[
    {
        "title": "Tesla Worth More Than Next 35 Biggest Automakers Combined",
        "url": "https://www.newsweek.com/elon-musk-tesla-worth-more-35-next-biggest-automakers-combined-2006586",
        "source": "Newsweek",
        "date": "2024-12-27T12:27:00+00:00",
        "content": "Electric vehicle manufacturer Tesla is worth more than the next 35 biggest automakers combined, according to Newsweek's calculations.\n\nNewsweek has contacted Tesla for comment via email.\n\nTesla's valuation has been on a meteoric rise, especially after the U.S. presidential election in November 2024.\n\nThe company's stock soared post-Election Day, fueled by investor optimism in the possibility of favorable policies under the incoming administration.\n\nIts CEO, South African-born billionaire Elon Musk, is a close ally of President-elect Donald Trump.\n\nMusk contributed heavily to the Republican's 2024 election campaign and has been selected by Trump to serve in his new administration.\n\nWith a market cap of around $1.46 trillion, it is more valuable than the 35 next-biggest automakers, which, combined, have a total value of approximately $1.42 trillion.\n\nBelow, Newsweek has visualized how Tesla's current value compares to that of its competitors.\n\nIn North America, Tesla's value far exceeds that of the two other biggest manufacturers, General Motors and Ford, which have market caps of $59.57 billion and $40.02 billion respectively.\n\nThe second biggest company on the chart overall was Japan-headquartered Toyota, with a market cap of $262.07 billion.\n\nOne finance expert told Newsweek that with its current market cap, the market expects Tesla will be able to substantially grow its earnings in the future.\n\nBut unlike other large companies such as Microsoft, Alphabet, and Meta Platforms that have \"network effects,\" allowing the company to maintain high-profit margins, the automobile sector is competitive, limiting the ability to have high-profit margins, said Jay Ritter, professor of finance at the University of Florida.\n\nRitter told Newsweek: \"Tesla is likely to benefit from the rollback of Biden administration policies that favored unionized automakers. But it is hard to see how these benefits will be big enough to allow Tesla to grow to have annual after-tax profits of $75 billion or more, which would be needed to give the company a price-earnings ratio of 20 and a market cap of $1.5 trillion.\n\n\"Thus, while anything can happen in the short run, I expect that Tesla stock will underperform in 2025 and beyond, as the market becomes disappointed with Tesla's inability to grow profits to $75 billion a year.\"\n\nThe firm's CEO, Elon Musk, is set to take up his position spearheading the newly created Department of Government Efficiency (DOGE) once Trump is inaugurated on January 20, 2025.\n\nDo you have a story we should be covering? Do you have any questions about this article? Contact LiveNews@newsweek.com"
    }
]