[
    {
        "title": "Amazon Stock Slide Is An Opportunity To Pounce",
        "url": "https://seekingalpha.com/article/4869845-amazon-stock-slide-is-an-opportunity-to-pounce",
        "source": "Seeking Alpha",
        "date": "2026-02-13T00:45:00+00:00",
        "content": "4kodiak/iStock Unreleased via Getty Images\n\nAmazon (AMZN) is the last Mag 7 that I have yet to review, and I believe that is the right time to establish coverage based on the recent quarterly earnings that pushed the stock to decline sharply. FY25 was a\n\nAnalyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body."
    },
    {
        "title": "US Two-Year Yield Set for Lowest Since 2022 on CPI: Markets Wrap",
        "url": "https://www.swissinfo.ch/eng/us-two-year-yield-set-for-lowest-since-2022-on-cpi:-markets-wrap/90937271",
        "source": "SWI swissinfo.ch",
        "date": "2026-02-13T18:35:00+00:00",
        "content": "(Bloomberg) — Wall Street got a degree of relief as relatively tame inflation data spurred bigger bets on Federal Reserve rate cuts, with bond yields falling. While most stocks gained, weakness in tech giants kept a lid on the market.\n\nTreasury two-year yields dropped to their lowest level since 2022 as traders priced in higher chances the Fed will slash rates more than twice this year. About 370 shares in the S&P 500 rose, but the gauge closed little changed at the end of its worst week since November. A gauge of megacaps lost 1.1%. Amazon.com Inc. saw its longest slide in almost 20 years. The Russell 2000 index of small firms climbed 1.2%. Bitcoin jumped.\n\nThe consumer price index rose 0.2% in January, the smallest gain since July and restrained by lower energy costs. While services costs picked up last month, prices of core goods remained stable. The core CPI rose from a year ago by the least since 2021. The overall gauge also eased on an annual basis.\n\n“There remain some trouble spots, but overall, the trend in inflation is lower,” said Steve Wyett at BOK Financial. “While the Fed is on pause for now, we expect somewhat lower rates as we move forward in 2026.”\n\nMarkets are “breathing easier” as price pressures remain contained, according to Seema Shah at Principal Asset Management.\n\n“Continued labor-market strength gives policymakers cover to stay on hold, while further disinflation in the second half of the year should reopen the door to easing,” she said.\n\nThe Fed chose to hold interest rates steady in January given signs of stabilization in the labor market and inflation that’s still elevated. Data this week showed US payrolls rose by the most in more than a year and the unemployment rate unexpectedly fell, suggesting the labor market continued to stabilize at the start of 2026.\n\nThe yield on two-year Treasuries slid five basis points to 3.41%. The S&P 500’s equal-weighted version – which strips out market-value biases – climbed 1% to near-record levels. Gold reclaimed its $5,000 mark. US markets will close Monday for Presidents’ Day.\n\nThe January CPI inflation report was “benign” relative to fears of a “hot start” to the year, but it’s not enough to motivate a near-term Fed cut given January’s strong jobs report, according to Krishna Guha at Evercore.\n\nStill, he says the latest data increases the likelihood inflation will be on the downslope in time for the Fed to cut in June or if not, July.\n\n“The report fundamentally reinforces the ‘Goldilocks’ narrative – improving growth alongside moderating inflation – creating an ideal environment for diversified investment portfolios,” noted Florian Ielpo at Lombard Odier Asset Management.\n\nWhile normally these types of inflation readings would give the Fed the go-ahead to ease policy, the robust job numbers that came out Wednesday mean we seemingly are entering a “gold medal” economy with strong growth, a stabilizing job market and lower inflation, said John Kerschner at Janus Henderson Investors.\n\n“The bond market is basically telling investors ‘nothing to worry about here’,” he added.\n\nThe CPI report was confirmation that: tariff-related adjustments have largely run their course, shelter inflation is set to moderate to a below pre-pandemic pace and unit labor costs should also moderate inflation over time, according to Tiffany Wilding at Pacific Investment Management Co.\n\n“This report did not meaningfully change our year-end 2026 inflation outlook of 2.4%, and we are still penciling in two more cuts later this year,” she said.\n\n“Overall, this won’t change Fed policy, but it will ease the path towards a cut in rates sooner rather than later,” said Neil Birrell at Premier Miton Investors.\n\nThe data suggest that price pressures remain a little too hot for comfort, but the direction of travel for inflation continues to look to be lower — even if this has proved a bumpy and slow process, according to James McCann at Edward Jones.\n\n“For the Fed, this probably doesn’t change much in the near term,” he said. “We do see scope for further easing later this year. However, this is contingent on a more convincing decline in inflation towards target with the urgency for additional cuts lower now that downside risks in the labor market have seemingly eased.”\n\nIn the near-term, the case for a cut looks flimsy and the strong likelihood is that the Fed stands pat in March, barring a shock to the economy in the interim, according to Jim Baird at Plante Moran Financial Advisors. Whether or not a reduction comes in the following months remains to be seen, but he says it will likely require further progress in inflation’s drop to the Fed’s 2% target.\n\n“That could change if the pace of layoffs accelerated or job creation faltered meaningfully again in the coming months,” Baird noted. “For now, policymakers appear convinced that the three quarter-point cuts late last year were enough to reduce that risk sufficiently, allowing them to take a patient approach in assessing whether additional easing will be needed.”\n\nFed Bank of Chicago President Austan Goolsbee said the central bank can cut rates further if inflation is on track to reach its 2% target, but that’s not currently the case.\n\n“Right now we are not on a path back to 2%. We’re kind of stuck at 3%, and that’s not acceptable,” Goolsbee said Friday on Yahoo! Finance.\n\nThe latest data reinforced the sense that inflation isn’t re-accelerating and that the Fed won’t need to extend its pause as long as the more hawkish voices feared, noted Karen Manna at Federated Hermes.\n\n“Paired with the recent jobs data — where revisions told the real story — this report keeps the narrative intact: Rate cuts move a little closer into view, even if they’re still not near,” she said.\n\nTraders continue to fully price in a Fed rate cut in July, as well as a strong likelihood of a move in June. Swaps project roughly 63 basis points of easing by year-end — equivalent to two quarter-point cuts and about half of a third — up from 58 basis points on Thursday.\n\n“Today’s inflation report is a relief for investors rattled by AI disruptions in the stock market,” said David Russell at TradeStation. “It also offsets this week’s strong payrolls report, giving the Fed a little more reason to lean dovish. However, it’s still well above the central bank’s target and does little to move the needle near term.”\n\nAlthough much has been made about whether or not the Fed can keep cutting rates this year, the markets seem to care much more about the possibilities of artificial-intelligence disruption across a broad swath of industries, according to Chris Zaccarelli at Northlight Asset Management.\n\n“As long as CPI remains in check – which so far it has – then the rates discussion will revert back to the labor market, and under the current economic conditions the Fed is likely to proceed cautiously lowering rates a couple of times later this year,” he said.\n\nDespite the recent bout of volatility, the bull market is likely to remain intact as long as the economy keeps growing, the labor market holds up, and inflation measures continue to fall, Zaccarelli noted.\n\n“All of these conditions are in place and there haven’t been any new data points this month to contradict that,” he concluded.\n\nInflation is fading into the background, and behavior is doing more of the work than policy: Consumers are pushing back, companies are absorbing costs, and pricing power is thinning, according to Gina Bolvin at Bolvin Wealth Management Group.\n\n“Markets responded because this gives the Fed flexibility — and shifts the investor focus away from rate cuts and back to fundamentals. The next phase won’t reward macro bets, it will reward earnings discipline and balance-sheet strength,” she said.\n\nThe S&P 500 saw its second straight week of losses, and is down about 2% from its late-January record.\n\n“After a powerful rally since last April, some consolidation during a typically weak February isn’t unhealthy,” said Mark Hackett at Nationwide. “Valuations have moderated, earnings expectations continue to improve, and bond yields are easing. The fundamental backdrop still supports this bull market.”\n\nStill, he noted that leadership is shifting, with investors finding better risk-reward in international, value and small-cap stocks.\n\nThe “AI disruption vigilantes” were at it again this week with new targets, but the initial reactions to that story may turn out to be “overblown,” since many industries and individual businesses could very well turn out to be AI beneficiaries in the long term, said Daniel Skelly, head of Morgan Stanley’s Wealth Management Market Research & Strategy Team.\n\nApplied Materials Inc. surged to a record after the company delivered a surprisingly upbeat sales forecast, signaling that demand for artificial intelligence and memory semiconductors is fueling equipment purchases. A data center project expected to be leased by Nvidia Corp. sold $3.8 billion of junk bonds on Friday after receiving about $14 billion of orders from investors, an indication that lenders are eager to continue funding the buildout of artificial-intelligence infrastructure. The US Federal Trade Commission is accelerating scrutiny of Microsoft Corp. as part of an ongoing probe into whether the company illegally monopolizes large swaths of the enterprise computing market with its cloud software and AI offerings, including Copilot. Anthropic PBC has named Chris Liddell to its board of directors, expanding its leadership with a seasoned finance executive who played a key role in taking General Motors Co. public. OpenAI has partnered with two defense technology companies that the Pentagon has selected to compete to develop voice-controlled, drone swarming software for the US military, according to multiple people familiar with the matter. Goldman Sachs Group Inc. has rolled out a new custom basket aimed at navigating the growing upheaval in software stocks, betting on companies perceived to be better insulated from artificial intelligence disruption than others. SpaceX is considering a dual-class share structure in its planned IPO this year, according to people familiar with the matter, mirroring a strategy its billionaire founder Elon Musk floated for Tesla Inc. Blackstone Inc.’s private equity fund for wealthy individuals notched a net 20% gain last year, thanks in part to some artificial intelligence investments the firm doesn’t hold in its institutional portfolios. The Pentagon added Alibaba Group Holding Ltd., BYD Co., Baidu Inc. and TP-Link Technologies Co. to a list of companies that aid the Chinese military – before withdrawing it minutes later without explanation. Pinterest Inc. tumbled after the company projected current-quarter sales that fell short of Wall Street estimates, the latest in a rocky period marked by layoffs and a pivot toward artificial intelligence products. DraftKings Inc., the online betting company, issued a 2026 forecast for sales and profit that fell short of Wall Street estimates, sending the stock slumping. Instacart climbed after the company issued a strong outlook for the start of 2026 that far exceeded analyst expectations, signaling sustained demand for its grocery delivery services. Airbnb Inc. gained after the company posted strong fourth-quarter bookings and issued an upbeat revenue outlook, citing strong travel demand and growing adoption of its new flexible payment and booking options. Moderna Inc. beat fourth-quarter revenue estimates as its struggling Covid vaccines business declined less than expected. Moderna lashed out at the US Food and Drug Administration for making it harder for companies to create new medicines, escalating a dispute between the vaccine maker and the regulator. Wendy’s Co. rebounded after the chain said sales would be little changed this year, suggesting that the struggling fast food chain has reached a low point. What Bloomberg Strategists say…\n\n“Friday’s CPI report certainly underscores the tension between the two sides of the Fed’s mandate, and raises the question of whether policymakers will heed labor market strength or capitalize on softer inflation to provide the economy with more support via lower rates.”\n\n—Kristine Aquino, Managing Editor, Markets Live. For the full analysis, click here.\n\nSome of the main moves in markets:\n\nThe S&P 500 was little changed as of 4 p.m. New York time The Nasdaq 100 rose 0.2% The Dow Jones Industrial Average was little changed The MSCI World Index was little changed Bloomberg Magnificent 7 Total Return Index fell 1.1% Philadelphia Stock Exchange Semiconductor Index rose 0.7% IShares Expanded Tech-Software Sector ETF rose 2.2% The Russell 2000 Index rose 1.2% S&P 500 Equal Weighted Index rose 1% Currencies\n\nThe Bloomberg Dollar Spot Index was little changed The euro was little changed at $1.1876 The British pound rose 0.3% to $1.3658 The Japanese yen was little changed at 152.64 per dollar Cryptocurrencies\n\nBitcoin rose 4.8% to $68,918.18 Ether rose 6.9% to $2,054.23 Bonds\n\nThe yield on 10-year Treasuries declined five basis points to 4.05% Germany’s 10-year yield declined two basis points to 2.75% Britain’s 10-year yield declined four basis points to 4.42% Commodities\n\nWest Texas Intermediate crude was little changed Spot gold rose 2.3% to $5,033.39 an ounce ©2026 Bloomberg L.P.\n\nSWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR\n\nSWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR"
    }
]