[
    {
        "title": "Stock Market Today: Stocks Rise as Tech Gains Ground Amid Easing AI Fears",
        "url": "https://www.investopedia.com/stock-market-today-dow-jones-s-and-p-500-02182026-11908516",
        "source": "Investopedia",
        "date": "2026-02-18T19:11:00+00:00",
        "content": "ANGELA WEISS / AFP via Getty Images\n\nStocks rose on Wednesday, but pared their gains as investors questioned the outlook for interest rates in light of the minutes of January's Federal Reserve meeting.\n\nThe tech-heavy Nasdaq Composite rose 0.8% on Wednesday, while the benchmark S&P 500 advanced 0.6% and the blue-chip Dow Jones Industrial Average gained 0.3%. All three major indexes eked out tiny gains on Tuesday in a volatile session driven by rising and ebbing tech jitters.\n\nThe minutes of the Federal Reserve's last meeting revealed starkly diverging views among policymakers on the appropriate path of monetary policy. Some officials want to leave the door open for the Fed to raise rates if inflation remains sticky, while others are eager to continue cutting, according to the minutes released Wednesday.\n\nThe majority of officials voted in late January to leave interest rates unchanged for the first time since July. The odds of more cuts in the next few months dwindled last week following surprisingly rosy inflation and jobs reports. The December Personal Consumption Expenditures price index, the Fed's preferred inflation gauge, is set to be released on Friday morning.\n\nTech stocks found their footing Wednesday. Shares of Nvidia (NVDA) rose 1.6% after social media giant Meta (META) announced a new deal to buy millions of its chips. Several of Wall Street's favorite AI \"pick and shovel\" stocks rose, including Micron (MU) and Western Digital (WDC). Meta shares rose 0.6%.\n\nThe remainder of the Magnificent Seven closed in the green. Shares of Amazon (AMZN) rose nearly 2% despite Berkshire Hathaway reporting on Tuesday it had sold nearly all of its stake in the e-commerce giant. Apple (AAPL), Alphabet (GOOG), Microsoft (MSFT), and Tesla (TSLA) posted marginal gains.\n\nOn the earnings front, shares of Palo Alto Networks (PANW) slid 7% after its earnings guidance came up short of expectations. The stocks of chip firms Cadence Design Systems (CDNS) and Analog Devices (ADI) rose 8% and 3%, respectively, after each topped estimates on the top and bottom lines.\n\nThe 10-year Treasury yield, which impacts interest rates on a variety of consumer loans including mortgages, was recently 4.08%, up from 4.06% at Tuesday's close.\n\nWest Texas Intermediate futures, the U.S. crude oil benchmark, rose about 4.5% to $65.10 a barrel after Vice President JD Vance cast doubt on the progress of diplomatic negotiations between the U.S. and Iran. Gold and silver futures rebounded from their slump yesterday. Gold climbed 1.8% to $4,995 an ounce, while silver rose 4.9% to $77.10 an ounce.\n\nBitcoin traded around $66,300 in the late afternoon, down from its overnight highs above $68,000. The U.S. dollar index, which tracks the value of the greenback against a basket of currencies, ticked up 0.6% to 97.70.\n\nHoops or Hockey? Investors Might Get to Own Shares of the Knicks and Rangers\n\nIf you've always wanted to own a piece of a pro basketball team, this deal might be a slam dunk. (If you prefer ice hockey, insert your favorite metaphor here.)\n\nMadison Square Garden Sports (MSGS), which owns the NBA's New York Knicks and NHL's New York Rangers, said its board would explore a spinoff that would create publicly traded companies for each team. (The stadium itself is owned by Madison Square Garden Entertainment (MSGE), which was created by the 2020 separation of the teams from the facility.)\n\n\"We believe this proposed transaction would provide each company with enhanced strategic flexibility, its own defined business focus, and clear characteristics for investors,\" MSGS CEO Jim Dolan said.\n\nThe company's statement said no timetable had been set for a deal, and that it was not certain one would happen. League approval would be required, the company said.\n\nThe deal would offer investors an opportunity to do something comparatively rare: put their money where their rooting mouths are.\n\nMost sports teams are privately owned, and none of the organizations in the top U.S. leagues—the NBA and NHL, but also the NFL, Major League Baseball and MLS—are traded as single stocks. Some teams are owned by larger conglomerates; the Green Bay Packers do offer public ownership, though through a somewhat unconventional arrangement.\n\nThe Knicks are faring better than the Rangers so far in their respective seasons, but Madison Square Garden Sports stock is hot. The shares are up substantially today on the news, bringing their rise to roughly 30% this year—and they've added almost three-quarters of their value over the past five years.\n\nIn 2025, the Knicks were ranked among the top 10 most valuable sports franchises worldwide at some $9.5 billion, according to Forbes.\n\nCiti analysts on Wednesday said they value the stock at $337, about 15% above yesterday's close; the Knicks, they said, accounted for $226 of that. \"We like the proposed spin-off and see it as a viable step to potentially unlock value,\" they wrote.\n\nHere's How Much Traders Expect Carvana Stock To Move After Earnings on Wedneday\n\nCarvana is set to report earnings after the market closes today, with traders expecting a big move in the online used car dealer's stock following the results.\n\nBased on recent options pricing, traders expect Carvana's (CVNA) stock could swing up to 13.5% in either direction by the end of the week. A move of that magnitude from Tuesday's close near $351 would lift Carvana shares to about $398. The low end of the range would see the stock slip below $304, its lowest point since last November.\n\nCarvana has had a difficult start to 2026, as a short-seller report released last month sent the stock tumbling from its record highs. Carvana stock had rallied to end 2025 as it joined the S&P 500 and analysts laid out bullish visions for the company.\n\nJPMorgan analysts said the basis of the short-seller report appeared to include an incorrect reading of some of Carvana's finances by the authors, leading to a \"significant misrepresentation of facts.\" The analysts recently lifted their price target for Carvana to $510 from $490, and said they expect the company to report strong sales growth for the fourth quarter that could carry through to the first quarter of 2026.\n\nCarvana is projected to report a 48% year-over-year jump in revenue to $5.25 billion, while earnings per share are seen rising to $1.01 from 56 cents the same time a year ago.\n\nAnalysts have stayed bullish on Carvana stock despite the recent slump, with 12 of the 13 analysts with current ratings tracked by Visible Alpha calling the company a \"buy,\" with just one \"hold\" rating. Their mean target of $500 would suggest 40% upside from Tuesday's close.\n\nThe shares, which were up about 2% in recent trading ahead of the company's earnings report, have lost about 15% since the start of the year.\n\nNvidia Sold Its Stakes in These Firms. The Stocks Are Sliding.\n\nNvidia is backing out of some of its bets.\n\nShares of three AI-focused firms fell Wednesday following the news that Nvidia (NVDA) sold its stakes in the companies in the fourth quarter. Data center service provider Applied Digital (APLD) dropped nearly 10%, while drug developer Recursion Pharmaceuticals (RXRX) plunged 14% and driverless tech company WeRide (WRD) slipped close to 4%, before paring their losses later in the session.\n\nA regulatory filing revealed Nvidia's sales of the companies' shares but didn't specify the company's reasoning. Nvidia declined to comment on the changes to its portfolio.\n\nNvidia's stock climbed about 2%, bringing it back into positive territory for 2026 after a rough start to the year marked by lingering worries about an AI bubble. Read Investopedia's full daily markets roundup here.\n\nNvidia's latest 13F filing also revealed it dropped its shares of Arm (ARM), the chip designer and long-term partner it tried to acquire in 2020. Shares of Arm were up about 1% recently, building on gains earlier this month after the company posted better-than-expected earnings.\n\nNvidia added positions in struggling rival Intel (INTC), chip design software maker Synopsys (SNPS), and Finnish telecom Nokia (NOK). Synopsys shares climbed about 5% in recent trading, while Nokia shares added 1.5%. Intel shares were little changed.\n\nWhile the investment in Intel shouldn't come as a surprise, after Nvidia's September announcement of a multibillion-dollar investment and partnership, rumors have continued to swirl lately about deepening ties and a possible foundry deal in the works.\n\nNvidia kept its holdings in AI cloud infrastructure providers CoreWeave (CRWV) and Nebius Group (NBIS) unchanged. CoreWeave and Nebius shares climbed about 5% and 4%, respectively.\n\nPalo Alto Networks' Deals Are Dragging on Its Profit Outlook. The Stock Is Falling\n\nPalo Alto Networks' string of recent deals is hurting its profit outlook, weighing on its stock.\n\nShares of Palo Alto Networks (PANW) were down 6% to about $153 in recent trading after the cybersecurity provider's full-year outlook disappointed. It was the worst-performing stock in the S&P 500 and Dow on a day when broader markets gained.\n\nPalo Alto Networks said late Tuesday that it now expects adjusted earnings per share of $3.65 to $3.70 for the full fiscal year, down from its previous range of $3.80 to $3.90. The company is grappling with higher integration costs tied to its recent acquisitions, including its $25 billion purchase of CyberArk.\n\nMorgan Stanley analysts trimmed their price target for Palo Alto Networks stock to $223 from $245 following the results. However, they maintained an \"overweight\" rating and called its post-earnings drop \"overdone,\" citing the company's \"compelling argument for AI as a tailwind.\"\n\nMeanwhile, analysts at Wedbush stood by their \"outperform rating\" and $225 target Wednesday, calling Palo Alto Networks \"one of our favorite cyber names to own in 2026.\" Though ratings are still in flux, most analysts tracked by Visible Alpha have stood by their bullish ratings for the stock.\n\nPalo Alto Networks reported adjusted earnings per shares of $1.03 on a 15% year-over-year jump in revenue to $2.59 billion for its fiscal second quarter. Both figures came in above analysts' estimates compiled by Visible Alpha.\n\nWith Wednesday's slide, Palo Alto Networks shares have lost about 16% of their value since the start of the year.\n\nThe S&P 500 Is Flat For the Year, But There Are Big Moves Below the Surface\n\nWall Street is behaving a lot like Capitol Hill so far this year.\n\nAs of Tuesday’s close, the S&P 500 was down 0.03% since the start of the year. That's about as unexceptional as it gets, but it belies a lot of churn below the surface.\n\nAccording to a recent analysis by Bespoke Investment Group, 117 stocks in the S&P 500 have gained or lost more than 20% so far this year. Meanwhile, just 94 of the index’s components are up or down less than 5%.\n\nAs in Washington, D.C., “we’ve seen an increase in concentration at the extremes with nothing to show for it,” wrote Bespoke’s analysts in a note on Wednesday.\n\nThe massive disparity in performance is pronounced in the tech sector, where more than 40% of stocks are either up or down more than 20% this year. Seventeen stocks are sharply higher, including AI “pick and shovel” plays like memory device makers Sandisk (SNDK) and Western Digital (WDC), up 150% and 70%, respectively. On the flip side are the dozen (mostly software) stocks that have been battered by concerns about AI disruption. They include Intuit (INTU) and ServiceNow (NOW), down a respective 40% and 30%.\n\nExtreme moves are causing the capitalization-weighted S&P 500 to trail the equal-weight index by about 5.5 percentage points, the cap-weighted index’s worst relative performance since 1992, according to Bespoke.\n\nWedbush Sees Big Gains for These Cybersecurity Stocks. Here's Why\n\nIt's been a rough start to the year for the software sector, but one group of experts said they see big gains ahead for some beaten-down cybersecurity stocks.\n\nAs the use of AI spreads, companies could face growing risks that drive up demand for cybersecurity services, according to analysts at Wedbush, who named three stocks they see as likely \"winners\" in a note Tuesday.\n\nOne of them is CrowdStrike (CRWD), which Wedbush said remains a \"gold standard of cybersecurity\" despite the stock's recent selloff. The shares are down about 13% year-to-date, with Wedbush's $600 price target suggesting nearly 45% upside from Wednesday's level around $420.\n\nWedbush also identified ZScaler (ZS) as a \"premier name to own in the cyber space,\" with a strong product pipeline and AI strategy. The analysts said they see the stock roughly doubling to $350 in the next 12 months.\n\nPalo Alto Networks (PANW), which reported disappointing earnings after the closing bell Tuesday, rounded out Wedbush's trio. The analysts said the company, which has sought to expand its offerings with several acquisitions recently, has seen its value proposition improve as companies look to consolidate vendors. Wedbush's price target at $225 is about 45% above the stock's recent level.\n\nInvestors could also get more insights when ZScaler reports next week on Feb. 26, with CrowdStrike scheduled to release its latest quarterly results on March 3.\n\nModerna Stocks Rises After FDA Reverses Course on New Flu Vaccine Review\n\nModerna (MRNA) stock rose 6% on Wednesday after the company said the Food and Drug Administration agreed to review its application for a new flu shot that regulators had previously refused to consider.\n\nModerna on Wednesday said that, after meeting with the FDA, it had submitted an amended application for its new mRNA influenza vaccine. Federal drug regulators last week surprised investors when they refused to review Moderna’s application. Moderna is seeking full approval for adults 50 to 64, and accelerated approval for adults over 65. The review is expected to be complete by Aug. 5.\n\n“We appreciate the FDA's engagement in a constructive Type A meeting and its agreement to advance our application for review,\" said CEO Stéphane Bancel in a press release.\n\nWith Wednesday’s gains, Moderna shares have risen nearly 60% since the start of the year. The stock got a boost last month after the release of encouraging data from a cancer clinical trial.\n\nIn Buffett's Last Quarter as CEO, Berkshire Slashed Amazon Stake and Sold More Apple\n\nBerkshire Hathaway (BRK.A)(BRK.B), the conglomerate formerly led by famed investor Warren Buffett, reduced its holdings in tech giants Apple (AAPL) and Amazon (AMZN) in the final quarter of 2025, according to a regulatory filing released Tuesday.\n\nBerkshire sold about 10.3 million shares of Apple, about 4% of the firm’s stake in the iPhone maker. Berkshire has been steadily trimming its stake in Apple—its largest position—since late 2023, though the pace of its sales has slowed. Berkshire’s stake, once worth about $175 billion, totaled about $60 billion as of Tuesday’s close. Shares were down about 0.3% in early trading Wednesday.\n\nBerkshire made a bigger cut to its Amazon holdings, selling 7.7 million shares, or more than 75% of its stake in the e-commerce giant. The holdings, worth about $2.1 billion at the end of the third quarter, were valued at about $457 million as of Tuesday. Amazon stock rose 1.5% Wednesday morning.\n\nTuesday's filing is the last Berkshire portfolio update overlapping with Warren Buffett's tenure as chief executive. Buffett, who took over Berkshire in 1965 and built it into an insurance and investment behemoth worth more than $1 trillion, officially handed the reins over to current CEO Greg Abel when he retired at the end of last year.\n\nApple stock rose nearly 7% in the fourth quarter. Apple, unlike Big Tech peers such as Meta (META) and Alphabet (GOOG), is not spending hand over fist on AI infrastructure, and that became a tailwind for the stock when the AI rally wavered last quarter. Amazon shares rose 5% in the same period.\n\nFutures Point To Higher Open as Tech Stocks Find Footing\n\nFutures contracts connected to the Dow Jones Industrial Average were up 0.3% in premarket trading on Wednesday.\n\nNasdaq 100 contracts gained 0.5%.\n\nBeSpoke Investment Group. “A Flat Market with Extreme Single-Stock Moves.”\n\nModerna. “Moderna Announces the U.S. Food and Drug Administration will Initiate the Review of Its Investigational Seasonal Influenza Vaccine Submission.”"
    }
]