[
    {
        "title": "Stock Rout Deepens as Tech Giants Get Hammered: Markets Wrap",
        "url": "https://www.swissinfo.ch/eng/stock-rout-deepens-as-tech-giants-get-hammered:-markets-wrap/90930608",
        "source": "SWI swissinfo.ch",
        "date": "2026-02-12T15:35:00+00:00",
        "content": "(Bloomberg) — Prices buckled across several asset classes as concern over technology profits and weakness in commodities spurred losses in the stock market. Gold and silver tumbled as traders plowed money into the perceived safety of Treasuries. A selloff in Bitcoin deepened.\n\nThe S&P 500 and the Nasdaq 100 slipped 1.6% and 2%, respectively. Cisco Systems Inc. plunged 12% as a tepid margin outlook signaled higher memory-chip prices are taking a toll. All megacaps fell and an ETF tracking software firms slumped 2.7%. Worries about artificial-intelligence disruption engulfed industries from logistics to commercial real estate. In late hours, Applied Materials Inc. gave an upbeat forecast.\n\nWeeks of rising anxiety over the impact of AI on multiple sectors showed signs of morphing into a broader reassessment of risk after more than a year of steady appreciation across assets.\n\nWall Street’s jitters over the outlook for the industry that has powered the bull market have grown despite solid results from megacaps, with traders dumping a broad range of tech shares. Besides all the worries over whether AI investments will pay off, fears about disruption have been mounting.\n\nThose concerns have deepened since AI startup Anthropic released new tools designed to automate work tasks in various industries, sparking fears that the innovations would doom countless businesses. That’s not to mention the rush from big techs to raise unprecedented amounts of money to build out AI, making the credit market vulnerable — especially with risk premiums already near the tightest levels since the financial crisis.\n\n“This is the most uncertain outlook we’ve seen for AI and the tech-driven rally since this bull market started,” said Tom Essaye at The Sevens Report. “That does not mean tech won’t recover like it has since then. But I do want to caution against dismissing this weakness as ‘just another bump in the road’.”\n\nIn the past few weeks, and specifically the past few days, it feels the market landscape is “full of AI landmines,” according to Steve Sosnick at Interactive Brokers. The software sector, then insurance brokers, wealth managers, and real estate brokers succumbed sequentially to fears of being decimated by advancements in AI that could impair their business models, he noted.\n\nIn his view, the outsized downward reactions are a testament to a momentum-driven market’s ability to overreact to bad news as well as good. And it is also a testament to a huge change in market psychology.\n\n“For most of the past three years, investors took a ‘glass half-full’ approach to AI,” noted Sosnick. “It was, ‘What can AI do to make a business or industry more efficient?’ It now seems to be ‘How can AI ruin a business’s or industry’s profitability model?’ – and rather than searching for winners, investors are hunting for potential losers.”\n\nEquities saw their biggest slide in more than three weeks. OpenAI has warned US lawmakers that its Chinese rival DeepSeek is using unfair and increasingly sophisticated methods to extract results from leading US AI models to train the next generation of its breakthrough R1 chatbot, according to a memo reviewed by Bloomberg News.\n\nIn the run-up to key inflation data, the yield on 10-year Treasuries slid seven basis points to 4.10%. A $25 billion sale of 30-year bonds drew historic demand. Bitcoin traded under $66,000. Gold sank below $5,000, with algorithmic traders appearing to amplify the precious metal’s sudden drop. Silver plunged 11%. Oil slid about 3%.\n\n“From AI-phoria to AI-phobia,” Yardeni Research strategists said in a note. “For those who lived through the advent of the Internet, this feels like ‘déjà vu all over again.’ Both AI and the Internet are technological disruptions profound enough to shift the behavior of just about everyone.”\n\nFears that new firms using AI will replace incumbent operators have hurt stocks across a wide range of industries over the past two weeks, they said.\n\n“There is simply more bad news about AI disruption than good news about AI implementation and margins right now,” said Dennis DeBusschere at 22V Research. “AI usage baskets can bounce when there is a friendlier balance between good margin/implementation news and existential risk.”\n\nToday’s market action is a broad deleveraging, he said. While there may be a macro contribution from investors becoming more concerned about easy financial conditions following strong jobs data, the contribution of idiosyncratic risk (AI) to returns is still outsized, he concluded.\n\n“AI might be boosting the economy thanks to massive capex investments and productivity enhancements but it’s becoming a net negative for the stock market,” said Adam Crisafulli at Vital Knowledge. AI is “demolishing” stocks in legacy industries, he said.\n\nFor the past 2 1/2 years, AI stocks have absorbed virtually all money flow while the rest of the market languished, but the AI monopoly on capital flows is ending, according to Brett Ewing at First Franklin Financial Services\n\n“We’re not calling for a massive crash, but rather a normalization as investors finally demand real metrics around adoption rates and monetization,” he said. “The easy money in AI is done — these stocks have been consolidating sideways for 4-5 months and will face increased scrutiny in 2026 as fundamentals finally rule the day over hype.”\n\nThe spreads for the hyperscalers have widened within the indices, and supply is being impacted in a meaningful way by AI, according to Christian Hoffmann at Thornburg Investment Management.\n\n“A major theme related to AI is the ‘software scare,’ which is still playing out in equity markets,” he said. “This dynamic is also reverberating through fixed income markets, particularly in lower-quality segments. As those fears get repriced, investors are reassessing assets and applying greater scrutiny to their underlying exposures.”\n\nAI disruption risk is only partially priced in credit, with further repricing likely through 2026 and early 2027, according to UBS strategists led by Matthew Mish.\n\n“February’s selloff reflects faster AI adoption, but spreads – particularly in US leveraged finance markets – do not yet fully discount higher default risk and refinancing challenges,” they said.\n\nDespite some stabilization in US equity benchmarks in recent days, investor concerns over the disruption of AI continue to weigh on various sectors, according to UBS Global Wealth Management’s Ulrike Hoffmann-Burchardi.\n\n“With AI acting both as a driver and a detractor of performance, investors should hold a diversified exposure as they dynamically evaluate the AI landscape,” she said. “We also believe companies that actively use AI to enhance operations and evolve their business models should benefit, especially those in the financials and health care sectors.”\n\nTo start 2026, markets have broadened out over hopes of a “run hot” US economy, driven by a combination of monetary and fiscal stimulus and investor angst over AI capital spending plans, noted Chris Senyek at Wolfe Research.\n\n“Throughout earnings season we’ve seen wild, whipsaw price action as AI news has created headline risk across a variety of industries, with the carnage in software spreading to other areas at risk of being “AI’d” such as asset managers and other data providers,” he said.\n\nTo be fair, he says some recent positive US economic datapoints such as payrolls and manufacturing further support a broadening out trend causing factor unwinds beneath the surface.\n\n“Ongoing cyclical strength is generally consistent with an improving economy and rising risk appetite,” said Adam Turnquist at LPL Financial. “Recently, however, the ratio has diverged from the S&P 500 as big tech has cooled and relative strength in financials, consumer discretionary, and real estate has weakened.”\n\nWhile this doesn’t yet signal a full‑scale rotation into defensive sectors, the emerging tilt toward risk aversion is something we’re monitoring closely, he said.\n\nEquity leadership is indeed broadening beyond mega-cap tech, and if the path for longer-term yields continues to be flat to slightly higher, valuations and fundamentals take on heightened importance, according to Simeon Hyman at ProShares.\n\nThat has been one of the drivers of broadening equity market performance so far this year, he noted.\n\nUS PREVIEW: A Lukewarm CPI Will Keep Alive Hope for Fed Cuts\n\nMeantime, Thierry Wizman at Macquarie Group says AI may enter the monetary policy debate very soon.\n\n“Hawks on the FOMC may rely on the real-time inflation and unemployment data to justify raising the policy rate,” he said. “If the ‘AI scare’ sinks sentiment further, the ‘burden of proof’ may soon rest with the hawks to justify why policy shouldn’t ease.”\n\nTraders continued to assign little chance that Federal Reserve officials lower rates when they meet next in March, with a July cut fully priced in.\n\nA survey conducted by 22V Research showed 33% of investors believe that the market reaction to CPI will be “risk-on,” 43% said “mixed/negligible” and only 24% bet on a “risk-off” move. In addition, the tally shows that 62% of investors think core CPI is on a Fed friendly glide path while 38% think financial conditions need to tighten, which is the highest share since September.\n\nMarkets are complacent on the outlook for US inflation, making trades that pay out if price pressures climb look attractive, said Benjamin Wiltshire at Citigroup Inc. Investors may be underestimating the resilience of the US consumer and market expectations for inflation are likely to be revised slightly higher, he noted.\n\n“Markets seem to have this conviction that inflation is going to come down,” Wiltshire said in an interview. “We’re still in a structurally higher inflation environment.”\n\nNvidia Corp. is expected to lease a data center being built with funds from a $3.8 billion junk-bond sale, adding to the borrowing frenzy around artificial-intelligence infrastructure. Anthropic has completed a deal to raise $30 billion in funding from investors at a $380 billion valuation, including the money raised, bolstering the artificial intelligence company as it gains ground on rival OpenAI. OpenAI is releasing its first artificial intelligence model that runs on chips from semiconductor startup Cerebras Systems Inc., part of a push by the ChatGPT maker to broaden the pool of chipmakers it works with beyond Nvidia Corp. International Business Machines Corp. said it will triple entry-level hiring in the US in 2026, even as artificial intelligence appears to be weighing on broader demand for early-career workers. Alphabet Inc.’s YouTube released a dedicated app for Apple Inc.’s Vision Pro on Thursday, filling a notable gap in the headset’s lineup of entertainment options two years after its debut. Alphabet has updated its Gemini Deep Think artificial intelligence model for better performance in math and science research, the company said. Alphabet’s Waymo is enlisting DoorDash Inc. drivers in Atlanta to close robotaxi doors that have been left open, letting the driverless vehicles continue on their way. AppLovin Corp. reported its fourth-quarter results and gave an outlook. While both were above consensus expectations on key metrics, they may not be strong enough to assuage recent concerns over AI-related disruption. Fastly Inc., an infrastructure software company, posted fourth-quarter results that beat expectations and it gave a robust full-year forecast. William Blair upgraded their recommendation on the stock. A drumbeat of bearish signals is building across the crypto industry, with Standard Chartered slashing its Bitcoin price target and Coinbase Global Inc. getting cut to sell as momentum traders struggle to push Bitcoin back toward its highs. Pinterest Inc. projected current-quarter sales that fell short of Wall Street estimates, just weeks after announcing layoffs and a pivot toward artificial intelligence products. DraftKings Inc., the online betting company, issued a 2026 forecast for sales and profit that fell short of Wall Street estimates. Airbnb Inc. posted strong fourth-quarter bookings and issued an upbeat revenue outlook, citing strong travel demand and growing adoption of its new flexible payment and booking options. Rivian Automotive Inc. closed out 2025 with better-than-expected financial results, sending the shares higher ahead of the electric-vehicle maker’s critical debut of its next-generation SUV. Instacart issued a strong outlook for the start of 2026 that far exceeded analyst expectations, signaling sustained demand for its grocery delivery services. Constellation Brands Inc., the owner of the Modelo beer brand in the US, said its board named Nicholas Fink as its next chief executive officer. McDonald’s Corp.’s US sales grew at the fastest pace in more than two years in the fourth quarter as value meals continued to resonate with cost-conscious diners. CarMax Inc. named Keith Barr as chief executive officer, bringing in the former InterContinental Hotels Group Plc chief to modernize the company and revive performance. Clear Street Group Inc. slashed the targeted size of its initial public offering by nearly two thirds, after the broker faced pushback from prospective investors. Cargill Inc. is permanently closing a plant that produces ground beef in Milwaukee, joining other meatpackers who have pulled back amid a severe cattle shortage. Brookfield Corp.’s profit rose in the fourth quarter as the company reported record earnings from its asset manager and strong growth in its wealth business. Birkenstock Holding Plc saw robust holiday demand for its clogs, boots and high-end shearling-lined footwear as the German sandal maker continues a push to become a footwear brand for all seasons. Novo Nordisk A/S is planning to boost investment in Ireland where it will make its hit Wegovy weight-loss pill for markets outside the United States. Sanofi abruptly replaced Chief Executive Officer Paul Hudson after a massive research spending boost failed to deliver rapid results, appointing its first female leader, Merck KGaA’s Belén Garijo. L’Oréal SA sales missed estimates in the final months of last year after the French beauty group’s luxury division disappointed. Ubisoft Entertainment SA reported net bookings that beat analysts’ estimates in the fiscal third quarter, buoyed by strong demand for the video game publisher’s most popular franchises such as Assassin’s Creed. Nuveen is buying Schroders Plc in a £9.9 billion ($13.5 billion) deal, creating one of the world’s largest active asset managers with nearly $2.5 trillion of assets. What Bloomberg strategists say…\n\n“Stock futures are sharply lower after the triggering of Commodity Trading Advisor sales hit in E-mini Nasdaq 100 contracts first and more recently in E-mini S&P 500 futures, according to dealers that see the flow. If a price recovery does not materialize, that puts the broader market at risk of a deepening the selloff.”\n\n— Alyce Andres, Macro Strategist, Markets Live. For the full analysis, click here.\n\nSome of the main moves in markets:\n\nThe S&P 500 fell 1.6% as of 4 p.m. New York time The Nasdaq 100 fell 2% The Dow Jones Industrial Average fell 1.3% The MSCI World Index fell 1.2% Bloomberg Magnificent 7 Total Return Index fell 2.3% Philadelphia Stock Exchange Semiconductor Index fell 2.5% IShares Expanded Tech-Software Sector ETF fell 2.7% The Russell 2000 Index fell 2% Cisco fell 12% S&P 500 Equal Weighted Index fell 1.4% Currencies\n\nThe Bloomberg Dollar Spot Index was little changed The euro was little changed at $1.1871 The British pound was little changed at $1.3623 The Japanese yen rose 0.4% to 152.70 per dollar Cryptocurrencies\n\nBitcoin fell 3.2% to $65,584.65 Ether fell 2.5% to $1,919.84 Bonds\n\nThe yield on 10-year Treasuries declined seven basis points to 4.10% Germany’s 10-year yield declined one basis point to 2.78% Britain’s 10-year yield declined two basis points to 4.45% The yield on 2-year Treasuries declined six basis points to 3.45% The yield on 30-year Treasuries declined eight basis points to 4.73% Commodities\n\nWest Texas Intermediate crude fell 2.7% to $62.90 a barrel Spot gold fell 3.2% to $4,919.85 an ounce –With assistance from Chris Nagi.\n\nSWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR\n\nSWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR"
    }
]