[
    {
        "title": "Here's Why I'm Not Buying Walmart Stock",
        "url": "https://www.aol.com/articles/heres-why-im-not-buying-012600395.html",
        "source": "AOL",
        "date": "2026-02-20T08:26:00+00:00",
        "content": "Walmart's latest results marked another strong quarter for e-commerce and advertising.\n\nThe company's guidance calls for continued steady growth in Walmart's overall business in fiscal 2027.\n\nAt today's price, the stock's valuation implies very little room for any slowdown or execution missteps.\n\n10 stocks we like better than Walmart ›\n\nWalmart (NASDAQ: WMT) just gave investors a fresh set of results and a new outlook, and the numbers were solid. Revenue rose 5.6% in its fiscal fourth quarter (the period ended on Jan. 31, 2026), and adjusted earnings per share came in at $0.74, up more than 12% year over year. Both figures came in ahead of analysts' consensus forecasts.\n\nBut I'm not buying the stock here.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nThe problem is not the quarter. It's the price investors are paying for it -- especially when you can buy a fast-growing retailer like Amazon (NASDAQ: AMZN) at a meaningfully lower valuation.\n\nTo Walmart's credit, its momentum is notable -- especially for a retailer of its size.\n\nIts global e-commerce sales rose 24% in the quarter. Even more, these e-commerce sales notably represented a meaningful 23% of total net sales.\n\nAdditionally, Walmart U.S. comparable sales, a metric that compares stores open at least a year and excludes fuel, increased 4.6%. Management said transactions grew 2.6% in Walmart U.S., suggesting customer traffic is still driving growth, not just higher prices.\n\nHigher-margin lines are showing up more clearly, too. The company said its global advertising business grew 37% in the quarter, including advertising revenue from its TV operating system platform VIZIO. And Walmart Connect -- the company's retail media business unit and advertising platform -- in the U.S. grew 41%. Finally, the company's membership fee revenue grew 15.1% globally.\n\nFurther, Walmart's profit picture in the quarter was better than the sales growth rate would suggest. Operating income rose 10.8%, and the company said operating income grew faster than sales due to higher gross margins, expense leverage, and improved e-commerce economics, helped by a better mix (a higher percentage of sales going to higher-margin products and services).\n\nThat's some impressive momentum. Walmart is steadily becoming more digital and more profitable.\n\nBut things become more concerning when you consider Walmart's outlook.\n\nManagement expects fiscal 2027 net sales to increase 3.5% to 4.5% on a constant-currency basis. As for profitability, the company forecast constant-currency-adjusted operating income to grow 6% to 8%. And for its full-year adjusted earnings per share, management guided for $2.75 to $2.85.\n\nAt Walmart's current stock price, the stock trades at about 45 times the midpoint of management's fiscal 2027 adjusted EPS guidance.\n\nAt this valuation, Walmart has to maintain strong comparable sales growth, keep expanding its margins, and continue growing higher-margin streams like advertising and membership with very few hiccups.\n\nWalmart did try to bolster the shareholder-return story. The company announced a new $30 billion share repurchase authorization and increased its annual dividend to $0.99 per share. Those are real positives. But they don't erase the valuation problem.\n\nAmazon's most recent quarter showed net sales growth of 14%, with AWS segment sales up 24%. CEO Andy Jassy said Amazon expects to invest about $200 billion in capital expenditures in 2026, including in AI and other long-term opportunities -- and he anticipates a \"strong long-term return\" on this capital.\n\nOf course, there are risks to big spending like this. But here's the kicker: Amazon's price-to-earnings ratio is just 28. Even more, Amazon isn't just a retail operation; it comes with a lucrative cloud computing business that grew sales 24% year over year in the company's most recent quarter.\n\nThe risk for Walmart investors is not that the business will suddenly break. It is that anything merely \"fine\" becomes a problem when the stock is priced for near-perfection. And the bigger reason I wouldn't buy Walmart stock today is even simpler: I'd rather buy Amazon.\n\nBefore you buy stock in Walmart, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Walmart wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $420,595!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,152,356!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 899% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 19, 2026.\n\nDaniel Sparks and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon and Walmart. The Motley Fool has a disclosure policy."
    },
    {
        "title": "Market Outlook: Canadian energy shares hit 17 year high",
        "url": "https://www.bnnbloomberg.ca/investing/market-outlook/2026/02/20/market-outlook-canadian-energy-shares-hit-17-year-high/",
        "source": "BNN Bloomberg",
        "date": "2026-02-20T20:11:00+00:00",
        "content": "Published: February 20, 2026 at 2:50PM EST\n\nCanadian energy stocks have reached their first record high since 2008, even as oil prices remain well below the peaks seen during the last commodity boom. Investors are assessing whether stronger balance sheets and capital discipline can sustain the rally.\n\nBNN Bloomberg spoke with Denis Taillefer, portfolio manager at Caldwell Investment Management, who said improved capital allocation, rising shareholder returns and selective opportunities in energy and gold are shaping his positioning as earnings season points to a still-healthy growth backdrop.\n\nRead the full transcript below:\n\nANDREW: We’ve seen this week Canadian energy stocks hitting a record, their first record high since 2008, driven by surging oil prices. Cenovus is one of the Canadian energy names that our guest is interested in buying. We’re joined by Denis Taillefer, portfolio manager at Caldwell Investment Management. Thanks very much indeed for joining us, Denis. Maybe we could pop up a 10- or 20-year chart for XEG or the Canadian energy index. So we’re finally back to where we were, or getting back to where we were, in 2008.\n\nDENIS: Yeah, we are, which is interesting, because you look back to 2008, I think the price of oil, the commodity, hit $145 or something, right? So we’re in a very different environment today. The price of oil is much lower. And interestingly enough, if you look at the last year and a half or so, the price of oil has been under pressure, and yet the energy names have done quite well. And there’s a couple of factors there, but one being really that the industry as a whole is much more disciplined today than it’s ever been in the past. So we’re not seeing the oil companies being so aggressive in reinvesting every dollar they make, putting that back into the ground. And there’s a much bigger emphasis on returning some shareholder value here, right through dividends and share buybacks. So the balance sheets are in much better shape. The industry is much more disciplined. And any of the firms that have decent catalysts and decent growth and can do that in a disciplined way, those stocks have been rewarded quite a bit. So we like the oil space here, the sector overall, and we have good exposure to it. The oil itself seems to be somewhat maybe oversupplied in the short term, but overall we think the industry is in a very good position here as oil prices recover in the longer term.\n\nANDREW: Cenovus is one stock that you like. Tell us what attracts you to it.\n\nDENIS: Yes, we think Cenovus is one of the larger players that has more catalysts in play. We really like the MEG acquisition they made. Obviously, the assets were very synergistic. There are quite a few synergies that the company has been speaking to that they can produce over the next few years, $150 million a year this year, and $400 million in total. We think there’s upside to those synergy figures. As well, this is a company that has a lot of decent growth prospects in front of it, really through brownfield-type expansion, so lower capital intensity to be able to produce some decent growth to the bottom line. They’ve been improving their downstream operations as well. So overall, we like it. It’s got quite a few catalysts that we think will play out over the next few years. It still trades at what we think is a slight discount to some of the other major players like Suncor and CNQ. It’s just starting to break out off that five-year chart. So we think Cenovus is probably one of the better players in that larger-cap space in Canada because it has more catalysts that will play out over the next few years.\n\nANDREW: Let’s talk about a stock that you don’t own right now and, if you held it, you might hold it, but you wouldn’t be inclined to buy it — Walmart. They actually just, I think I saw a headline, got overtaken by Amazon in terms of revenue. And it is down — investors didn’t like the latest numbers from the company. What would induce you to buy Walmart?\n\nDENIS: So the quarter was pretty good, actually. Overall, it was a good quarter. They slightly beat on the top line and on the bottom line, and margins were improving. The same-store sales metrics were solid, with the top end even slightly better than what the market was expecting. So it was a good quarter overall. Their guidance was somewhat conservative. They tend to be conservative, and we think it’s not a bad place to be. It gives them probably a high probability of beating their quarters on a go-forward basis, which stocks tend to do well on. They’ve got some strong catalysts behind what’s driving that performance today. They’re investing in their e-commerce platform. They have a new shopping assistant agent that the early numbers out of that are very encouraging. The shoppers that do use this agent, you see a pretty significant pickup in the average size of the basket. They’re also investing in their digital advertising, which is growing quickly. Their e-commerce is growing quickly. They’re investing in automating their supply chain, which is really starting to see some impact on SG&A. So as they leverage that, that will help margins as well. So we think the catalysts they have that are driving that, on top of the kind of fund flows you’re seeing into more defensive stocks, are probably still going to be in play for a while. So from that perspective, we like the story. The valuation is what really has us step back a bit. It’s trading at a very rich multiple. Again, many players, given the fact that some of these catalysts are still playing out, are probably more than comfortable investing here. But when we look at that overall space, we think there are other names that, from a valuation standpoint, are quite a bit more attractive here because Walmart has had quite a good run.\n\nANDREW: Here’s another stock that you don’t own, but you would be inclined to buy — Newmont Mining.\n\nDENIS: So Newmont Mining, for someone who’s looking to get some gold exposure, if they’re not there already, Newmont Mining is the largest gold producer in the world. They made an acquisition a few years ago. They’ve been optimizing their asset base. They’ve got a very diversified asset base. They’re generating a lot of cash flow. From an operations standpoint, they’re doing very well. They have a new CEO in place. I think the market was really looking to see what their capital allocation priorities would be on a go-forward basis. It looks like they will be buying back more shares on a go-forward basis. So anything above and beyond the dividend, they will return to shareholders in the form of buybacks. So it’s just an overall safe way to play if you want some gold exposure. We don’t own Newmont. We have a few other larger players that we own in our portfolios, but we also have some smaller-cap names that we think have more leverage and more catalysts to the stories that will produce more growth on a go-forward basis. But Newmont is firing on all cylinders here, and it’s kind of a safe way to get exposure to that gold market.\n\nANDREW: I’m just checking these numbers here for Amazon and Walmart. So apparently Amazon hit $717 billion in sales last year. Walmart, which was the world leader, was slightly below $713 billion. However, almost $130 billion in those sales at Amazon came from web services, so it’s kind of apples and oranges. Thank you very much, Denis. I really appreciate it.\n\nDENIS: Thanks for having me, Andrew.\n\nANDREW: Denis Taillefer, portfolio manager at Caldwell Investment Management.\n\nThis BNN Bloomberg summary and transcript of the Feb. 20, 2026 interview with Denis Taillefer are published with the assistance of AI. Original research, interview questions and added context was created by BNN Bloomberg journalists. An editor also reviewed this material before it was published to ensure its accuracy and adherence with BNN Bloomberg editorial policies and standards."
    }
]