[
    {
        "title": "Market Outlook: Tech slides on AI worries as investors brace for pullback",
        "url": "https://www.bnnbloomberg.ca/investing/market-outlook/2026/02/17/market-outlook-tech-slides-on-ai-worries-as-investors-brace-for-pullback/",
        "source": "BNN Bloomberg",
        "date": "2026-02-17T20:32:00+00:00",
        "content": "Published: February 17, 2026 at 3:18PM EST\n\nThe Magnificent Seven and other high-growth technology stocks remain under pressure as investors reassess lofty valuations and the potential impact of artificial intelligence on future earnings. Some portfolio managers warn a deeper correction could still lie ahead after years of tech-led gains.\n\nBNN Bloomberg spoke with Mike Vinokur, portfolio manager and senior wealth advisor at iA Private Wealth, who said his team has raised cash above 30 per cent in equity accounts and is preparing to deploy capital selectively into undervalued names if markets weaken further.\n\nRead the full transcript below:\n\nANDREW: Those Magnificent Seven tech giants in the United States are still under pressure, and smaller tech stocks too, amid fears AI will harm their business models. Our guest says this may lead to an actual correction for the U.S. market and open the door to buys at lower prices. We’re joined by Mike Vinokur, portfolio manager and senior wealth advisor at iA Private Wealth. Mike, great to see you. Thanks for joining us. Are you keeping your powder dry, though? Are you tempted to buy some of these big tech stocks that are off their highs?\n\nMIKE: Yeah, thanks for having me, Andy. Good morning. Yes, we are definitely tempted, but we are tempering our enthusiasm for the time being. We think we’ve been anticipating some kind of a pull-off, some kind of a correction. I think the Nasdaq is off five or six per cent from its highs. So, you know, we still haven’t had a nasty correction, if you will call it 10 per cent. We wouldn’t be surprised if we had a very sharp, short correction based on, you know, the fears that have been building up in the market with respect to the big tech giants, the spending and all of the other news items that have been filtering in through the system.\n\nANDREW: Yeah, it’s amazing. I hadn’t realized this selloff had been this tough. Microsoft, for example, is down about 18 per cent this year. Amazon is down about 15 per cent.\n\nMIKE: Yes, and both of those are on our buy list, full disclosure, but we have not bought them yet. We anticipate that prices may go down even further. Our feeling is that market participants have been pricing these companies at very high multiples to earnings, and we believe that there’s been a shift in mindset in that maybe, as an investor, you don’t want to pay that kind of big multiple because the growth is not going to be the same in the future as it was in the past. So we think that we’re maybe seeing a growth slowdown, a shift in slowdown. And then the other thing is the constant amount of spending of free cash flow for these buildouts. How do you start valuing, as a value investor anyway, how do you look at these enterprise valuations and think about being a shareholder, and how do you need to adjust the fair market value of that equity, given what we’re seeing in the market?\n\nANDREW: So Amazon, the stock that’s catching your eye at this stage, but you’re not necessarily putting new money into it?\n\nMIKE: Absolutely. Actually, we don’t own it at all right now. We would like to own it. We really think Amazon is a wonderful enterprise. Having said that, they are spending an — well, you could say an obscene amount of money — or not spending, rather, I should say investing. Fabulous operator. I mean, there’s not much you can knock about Amazon. For us as value investors, it’s not the business itself, it’s the valuation of that business, and we want to proceed with a margin of safety. So we think that the tech sector, which has been the runaway leader, the runaway winner for, you know, many years, but especially the last three years, is giving way to some other sectors because you have been seeing this rotation. And so you do want to buy some of these fantastic businesses, but we think you want to buy them with a much bigger margin of safety on the valuation of the equity to then be able to ride back up the growth in the business and perhaps the expansion that will occur to the valuation as the earnings once again expand into the next cycle.\n\nANDREW: You have an idea for us — Martinrea, auto parts part of their business. You see promise here, Mike?\n\nMIKE: Yeah, this has been sort of a dead money stock for quite a few years, even though we think they’ve been great operators. You know, there was this bump during COVID in terms of car sales because for a while they couldn’t produce cars because of the shutdowns. And then there was this rush to purchase cars, and so a lot of the automakers and parts manufacturers had this big bump. And then we had this lull again, right? Martinrea, we believe, has been executing really well. You have now a solid balance sheet. The debt to trailing EBITDA numbers have come in quite substantially to 1.5, which we think is a very healthy level. The company is a shrewd allocator of capital. They operate in 10 countries. They have a huge amount of facilities. They have major contracts with all the OEMs. You get a nice dividend while you wait. And they have been an acquirer of their stock, and now that their balance sheet is in such great strength, we think that they could accelerate the buybacks here.\n\nANDREW: And then you have another one for us — CRBG. Tell us about that stock. What do they do?\n\nMIKE: So Corebridge Financial is a typical life co. It’s a mid-cap life co., competes with MetLife, Prudential, Lincoln National, which we also own. We like that space, especially at this point in the cycle, because we feel that well-managed life insurance companies are earning well above very good returns on equity — in other words, very cheap on a price-to-earnings basis. I think they trade at six times forward earnings. We think that given where they are in terms of their regulatory-based capital, which is very, very high, it will allow them to accelerate their share buybacks, allow them to accelerate perhaps their dividend increases, and more importantly, it’s just a very steady Eddie-run business. You get a three per cent dividend. You’re buying something at six times earnings. We think that earnings from here could go up by 20 to 30 per cent over the next couple of years. So if they can get their earnings to, let’s say, six, six and a half dollars by 2028, you know, would you pay maybe 10, 11 times earnings for something like that? We think so. And so today, at a share price of $31, we see a tremendous amount of value. You get paid while you wait, and you have a pretty big margin of safety.\n\nANDREW: Mike, always great hearing from you, and thanks very much indeed.\n\nMIKE: My pleasure. Thank you for having me.\n\nANDREW: Mike Vinokur of iA Private Wealth.\n\nThis BNN Bloomberg summary and transcript of the Feb. 17, 2026 interview with Mike Vinokur are published with the assistance of AI. Original research, interview questions and added context was created by BNN Bloomberg journalists. An editor also reviewed this material before it was published to ensure its accuracy and adherence with BNN Bloomberg editorial policies and standards."
    },
    {
        "title": "Amazon snaps 9-day losing streak during which it lost more than $450 billion in value",
        "url": "https://www.cnbc.com/2026/02/17/amazon-stock-losing-streak.html",
        "source": "CNBC",
        "date": "2026-02-17T19:24:00+00:00",
        "content": "Amazon shares closed up more than 1% on Tuesday, snapping a nine-day slide that shaved billions off of its market cap.\n\nThe stock shed roughly 18% of its value between Feb. 2 and Friday, marking the worst losing streak since 2006 and axing more than $450 billion in market valuation as investors question the merits of its artificial intelligence spending plans.\n\nThe selling frenzy around Amazon is tied to the company's fourth-quarter earnings report released earlier this month.\n\nAmazon said it expects to spend $200 billion in capital expenditures this year, a nearly 60% increase from last year and more than $50 billion above Wall Street's forecast. Most of the spending is expected to go to AI-related initiatives, which require more infrastructure such as data centers, chips and networking equipment.\n\nInvestors have grown increasingly concerned about tech companies' hefty AI investments and their potential to shrink or erase free cash flows.\n\nAlphabet, Microsoft, Meta and Amazon's capital expenditures could hit $700 billion this year as the companies race to build out more infrastructure.\n\nAlphabet and Microsoft shares slid more than 1% on Tuesday, while Meta's stock closed down less than a percent. Shares of Microsoft and Alphabet both notched their fifth straight negative session.\n\nAmazon CEO Andy Jassy defended the company's massive outlay, telling analysts in a conference call that he's confident it will \"yield strong returns on invested capital.\"\n\nAmazon Web Services CEO Matt Garman has also sought to justify the spending increase, telling CNBC in an interview last week that the capex boost will allow the company to seize AI opportunities in the cloud.\n\nWedbush analysts wrote in a research note following Amazon's fourth-quarter report that the company is now in \"prove it mode\" to show investors it can deliver a return on capex spending.\n\n\"The increase in spending will remain an overhang as investors digest the guide and will likely need to see more tangible returns before regaining comfort,\" the analysts wrote. The firm has an outperform rating on Amazon shares.\n\nAndrew Boone, Citizens managing director and research analyst, told CNBC on Tuesday that he remains \"bullish\" on AWS despite the recent sell-off.\n\nHe pointed to Jassy's comment that Amazon expects to double data center capacity by 2027 as an \"underappreciated\" growth driver to the cloud business.\n\n\"We think that's going to lead to an acceleration in terms of AWS revenue as more capacity comes online,\" Boone said in an interview on CNBC's \"The Exchange.\"\n\n— CNBC's Nick Wells contributed to this report."
    },
    {
        "title": "Stock Market Today, Feb. 17: Amazon Rises After Nine-Day Slide Ends on AI Investment Reassessment",
        "url": "https://www.fool.com/coverage/stock-market-today/2026/02/17/stock-market-today-feb-17-amazon-rises-after-nine-day-slide-ends-on-ai-investment-reassessment/",
        "source": "The Motley Fool",
        "date": "2026-02-17T22:05:00+00:00",
        "content": "Today, Feb. 17, 2026, investors weigh a $200 billion AI buildout against the profit power of Amazon's cloud business.\n\nAmazon (AMZN +1.19%), online retail, cloud services, and digital streaming leader, closed Tuesday at $201.15, up 1.19% after snapping a nine-day losing streak tied to concerns over its planned $200 billion AI investment program. The stock’s rebound is coming as coverage highlights the outsized profit contribution from Amazon Web Services and investors are watching how future AI-related capital spending shapes growth and margins.Trading volume reached 67.9 million shares, coming in about 43% above compared with its three-month average of 47.5 million shares. Amazon IPO'd in 1997 and has grown 205,329% since going public.\n\nThe S&P 500 (^GSPC +0.10%) added 0.10% to finish Tuesday at 6,843, while the Nasdaq Composite (^IXIC +0.14%) rose 0.14%, closing at 22,578. Within e-commerce and cloud computing, industry peers Alibaba Group (BABA 0.19%) closed at $155.43 (-0.19%) and Walmart (WMT 3.91%) finished at $128.85 (-3.76%), underscoring divergent reactions to growth and investment risk across sector rivals.\n\nAmazon snapped a nine-day losing streak today that had erased nearly $450 billion in market value. Investors had been reacting to Amazon’s plan for a massive $200 billion capital expenditure plan for 2026, largely driven by investments in AI infrastructure and data centers.\n\nInvestors are now also balancing that spending against Amazon’s growing Amazon Web Services (AWS) segment and overall  long-term growth prospects.\n\nAWS revenue increased 24% in Q4 and delivered $128 billion of Amazon’s $717 billion full-year revenue lasts year, so investing to maintain its leadership position makes sense.\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."
    }
]