[
    {
        "title": "YETI Holdings, Inc.: YETI Reports Fourth Quarter and Full Year 2025 Results; Provides Full Year 2026 Outlook",
        "url": "https://www.finanznachrichten.de/nachrichten-2026-02/67742661-yeti-holdings-inc-yeti-reports-fourth-quarter-and-full-year-2025-results-provides-full-year-2026-outlook-399.htm",
        "source": "FinanzNachrichten.de",
        "date": "2026-02-19T15:51:00+00:00",
        "content": "Fourth Quarter Net Sales Increased 7% and Adjusted Net Sales Increased 5%International Net Sales Increased 25% and Drinkware Net Sales Increased 6% During the Fourth QuarterReturned Nearly $300 Million to Shareholders in 2025 Through Share Repurchases\n\nAUSTIN, Texas, Feb. 19, 2026 (GLOBE NEWSWIRE) -- YETI Holdings, Inc. (\"YETI\") (NYSE: YETI) today announced its financial results for the fourth quarter and fiscal year ended January 3, 2026. YETI reports its financial performance in accordance with accounting principles generally accepted in the United States of America (\"GAAP\") and as adjusted on a non-GAAP basis. Please see \"Non-GAAP Financial Measures\" and \"Reconciliation of GAAP to Non-GAAP Financial Information\" below for additional information and reconciliations of the non-GAAP financial measures to the most comparable GAAP financial measures.\n\nMatt Reintjes, President and Chief Executive Officer, commented, \"Q4 was our strongest quarter of the year as the YETI brand continued to build momentum. We're seeing solid demand, our teams are executing with discipline, and the strategy we've been building over the last few years is showing through in the numbers and outlook. Across categories and channels, the business is more balanced and resilient than it's ever been. A big part of that strength comes from the work we've done on innovation, strengthening our brand globally, and expanding internationally. These long-term growth pillars are producing tangible results and give us tremendous confidence as we head into 2026. These are the reasons we expect to continue to drive strong top and bottom-line results while generating over $200 million in free cash flow. We are playing in a large global addressable market, which provides us with a significant runway for growth as we continue to bring new consumers to YETI.\"\n\nMr. Reintjes continued, \"What stands out in Q4 is how consumers responded to our innovation across both Drinkware and Coolers & Equipment. Drinkware grew 6% delivering its best performance in over a year as we brought innovation to the market, and our global consumers discovered and embraced the breadth of our portfolio. At the same time, categories like soft coolers and bags continue to deliver standout performance, reinforcing the YETI portfolio strength and multi-year opportunity we see ahead. International accelerated as we delivered our highest growth quarter of the year, a testament to how much upside remains outside the U.S. Behind the scenes, the supply chain work we did in 2025 sets us up extremely well for the long term. We've built a far more flexible, diversified global sourcing network. It gives us resilience, improves our speed to market, and positions us to scale. We've also strengthened our innovation and international capabilities, which are critical to sustaining long-term growth. To that end, our team showcased excellent organic innovation while leveraging inorganic product development, launching the Yonder shaker bottle in Q4, built on the design and IP we acquired in Q3. Putting all of that together, YETI is stronger, more global, more innovative, and better positioned for the future than ever before.\"\n\nSales increased 7% to $583.7 million, compared to $546.5 million during the same period last year.\n\nAdjusted sales, which exclude the impact of the recall reserves in the prior year quarter, increased 5% to $583.7 million.\n\nGross profit increased 4% to $340.9 million, or 58.4% of sales, compared to $326.4 million, or 59.7% of sales, in the fourth quarter of 2024. The 130 basis points decrease in gross margin included a 310 basis point unfavorable impact from higher tariff costs, partially offset by lower product costs and selective price increases implemented in the second quarter of 2025.\n\nAdjusted gross profit increased 2% to $340.9 million, or 58.4% of adjusted sales, compared to $334.5 million, or 60.2% of adjusted sales, in the fourth quarter of 2024. The 180 basis points decrease in adjusted gross margin included a 310 basis point unfavorable impact from higher tariff costs, partially offset by lower product costs and selective price increases implemented in the second quarter of 2025.\n\nSelling, general, and administrative (\"SG&A\") expenses increased 9% to $265.4 million, compared to $243.9 million in the fourth quarter of 2024. As a percentage of sales, SG&A expenses increased 90 basis points to 45.5% from 44.6% in the prior year period, reflecting higher marketing expenses, growth investments in technology and facilities, and higher employee compensation, partially offset by leverage in distribution and fulfillment expenses on higher sales.\n\nAdjusted SG&A expenses increased 10% to $246.2 million, compared to $223.9 million in the fourth quarter of 2024. As a percentage of adjusted sales, adjusted SG&A expenses increased 190 basis points to 42.2% from 40.3% in the prior year period, reflecting higher marketing expenses, growth investments in technology and facilities, and higher employee compensation, partially offset by leverage in distribution and fulfillment expenses on higher sales.\n\nOperating income decreased 8% to $75.5 million, or 12.9% of sales, compared to $82.5 million, or 15.1% of sales during the prior year quarter. The operating income margin of 12.9% reflects an approximately 250 basis point unfavorable net impact from higher tariff costs.\n\nAdjusted operating income decreased 14% to $94.7 million, or 16.2% of adjusted sales, compared to $110.6 million, or 19.9% of adjusted sales during the same period last year. The adjusted operating income margin of 16.2% reflects an approximately 250 basis point unfavorable net impact from higher tariff costs.\n\nOther income of $1.2 million compared to other expense of $13.5 million in the fourth quarter of 2024, primarily due to foreign currency gains related to intercompany balances in the current year quarter versus foreign currency losses related to intercompany balances in the prior year quarter.\n\nNet income increased 10% to $58.2 million, or 10.0% of sales, compared to $53.2 million, or 9.7% of sales in the prior year quarter; Net income per diluted share increased 17% to $0.74, compared to $0.63 in the prior year quarter. Net income per diluted share in the current quarter included an unfavorable net impact from higher tariff costs of approximately $0.15.\n\nAdjusted net income decreased 15% to $71.8 million, or 12.3% of adjusted sales, compared to $84.6 million, or 15.2% of adjusted sales in the prior year quarter; Adjusted net income per diluted share decreased 8% to $0.92, compared to $1.00 per diluted share in the prior year quarter. Adjusted net income per diluted share in the current quarter included an unfavorable net impact from higher tariff costs of approximately $0.15.\n\nSales increased 2% to $1,868.5 million, compared to $1,829.9 million in the prior year period.\n\nAdjusted sales, which exclude the unfavorable impact from the recall adjustment in the prior year, increased 2% to $1,868.5 million.\n\nGross profit increased 1% to $1,072.7 million, or 57.4% of sales, compared to $1,063.3 million, or 58.1% of sales, in the prior year period. The 70 basis points decrease in gross margin included a 230 basis point unfavorable impact from higher tariff costs, as well as a lower mix of our Drinkware category. These decreases were partially offset by lower product costs, selective price increases implemented in the second quarter of 2025, and the absence in the current year period of purchase accounting inventory step-up amortization.\n\nAdjusted gross profit decreased to $1,072.3 million, or 57.4% of sales, compared to $1,076.9 million, or 58.6% of sales, in the prior year period. The 120 basis points decrease in gross margin included a 230 basis point unfavorable impact from higher tariff costs, as well as a lower mix of our Drinkware category. These decreases were partially offset by lower product costs and selective price increases implemented in the second quarter of 2025.\n\nSG&A expenses increased 5% to $859.1 million, compared to $817.9 million in the prior year period. As a percentage of sales, SG&A expenses increased 130 basis points to 46.0% from 44.7% in the prior year period. This increase was primarily due to growth investments related to technology and facilities, and higher employee compensation, including non-cash stock-based compensation, partially offset by leverage in distribution and fulfillment expenses on higher sales.\n\nAdjusted SG&A expenses increased 5% to $802.6 million, compared to $767.6 million in the prior year period. As a percentage of adjusted sales, adjusted SG&A expenses increased by 130 basis points to 43.0% from 41.7% in the prior year period. This increase was primarily due to growth investments related to technology and facilities, and higher employee compensation, partially offset by leverage in distribution and fulfillment expenses on higher sales.\n\nOperating income decreased 13% to $213.6 million, or 11.4% of sales, compared to $245.4 million, or 13.4% of sales during the prior year period. The operating income margin of 11.4% reflects an approximately 200 basis point unfavorable net impact from higher tariff costs.\n\nAdjusted operating income decreased 13% to $269.7 million, or 14.4% of adjusted sales, compared to $309.4 million, or 16.8% of adjusted sales during the same period last year. The adjusted operating income margin of 14.4% reflects an approximately 200 basis point unfavorable net impact from higher tariff costs.\n\nOther income of $7.2 million compared to other expense of $13.2 million in the prior year period, primarily due to foreign currency gains related to intercompany balances in the current year quarter versus foreign currency losses related to intercompany balances in the prior year period.\n\nNet income decreased 6% to $165.4 million, or 8.9% of sales, compared to $175.7 million, or 9.6% of sales in the prior year period; Net income per diluted share decreased 1% to $2.03, compared to $2.05 in the prior year period. Net income per diluted share in the current year period included an unfavorable net impact from higher tariff costs of approximately $0.35.\n\nAdjusted net income decreased 14% to $202.4 million, or 10.8% of adjusted sales, compared to $234.0 million, or 12.7% of adjusted sales in the prior year period; Adjusted net income per diluted share decreased 9% to $2.48, compared to $2.73 per diluted share in the prior year period. Adjusted net income per diluted share in the current year period included an unfavorable net impact from higher tariff costs of approximately $0.35.\n\nBalance Sheet and Liquidity Review\n\nYETI continued to maintain a strong liquidity position with Cash of $188.3 million, total debt, excluding finance leases and unamortized deferred financing fees, of $73.8 million, and our $300 million Revolving Credit Facility undrawn as of the end of Fiscal 2025.\n\nInventory decreased 6% to $290.6 million from $310.1 million at the end of Fiscal 2024, reflecting strategic management of our inventory and supply constraints related to our supply chain transformation.\n\nYETI continued to generate strong free cash flow in Fiscal 2025 and remains committed to investing in the business to drive sustainable growth and enhance long-term shareholder value through share repurchases.\n\nPursuant to our existing $450 million share repurchase authorization, in the fourth quarter of 2025, we repurchased 3.1 million shares of YETI's common stock on the open market for $124.9 million, bringing fiscal year 2025 share repurchases to 8.2 million shares for $297.6 million.\n\nMr. Reintjes concluded, \"Building on our fourth quarter momentum, as we look ahead to 2026, we expect full-year sales growth between 6% and 8%, supported by balanced contributions from both Drinkware and Coolers & Equipment, continued international strength, and a robust innovation cycle. When we look at our long-range plan and the progress we're making across geographies and product categories we see an even broader runway and a clear path to high-single to low-double digit growth. We enter 2026 with a strong, diverse multi-year innovation pipeline, backed by a global product engine. Our innovation capabilities allow us to accelerate category expansion and bring new products to market faster than ever before. While tariff pressures will remain a headwind in 2026, the structural actions we have taken, across both supply chain diversification and ongoing cost optimization, give us confidence in our ability to enhance profitability while continuing to invest in growth. Our financial strength is a strategic advantage, enabling us to invest behind innovation, brand demand creation, international expansion, and technology, while maintaining strong free cash flow and delivering value to shareholders. With disciplined execution and a clear focus on our strategic priorities, we remain confident in our ability to deliver long-term growth, enhance profitability, and unlock the full global potential of YETI.\"\n\nFor Fiscal 2026 compared to Fiscal 2025, YETI expects:\n\nConference Call DetailsA conference call to discuss the fourth quarter of 2025 financial results is scheduled for today, February 19, 2026, at 8:00 a.m. Eastern Time. Investors and analysts interested in participating in the call are invited to dial 800-717-1738 (international callers, please dial 646-307-1865) approximately 10 minutes prior to the start of the call. A live audio webcast of the conference call will be available online at http://investors.yeti.com. A replay will be available through March 5, 2026 by dialing 844-512-2921 (international callers, 412-317-6671). The accompanying access code for this call is 1110189.\n\nAbout YETI Holdings, Inc.Headquartered in Austin, Texas, YETI is a global designer, retailer, and distributor of innovative outdoor products. From coolers and drinkware to bags and apparel, YETI products are built to meet the unique and varying needs of diverse outdoor pursuits, whether in the remote wilderness, at the beach, or anywhere life takes you. By consistently delivering high-performing, exceptional products, we have built a strong following of brand loyalists throughout the world, ranging from serious outdoor enthusiasts to individuals who simply value products of uncompromising quality and design. We have an unwavering commitment to outdoor and recreation communities, and we are relentless in our pursuit of building superior products for people to confidently enjoy life outdoors and beyond. For more information, please visit www.YETI.com.\n\nNon-GAAP Financial MeasuresIn addition to our results determined in accordance with GAAP, we supplement our results with non-GAAP financial measures, including adjusted net sales, adjusted gross profit, adjusted gross margin, adjusted SG&A expenses, adjusted operating income, adjusted net income, adjusted net income per diluted share (which we also refer to as adjusted EPS), free cash flow as well as adjusted gross profit, adjusted SG&A expenses, adjusted operating income and adjusted net income as a percentage of adjusted net sales.\n\nOur management uses these non-GAAP financial measures in conjunction with GAAP financial measures to measure our profitability and to evaluate our financial performance. We believe that these non-GAAP financial measures provide meaningful supplemental information regarding the underlying operating performance of our business and are appropriate to enhance an overall understanding of our financial performance. These non-GAAP financial measures have limitations as analytical tools in that they do not reflect all of the amounts associated with our results of operations as determined in accordance with GAAP. Because of these limitations, these non-GAAP financial measures should be considered along with GAAP financial performance measures. The presentation of these non-GAAP financial measures is not intended to be considered in isolation or as a substitute for, or superior to, financial information prepared and presented in accordance with GAAP. Investors are encouraged to review the reconciliation of these non-GAAP financial measures to their most directly comparable GAAP financial measures. A reconciliation of the non-GAAP financial measures to such GAAP measures can be found below.\n\nYETI does not provide a reconciliation of forward-looking non-GAAP to GAAP financial measures because such reconciliations are not available without unreasonable efforts. This is due to the inherent difficulty in forecasting with reasonable certainty certain amounts that are necessary for such reconciliation, including in particular the impacts of product recalls and realized and unrealized foreign currency gains and losses reported within other expense. For the same reasons, we are unable to forecast with reasonable certainty all deductions and additions needed in order to provide a forward-looking GAAP financial measures at this time. The amount of these deductions and additions may be material and, therefore, could result in forward-looking GAAP financial measures being materially different or less than forward-looking non-GAAP financial measures. See \"Forward-looking statements\" below.\n\nForward-looking statementsThis press release contains \"forward-looking statements'' within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical or current fact included in this press release are forward-looking statements. Forward-looking statements include statements containing words such as \"anticipate,\" \"assume,\" \"believe,\" \"can have,\" \"contemplate,\" \"continue,\" \"could,\" \"design,\" \"due,\" \"estimate,\" \"expect,\" \"forecast,\" \"goal,\" \"intend,\" \"likely,\" \"may,\" \"might,\" \"objective,\" \"plan,\" \"predict,\" \"project,\" \"potential,\" \"seek,\" \"should,\" \"target,\" \"will,\" \"would,\" and other words and terms of similar meaning in connection with any discussion of the timing or nature of future operational performance or other events. For example, all statements made regarding future expectations relating to strengthening our brand, global expansion, our position to deliver top- and bottom-line growth, our path to high-single to low-double-digit growth, enhancing profitability, technology investments, free cash flow generation, the impact of our supply chain transformation efforts, share repurchase plans, growth and innovation initiatives, the impact of tariffs, future financial performance, capital expenditures, and our expectations for opportunity, growth, and investments, including those set forth in the quotes from YETI's President and CEO, and the 2026 financial outlook provided herein, constitute forward-looking statements. All forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from those that are expected and, therefore, you should not unduly rely on such statements. The risks and uncertainties that could cause actual results to differ materially from those expressed or implied by these forward-looking statements include but are not limited to: (i) economic conditions or consumer confidence in future economic conditions; (ii) our ability to maintain and strengthen our brand and generate and maintain ongoing demand for our products; (iii) our ability to successfully design, develop and market new products; (iv) our ability to effectively manage our growth; (v) our ability to expand into additional consumer markets, and our success in doing so; (vi) the success of our international expansion plans; (vii) our ability to compete effectively in the outdoor and recreation market and protect our brand; (viii) the level of customer spending for our products, which is sensitive to general economic conditions and other factors; (ix) problems with, or loss of, our third-party contract manufacturers and suppliers or an inability to obtain raw materials; (x) fluctuations in the cost and availability of raw materials, equipment, labor, and transportation and subsequent manufacturing delays or increased costs; (xi) adverse changes in international trade policies, tariffs and treaties, including increases in tariff rates and the imposition of additional tariffs; (xii) our ability to accurately forecast demand for our products and our results of operations; (xiii) our relationships with our national, regional, and independent retail partners, who account for a significant portion of our sales; (xiv) the impact of natural disasters and failures of our information technology on our operations and the operations of our manufacturing partners; (xv) the integration and use of artificial intelligence; (xvi) our ability to attract and retain skilled personnel and senior management, and to maintain the continued efforts of our management and key employees; (xvii) the impact of our indebtedness on our ability to invest in the ongoing needs of our business; and (xviii) our ability to successfully execute our share repurchase program and its impact on stockholder value and the volatility of the price of our common stock. For a more extensive list of factors that could materially affect our results, you should read our filings with the United States Securities and Exchange Commission (the \"SEC\"), including our Annual Report on Form 10-K for the year ended December 28, 2024 and our Quarterly Report on Form 10-Q for the quarter ended September 27, 2025, as such filings may be amended, supplemented or superseded from time to time by other reports YETI files with the SEC, including our Annual Report on Form 10-K for the year ended January 3, 2026 to be filed with the SEC.\n\nThese forward-looking statements are made based upon detailed assumptions and reflect management's current expectations and beliefs. While YETI believes that these assumptions underlying the forward-looking statements are reasonable, YETI cautions that it is very difficult to predict the impact of known factors, and it is impossible for YETI to anticipate all factors that could affect actual results.\n\nThe forward-looking statements included here are made only as of the date hereof. YETI undertakes no obligation to publicly update or revise any forward-looking statement as a result of new information, future events, or otherwise, except as required by law. Many of the foregoing risks and uncertainties may be exacerbated by the global business and economic environment, including ongoing geopolitical conflicts.\n\nSolely for convenience, certain trademark and service marks referred to in this press release appear without the ® or  symbols, but those references are not intended to indicate, in any way, that we will not assert, to the fullest extent under applicable law, our rights to these trademarks and service marks.\n\nInvestor Relations Contact:Arvind Bhatia, CFAInvestor.relations@yeti.com\n\nMedia Contact:YETI Holdings, Inc. Media HotlineMedia@yeti.com\n\n_________________________(1)   Represents adjustments and charges associated with product recalls. Beginning in the fourth quarter of 2025, and on a prospective basis, product recall adjustments will no longer be excluded from non-GAAP financial results. Accordingly, the unfavorable product recall adjustment recorded in the fourth quarter of 2025 was not excluded from non-GAAP financial results. (2)   For the twelve months ended January 3, 2026, represents a favorable true-up of estimated disposal costs in connection with the acquisition of Mystery Ranch, LLC. For the twelve months ended December 28, 2024, represents inventory step-up and inventory disposal costs in connection with the acquisition of Mystery Ranch, LLC. (3)   Represents employee severance costs in connection with strategic organizational realignments.(4)   Represents advisory and legal fees related to a stockholder matter that resulted in a cooperation agreement signed in March 2025.(5)   Represents third-party consulting fees related to certain initiatives to optimize and enhance our technology infrastructure. These expenses represent non-recurring incremental costs above the normal ongoing level of spending on technology to support operations. (6)   Represents transition costs in connection with the acquisition of Mystery Ranch, LLC, including third-party business integration costs.(7)   Represents start-up, transition and integration costs associated with our new distribution facility in the United Kingdom.\n\n_________________________(1)   These costs are reported in SG&A expenses. (2)   Represents adjustments and charges associated with product recalls. Beginning in the fourth quarter of 2025, and on a prospective basis, product recall adjustments will no longer be excluded from non-GAAP financial results. Accordingly, the unfavorable product recall adjustment recorded in the fourth quarter of 2025 was not excluded from non-GAAP financial results.(3)   Represents employee severance costs in connection with strategic organizational realignments. (4)   For the twelve months ended January 3, 2026, represents a favorable true-up of estimated disposal costs in connection with the acquisition of Mystery Ranch, LLC. For the twelve months ended December 28, 2024, represents inventory step-up costs, inventory disposal costs, and third-party business integration costs in connection with the acquisition of Mystery Ranch, LLC. (5)   Represents advisory and legal fees related to a stockholder matter that resulted in a cooperation agreement signed in March 2025.(6)   Represents start-up, transition and integration costs associated with our new distribution facility in the United Kingdom.(7)   Represents third-party consulting fees related to certain initiatives to optimize and enhance our technology infrastructure. These expenses represent non-recurring incremental costs above the normal ongoing level of spending on technology to support operations.(8)   Other (income) expense, net substantially consists of realized and unrealized foreign currency gains and losses on intercompany balances that arise in the ordinary course of business. (9)   Represents the tax impact of adjustments calculated at an expected statutory tax rate of 24.5% for each of the three and twelve months ended January 3, 2026 and December 28, 2024.\n\n_________________________(1)   Represents adjustments and charges associated with product recalls. Beginning in the fourth quarter of 2025, and on a prospective basis, product recall adjustments will no longer be excluded from non-GAAP financial results. Accordingly, the unfavorable product recall adjustment recorded in the fourth quarter of 2025 was not excluded from non-GAAP financial results.\n\n_________________________(1)   Represents adjustments and charges associated with product recalls. Beginning in the fourth quarter of 2025, on a prospective basis, product recall adjustments will no longer be excluded from non-GAAP financial results. Accordingly, the unfavorable product recall adjustment recorded in the fourth quarter of 2025 was not excluded from non-GAAP financial results."
    }
]