[
    {
        "title": "Stock Market Today, Feb. 10: Amazon Doubles Down on AI as AWS Drives $200 Billion Capex Push",
        "url": "https://www.fool.com/coverage/stock-market-today/2026/02/10/stock-market-today-feb-10-amazon-doubles-down-on-ai-as-aws-drives-usd200-billion-capex-push/",
        "source": "The Motley Fool",
        "date": "2026-02-10T22:41:00+00:00",
        "content": "Amazon’s AI strategy came into sharper focus as AWS-led spending plans highlighted the scale of its long-term cloud ambitions.\n\nAmazon (AMZN 1.39%), online marketplace and cloud leader, closed Tuesday at $206.9, down 0.84%. The stock moved lower during the regular session as investors continued weighing Amazon’s roughly $200 billion 2026 capex plan and heavy AWS AI spending against robust recent cloud growth and AI content-licensing initiatives investors are watching.\n\nThe company’s trading volume reached 66.3 million shares, which is roughly   47% above compared with its three-month average of 45 million shares. Amazon went public in 1997 and has grown 211201% since its IPO.\n\nThe broader U.S. markets finished weaker on Tuesday, with the S&P 500 (SNPINDEX: ^GSPC) closing down 0.33% at 6,941 and the Nasdaq Composite (NASDAQINDEX: ^IXIC) off 0.59% at 23,102. Within e-commerce and cloud computing, peers were mixed as Alibaba Group (BABA 1.38%) closed at $166.51, up 2.15%, while Walmart (WMT +1.69%) ended at $126.7, down 1.80%, underscoring divergent retail and cloud narratives.\n\nAmazon plans to invest approximately $200 billion through 2026, reflecting its belief that demand for AI-driven cloud infrastructure will remain strong. Most of this investment will expand AWS capacity in data centers, custom chips, networking, robotics, and satellite infrastructure. This approach addresses current supply constraints and prepares AWS for sustained enterprise AI workloads.\n\nAWS is developing an AI content marketplace to secure data inputs and generate new revenue streams. Partnerships in autonomous vehicle deployments are also expanding AWS’s role in industry-specific AI applications. Significant capital spending has affected market sentiment, as investors weigh short-term cash flow against long-term returns, especially given ongoing regulatory challenges in retail. Investors will continue to monitor whether AWS can convert these investments into sustained revenue growth and improved operating leverage as new AI capacity materialize.\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."
    }
]