[
    {
        "title": "Agilent Technologies Stock: Analyst Estimates & Ratings",
        "url": "https://finance.yahoo.com/news/agilent-technologies-stock-analyst-estimates-070638728.html",
        "source": "Yahoo Finance",
        "date": "2026-02-20T12:56:00+00:00",
        "content": "Agilent Technologies, Inc. (A) is a leading provider of instruments, software, services and consumables that support laboratory workflows across life sciences, diagnostics and applied chemical markets worldwide. Agilent is headquartered in Santa Clara, California and has a market cap of $35.8 billion, reflecting its significant presence in the healthcare and research tools sector.\n\nThe healthcare stock has underperformed the broader market over the past year. Agilent’s stock prices have declined 7.9% over the past 52 weeks and 7.2% on a YTD basis, compared to the S&P 500 Index’s ($SPX) 11.7% gains over the past year and marginal rise this year.\n\nQQQ Just Sent a Chilling Signal — Right Before Nvidia Earnings\n\nStocks Slip Before the Open on U.S.-Iran Fears, Economic Data and Walmart Earnings on Tap\n\nIgnore the Panic and Keep Buying Apple Stock, According to Wedbush\n\nTired of missing midday reversals? The FREE Barchart Brief newsletter keeps you in the know. Sign up now!\n\nNarrowing the focus, the stock has also lagged behind the sector-focused State Street Health Care Select Sector SPDR ETF’s (XLV) 7.4% gains over the past 52 weeks and 1.6% uptick in 2026.\n\nAgilent Technologies stock has faced downward pressure in 2026, largely due to weak sentiment and profit-taking despite stable fundamentals. Despite stable Q4 2025 results and a positive outlook for the long term, the market was concerned by persisting pressures driven by global tariffs and supply chain issues.\n\nFor the full fiscal 2026, ending in October, analysts expect Agilent to deliver an EPS of $5.93, up 6.1% year-over-year. Further, the company has a steady earnings surprise history. It has surpassed or met the Street’s bottom-line projections in each of the past four quarters.\n\nAmong the 18 analysts covering the Agilent stock, the consensus rating is a “Moderate Buy.” That’s based on 12 “Strong Buy” ratings, one “Moderate Buy,” and five “Holds.”\n\nThis configuration is more bullish than three months ago, when there were nine “Strong Buy” ratings.\n\nLast month, HSBC initiated coverage on Agilent Technologies with a “Buy” rating and a $180 price target.\n\nAgilent’s mean price target of $171.25 represents a 35.5% premium to current price levels. Meanwhile, the street-high target of $185 suggests a notable 46.4% upside potential.\n\nOn the date of publication, Subhasree Kar did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com"
    },
    {
        "title": "Woodline Partners LP Boosts Apple Inc Stake by 472,035 Shares",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/AAPL/pressreleases/320037/woodline-partners-lp-boosts-apple-inc-stake-by-472035-shares/",
        "source": "The Globe and Mail",
        "date": "2026-02-20T03:56:00+00:00",
        "content": "Woodline Partners LP, managed by Michael Rockefeller, recently executed a significant transaction involving Apple Inc ((AAPL)). The hedge fund increased its position by 472,035 shares.\n\nRecent Updates on Apple Inc stock\n\nApple (AAPL) has seen choppy but positive trading, with weekly gains of 1%–5% and a modestly higher one-year return, while recent months have been flat to slightly negative. Despite this, analysts keep a “Moderate Buy” stance and targets around $300–$305, with top bulls like Goldman Sachs, BofA, and J.P. Morgan eyeing $325 on strong iPhone 17 demand, record margins, and expanding AI- and services-driven growth.\n\nAccording to Spark, TipRanks’ AI Analyst, AAPL is a Outperform.\n\nThe score is driven primarily by very strong financial performance (best-in-class margins and massive free cash flow) and a constructive earnings outlook with record results. Offsetting factors are mixed near-term technical momentum and a premium valuation with a low dividend yield, plus execution risks from supply constraints and input-cost pressures.\n\nTo see Spark’s full report on AAPL stock, click here.\n\nAverage Trading Volume: 48,915,757\n\nDisclaimer & DisclosureReport an Issue\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Driehaus Capital Management Boosts Apple Stake by 1,888 Shares",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/AAPL/pressreleases/320160/driehaus-capital-management-boosts-apple-stake-by-1888-shares/",
        "source": "The Globe and Mail",
        "date": "2026-02-20T03:55:00+00:00",
        "content": "Driehaus Capital Management LLC, managed by Richard Driehaus, recently executed a significant transaction involving Apple Inc ((AAPL)). The hedge fund increased its position by 1,888 shares.\n\nRecent Updates on Apple Inc stock\n\nApple (AAPL) has seen choppy but positive trading, recently up modestly over the week while slipping over the month, yet still posting double‑digit gains over the past year. Analysts keep a “Moderate Buy” stance, with average 12‑month targets around $300–$305 versus current prices near $260–$270, implying solid upside.\n\nSentiment is supported by blockbuster iPhone 17 demand, especially in China, record or near‑record gross margins near 48%, and accelerating Services and App Store trends. Several top analysts have reiterated or upgraded to Buy with targets up to $325, citing AI partnerships, an upcoming AI‑enabled Siri and potential foldable iPhone, while noting valuation and rising memory costs as key risks.\n\nAccording to Spark, TipRanks’ AI Analyst, AAPL is a Outperform.\n\nThe score is driven primarily by very strong financial performance (best-in-class margins and massive free cash flow) and a constructive earnings outlook with record results. Offsetting factors are mixed near-term technical momentum and a premium valuation with a low dividend yield, plus execution risks from supply constraints and input-cost pressures.\n\nTo see Spark’s full report on AAPL stock, click here.\n\nAverage Trading Volume: 48,915,757\n\nDisclaimer & DisclosureReport an Issue\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Market continues to overlook this ASX share",
        "url": "https://www.morningstar.com.au/stocks/market-continues-overlook-this-asx-share",
        "source": "Morningstar Australia",
        "date": "2026-02-20T00:20:00+00:00",
        "content": "Goodman’s (ASX: GMG) first-half operating profit per security fell 8% year on year to 59 cents, on lower transactional and performance fees, and development earnings timing. Full-year guidance remains for operating earnings growth of 9% and distributions of 30 cents.\n\nWhy it matters: Earnings largely met our expectations, though the timeline for building out the data center pipeline is still somewhat unclear. The group plans to start building 0.5 gigawatts by June 2026, which we estimate will take until fiscal 2028 to finish.\n\nThe bottom line: We maintain our fair value estimate for narrow-moat Goodman of $29 per security. The securities are fairly valued. In contrast to the irrational market exuberance in 2023/24 over Goodman’s data center ambitions, investors are valuing the company more realistically now.\n\nBetween the lines: The balance sheet is strong. Gearing (net debt/tangible assets) was 4%, near the bottom of the 0%-25% target range. On a look-through basis, including debt in joint ventures and partnerships, gearing was 18%, which is modest.\n\nGoodman operates an own-develop-manage business model. A typical cycle starts from acquiring a site and developing it. Completed projects are either sold or retained in one of Goodman’s funds or partnerships. Goodman typically retains minority stakes in the investment vehicles and continues to manage the sites after completion.\n\nThe group’s development-led strategy fuels growth of its asset base. As of December 2025, Goodman’s total assets under management reached AUD 87 billion, tripling the asset base of 10 years ago. Its development pipeline has also experienced significant expansion, growing to AUD 14 billion by December 2025, compared with fiscal 2014’s AUD 3 billion. With a large development pipeline and an active development strategy, we expect AUM to enjoy mid-single-digit percentage growth over the medium term, and the management segment to contribute almost 40% of the group’s midcycle operating earnings.\n\nThe pivot toward larger-scale, higher-value projects not only expands pipeline size but also increases project lead time. Today, an average development project takes 24 months to complete, up from 17 months in 2020. This reflects a higher percentage of data center projects, an area of focus for Goodman in the short to medium term.\n\nDespite larger developments, capital management has remained prudent. Most development projects have capital partners involved, with high tenancy precommitment and long leases secured. The company has been rotating properties into its funds or disposing of its assets to external third parties. By doing so, Goodman is redeploying capital to new opportunities and maintaining low leverage on its own balance sheet.\n\nGoodman prefers urban infill locations in core gateway cities, and this adds to the appeal of its portfolio. These locations—typically in established and densely populated neighborhoods and close to end-consumer markets—are supply-constrained. Good locations, combined with structural tailwinds like e-commerce and cloud technology booms, are likely to underpin solid rent growth in the medium term.\n\nStar Rating: Our one- to five-star ratings are guideposts to a broad audience and individuals must consider their own specific investment goals, risk tolerance, and several other factors. A five-star rating means our analysts think the current market price likely represents an excessively pessimistic outlook and that beyond fair risk-adjusted returns are likely over a long timeframe. A one-star rating means our analysts think the market is pricing in an excessively optimistic outlook, limiting upside potential and leaving the investor exposed to capital loss.\n\nFair Value: Morningstar’s Fair Value estimate results from a detailed projection of a company’s future cash flows, resulting from our analysts’ independent primary research. Price To Fair Value measures the current market price against estimated Fair Value. If a company’s stock trades at $100 and our analysts believe it is worth $200, the price to fair value ratio would be 0.5. A Price to Fair Value over 1 suggests the share is overvalued.\n\nMoat Rating: An economic moat is a structural feature that allows a firm to sustain excess profits over a long period. Companies with a narrow moat are those we believe are more likely than not to sustain excess returns for at least a decade. For wide-moat companies, we have high confidence that excess returns will persist for 10 years and are likely to persist at least 20 years. To learn about finding different sources of moat, read this article by Mark LaMonica."
    },
    {
        "title": "Trending tickers: Walmart, Super Micro, Opendoor, Klarna, and Anglo American",
        "url": "https://www.aol.co.uk/articles/trending-tickers-walmart-super-micro-092209802.html",
        "source": "AOL.co.uk",
        "date": "2026-02-20T09:22:00+00:00",
        "content": "Shares in Walmart (WMT) were flat in pre-market trading after the retailer reported stronger than expected fourth quarter sales, driven by resilient grocery demand and rapid online growth, as newly appointed chief executive John Furner began his tenure with a cautious outlook for the year ahead.\n\nRevenue rose 5.6% to $190.7bn (£141.7bn) in the quarter ended in January, slightly ahead of analyst estimates, according to Reuters. US comparable sales increased 4.6%, above forecasts of about 4.2%, helped by a 27% rise in US online sales.\n\nGlobal e-commerce sales climbed 24% year on year, as the company continued to attract higher income households with faster delivery options and an expanded third party marketplace.\n\nFor the full year, revenue reached a record $713.2bn. However, the Financial Times noted that the figure was surpassed for the first time by Amazon (AMZN), which reported annual revenue of $716.9bn.\n\nRead more: FTSE 100 LIVE: Markets gain after positive retail sales data and record budget surplus\n\nWalmart’s shares have more than doubled over the past two years, lifting its market capitalisation above $1tn, as it benefited from inflation weary consumers trading down and from investments in automation and AI.\n\nQuarterly operating profit rose 10.8% to $8.7bn, slightly below analyst expectations of $8.9bn, while net income fell 19.4% to $4.2bn, reflecting changes in the fair value of certain investments.\n\nThe group’s dominance in groceries, which account for about 60% of US sales, continued to underpin performance.\n\nShares in Super Micro Computer (SMCI) were the top trending ticker on Yahoo Finance on Friday morning after a strong quarterly earnings report and a series of analyst upgrades rekindled investor sentiment.\n\nThe San Jose-based provider of server and storage systems reported net revenue of $12.68bn and net profit of $400.56m for the quarter earlier this month, a performance that helped drive the latest rally in the shares.\n\nAnalysts moved the stock to a “strong buy” following the results, pointing to the company’s Data Center Building Block Solutions platform as a key driver of potential margin improvement and the principal rationale for owning the shares. The consensus rating on Wall Street for SMCI stands at “Moderate Buy”, with a mean price target of about $43, implying roughly 35% upside from current levels.\n\nRead more: What crypto investors need to know about the UK's sandbox scheme\n\nOptions traders also increased activity, with a surge in call buying as the stock climbed back above its 50 day moving average, a closely watched technical threshold for momentum investors. Trading volume reached 42.1 million shares, about 47% above the three month average of 28.6 million.\n\nFor the three months to December, the company posted revenue of $736m, ahead of analysts’ estimates of $594.9m. Adjusted EBITDA came in at a loss of $43m, narrower than the consensus forecast of a $47.5m loss and ahead of company guidance for a loss “in the high $40m to mid $50m”.\n\nOpendoor (OPEN) exceeded its own operating targets during the quarter. The number of homes purchased rose 46% quarter on quarter, compared with management’s goal of at least 35% growth. The 1,978 homes sold in the period were almost 20% above Wall Street’s expectations.\n\n“This quarter demonstrates we are executing on that plan,” said chief executive Kaz Nejatian. “These results reflect structural improvements in how we operate with more accurate pricing, faster inventory turns, and disciplined selection.”\n\nLooking ahead, the company said it expects a first quarter adjusted EBITDA loss “in the low to mid $30m,” an improvement on the anticipated $37.7m deficit. However, its revenue outlook disappointed investors, with management projecting a decline of about 10% quarter on quarter, compared with analysts’ expectations of a sharp increase.\n\nShares in Klarna (KLAR) edged up 1% in pre-market trading after plunging 27% in the previous session, as the buy now pay later group reported a $273m net loss for 2025 and raised provisions for loans it expects customers will be unable to repay.\n\nFor the year to the end of December, the company swung to a net loss of $273m from a profit of $21m a year earlier, while total revenue increased to $3.5bn from $2.8bn.\n\nIn the fourth quarter, the Stockholm based group reported a net loss of $26m, compared with a profit of $40m in the same period last year. Revenue for the quarter rose 38% to $1.1bn, marking the company’s first billion dollar quarter and coming in above guidance. However, analysts had been expecting a fourth quarter loss closer to $10m.\n\nRead more: UK records largest ever budget surplus in boost for Reeves ahead of spring forecast\n\nThe shares had already halved since the Swedish group secured a $15bn valuation in a New York listing in September. Thursday’s 27% fall to $13.85 extended the post IPO decline to almost 68% and reduced its market value to $5.3bn. The company said it had set aside $250m for credit losses in the fourth quarter, up almost 60% from the same period in 2024.\n\nKlarna primarily offers interest free consumer loans for retail purchases, allowing customers to pay in several instalments.\n\nShares in Anglo American (AAL.L) hovered around flat in London trading after the miner wrote down the value of its troubled De Beers unit by a further $2.3bn, weighing on annual earnings.\n\nThe mining group is seeking to sell De Beers amid weak demand from China and the rapid growth of synthetic diamonds. It reported impairments of $2.9bn in 2025 and $1.6bn the previous year in relation to the business.\n\nUnderlying group core earnings rose 2% to $6.4bn, as higher copper prices offset a 10% decline in production of the metal, reflecting lower grades and plant maintenance.\n\nThe final dividend was cut by 27% to 16 cents a share, bringing the total payout for the year to 23 cents a share, down 64%.\n\nStocks: Create your watchlist and portfolio\n\nAdam Vettese, market analyst for eToro, said: “Anglo American’s full year results tell a story of steady stabilisation for a miner in transition, showing gritty operational progress amid portfolio pruning, setting the stage for bigger ambitions via the advancing Teck (TECK) merger. Earnings from continuing operations edged up with EBITDA up 2%, powered by stellar 49% copper margins and 43% from premium iron ore, while nailing $1.8bn in cost savings and strong 107% cash conversion trimmed net debt to $8.6bn.\n\n“That said, the group’s total earnings remain well below 2023 peaks after shedding coal and nickel, capex eats over $2.5bn in cash yearly, and fresh De Beers writedowns highlight past allocation missteps. These numbers now bridge to the Teck deal, post Canadian approval and shareholder backing, which will promise $800m synergies, a top-tier copper giant, and a Vancouver HQ to turbocharge growth.\n\n“For investors, it’s a leveraged copper bet, though merger execution and commodity swings will decide the fate. Shares have opened positively this morning and could be primed for further upside if Teck seals smoothly in 12-18 months and copper rallies, although any China jitters could stall that.”\n\nDownload the Yahoo Finance app, available for Apple and Android.\n\nOur editors will email you a roundup of their favourite stories from across AOL"
    }
]