[
    {
        "title": "실적 발표 앞둔 LG CNS, AI 호재에 주가 고공행진",
        "url": "https://www.newspim.com/news/view/20260126001116",
        "source": "뉴스핌",
        "date": "2026-01-26T00:00:00+00:00",
        "content": "기사입력 :\n                                \n                                    2026년01월26일 17:32\n\n최종수정 :\n                                \n                                    2026년01월26일 17:33\n\n[서울=뉴스핌] 양태훈 기자 = LG CNS가 지난해 사상 최초로 매출 6조원을 돌파한 것으로 예측되는 가운데, 주가도 상승 흐름을 이어가고 있다.\n\n26일 한국거래소 데이터마켓플레이스에 따르면 올해 초 6만2000원 선에서 출발한 LG CNS 주가는 한 달여 만에 15% 안팎 상승하며 강세 흐름을 이어가고 있다. 지난 15일에는 주가가 직전 거래일 대비 10.19% 오른 6만8100원을 넘겼고, 이달 23일에도 전 거래일 대비 8.38% 상승한 7만3700원에 마감했다.\n\n시장에서는 정부 '독자 파운데이션 모델' 프로젝트 1차 발표에서 파트너사인 LG AI연구원 컨소시엄이 최고점을 기록한 점과 오픈AI 서비스 파트너 선정, 한국은행과의 'AI 디지털화폐 자동결제' 실증 성과 등이 주가 모멘텀으로 부각됐다는 해석이 나온다.정원석 신영증권 연구원은 \"LG CNS는 LG AI연구원의 엑사원이 최종적으로 국가대표 AI 모델로 선정될 경우, 상장사 가운데 장기적인 관점에서 가장 큰 수혜자가 될 수 있는 기업\"이라며 \"아직 실적 기여도는 작지만, 이미 에이전틱웍스, AX씽크 등 자체적인 AI 플랫폼에 기존 엑사원 모델을 활용하고 있으며, 올해부터 관련 매출액이 본격 발생할 예정\"이라고 설명했다.이어 \"LG CNS는 LG AI 연구원과 함께 K-엑사원을 챗GPT처럼 이용할 수 있는 엑사원 챗을 그룹사에 구축하고 있다. 이번 프로젝트를 통해 엑사원 모델의 성능이 개선되고 신뢰도가 상승할 경우, 동사 AI 솔루션에 대한 수요가 증가할 것 가능성이 있다\"며 \"특히 공공 프로젝트 수주에도 유리할 것으로 예상, 동사 AI 플랫폼을 사용하는 고객사는 글로벌 기업들의 성능에 가까워진 엑사원을 무료로 사용할 수 있어 가격 측면에서도 소구점이 있다\"고 전했다.\n\n실적 기대도 주가를 지지하는 요인으로 거론된다. 증권정보업체 에프앤가이드가 집계한 LG CNS의 2025년 연간 실적 컨센서스는 매출 6조3291억원, 영업이익 5548억원으로, 2024년에 이어 역대급 실적 기록 경신이 기대된다. 다만 실적 발표를 하루 앞둔 이날 주가는 차익 실현 매물 영향으로 전일 대비 2.71% 내린 7만1700원에 거래를 마쳤다.LG CNS는 이미 지난해 3분기 누적 기준 실적으로 매출 4조1939억원, 영업이익 3399억원을 기록하며 역대 최대치를 기록을 갈아치운 바 있다. 전체 매출의 50% 이상을 차지하는 핵심 사업인 클라우드와 AI 사업에서 이 성장을 견인한 덕분이다.\n\n최승호 DS투자증권 연구원은 \"지난해 4분기 실적은 매출액 2.1조원, 영업이익 2134억원으로 컨센서스에 부합할 것으로 예상, 전분기 이연되었던 수주가 반영되면서 영업마진이 10.2%로 최근 분기 중 가장 높은 수준을 기록할 전망\"이라며 \"매출을 세부적으로 보면 데이터센터 설계·구축·운영은 4246억원(전년 동기 10% 성장)로 호조를 예상, 주요 수주 개발단계에 착수해 매출 성장세 가속화될 것\"이라고 전했다. LG CNS는 작년 하반기 들어 AI 데이터센터(DC) 사업의 국내외 확장과 데이터센터 설계·구축·운영 역량 고도화에 집중하는 동시에, 에이전틱 AI를 중심으로 금융·공공 분야 AX 프로젝트 수주를 늘리는 전략을 이어왔다. 아울러 '피지컬 AI(로봇)' 등 신규 사업의 개념증명(PoC)를 확대하며 중장기 성장 동력을 확보하는 데 힘을 실어왔다.\n\n아울러 LG CNS는 제약·바이오 분야로도 사업 영역을 빠르게 확장 중이다. 최근 차바이오텍에 100억원 규모의 지분 투자를 단행했으며, 종근당의 품질관리 보고서 자동화 시스템을 구축해 문서 생성 시간을 90% 이상 단축하는 성과를 냈다. 특히 한국은행과의 디지털화폐 실증은 단순한 기술 확인을 넘어 '머신 이코노미(Machine Economy)' 선점의 발판이 될 것이라는 평가가 나온다.\n\n김준섭 KB증권 연구원은 \"실증 내용은 예금 토큰(은행 예금을 디지털화한 토큰 형태의 화폐)이 유통되는 디지털 화폐플랫폼을 활용해 AI가 상거래 전 과정을 자율적으로 수행하는 차세대 결제인프라를 구현하는 것으로, 해당 결과로 자율주행차가 스스로 충전비를 결제하거나, 스마트 냉장고가 식재료를 주문하는 등 스마트계약 시장의 급성장이 가능하다\"고 전했다.증권가에서는 LG CNS가 올해 매출 성장과 함께, 영업이익 6000억원을 돌파하는 성과를 낼 것으로 기대하고 있다. KB증권의 경우, LG CNS의 영업이익이 향후 5년간 연평균 13%의 고성장을 지속할 것으로 추정했다. 올해부터 인도네시아와 베트남 등 글로벌 AI 데이터센터 수주 건이 본격적으로 매출에 반영되는 동시에, 현재 10여 개 고객사에서 PoC 중인 피지컬 AI(로봇) 사업이 상용화 단계에 진입하며 새로운 성장 축 역할을 할 것이라는 게 이유다.\n\n실제로 현신균 LG CNS 대표는 올해 신년사에서 클라우드와 AI를 축으로 한 기존 사업 경쟁력을 고도화하는 동시에, 데이터센터와 플랫폼형 사업을 통해 중장기 성장 기반을 다지겠다는 방향성을 제시했다.현 대표는 \"에이전틱 AI를 넘어 피지컬 AI 시대로 전환되는 시장 환경에서 미래 경쟁을 주도할 '위닝 테크놀로지'를 선제적으로 확보해야 한다\"며 \"핵심 기반 기술을 적시에 내재화하고 기술 경험과 산업 전문성을 바탕으로 고객 요구에 신속하게 대응해 LG CNS가 대체 불가능한 AX와 RX 파트너로 자리매김해야 한다\"고 강조한 바 있다. dconnect@newspim.com\n\n'여야, 대미투자특별법 특위 구성…\"3월 초까지 처리 목표\"\n\n양도세 중과 유예 종료 임박...강남3구 아파트 매물 증가\n\nS&P 500 기업 중 기사 내용이 영향을 줄 종목 추적\n\n조희대 \"한덕수 전 총리와 李공직선거법 사건 논의한 바 없어\"\n\n[스팟Live] 계엄에 대한 입장 묻자…장동혁 \"할 상황 아니었다\" | 26.01.02 국민의힘 장동혁 당대표, 현안 관련 기자간담회 하이라이트"
    },
    {
        "title": "Global week ahead: Hopes that cooler heads can prevail in Davos",
        "url": "https://www.cnbc.com/2026/01/18/trump-davos.html",
        "source": "CNBC",
        "date": "2026-01-18T07:37:00+00:00",
        "content": "I have been going to the World Economic Forum since 2009, when I was a young news assistant on \"Squawk Box Europe\" and had no idea what I was getting into.\n\nBack then, and still now, it is CNBC International's biggest outside broadcast of the year, and it's still thrilling to attend.\n\nThe heady combination of world leaders, the most powerful players in business and a splash of celebrity — all navigating the snowy streets of Alpine ski resort Davos — makes for a unique experience.\n\nOver the years, I have seen many versions of Davos: the fall-out from the Great Financial Crisis and European debt crunch; the trading scandal that rocked French banking giant Societe Generale; the surge of the Arab Spring; the rise and fall of Russia; the spread of the Covid-19 epidemic and now the upending of the world order that has been in place since the end of the Second World War.\n\nEveryone has an opinion about this meeting, but one thing is true — it is never dull. And 2026 will certainly be no different.\n\nThe tension between countries that call themselves allies is palpable going into this meeting.\n\nU.S. President Donald Trump has started 2026 by shocking the international community with a series of actions that challenge sovereignty and alliances that have been in place for decades.\n\nHis latest threat to impose fresh tariffs on European countries for not supporting his advances on Greenland has drawn sharp criticism from Brussels to Paris, and from Copenhagen and Nuuk. The move will sharpen what was already set to be a tense week in Davos as he will cross paths with European leaders in the hallways of the Congress Centre.\n\nHe will speak at the Forum on Wednesday, as the global community struggles to assess the impact of his action in Venezuela, his hardline stance towards Iran and slow progress toward a peace deal for Ukraine.\n\nThe World Economic Forum designated this year as \"The Spirit of Dialogue,\" but the organization itself has warned in its latest Global Risk Report that \"rules and institutions that have long underpinned stability are under siege in a new era in which trade, finance and technology are wielded as weapons of influence.\"\n\nAhead of Trump's speech, we will hear from a number of other world leaders on the first full day of the Forum.\n\nThis includes European Commission President Ursula von der Leyen, French President Emmanuel Macron and Canadian Prime Minister Mark Carney. It is likely that all three will urge the importance of the role of NATO as it faces the most significant challenge since it's inception.\n\nPresident Trump's threats of military force in Greenland have put what was previously inconceivable — the end of the NATO alliance — on the table. Reports suggest the G7 could convene on the side-lines of the event, ostensibly to progress a peace deal between Russia and Ukraine, but the tensions with NATO will inevitably be debated.\n\nTuesday will also see Chinese Vice-Premier He Lifeng speak, as a tentative trade truce seems to be holding with Washington D.C, despite recent data showing China recording the world's largest ever trade surplus for 2025, topping $1 trillion. Corporate leaders with significant interests in China, like Nvidia boss Jensen Huang, will also speak at the Forum as they look to navigate an increasingly political business landscape.\n\nOutside of geopolitics, the debate over the independence of central banks is set to heat up the frosty peaks of Davos. Central bankers across the globe were outraged by the announcement of the Department of Justice launching a criminal probe into Federal Reserve Bank Chair Jerome Powell.\n\nIn a statement, Powell said the probe \"is about whether the Fed will be able to continue to set interest rates... or whether monetary policy will be directed by political pressure or intimidation.\"\n\nHis peers from across the globe issued an astonishing letter of support, including signatures from ECB President Christine Lagarde and Bank of England Governor Andrew Bailey, alongside others. Former ECB boss, Jean-Claude Trichet told Squawk Box Europe that markets were not taking the threat seriously enough, calling the situation \"extremely grave.\"\n\nIf I had told my 20-something year old self back in 2009 that in 2026 these would be the big debates for Davos, I'm sure I would not have believed it.\n\nToday, the influence of the G20 and G7 have been tested, making the World Economic Forum an even rarer occasion for face-to-face diplomacy. As someone who values diplomacy in all aspects of my life — at work, at home, in the content I consume and the people I am influenced by — I hope that cooler heads can prevail in the Alps.\n\nTuesday: European Commission President Ursula von der Leyen; Chinese Vice-Premier He Lifeng, French President Emmanuel Macron\n\nWednesday: U.S. President Donald Trump\n\nThursday: Israeli President Isaac Herzog; German Chancellor Friedrich Merz"
    }
]