[
    {
        "title": "Stock market today: Dow, S&P 500, Nasdaq end higher in volatile trading day as Apple jumps",
        "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-end-higher-in-volatile-trading-day-as-apple-jumps-210119999.html",
        "source": "Yahoo Finance",
        "date": "2026-02-17T21:12:00+00:00",
        "content": "US stocks edged higher Tuesday in volatile trading as Wall Street continued assessing the AI jitters that have hammered markets in recent weeks.\n\nThe tech-heavy Nasdaq Composite (^IXIC) flipped into the green to end 0.1% higher, recovering from steep losses early in the session. The S&P 500 (^GSPC) rose just above the flatline. The Dow Jones Industrial Average (^DJI) was little changed.\n\nApple (AAPL) shares gained more than 3% over optimism that the iPhone maker is ramping up development of wearable devices with AI capabilities.\n\nAfter a break for Presidents Day, AI concerns continued to simmer. Investors are on the lookout for the next potential victim after fresh worries about AI's ability to upend industries hit stocks in sectors from wealth management to transportation to logistics. The Dow and S&P 500 have fallen in four of the past five weeks amid that pressure.\n\nThis week, earnings season enters its final stretch. The week's highlight is Walmart's (WMT) quarterly report on Thursday, the first since the retail giant joined the trillion-dollar market cap club.\n\nElsewhere in corporates, Paramount Skydance (PSKY) stock rose over 5% on Tuesday following the news that Warner Bros. Discovery (WBD) has given the studio one week to come back with a better offer. Warner Bros. rejected the latest bid from the Hollywood studio.\n\nStocks went from negative to positive territory on Tuesday with the three major averages closing just above the flatline.\n\nThe tech-heavy Nasdaq Composite (^IXIC) rose 0.1%, while the S&P 500 (^GSPC) rose 0.1%. The blue-chip-heavy Dow Jones Industrial Average (^DJI) closed slightly higher.\n\nApple (AAPL) shares gained more than 3% after a Bloomberg report indicated the tech giant is ramping up development of three wearable devices with AI capabilities, including glasses, a pendant, and AirPods.\n\nFinancial (XLF) stocks gained while some software players continued their decline over fears that AI will disrupt the industry.\n\nGE Aerospace (GE) is dragging aerospace & defense higher today, up over 3% heading into the close.\n\nOther winners include Raytheon (RTX), Honeywell (HON), Parker-Hannifin (PH), and Wabtec (WAB).\n\nStill, it’s not a sea of green for a group that’s been a bastion of strength since the post–\"Liberation Day\" lows last April. General Dynamics (GD), Lockheed Martin (LMT), and Teledyne (TDY) are slightly in the red.\n\nGE’s the standout story either way. After spinning off GE Vernova (GEV), the stock has pushed back above its old 2000 peak — a long way from the two lost decades in between. It’s up more than 10x from the 2020 lows and back within spitting distance of the Jan. 6 all-time high.\n\nThe Dow Jones Transportation Index (^DJT) rallied Tuesday into key technical resistance above 19,500. That’s the 61.8% Fibonacci retracement from the Feb. 6 all-time closing high to the Feb. 12 closing low — and it’s the line in the sand for bears to defend.\n\nTransportation and logistics stocks like RXO Inc. (RXO) and C.H. Robinson Worldwide (CHRW) were among last week’s biggest losers, as the “AI scare trade” morphed from a software-only problem into a sledgehammer that hit anything tied to efficiency, labor, and fee pressure — including asset managers and insurance brokers. Now they’re bouncing hard, with RXO at the top of the transport tape.\n\nAirlines weren’t in the AI crosshairs, but they still got swept up in the industry sell-off. The spark was a paper from microcap Algorythm Holdings (RIME) on using AI in transportation logistics, which set off nerves in an index that had already notched 10 record closes in 2026.\n\nToday, Southwest (LUV) is leading the airlines bounce — up near 7% — with United (UAL), American (AAL), and Alaska (ALK) in tow, each up more than 3%.\n\nMeanwhile, RIME is down 17% after opening at a one-year high.\n\nFor the Dow Transports: holding above 19,500, bulls take control. Rejected, 19,000 is the downside target.\n\nApple (AAPL) shares gained more than 3% on Tuesday after a Bloomberg report indicated the tech giant is ramping up development of three new wearable devices with AI capabilities, including glasses, a pendant, and AirPods.\n\nThe devices are all built around Apple’s Siri digital assistant, according to the report.\n\nThe iPhone maker is competing with Meta (META), which is developing smart glasses, and OpenAI, which is exploring wearable devices.\n\nApple shares also gained following a bullish note from Wedbush Securities analyst Dan Ives, who brushed off a recent decline in Apple shares amid a broader tech sell-off.\n\n\"This recent worry and sell-off in Apple Inc.’s shares is unwarranted, as the focus is on Apple getting its AI strategy right and releasing its advanced AI features by the summer timeframe, which still appears to be on track,\" wrote Ives.\n\nWedbush maintained an Outperform rating and a $350 price target.\n\nGold (GC=F) retreated more than 2% on Tuesday, but the recent volatility may be temporary as Wall Street analysts see a bullish outlook for the precious metal in 202\n\nGold futures hovered around $4,900 as Asian markets closed for the Chinese New Year. Meanwhile, Iran and the US reached a “general agreement” on a possible nuclear deal, easing tensions in the Middle East.\n\n\"Despite short-term softness, the structural drivers supporting gold remain firmly in place,\" Ole Hansen, head of commodity strategy at Saxo Bank, wrote in a newsletter.\n\nThe strategist highlighted central bank buying, geopolitical fragmentation, and portfolio diversification as key factors driving gold’s safe-haven appeal amid concerns over currency debasement.\n\nPalantir (PLTR) has moved its headquarters to Miami from Denver, joining a growing list of firms through the financial and tech sectors to decamp for the growing \"Wall Street South.\"\n\nThe company announced the move in an X post on Tuesday. Shares picked up roughly 0.5% in midday trading.\n\nIn moving its headquarters to Miami, Palantir follows a large list of companies looking to Florida for lower taxes and a lighter business regulation scheme. Among those are Citadel, one of the largest hedge funds in the world, led by Ken Griffin, and Related Companies, the real estate investment firm led by Stephen Ross.\n\nGriffin and Ross, both billionaires, recently launched a $10 million campaign aimed at convincing more corporate leaders to relocate their firms to Miami. Peter Thiel, the chairman of Palantir, also recently opened an office for his private investment firm in Miami, according to Bloomberg.\n\nAfter Ford's first release of electric vehicles, the automaker faced demand below expectations — and a massive bill of roughly $19.5 billion in write-offs. With its latest EV plan, the company is pivoting to a \"universal electric vehicle (UEV) platform\" designed to lower manufacturing costs.\n\nShares in renewable power provider Ormat Technologies (ORA) surged Tuesday morning, gaining more than 5% on the announcement of a deal that will see Ormat provide geothermal energy for Google (GOOG) data center projects.\n\nUnder the terms of the deal, Ormat will develop several geothermal power projects throughout Nevada that the company said provide Google with around 150 megawatts of power for the Big Tech hyperscaler's data center projects in the region.\n\nThe sites are expected to come online between 2028 and 2030, Ormat said in its press release announcing the deal. The Purchase Power Agreement underpinning the project is subject to approval from the Public Utilities Commission of Nevada (PUCN), expected in the second half 20206, Ormat said.\n\n“AI is fundamentally increasing electricity demand across the technology sector, and geothermal power is uniquely positioned to deliver the reliable, carbon-free power required to support that growth,” Doron Blachar, Chief Executive Officer of Ormat Technologies, said in the press release.\n\nOil prices fell Tuesday after Iran announced it had reached a \"general agreement\" with the US on a potential nuclear deal that would lift some sanctions on the Iranian regime.\n\nFutures on Brent crude (BZ=F), the international pricing benchmark, fell by 0.6% to trade below $67.50. Those on the US pricing benchmark West Texas Intermediate (WTI) crude (CL=F), lost 0.9% to change hands around $62.25.\n\nIn comments to state TV, Iranian foreign minister Abbas Araghchi said, “We were able to reach a general agreement on a set of guiding principles, based on which we will proceed from now on and move toward drafting a potential agreement.\"\n\nIran's leadership has spent the past month in talks with US Special Envoy Steve Witkoff. The news is seen as lowering the risk of a military conflict between the two countries, which would apply an immediate risk premium to oil prices.\n\nIran largely controls the Strait of Hormuz, a key shipping chokepoint that sees roughly 20 million barrels of oil traverse its waters every day. Any moves to restrict access to the strait, or attacks against infrastructure in the region, would push oil prices much higher as buyers priced in longer and slower shipping routes and a drop-off in Middle Eastern supply.\n\nEarlier on Tuesday, Iranian leadership said Tehran would partially close the strait for several hours due to military drills, according to Bloomberg. The move comes as the US has steadily built up its naval armament in the region, sending a second aircraft carrier to the region late last week. The US Maritime Authority advised ship captains in early February to avoid Iran's territorial waters if possible, for fear of potential interference or forcible boardings.\n\nYet despite seeming progress toward a deal the X account for the Ayatollah Ali Khamenei, Iran's supreme leader, posted several comments disparaging US involvement in Iran's energy industry.\n\n\"The Americans say, ‘Let's negotiate over your nuclear energy, and the result of the negotiation is supposed to be that you do not have this energy!'\" the X account posted early Tuesday morning.\n\n\"If that’s the case, there is no room for negotiation; but if negotiations are truly to take place, determining the outcome of the negotiations in advance is a wrong and foolish act.\"\n\nCorporate profits are rising while labor income keeps falling, a sign that so-called \"K-shaped\" movements in the economy are continuing, analysts for Bank of America wrote on Tuesday.\n\nSince the COVID-19 pandemic, the analysts wrote, an increasing amount of economic data has pointed toward an uptick in productivity. However, the economic gains from that productivity seem to be aggregating in corporate profits, while wages steadily fall.\n\nThis split between profits and income is consistent and being reinforced by the rally in financial as well as real assets, which are more concentrated among higher- and middle-income households,\" the analysts wrote. The dichotomy in the data also \"begs the question of whether these are real improvements in labor productivity.\n\n\"It remains to be seen whether wages and salaries recoup some of their lost ground relative to corporate profits,\" the analysts wrote. \"But for now, higher profits relative to wages are yet another driver of a K-shaped economy, as higher-income consumers tend to be more exposed.\"\n\nUS stocks opened Tuesday's session split, as the tech sector continued its downturn in a sign that investor concerns about AI disruption aren't yet settling.\n\nThe tech-heavy Nasdaq Composite (^IXIC) led losses, shedding roughly 0.5%, while the S&P 500 (^GSPC) lost a thinner 0.2%. Meanwhile, the blue-chip-heavy Dow Jones Industrial Average (^DJI), which is less exposed to the tech sector, rose roughly 0.3% before paring gains.\n\nFourth-quarter results from Walmart (WMT), a recent member of the the trillion-dollar market cap club, on Thursday will highlight the week's earnings calendar. Constellation Energy (CEG), Energy Transfer (ET), Medtronic (MDT), and Palo Alto Networks (PANW) will also report this week, all on Tuesday.\n\nThe Personal Consumption Expenditures index and an advance read on fourth-quarter GDP, both on Friday, will dominate investor attention on the economic calendar. Investors will also get meetings from the Federal Reserve's January meeting on Wednesday.\n\nShares in consumer food giant General Mills (GIS) fell by more than 3.3% in premarket trading after the company lowered its 2026 sales outlook. \"Weak consumer sentiment, heightened uncertainty, and significant volatility have weighed on category growth and impacted consumer purchase patterns\" contributed to the dour outlook, the company said.\n\nGeneral Mills is now projecting organic net sales of -1.5% to -2%, down from a previous range of -1% to 1%. Adjusted operating profit and adjusted diluted earnings per share are now expected at a range of -16% to -20%, down from a previously stated range of -10% to -15%.\n\n\"While the company is making meaningful progress in strengthening its remarkability to position the business for long-term sustainable growth, this progress has come amid a more challenging backdrop,\" General Mills said in its statement.\n\nWhile General Mills has managed to return roughly 4% since the beginning of the year, the company's shares are down more than 18% over the past year. Meanwhile, an index tracking the consumer staples sector (XLP) has returned 15% year to date and roughly 10% since the same time last year.\n\nParamount Skydance (PSKY) stock is moving higher after Warner Bros. (WBD) agreed to reopen acquisition discussions.\n\nThe move comes after Paramount proposed a new all-cash offer last week of $30 per share to acquire the entire company. That offer came with a $ 0.25-per-share \"ticking fee\" — under which Warner Bros.' shareholders would receive $0.25 per share each quarter until the transaction is not closed beyond the end of this year.\n\nParamount also floated an informal acquisition proposal for $31 a share, WBD said.\n\nThe new window for discussions will last seven days, ending on Feb. 23, 2026, \"to seek clarity for Warner Bros. stockholders and provide Paramount the ability to make its best and final offer.\"\n\nIn the release, Warner Bros. Chair Samuel A. Di Piazza said the board of directors said it still suggests the Netflix offer, worth some $82.7 billion, which does not include the entire business.\n\n\"The Netflix merger is in the best interests of WBD shareholders due to the tremendous value it provides\" with a \"clear path to achieve regulatory approval,\" he said in the release.\n\nParamount's current offer of $30 per share values the whole company at $108.4 billion.\n\nNetflix’s co-CEO Ted Sarandos testified before the Senate Judiciary Subcommittee last week, negating claims that it would lead to a monopoly, or higher prices for consumers.\n\nYahoo Finance's Jake Conley lays out the key events ahead for investors in a holiday-shortened week.\n\nRead more here on what to look out for.\n\nDTE Energy (DTE) stock rose as much as 10% before paring gains. The energy company is due to release its earnings before the bell today, and the stock has risen 13% over the past year.\n\nNorwegian Cruise Line (NCLH) stock rose 7% during premarket trading on Tuesday after activist investor Elliott built a stake in the company.\n\nStrategy (MSTR) stock fell 3% before the bell today. The company, which is one of the largest corporate holders of bitcoin, has been struggling recently due to the sell-off with the world's largest cryptocurrency.\n\nA growing number on Wall Street are assessing the recent AI sell-offs. And despite many fearing the bubble has burst, for stock pickers, now might be the time for them to get greedy.\n\nGermany's Hapag-Lloyd (HLAG.DE, HPGLY) is buying ZIM Integrated Shipping Services in a deal worth $4.2 billion, bringing together two of the world's biggest shipping lines.\n\nShares of Israel-based ZIM rocketed over 35% higher in premarket trading, after the two companies confirmed the takeover on Monday.\n\nThe Wall Street Journal reports:\n\nNothing like a BofA fund manager survey drop the day after a market holiday.\n\nLots of great nuggets in the one out this morning, but the chart below stood out to me. So many on the Street I talk with expect a very robust economy this spring, in part because of expectations for a strong tax refund season.\n\nGoes a long way in explaining the hot small-caps trade.\n\nMasimo (MASI) stock surged over 30% in premarket following a report that Danaher (DHR) is closing in on a deal to buy the medical technology company.\n\nThe deal moves come two years after activist investor Politan succeeded in pushing through a change in Masimo's board.\n\nIt would be the biggest acquisition by Danaher in over half a decade, the Financial Times reported. Shares of the US life sciences manufacturer fell over 5% before the bell.\n\nRead more here (premium subscribers)\n\nNorwegian Cruise Line (NCLH) stock rose 6% before the bell on Tuesday following a report from The Wall Street Journal that activist investor Elliott has built a 10% stake in the company and plans to push for changes.\n\nElliott has become one of the cruise line's top investors and is keen to fix the company's underperformance. Elliott has so far built stakes in Southwest Airlines (LUV), as well as oil refiner Phillips 66 (PSX) and Toyota Industries (TYIDY). According to The Wall Street Journal, Elliott has over $79 billion in assets under management and is concerned about Norwegian Cruise Line's financial performance."
    },
    {
        "title": "Apple (AAPL) Trading 10% Below Analyst Targets After This Week's 8% Drop",
        "url": "https://247wallst.com/investing/2026/02/16/apple-aapl-trading-14-2-below-analyst-targets-after-this-weeks-8-drop/",
        "source": "24/7 Wall St.",
        "date": "2026-02-16T23:13:00+00:00",
        "content": "Apple (AAPL) fell 7.95% in a week to $255.78 despite record iPhone sales of $85.27B and $143.76B revenue.\n\nApple faces doubled NAND flash costs starting Q1 2026 and delays in Apple Intelligence 2.0 past March.\n\n29 of 47 analysts maintain Buy ratings with average target of $292.15 despite the selloff.\n\nSending You to Google News in 3\n\n© Photo by Drew Angerer / Getty Images\n\nApple (NASDAQ: AAPL | AAPL Price Prediction) closed at $255.78 on February 13, down 7.95% from the previous week’s $277.86. Yet Wall Street analysts still see the stock climbing to an average target of $292.15, implying 10% upside from current levels. That disconnect raises a question: is the market pricing in risks analysts are missing, or did the selloff create an entry point?\n\nThe drop came despite Apple reporting a blowout quarter in late January. Revenue hit $143.76 billion, beating estimates, while iPhone sales reached an all-time quarterly high of $85.27 billion. The company returned nearly $32 billion to shareholders and saw its installed base surpass 2.5 billion active devices. Yet the stock has struggled in the weeks since, falling 5.83% year to date while the S&P 500 has remained essentially flat at negative 0.02%.\n\nThe decline accelerated in mid-February as specific concerns emerged. Apple agreed to contract terms with Kioxia that will see NAND flash memory prices double starting in Q1 2026, with quarterly repricing thereafter. That signals ongoing component cost inflation even as the company locks in short-term supply.\n\nMore troubling for investors betting on an AI-driven growth cycle, Evercore ISI reported anticipated delays in the Apple Intelligence 2.0 launch, potentially pushing the release past March. The firm cited testing headwinds and Apple’s privacy-first approach as reasons for the multi-phase rollout, with a complete Siri overhaul not expected until fall 2026. Regulatory scrutiny also intensified, with the FTC raising concerns about alleged political bias in Apple News while antitrust litigation continues.\n\nTechnical indicators confirm the severity of the move. The Relative Strength Index dropped to 39.59 as of February 13, down from 69.03 on February 6. That 29-point swing in seven days pushed the stock into oversold territory, a level historically associated with near-term bounces.\n\nDespite the selloff, 29 of 47 analysts covering Apple maintain Buy or Strong Buy ratings. Evercore kept its Outperform rating with a $330 price target even after flagging the AI delays. The firm argued that Apple’s privacy focus and seamless integration justify the slower rollout.\n\nThe bull case centers on durable growth drivers that extend beyond quarterly noise. The iPhone 17 cycle continues to show strength, with 23% year-over-year growth in the most recent quarter. Services reached a record $30.01 billion, up 14% year over year, providing high-margin recurring revenue. Apple’s partnership with Google on AI features reduces R&D burden while maintaining ecosystem control. The company is also expanding into streaming content, recently acquiring rights to Severance for approximately $70 million as it works to make Apple TV+ profitable.\n\nJim Cramer called Apple “the greatest free rider in history” for its Google AI partnership, arguing the company gains cutting-edge capabilities without the massive capital expenditure rivals face. That strategic positioning matters as Nvidia and Microsoft pour billions into AI infrastructure.\n\nThe data shows Apple underperforming the broader market by nearly 6 percentage points year to date, with the gap widening sharply in recent weeks. Yet analyst conviction remains strong, with 62% of coverage at Buy or better. The disconnect suggests either the market is ahead of Wall Street in pricing execution risks, or short-term concerns are masking a compelling setup.\n\nInvestors are monitoring whether Apple can execute on AI features without further delays and manage component cost inflation without margin compression. The fundamental story remains intact: record iPhone demand, expanding services revenue, and a capital-light AI strategy that avoids the massive spending competitors face. Trading at 32 times trailing earnings with 27% profit margins and $42.10 billion in quarterly net income, the valuation reflects expectations for continued execution.\n\nThe technical setup also suggests potential for a near-term bounce. Previous oversold readings in January recovered within two weeks, and the current RSI of 39.59 suggests capitulation selling. If Apple delivers on the delayed AI features by summer and component costs stabilize, the path back to $292 analyst targets becomes more achievable.\n\nKey risks include AI delays extending beyond fall or margin pressure intensifying. The doubled NAND pricing signals that component inflation hasn’t peaked. If Apple Intelligence 2.0 slips further or adoption disappoints when it does launch, the premium valuation becomes harder to justify. Competitive pressure from Nvidia and Microsoft in AI, combined with regulatory headwinds, could keep the stock range-bound even as fundamentals hold up.\n\nThe risk-reward calculation depends on execution. Retail sentiment turned bearish during the decline, with Reddit activity showing sentiment scores between 25 and 42 through mid-February, well into bearish territory. That contrarian indicator, combined with oversold technicals and analyst conviction, suggests the selloff may have been overdone. But the company needs to prove it can deliver on AI promises and protect margins, or the 9% gap to analyst targets could widen rather than close.\n\nOur top personal finance-related articles today. Your wallet will thank you later.\n\nSuper Micro Computer (Nasdaq: SMCI | SMCI Price Prediction) is trading at $30.54, down 11.2% over the past week. Yet…\n\nCisco Systems (NASDAQ: CSCO) has dropped 9.4% over the past week. That’s seven times worse than the S&P 500’s 1.28%…\n\nAstera Labs (Nasdaq: ALAB) closed at $129.32 on February 13, 2026, down 23.86% over the past week. Wall Street’s average…\n\nUpstart Holdings (NASDAQ: UPST) has dropped 19.77% over the past week, falling from $38.24 to $30.68 as of February 13.…\n\nApple may have some concerns building around just how many new iPhones it really will be selling in the near…\n\nApple has recovered handily from its March lows as the market recovery has been strong. That said, Apple is running…\n\nTuesday morning brings five major stories, and five ways to profit. Here’s what happened and how you make money from…\n\nThe post-earnings rise in Apple's shares was the push that allowed the Dow to hit 22,000 for the first time…\n\nIt hasn’t gone unnoticed by the broader market that Shares of Qualcomm (NASDAQ:QCOM) fell sharply in early February, coinciding with…"
    },
    {
        "title": "AMD Stock: Why This Analyst Remains Skeptical of AI Strategy",
        "url": "https://blockonomi.com/amd-stock-why-this-analyst-remains-skeptical-of-ai-strategy/",
        "source": "Blockonomi",
        "date": "2026-02-17T13:48:00+00:00",
        "content": "Advanced Micro Devices stock dropped 12% following its February 3 earnings release despite posting solid fourth-quarter 2025 numbers. The disconnect between results and market reaction highlights investor concerns about the company’s ability to capture meaningful AI market share.\n\nAdvanced Micro Devices, Inc., AMD\n\nData center revenue reached $5.4 billion in Q4, representing 39% growth from the prior year. Instinct MI350 Series GPUs and Epyc CPU deployments drove the increase, with eight of the top ten AI companies now using AMD’s Instinct accelerators.\n\nThe company is pivoting from selling individual chips to complete infrastructure solutions. Its Helios rack-scale platform combines CPUs, GPUs, networking hardware, and software into turnkey AI systems centered on MI450 accelerators.\n\nAMD expects MI450 revenue to start in the third quarter of 2026 with volume ramping in Q4. The majority of shipments will be full Helios systems rather than standalone chips.\n\nOpenAI has committed to a multi-year, multi-generation partnership deploying up to 6 gigawatts of Instinct GPUs beginning with MI450 in the second half of 2026. Management indicated other customers are in discussions for similar large-scale commitments.\n\nThe Epyc CPU business achieved record quarterly sales powered by fifth-generation Turin and fourth-generation Genoa processors. Despite typical first-quarter seasonality, management projects sequential CPU revenue growth into Q1 2026.\n\nCPUs are handling more AI workload responsibilities including orchestration, memory management, and data preprocessing. Cloud providers and enterprises are building out infrastructure to support AI applications, creating sustained Epyc demand.\n\nD.A. Davidson’s Gil Luria initiated coverage with a Neutral rating and $220 price target, expressing skepticism about AMD’s competitive position. Luria acknowledged strong single-node GPU specifications but questioned performance at scale across tens of thousands of chips.\n\nThe analyst suggested OpenAI ranks AMD behind Nvidia and potentially behind Broadcom ASICs and other alternatives. This positioning reflects real-world deployment challenges beyond paper specifications.\n\nROCm software platform improvements continue but face steep competition from Nvidia’s CUDA ecosystem. CUDA enjoys nearly two decades of developer tools, libraries, and familiarity that make it the default choice for AI development.\n\nLuria identified a concerning dynamic where lower Instinct volumes result in reduced TSMC manufacturing priority compared to Nvidia, Apple, and hyperscaler programs. This creates supply uncertainty for buyers and limits ROCm development feedback, creating what the analyst calls a “negative flywheel.”\n\nThe broader analyst community maintains a more optimistic stance with 24 Buy ratings against 8 Hold ratings. The Moderate Buy consensus carries an average price target of $286.80, suggesting 38% upside from current levels.\n\nAMD shares closed at $207.19 on February 13, 2026. The company holds a market capitalization of $338 billion.\n\nDiscover top-performing stocks in AI, Crypto, and Technology with expert analysis.\n\n📈 Futures & Crypto Trader 🔍 Sharing charts, strategies, & mindset tips to help you level up 🚨 Not Financial Advice Follow on X @Pro_Trader_Edge\n\nType above and press Enter to search. Press Esc to cancel.\n\nZunaBet New Crypto Casino: 250% Bonus & 75 Free Casino Spins, Claim!"
    },
    {
        "title": "Why Vulcan Materials (VMC) Shares Are Trading Lower Today",
        "url": "https://uk.finance.yahoo.com/news/why-vulcan-materials-vmc-shares-190049570.html",
        "source": "Yahoo Finance UK",
        "date": "2026-02-17T19:00:00+00:00",
        "content": "Your privacy is important to us\n\nYahoo is part of the Yahoo family of brandsThe sites and apps that we own and operate, including Yahoo and Engadget, and our digital advertising service, Yahoo Advertising.Yahoo family of brands.\n\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\n\nIf you would like to customise your choices, click 'Manage privacy settings'.\n\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy and Cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
    },
    {
        "title": "Stock market today: Dow, S&P 500, Nasdaq turn higher in volatile trading as Wall Street assesses AI fears",
        "url": "https://uk.finance.yahoo.com/news/stock-market-today-dow-sp-500-nasdaq-turn-higher-in-volatile-trading-as-wall-street-assesses-ai-fears-143417857.html",
        "source": "Yahoo Finance UK",
        "date": "2026-02-17T20:00:00+00:00",
        "content": "US stocks edged higher Tuesday in volatile trading as Wall Street continued assessing the AI jitters that have hammered markets in recent weeks.\n\nThe tech-heavy Nasdaq Composite (^IXIC) flipped into the green to end 0.1% higher, recovering from steep losses early in the session. The S&P 500 (^GSPC) rose just above the flatline. The Dow Jones Industrial Average (^DJI) was little changed.\n\nApple (AAPL) shares gained more than 3% over optimism that the iPhone maker is ramping up development of wearable devices with AI capabilities.\n\nAfter a break for Presidents Day, AI concerns continued to simmer. Investors are on the lookout for the next potential victim after fresh worries about AI's ability to upend industries hit stocks in sectors from wealth management to transportation to logistics. The Dow and S&P 500 have fallen in four of the past five weeks amid that pressure.\n\nThis week, earnings season enters its final stretch. The week's highlight is Walmart's (WMT) quarterly report on Thursday, the first since the retail giant joined the trillion-dollar market cap club.\n\nElsewhere in corporates, Paramount Skydance (PSKY) stock rose over 5% on Tuesday following the news that Warner Bros. Discovery (WBD) has given the studio one week to come back with a better offer. Warner Bros. rejected the latest bid from the Hollywood studio.\n\nStocks went from negative to positive territory on Tuesday with the three major averages closing just above the flatline.\n\nThe tech-heavy Nasdaq Composite (^IXIC) rose 0.1%, while the S&P 500 (^GSPC) rose 0.1%. The blue-chip-heavy Dow Jones Industrial Average (^DJI) closed slightly higher.\n\nApple (AAPL) shares gained more than 3% after a Bloomberg report indicated the tech giant is ramping up development of three wearable devices with AI capabilities, including glasses, a pendant, and AirPods.\n\nFinancial (XLF) stocks gained while some software players continued their decline over fears that AI will disrupt the industry.\n\nGE Aerospace (GE) is dragging aerospace & defense higher today, up over 3% heading into the close.\n\nOther winners include Raytheon (RTX), Honeywell (HON), Parker-Hannifin (PH), and Wabtec (WAB).\n\nStill, it’s not a sea of green for a group that’s been a bastion of strength since the post–\"Liberation Day\" lows last April. General Dynamics (GD), Lockheed Martin (LMT), and Teledyne (TDY) are slightly in the red.\n\nGE’s the standout story either way. After spinning off GE Vernova (GEV), the stock has pushed back above its old 2000 peak — a long way from the two lost decades in between. It’s up more than 10x from the 2020 lows and back within spitting distance of the Jan. 6 all-time high.\n\nThe Dow Jones Transportation Index (^DJT) rallied Tuesday into key technical resistance above 19,500. That’s the 61.8% Fibonacci retracement from the Feb. 6 all-time closing high to the Feb. 12 closing low — and it’s the line in the sand for bears to defend.\n\nTransportation and logistics stocks like RXO Inc. (RXO) and C.H. Robinson Worldwide (CHRW) were among last week’s biggest losers, as the “AI scare trade” morphed from a software-only problem into a sledgehammer that hit anything tied to efficiency, labor, and fee pressure — including asset managers and insurance brokers. Now they’re bouncing hard, with RXO at the top of the transport tape.\n\nAirlines weren’t in the AI crosshairs, but they still got swept up in the industry sell-off. The spark was a paper from microcap Algorythm Holdings (RIME) on using AI in transportation logistics, which set off nerves in an index that had already notched 10 record closes in 2026.\n\nToday, Southwest (LUV) is leading the airlines bounce — up near 7% — with United (UAL), American (AAL), and Alaska (ALK) in tow, each up more than 3%.\n\nMeanwhile, RIME is down 17% after opening at a one-year high.\n\nFor the Dow Transports: holding above 19,500, bulls take control. Rejected, 19,000 is the downside target.\n\nApple (AAPL) shares gained more than 3% on Tuesday after a Bloomberg report indicated the tech giant is ramping up development of three new wearable devices with AI capabilities, including glasses, a pendant, and AirPods.\n\nThe devices are all built around Apple’s Siri digital assistant, according to the report.\n\nThe iPhone maker is competing with Meta (META), which is developing smart glasses, and OpenAI, which is exploring wearable devices.\n\nApple shares also gained following a bullish note from Wedbush Securities analyst Dan Ives, who brushed off a recent decline in Apple shares amid a broader tech sell-off.\n\n\"This recent worry and sell-off in Apple Inc.’s shares is unwarranted, as the focus is on Apple getting its AI strategy right and releasing its advanced AI features by the summer timeframe, which still appears to be on track,\" wrote Ives.\n\nWedbush maintained an Outperform rating and a $350 price target.\n\nGold (GC=F) retreated more than 2% on Tuesday, but the recent volatility may be temporary as Wall Street analysts see a bullish outlook for the precious metal in 202\n\nGold futures hovered around $4,900 as Asian markets closed for the Chinese New Year. Meanwhile, Iran and the US reached a “general agreement” on a possible nuclear deal, easing tensions in the Middle East.\n\n\"Despite short-term softness, the structural drivers supporting gold remain firmly in place,\" Ole Hansen, head of commodity strategy at Saxo Bank, wrote in a newsletter.\n\nThe strategist highlighted central bank buying, geopolitical fragmentation, and portfolio diversification as key factors driving gold’s safe-haven appeal amid concerns over currency debasement.\n\nPalantir (PLTR) has moved its headquarters to Miami from Denver, joining a growing list of firms through the financial and tech sectors to decamp for the growing \"Wall Street South.\"\n\nThe company announced the move in an X post on Tuesday. Shares picked up roughly 0.5% in midday trading.\n\nIn moving its headquarters to Miami, Palantir follows a large list of companies looking to Florida for lower taxes and a lighter business regulation scheme. Among those are Citadel, one of the largest hedge funds in the world, led by Ken Griffin, and Related Companies, the real estate investment firm led by Stephen Ross.\n\nGriffin and Ross, both billionaires, recently launched a $10 million campaign aimed at convincing more corporate leaders to relocate their firms to Miami. Peter Thiel, the chairman of Palantir, also recently opened an office for his private investment firm in Miami, according to Bloomberg.\n\nAfter Ford's first release of electric vehicles, the automaker faced demand below expectations — and a massive bill of roughly $19.5 billion in write-offs. With its latest EV plan, the company is pivoting to a \"universal electric vehicle (UEV) platform\" designed to lower manufacturing costs.\n\nShares in renewable power provider Ormat Technologies (ORA) surged Tuesday morning, gaining more than 5% on the announcement of a deal that will see Ormat provide geothermal energy for Google (GOOG) data center projects.\n\nUnder the terms of the deal, Ormat will develop several geothermal power projects throughout Nevada that the company said provide Google with around 150 megawatts of power for the Big Tech hyperscaler's data center projects in the region.\n\nThe sites are expected to come online between 2028 and 2030, Ormat said in its press release announcing the deal. The Purchase Power Agreement underpinning the project is subject to approval from the Public Utilities Commission of Nevada (PUCN), expected in the second half 20206, Ormat said.\n\n“AI is fundamentally increasing electricity demand across the technology sector, and geothermal power is uniquely positioned to deliver the reliable, carbon-free power required to support that growth,” Doron Blachar, Chief Executive Officer of Ormat Technologies, said in the press release.\n\nOil prices fell Tuesday after Iran announced it had reached a \"general agreement\" with the US on a potential nuclear deal that would lift some sanctions on the Iranian regime.\n\nFutures on Brent crude (BZ=F), the international pricing benchmark, fell by 0.6% to trade below $67.50. Those on the US pricing benchmark West Texas Intermediate (WTI) crude (CL=F), lost 0.9% to change hands around $62.25.\n\nIn comments to state TV, Iranian foreign minister Abbas Araghchi said, “We were able to reach a general agreement on a set of guiding principles, based on which we will proceed from now on and move toward drafting a potential agreement.\"\n\nIran's leadership has spent the past month in talks with US Special Envoy Steve Witkoff. The news is seen as lowering the risk of a military conflict between the two countries, which would apply an immediate risk premium to oil prices.\n\nIran largely controls the Strait of Hormuz, a key shipping chokepoint that sees roughly 20 million barrels of oil traverse its waters every day. Any moves to restrict access to the strait, or attacks against infrastructure in the region, would push oil prices much higher as buyers priced in longer and slower shipping routes and a drop-off in Middle Eastern supply.\n\nEarlier on Tuesday, Iranian leadership said Tehran would partially close the strait for several hours due to military drills, according to Bloomberg. The move comes as the US has steadily built up its naval armament in the region, sending a second aircraft carrier to the region late last week. The US Maritime Authority advised ship captains in early February to avoid Iran's territorial waters if possible, for fear of potential interference or forcible boardings.\n\nYet despite seeming progress toward a deal the X account for the Ayatollah Ali Khamenei, Iran's supreme leader, posted several comments disparaging US involvement in Iran's energy industry.\n\n\"The Americans say, ‘Let's negotiate over your nuclear energy, and the result of the negotiation is supposed to be that you do not have this energy!'\" the X account posted early Tuesday morning.\n\n\"If that’s the case, there is no room for negotiation; but if negotiations are truly to take place, determining the outcome of the negotiations in advance is a wrong and foolish act.\"\n\nCorporate profits are rising while labor income keeps falling, a sign that so-called \"K-shaped\" movements in the economy are continuing, analysts for Bank of America wrote on Tuesday.\n\nSince the COVID-19 pandemic, the analysts wrote, an increasing amount of economic data has pointed toward an uptick in productivity. However, the economic gains from that productivity seem to be aggregating in corporate profits, while wages steadily fall.\n\nThis split between profits and income is consistent and being reinforced by the rally in financial as well as real assets, which are more concentrated among higher- and middle-income households,\" the analysts wrote. The dichotomy in the data also \"begs the question of whether these are real improvements in labor productivity.\n\n\"It remains to be seen whether wages and salaries recoup some of their lost ground relative to corporate profits,\" the analysts wrote. \"But for now, higher profits relative to wages are yet another driver of a K-shaped economy, as higher-income consumers tend to be more exposed.\"\n\nUS stocks opened Tuesday's session split, as the tech sector continued its downturn in a sign that investor concerns about AI disruption aren't yet settling.\n\nThe tech-heavy Nasdaq Composite (^IXIC) led losses, shedding roughly 0.5%, while the S&P 500 (^GSPC) lost a thinner 0.2%. Meanwhile, the blue-chip-heavy Dow Jones Industrial Average (^DJI), which is less exposed to the tech sector, rose roughly 0.3% before paring gains.\n\nFourth-quarter results from Walmart (WMT), a recent member of the the trillion-dollar market cap club, on Thursday will highlight the week's earnings calendar. Constellation Energy (CEG), Energy Transfer (ET), Medtronic (MDT), and Palo Alto Networks (PANW) will also report this week, all on Tuesday.\n\nThe Personal Consumption Expenditures index and an advance read on fourth-quarter GDP, both on Friday, will dominate investor attention on the economic calendar. Investors will also get meetings from the Federal Reserve's January meeting on Wednesday.\n\nShares in consumer food giant General Mills (GIS) fell by more than 3.3% in premarket trading after the company lowered its 2026 sales outlook. \"Weak consumer sentiment, heightened uncertainty, and significant volatility have weighed on category growth and impacted consumer purchase patterns\" contributed to the dour outlook, the company said.\n\nGeneral Mills is now projecting organic net sales of -1.5% to -2%, down from a previous range of -1% to 1%. Adjusted operating profit and adjusted diluted earnings per share are now expected at a range of -16% to -20%, down from a previously stated range of -10% to -15%.\n\n\"While the company is making meaningful progress in strengthening its remarkability to position the business for long-term sustainable growth, this progress has come amid a more challenging backdrop,\" General Mills said in its statement.\n\nWhile General Mills has managed to return roughly 4% since the beginning of the year, the company's shares are down more than 18% over the past year. Meanwhile, an index tracking the consumer staples sector (XLP) has returned 15% year to date and roughly 10% since the same time last year.\n\nParamount Skydance (PSKY) stock is moving higher after Warner Bros. (WBD) agreed to reopen acquisition discussions.\n\nThe move comes after Paramount proposed a new all-cash offer last week of $30 per share to acquire the entire company. That offer came with a $ 0.25-per-share \"ticking fee\" — under which Warner Bros.' shareholders would receive $0.25 per share each quarter until the transaction is not closed beyond the end of this year.\n\nParamount also floated an informal acquisition proposal for $31 a share, WBD said.\n\nThe new window for discussions will last seven days, ending on Feb. 23, 2026, \"to seek clarity for Warner Bros. stockholders and provide Paramount the ability to make its best and final offer.\"\n\nIn the release, Warner Bros. Chair Samuel A. Di Piazza said the board of directors said it still suggests the Netflix offer, worth some $82.7 billion, which does not include the entire business.\n\n\"The Netflix merger is in the best interests of WBD shareholders due to the tremendous value it provides\" with a \"clear path to achieve regulatory approval,\" he said in the release.\n\nParamount's current offer of $30 per share values the whole company at $108.4 billion.\n\nNetflix’s co-CEO Ted Sarandos testified before the Senate Judiciary Subcommittee last week, negating claims that it would lead to a monopoly, or higher prices for consumers.\n\nYahoo Finance's Jake Conley lays out the key events ahead for investors in a holiday-shortened week.\n\nRead more here on what to look out for.\n\nDTE Energy (DTE) stock rose as much as 10% before paring gains. The energy company is due to release its earnings before the bell today, and the stock has risen 13% over the past year.\n\nNorwegian Cruise Line (NCLH) stock rose 7% during premarket trading on Tuesday after activist investor Elliott built a stake in the company.\n\nStrategy (MSTR) stock fell 3% before the bell today. The company, which is one of the largest corporate holders of bitcoin, has been struggling recently due to the sell-off with the world's largest cryptocurrency.\n\nA growing number on Wall Street are assessing the recent AI sell-offs. And despite many fearing the bubble has burst, for stock pickers, now might be the time for them to get greedy.\n\nGermany's Hapag-Lloyd (HLAG.DE, HPGLY) is buying ZIM Integrated Shipping Services in a deal worth $4.2 billion, bringing together two of the world's biggest shipping lines.\n\nShares of Israel-based ZIM rocketed over 35% higher in premarket trading, after the two companies confirmed the takeover on Monday.\n\nThe Wall Street Journal reports:\n\nNothing like a BofA fund manager survey drop the day after a market holiday.\n\nLots of great nuggets in the one out this morning, but the chart below stood out to me. So many on the Street I talk with expect a very robust economy this spring, in part because of expectations for a strong tax refund season.\n\nGoes a long way in explaining the hot small-caps trade.\n\nMasimo (MASI) stock surged over 30% in premarket following a report that Danaher (DHR) is closing in on a deal to buy the medical technology company.\n\nThe deal moves come two years after activist investor Politan succeeded in pushing through a change in Masimo's board.\n\nIt would be the biggest acquisition by Danaher in over half a decade, the Financial Times reported. Shares of the US life sciences manufacturer fell over 5% before the bell.\n\nRead more here (premium subscribers)\n\nNorwegian Cruise Line (NCLH) stock rose 6% before the bell on Tuesday following a report from The Wall Street Journal that activist investor Elliott has built a 10% stake in the company and plans to push for changes.\n\nElliott has become one of the cruise line's top investors and is keen to fix the company's underperformance. Elliott has so far built stakes in Southwest Airlines (LUV), as well as oil refiner Phillips 66 (PSX) and Toyota Industries (TYIDY). According to The Wall Street Journal, Elliott has over $79 billion in assets under management and is concerned about Norwegian Cruise Line's financial performance."
    }
]