[
    {
        "title": "This Utilities Stock Is Up 23% Over the Past Year and One Fund Is Betting $49 Million on Sustained Growth",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/AAPL/pressreleases/227058/this-utilities-stock-is-up-23-over-the-past-year-and-one-fund-is-betting-49-million-on-sustained-growth/",
        "source": "The Globe and Mail",
        "date": "2026-02-14T22:50:00+00:00",
        "content": "Bragg Financial Advisors added 207,861 shares of UGI in the fourth quarter; the estimated transaction value was $7.36 million based on average prices.\n\nMeanwhile, the quarter-end position value rose by $12.40 million, reflecting both increased holdings and share price movement.\n\nPost-trade, the fund holds 1,316,362 shares valued at $49.27 million.\n\nBragg Financial Advisors disclosed a buy of 207,861 shares of UGI(NYSE:UGI) in its February 13, 2026, SEC filing, an estimated $7.36 million trade based on quarterly average pricing.\n\nAccording to a SEC filing dated February 13, 2026, Bragg Financial Advisors, Inc increased its stake in UGI(NYSE:UGI) by 207,861 shares last quarter. The estimated transaction value, based on the mean unadjusted close price over the quarter, was $7.36 million. The fund’s quarter-end exposure to UGI rose to 1,316,362 shares, with the position’s value up $12.40 million from the prior filing.\n\nUGI Corporation is a diversified energy distributor with a broad portfolio spanning propane, natural gas, and electricity. The company leverages an integrated infrastructure network to deliver energy products and services to customers across multiple markets. Its scale and multi-segment approach provide resilience and access to stable, regulated revenue streams.\n\nA diversified utility adding exposure to a portfolio heavy with mega cap tech changes the risk profile in subtle but important ways. UGI opened fiscal 2026 with $2.08 billion in quarterly revenue and 5% growth in total reportable segment EBIT to $441 million. Adjusted diluted EPS came in at $1.26. The Utilities segment delivered 12% operating income growth, helped by base rate increases in Pennsylvania and 16% growth in core market volumes during colder weather. Meanwhile, UGI International expanded operating income 20% despite lower LPG volumes, supported by disciplined margin management.Management is also reshaping the portfolio. Agreements to divest LPG businesses in several European countries are expected to generate roughly $215 million in cash, while Moody’s upgraded AmeriGas’ outlook to positive. Rate case filings requesting $99 million and $27 million in distribution increases underscore a focus on regulated earnings growth.At just over 1% of assets, this position sits well below Apple, Microsoft, and Alphabet, but it adds income stability and infrastructure exposure. And with shares up about 23% over the past year, along with a roughly 4% dividend, it makes sense why a fund would choose to double down on the holding.\n\nBefore you buy stock in UGI, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and UGI wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $414,554!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,120,663!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 884% — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 14, 2026.\n\nJonathan Ponciano has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Apple, and Microsoft. The Motley Fool has a disclosure policy.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "ASX listed bank overvalued after shares surge",
        "url": "https://www.morningstar.com.au/stocks/asx-listed-bank-overvalued-after-shares-surge",
        "source": "Morningstar Australia",
        "date": "2026-02-15T20:41:00+00:00",
        "content": "Investors were pleased with results but our fair value estimate is unchanged.\n\nANZ Group’s (ASX: ANZ) first-quarter fiscal 2026 underlying profit rose 17% to $2.0 billion. A sharp 8% cut to underlying operating expenses was the key driver, further aided by modest loan growth and a slight improvement in underlying net interest margins, or NIMs. Shares rose 8% on the day.\n\nWhy it matters: The current pace of cost-cutting is unlikely to continue, and our expectation for full-year expenses to fall 3% is unchanged. Cost-cutting was driven by redundancies in the first quarter, with over 60% of 3,500 planned job cuts complete by December 2025.\n\nThe bottom line: We maintain our $33 fair value estimate for wide-moat ANZ Group. Shares are overvalued. The market now appears overly confident that the company will achieve long-term strategic growth targets, despite integration and governance risks.\n\nANZ Group is the owner of ANZ Bank, the smallest of Australia’s four major banks by market value and the largest bank in New Zealand and the Pacific, offering a full range of banking and financial services to the consumer, small business, and corporate sectors. Like the other major banks, ANZ Bank has a well-recognized and trusted bank brand, large advertising and marketing budget, and customer fulfilment capacity (branches, systems, funding capacity) to capitalize on this brand equity. We see the firm’s strategy to simplify and focus on its highly profitable core banking operations as logical. The acquisition of Suncorp Bank provides an avenue to leverage benefits of current investments in its retail banking platform. These investments include better digital offerings and more lenders. Integration risk can not be ignored, but overall we believe the acquisition is strategically sound.\n\nTight underwriting standards, lender’s mortgage insurance, low average loan/valuation ratios, a high incidence of loan prepayment, full recourse lending, and a high proportion of variable rate home loans, combine to mitigate potential losses from mortgage lending.\n\nThe main current influences on earnings growth are modest credit growth, with households and businesses adjusting to lower borrowing capacity after a sharp increase in rates and slowing economic growth. Businesses are expected to be more cautious on making large investments as households rein in discretionary spending. Margins fell as banks competed aggressively in a low credit growth and high refinance market, but margins have stabilized, and we expect competition to be rational in the medium term. Despite productivity benefits, operating expenses are increasing as investments to make the bank more efficient and competitive across its digital offerings—namely home loans and savings.\n\nIn Asia, ANZ Bank targets large clients and has walked away from lending to small business. Given ANZ Bank would have no competitive advantage against local (and much larger) lenders, we support the revised strategy.\n\nStar Rating: Our one- to five-star ratings are guideposts to a broad audience and individuals must consider their own specific investment goals, risk tolerance, and several other factors. A five-star rating means our analysts think the current market price likely represents an excessively pessimistic outlook and that beyond fair risk-adjusted returns are likely over a long timeframe. A one-star rating means our analysts think the market is pricing in an excessively optimistic outlook, limiting upside potential and leaving the investor exposed to capital loss.\n\nFair Value: Morningstar’s Fair Value estimate results from a detailed projection of a company’s future cash flows, resulting from our analysts’ independent primary research. Price To Fair Value measures the current market price against estimated Fair Value. If a company’s stock trades at $100 and our analysts believe it is worth $200, the price to fair value ratio would be 0.5. A Price to Fair Value over 1 suggests the share is overvalued.\n\nMoat Rating: An economic moat is a structural feature that allows a firm to sustain excess profits over a long period. Companies with a narrow moat are those we believe are more likely than not to sustain excess returns for at least a decade. For wide-moat companies, we have high confidence that excess returns will persist for 10 years and are likely to persist at least 20 years. To learn about finding different sources of moat, read this article by Mark LaMonica."
    },
    {
        "title": "Barry Ritholtz calls January 130,000 job gain 'mediocre.' Why he says SCOTUS tariff ruling could spark 'immense rally'",
        "url": "https://finance.yahoo.com/news/barry-ritholtz-calls-january-130-121500802.html",
        "source": "Yahoo Finance",
        "date": "2026-02-15T13:00:00+00:00",
        "content": "As some economists and market-watchers crowed over the improved employment numbers released on Wednesday, showing the U.S. added 130,000 jobs in January (1), one leading financial expert suggested that context is key to revealing the bigger picture in the report.\n\n“I keep hearing people talk about blowout non-farm payroll number,” Barry Ritholtz, co-founder, chairman and chief investment officer of Ritholtz Wealth Management LLC, told Moneywise. “Well, first of all, 130,000 is pretty mediocre for the past 15 years. Hold aside the post-pandemic recovery, we typically see 200,000, 300,000 in a robust, expanding economy.”\n\nDave Ramsey warns nearly 50% of Americans are making 1 big Social Security mistake — here’s what it is and 3 simple steps to fix it ASAP\n\nThanks to Jeff Bezos, you can now become a landlord for as little as $100 — and no, you don't have to deal with tenants or fix freezers. Here's how\n\nI’m approaching retirement with no savings. Should I panic? Here are 6 easy ways to catch up (and fast)\n\nRitholtz, who also hosts the finance podcast Masters in Business on Bloomberg Radio, writes for his finance website The Big Picture and, most recently, authored the book How Not to Invest: The Ideas, Numbers and Behaviors That Destroy Wealth — and How to Avoid Them, added that focusing on the 130,000 new jobs buries the larger story.\n\nThat, he noted, is how the Bureau of Labor Statistics (BLS) chopped the 2025 employment gains by nearly 70%, revising them down from 584,000 to 181,000. “Some of it is deportation related. But whatever it is, last year was pretty mediocre for hiring.”\n\nIn addition, the 130,000 jobs created in January — while an improvement compared to the 2025 stats — does, as Ritholtz noted, mark one of the lower monthly gains in the last 15 years. Given the 2025 monthly job numbers peaked at 108,000 last April, the 130,000 marks a very modest step up. As well, the unemployment rate dipped a hair from 4.4 to 4.3, while hourly earnings increased year-over-year by 3.7%.\n\n“You need to have the broader context,” Ritholtz said. “I called [the] report ‘the confirmation bias’ because you can find whatever you want … Something bullish, here it is. You want to find something bearish, here it is. Again, almost nothing is black and white.”\n\nThe uneven pace of job growth so far during President Trump’s second term has added to broader uncertainty about the economic outlook.\n\n“There were a lot of issues last year,” Ritholtz explained, though he added that he doesn’t agree that 2.5%-3% inflation is too concerning. “I think other people think it's much more problematic because of the silly 2% target. But there were a lot of issues last year and it's complicated.”\n\nHe pointed to the fact that the economy is still expanding, the stock market is reaching all-time highs and that “it's hard to become too bearish in the light of that.”\n\nBut, he warned, “you have to have your eyes open” to what the back half of the year could bring.\n\nHe puts the chance of a recession in the first half of the year at 25% to 30%, or “really unlikely,” saying that those chances could tick up to 35% to 40% in the second half.\n\n“But as we've learned with this administration, you’ve really got to look at the policies that are announced,” he continued. “A giant trillion-dollar tax cut is very stimulating. A giant set of tariffs is inflationary and takes consumer spending to a not great level. And you've seen the consumer sentiment is pretty punk. So it's never black and white. It's always shades of gray.”\n\nRead More: The average net worth of Americans is a surprising $620,654. But it almost means nothing. Here’s the number that counts (and how to make it skyrocket)\n\nAnother looming issue hanging over the economy is the pending Supreme Court decision regarding whether or not to strike down Trump’s signature tariffs. The tariffs raked in an estimated $287 billion last year (2), while contributing to trade tensions with allies and coinciding with job losses in some sectors, including manufacturing (3), leaving U.S. households to absorb much of the price impact.\n\nRitholtz believes that a Supreme Court decision that strikes down tariffs could help keep inflation in check while flowing hundreds of billions of dollars in tariff refunds back into the corporate sector. In fact, he noted that he invested in Walmart, Caterpillar, Ford, GM and other companies requesting tariff refunds following last November’s oral arguments regarding the Trump administration’s use of the International Emergency Economic Powers Act (IEEPA), based on how “dubious” the court seemed of the government’s argument.\n\n“I'm not the only one who did that. So the nuance question is how much of this is already reflected in price?” he asked. “And I would guess probably half, maybe, just spitballing. So if nobody has thought about it, you would see an immense rally the day the IEEPA tariffs are overturned and it would probably run for weeks.”\n\nRitholtz added his belief that, if the Supreme Court offers a thorough tariff rebuke, it could signal to the Federal Reserve that “all these inflationary tariffs that have raised prices 10%, 15%, they're gone. You want to cut? You just got a giant deflationary ruling.”\n\nAnd if the court upholds the tariffs, Ritholtz said that, given they’re arguably a tax hike, it could benefit the deficit and bond markets.\n\n“There's always multiple opportunities on all these big events,” he explained. “The challenge is not only do you have to know which way the event is going to fall, you have to figure out how much of it's already in the price and what the second and third effects are. And so you're guessing what other people are going to do and then responding to that. It's pretty impressive.”\n\nWhether the economy tilts toward expansion or slowdown, Ritholtz says investors should expect volatility — and remember that policy shifts, not headlines, are likely to drive what comes next.\n\nRobert Kiyosaki says this 1 asset will surge 400% in a year — and he begs investors not to miss its ‘explosion’\n\nMega-rich Americans are ditching stocks and hoarding historic highs of cash. Here’s where their wealth’s going instead\n\nVanguard reveals what could be coming for U.S. stocks, and it’s raising alarm bells for retirees. Here’s why and how to protect yourself https://moneywise.com/mega-rich-americans-are-ditching-stocks-and-hoarding-historic-highs-of-cash-heres-where-their-wealths-going-instead\n\nStarting with just $10, everyday investors can now buy into his $1B private real estate fund. Here's how to get started in minutes\n\nJoin 200,000+ readers and get Moneywise’s best stories and exclusive interviews first — clear insights curated and delivered weekly. Subscribe now.\n\nWe rely only on vetted sources and credible third-party reporting. For details, see our editorial ethics and guidelines.\n\nBureau of Labor Statistics (1); Federal Reserve Bank of Richmond (2); Yahoo Finance (3)\n\nThis article provides information only and should not be construed as advice. It is provided without warranty of any kind."
    }
]