[
    {
        "title": "Top analyst revamps Apple stock price target",
        "url": "https://finance.yahoo.com/news/top-analyst-revamps-apple-stock-050300356.html?fr=yhssrp_catchall",
        "source": "Yahoo Finance",
        "date": "2026-02-12T06:01:00+00:00",
        "content": "Apple (AAPL) stock investors appear to be fixated on soaring memory costs of late. However, Bernstein’s Mark Newman feels they’re looking in the wrong place and should start focusing on AI.\n\nIn doing so, Newman bumped his price target on Apple to $340 from $325. With shares of the Cupertino giant trading near $273, that implies a nearly 24% upside from current levels.\n\nTo be fair, though, Apple fans weren’t exactly pulling that idea out of thin air.\n\nIn fact, Apple CEO Tim Cook specifically addressed memory after the company posted another blowout quarterly report.\n\nStill, when pressed about pricing being a possible lever for the iPhone 18,  Cook wouldn’t go there.\n\nThe cautiousness suggests Apple is still weighing its options, and clearly, the math behind the upcoming iPhone lineup still hasn’t been worked out.\n\nHowever, veteran Apple analyst Ming-Chi Kuo doesn’t expect a major shift in approach, at least for now, as the tech giant is likely to stick with its existing strategy heading into the iPhone 18 debut.\n\nDespite the validity of those concerns, Newman points to a bigger catalyst in Apple Intelligence and Siri 2.0 to drive the stock’s next leg higher.\n\nNewman feels Apple’s hybrid AI architecture could unlock a major new upgrade cycle, which is a bigger story than memory inflation.\n\nMorgan Stanley:$315 (overweight). Sources: Yahoo Finance, Investing.com\n\nDespite memory cost inflation being a big deal, it still doesn't fundamentally impact Apple’s tremendous earnings power, Newman shared in a CNBC interview.\n\nThat’s not to say he doesn’t expect iPhone production costs to rise, though.\n\nHeightened component costs could push iPhone prices up by as much as 15%, Newman added, while bumping the overall average selling price by nearly 12% as some customers trade down to cheaper models.\n\nMorgan Stanley sets jaw-dropping Micron price target after event\n\nNvidia’s China chip problem isn’t what most investors think\n\nQuantum Computing makes $110 million move nobody saw coming\n\nThat increase is substantial, and it comes down to a staggering 237% surge in mobile DRAM contract prices since Q2 2025, along with a 70% jump in NAND.\n\nDespite the pressures, Newman feels that Apple separates itself from the pack through its superb execution.\n\nHe says Apple is “managing better than competition,” led by unmatched scale advantages, supplier leverage, product mix, and durable pricing power.\n\nTo his point, Apple has evolved into a powerful platform company with a walled-garden ecosystem that locks users in.\n\nThat matters a ton when costs spike.\n\nThat’s why even with the memory pressures in play, Bernstein’s modeling points to iPhone gross margins dropping by nearly 1.5 percentage points by Q4 2027.\n\nThough that’s meaningful, Newman believes the EPS impact will be substantially offset by higher-margin services revenue, mix shift, and aggressive cost management.\n\nNewman’s bullish take on Apple centers around AI.\n\nInstead of AI technology showing up just as a chatbot, Newman says Apple is deploying it as a system-level layer, making its ecosystem stickier.\n\nWhat makes this possible is a hybrid design that handles as many requests on the device and reroutes the heavier ones (advanced reasoning) through Private Cloud Compute using Google’s Gemini.\n\nRelated: Cathie Wood drops $10 million on resurgent tech stock\n\nThat robust setup ensures Apple’s privacy positioning remains firmly intact, while delivering cutting-edge responses and features.\n\nUnlike many of its peers, Apple isn’t in the race to win AI benchmarks or translate those gains into tangible financial gains. It just needs those features to change behavior and pave the way for healthier services revenue.\n\nIn fact, some of the earlier modeling supports that logic.\n\nMorgan Stanley’s April 2025 survey, as reported by Investing.com, was an early “tell” that Apple’s AI pitch would likely move the needle.\n\nAt the time, 51% of iPhone owners said they were “extremely likely” to upgrade in the next 12 months. More importantly, those respondents, compared with those in the previous fall, showed a 12% higher willingness to pay $9.11 per month for Apple Intelligence.\n\nFor perspective, the significant Siri 2.0 (the next phase of Apple Intelligence) is reportedly set to launch in spring 2026, according to Mac Rumors.\n\nIronically, Apple stock was initially blasted for lagging in the AI realm. However, as we’ve gotten deeper into the cycle, Newman argues that investors have actually felt a lot “more comfortable” amid the AI wars.\n\nFor more context, Apple stock has gained an impressive 20% over the past six months, while the Roundhill Magnificent 7 ETF is up just 7% during the same period.\n\nYTD: Apple 0.67% versus S&P 5001.41%\n\n1-year: Apple 20.22% versus S&P 500 14.43%\n\n3-year: Apple 81.23% versus S&P 500 69.71%\n\n5-year: Apple 102.14% versus S&P 500 77.55%\n\n10-year: Apple 1,061.26% versus S&P 500 274.86% Source: Seeking Alpha\n\nRelated: Bank of America sends quiet warning to stock market investors\n\nThis story was originally published by TheStreet on Feb 12, 2026, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here."
    },
    {
        "title": "Fractal Analytics IPO Day 3 Highlights: Issue booked 2.66x as QIBs step in — GMP turns negative",
        "url": "https://www.livemint.com/market/ipo/fractal-analytics-ipo-gmp-remains-flat-last-day-to-apply-for-fractal-analytics-ipo-check-review-11-february-2026-11770782214072.html",
        "source": "Mint",
        "date": "2026-02-12T00:08:00+00:00",
        "content": "Fractal Analytics IPO Day 3 Highlights: The initial public offering (IPO) of AI solutions provider Fractal Analytics has opened for the final day of bidding on Wednesday, February 11. The offer has so far seen a tepid response from investors. As of the second day of bidding, Fractal Analytics IPO was booked 20%.\n\nFractal Analytics’  ₹2,834-crore IPO has a price band of  ₹857 to  ₹900 per share, valuing the company at approximately  ₹15,500 crore.\n\nThe company has reduced the size of its IPO from the initially proposed  ₹4,900 crore. The revised issue consists of a fresh equity issue of up to  ₹1,023.5 crore and an offer for sale (OFS) worth  ₹1,810.4 crore, bringing the total issue size to  ₹2,833.9 crore.\n\nShareholders participating in the OFS include Quinag Bidco Ltd, TPG Fett Holdings Pte Ltd, Satya Kumari Remala Rao, Venkateswara Remala, and GLM Family Trust.\n\nProceeds from the fresh issue will be deployed to invest in its subsidiary, Fractal USA, for debt repayment, purchase of laptops, establishment of new offices in India, research and development initiatives, expansion of sales and marketing efforts under Fractal Alpha, funding acquisitions and strategic initiatives, as well as for general corporate purposes.\n\nFractal Analytics IPO grey market premium (GMP) has slumped to  ₹7 today. This means that shares of Fractal Analytics IPO are trading at  ₹907 as against the offer price of  ₹900.\n\nAt the current levels, Fractal Analytics IPO listing pop could be less than 1% only.\n\nThe company is scheduled to list on the stock exchanges on February 16.\n\nFounded in 2000, Fractal Analytics provides end-to-end AI solutions and data-driven insights to large global enterprises across various industries and business functions.\n\nThe company specialises in sectors such as consumer packaged goods and retail, technology, media and telecom, healthcare and life sciences, and banking, financial services and insurance.\n\nAs of March 31, 2025, Fractal’s client roster included global giants such as Microsoft, Apple, Nvidia, Alphabet, Amazon, Meta and Tesla.\n\nWatch this space for LIVE updates on Fractal Analytics IPO Day 3\n\nAs of September 2025, Fractal’s top ten clients had an average relationship tenure of over eight years, with marquee clients including Citibank, Costco, Franklin Templeton, Mars, Mondelez, Nationwide, Nestlé, and Philips.\n\nFractal Analytics IPO is -  ₹2. This means that shares of Fractal Analytics are trading  ₹2 below the IPO price of  ₹900.\n\nThe company operates through two business segments: Fractal.ai, which delivers AI services and products primarily through its proprietary agentic AI platform, Cogentiq, and Fractal Alpha, which houses independent AI ventures targeting core clients, adjacent markets, and new geographies.\n\nFractal Analytics IPO's NII segment was also fully subscribed as of 4 pm on the final day of bidding. QIB was the most booked segment at 4x bids.\n\nFractal Analytics has a strong presence across its four focus industries and serves large global clients, with the top 10 clients averaging over eight years of engagement. At the upper price band of  ₹900, the issue is valued at 78.9x FY25 P/E (post-issue), there are no listed companies in India or globally for comparison for similar business model , with positive sector outlook with moderate growth—18% revenue CAGR during FY23–25 and 20% YoY growth in 1HFY26.\n\nAttrition remains elevated at 16.3% in FY25 and 15.7% in 1HFY26. also Fractal is India’s first pure-play AI company to list, positioned as a Decision Intelligence player combining AI services with incubated SaaS products (Fractal Alpha ).\n\nWe assign a Subscribe rating for Long Term high-risk growth focused investor. ( 3–5 year horizon)\n\nFractal’s portfolio includes proprietary platforms and models such as Cogentiq (an agentic AI orchestration platform), Vaidya (a multimodal medical foundation model ecosystem), Kalaido.ai (a diffusion‑based generative image model), Pioneer (a multi‑agent system for software development and autonomous data science), and the Fathom family of reasoning and deep‑research models, alongside investments in ecosystem assets such as Qure.ai (AI for radiology) and Analytics Vidhya.\n\nThe global data, analytics and AI industry is undergoing a structural shift toward an AI-native, GenAI-led enterprise stack, with core AI services and platforms emerging as the fastest-growing layers of digital transformation spend.\n\nWithin this rapidly evolving landscape, Fractal Analytics is strategically positioned as a mission-critical, end-to-end enterprise AI partner, combining consulting, services, platforms and product businesses to help large global clients operationalize AI at scale across functions and industries.\n\nIt operates in a long-duration, secular growth market, with its total serviceable addressable market across AI services, platforms and software expected to expand from about US$85 billion in FY25 to around US$171 billion by FY30P, implying a robust mid-teens CAGR in line with, or above, broader DAAI growth.\n\nThis expansion is driven by accelerating GenAI adoption, rising demand for domain-specific AI, and the shift from pilot projects to scaled, production-grade AI and agentic systems embedded in core workflows, providing strong multi-year revenue visibility.\n\nFractal’s offerings are deeply integrated into client decision journeys and technology stacks, supported by high net revenue retention, long-standing relationships with marquee “must win” clients, and an increasing mix of recurring and product-linked revenues, resulting in high switching costs and improving earnings quality.\n\nWe recommend subscribing to the issue with a long-term investment horizon, as sustained execution on its IP- and platform-led strategy, deepening penetration within must-win clients, and powerful GenAI-led industry tailwinds could translate into meaningful value creation over time.\n\nWhile the emergence of Artificial General Intelligence (AGI) poses a long-term disruptive risk to traditional AI business models, Fractal’s dominant position in the analytics niche suggest a strong competitive strength and deep-rooted client trust. As the company continues to capitalize on the global demand for enterprise-grade AI, its ability to maintain high margins and operational leverage, we recommend a ‘SUBSCRIBE’ rating for long-term investors, said Lakshmishree Investment.\n\nFractal, in its RHP, said that it has experience in serving several large enterprises, including the majority of the “magnificent seven” companies (Alphabet, Amazon, Apple, Meta, Microsoft, Nvidia, and Tesla).\n\nFractal Analytics IPO was subscribed 1.45 times as of 1.15 pm, thanks to massive QIB demand. Other segments, however, remained undersubscribed.\n\nQIB quota was booked 2.27 times, QIB segment received 46% bids and the retail portion garnered 78% subscription.\n\nFractal Analytics operates in a niche segment of Data Analytics leveraging AI developed through in-house R&D and resources as well as on external models. It has a healthy presence across its 4 focus industries with top MNCs as its clients and an average tenure of 8+ years across the top 10 clients.\n\nAt the upper price band of  ₹900, the issue is valued at FY25 P/E multiple of 78.9x based on post-issue capital. This looks elevated given the relatively modest revenue growth (18% revenue CAGR between FY23-25 and 20% YoY growth in 1HFY26). Attrition rate for the company continues to be elevated (16.3% in FY25/15.7% in 1HFY26). Risks such as insourcing by clients especially with the advent of AI tools could lead to loss of clients and impact the company’s business model.\n\nConsidering the elevated valuation, we assign a NEUTRAL rating to the issue and would like to track the performance of the company for a few quarters post listing.\n\nThe company works with marquee clients such as Citibank, Costco, Franklin Templeton, Mars, Mondelez, Nationwide, Nestle, Phillips, etc., ensuring participation across its focus industries of CPGR, TMT, HLS, and BFSI. As of Sep’25, the company served 122 Must Win Clients (MWCs)and served its top 10 clients by revenue in 1HFY26 for an average of more than eight years.\n\nFractal Analytics IPO was subscribed 54% so far as QIB investors ramped up buying, with their quota booked 55%.\n\nFractal Analytics IPO subscribed 28% as of 12 pm. The QIB segment was booked 8% and the NII portion was subscribed 38%. The retail portion garnered 73% bids and the employee segment 27%.\n\nAs of 1HFY26/FY25, the company’s top 10 clients contributed 54.2%/53.8% to the total revenue from the Fractal.ai business segment. Thus, failure to maintain and expand relationships with its existing client base or add new clients, may impact the company’s business and financial performance.\n\nThe issue is priced at a P/BV of 7.76 based on its NAV of Rs. 116 as of September 30, 2025 and asking price is at a P/E of ~109.12x if we attribute FY26 annualized earnings. There are no listed peers to compare with as per the RHP. The issue is very aggressively priced.\n\nFractal Analytics offers investors an opportunity to contribute in a rapidly growing sector of DAAI services and generative AI that serves high-end consumer brands in India and globally but, Looking at all the factors, risks, opportunities and Elevated valuation, Investors with High-risk appetite can apply for Long term horizon.\n\nFractal Analytics IPO is a book build issue of  ₹2,833.9 crore, consisting of a fresh issue of 1.1 crore shares, aggregating to  ₹1,023.5 crore and an offer for sale of 2 crore shares aggregating to  ₹1,810.4 crore. The company plans to use the fresh funds raised for the following:\n\n1. Investment in Fractal USA for Debt Repayment –  ₹264.9 crore\n\n2. Purchase of Laptops –  ₹57.1 crore\n\n3. Setting-up New Office Premises in India –  ₹1,211 crore\n\n4. Investment in R&D and Sales & Marketing under Fractal Alpha –  ₹355.1 crore\n\n5. Inorganic Growth and General Corporate Purposes\n\nFractal Analytics IPO subscribed 22% as of 10.30 am. The QIB segment was booked 2% and the NII portion was subscribed 31%. The retail portion garnered 67% bids and the employee segment 23%.\n\nFractal is India’s first pure-play AI company to list, positioned as a Decision Intelligence player combining AI services with incubated SaaS products (Fractal Alpha). The company has seen a sharp turnaround, moving from a  ₹55 crore loss in FY24 to a  ₹221 crore profit in FY25 on the back of 26% revenue growth.\n\nAt the upper band of  ₹900, valuations look expensive at ~79x (post) FY25 P/E, but this reflects a scarcity premium for a listed AI platform. Best suited for high-risk, growth-focused investors with a 3–5 year view looking to ride the global GenAI cycle.\n\nFractal has built a diversified revenue profile. In FY25, revenue from the Fractal.ai segment stood at  ₹2,703.7 Cr, with CPGR contributing  ₹1,061.5 Cr, TMT  ₹808.7 Cr, HLS  ₹374.5 Cr, BFSI  ₹298.0 Cr, and other industries  ₹161.0 Cr.\n\nRevenue from operations grew from  ₹1,985.4 Cr in FY23 to  ₹2,196.3 Cr in FY24, and further to  ₹2,765.4 Cr in FY25, reflecting a 25.9% YoY growth. For the six months ended September 30, 2025, revenue stood at  ₹1,559.0 Cr, up 19.9% YoY.\n\nProfitability improved materially in FY25. EBITDA increased to  ₹398.0 Cr, with an EBITDA margin of 14.4%, compared to  ₹97.2 Cr and 4.4% in FY24. Adjusted EBITDA stood at  ₹482.1 Cr, with an adjusted EBITDA margin of 17.4%.\n\nProfit after tax (PAT) for FY25 was  ₹220.6 Cr, compared to a loss of  ₹54.7 Cr in FY24, with a PAT margin of 8.0%, while adjusted PAT stood at  ₹347.8 Cr, translating into an adjusted PAT margin of 12.6%.\n\nFractal Analytics IPO opened for the final day of bidding today at 10 am. Investors can place their bids till 5 pm today. Issue was booked 20% as of the second day.\n\nInvestors can apply for the IPO in multiples of 16 shares, requring a minimum investment of  ₹14,400.\n\nFractal Analytics IPO grey market premium (GMP) has slumped to  ₹7 today. This means that shares of Fractal Analytics IPO are trading at  ₹907 as against the offer price of  ₹900.\n\nAt the current levels, Fractal Analytics IPO listing pop could be less than 1% only.\n\nThe company is scheduled to list on the stock exchanges on February 16.\n\nFractal Analytics IPO received bids for 36,40,320 shares against 1,85,79,360 shares on offer, according to NSE data, resulting in 20% bids.\n\nThe category for retail individual investors (RIIs) fetched 60 per cent subscription, while the quota for non-institutional investors subscribed 27 per cent. The portion for qualified institutional buyers (QIBs) received a 2 per cent subscription.\n\nCatch all the Business News ,  Market News , Breaking News Events and Latest News  Updates on Live Mint. Download The Mint News App  to get Daily Market Updates."
    },
    {
        "title": "Sundar Pichai Net Worth Hits $1.6 Billion Amid Alphabet's AI Surge",
        "url": "https://www.financial-news.co.uk/sundar-pichai-net-worth-hits-1-6-billion-amid-alphabets-ai-surge/",
        "source": "Financial News",
        "date": "2026-02-12T12:26:00+00:00",
        "content": "In recent years, founders with electric cars, social media empires, or rockets have made headlines. The ascent of Sundar Pichai has been remarkably different—quieter, more steady, and, in many respects, more educational.\n\nHis estimated net worth as of February 2026 is $1.6 billion. That figure can seem surprisingly restrained for a man who is in charge of one of the world’s most powerful technology companies. However, its journey reveals a philosophy that is especially inventive in its moderation.\n\nNot one of the founders was Sundar Pichai. He didn’t go public with a startup. He didn’t have a majority stake in the company from the beginning. Rather, he became a product manager at Google in 2004, showing up for an interview the same day Gmail was introduced.\n\nI’ve always found that detail to be symbolic.\n\nPichai was raised without easy access to technology in a small two-room apartment in Tamil Nadu. His father, an electrical engineer, once paid for his son’s Stanford tuition with a year’s worth of wages. In interviews, he expressed quiet gratitude for that sacrifice, which influenced his outlook on opportunity and risk.\n\nPichai established an incredibly resilient foundation at IIT Kharagpur, Stanford, and then Wharton. He started out as a materials engineer, had a brief stint at McKinsey, and then joined Google while the company was still establishing its identity.\n\nHe contributed to the creation of a browser that was noticeably faster and incredibly successful at gaining market share by spearheading the development of Chrome. The simplicity of Chrome wasn’t a coincidence. It was designed, honed, and launched with a focus on security and speed, which worked incredibly well.\n\nPichai’s duties grew over time, initially involving Gmail and Maps before moving on to Android. He was appointed CEO of Google in 2015. He succeeded Larry Page as Alphabet Inc.’s chief executive in 2019.\n\nThat steady ascent is reflected in his wealth.\n\nPichai owns about 0.02 percent of Alphabet, compared to founders who own double-digit shares. That might not seem like much, but in a business worth trillions, it’s more than enough to make you a billionaire.\n\nHe has received a large portion of his compensation in the form of annual stock grants. He profited from Alphabet’s growth by utilizing long-term equity packages, especially during the AI boom that significantly raised the company’s valuation. In 2022 alone, his compensation package—which was mostly in stock—surpassed $200 million.\n\nObservers are more interested in his sales than in his earnings, though.\n\nPichai has sold hundreds of millions of dollars’ worth of shares under prearranged Rule 10b5-1 plans over the last ten years. Insider trading charges are avoided by these planned sales, which are intended to be very dependable and compliant with the law. They also mean he has chosen liquidity over speculation.\n\nAnalysts once estimated that his net worth could have surpassed $2.5 billion if he had kept all of the shares. He chose disciplined diversification instead, which greatly decreased his own exposure to volatility.\n\nWhen I read about one of his June sales, I recall that the stock rose a few days after tens of thousands of shares were sold at a predetermined price. The fact that even billionaires can’t time the market perfectly was brought home to me.\n\nAlphabet was under a great deal of strain during the pandemic. Revenues from advertising fluctuated. Corporate structures changed as millions of people began working remotely. Pichai oversaw the acceleration of AI investment, the tightening of cost controls, and the improvement of product roadmaps.\n\nAlphabet has been revolutionizing workflows by incorporating cutting-edge AI tools into search, cloud, and productivity software. These tools are coordinated, adaptable, and continuously iterating, much like a swarm of bees. When it comes to scaling innovation without crumbling under its own complexity, that distributed intelligence model has proven especially helpful.\n\nExecutive compensation has come under fire, particularly during the 2023 workforce reductions. Debate was triggered by the contrast between layoffs and billion-dollar net worth. Unbalance was perceived by some. Others witnessed the structural reality of public markets reacting to pressures from the macroeconomic environment.\n\nThe tone that Pichai uses is constant.\n\nHis responses to questions about political bias and privacy when he was questioned before Congress in 2018 were remarkably straightforward. He highlighted long-term trust, user control, and transparency. He didn’t speak louder. He didn’t stand up. It was nearly disarming in its steadiness.\n\nResponsible development has been a recurring theme in discussions about AI competition. AI is predicted to change a variety of industries in the upcoming years, including logistics and healthcare. Pichai’s strategy encourages creativity while recognizing moral limits, suggesting optimism restrained by prudence.\n\nSimilar restraint is evident in his private life. He lives in Los Altos Hills with his spouse, Anjali Pichai, whom he met at IIT, and their two kids. He likes playing cricket. He maintains a low public profile. There aren’t any extravagant product launches or yacht purchases.\n\nPichai has kept Alphabet at the top of search while branching out into cloud computing and AI research by optimizing operations and allowing engineering teams to concentrate on scalable platforms. Even in the face of regulatory scrutiny, these actions have been remarkably successful in maintaining investor confidence.\n\nHis path provides a particularly uplifting lesson for aspiring engineers and executives. To gain influence, you don’t have to be the loudest person in the room. Clarity, perseverance, and the capacity to work patiently within complex systems are necessary.\n\nDespite being substantial, his net worth seems almost insignificant in comparison to the structural impact he has had. It is not a spectacle, but a result of stewardship.\n\nAnd maybe that’s what makes it so interesting.\n\nYou must be logged in to post a comment.\n\nAmadeus House 27b Floral Street London WC2E 9DP United Kingdom\n\nGet the latest creative news from FooBar about art, design and business.\n\nBy signing up, you agree to the our terms and our Privacy Policy agreement.\n\nType above and press Enter to search. Press Esc to cancel."
    },
    {
        "title": "Here's Why Apple (AAPL) is a Great Momentum Stock to Buy",
        "url": "https://www.sharewise.com/us/news_articles/Heres_Why_Apple_AAPL_is_a_Great_Momentum_Stock_to_Buy_Zacks_20260212_1800",
        "source": "sharewise",
        "date": "2026-02-12T18:25:00+00:00",
        "content": "Momentum investing is all about the idea of following a stock's recent trend, which can be in either direction. In the \"long context,\" investors will essentially be \"buying high, but hoping to sell even higher.\" And for investors following this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving in that direction. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades.\n\nEven though momentum is a popular stock characteristic, it can be tough to define. Debate surrounding which are the best and worst metrics to focus on is lengthy, but the Zacks Momentum Style Score, part of the Zacks Style Scores, helps address this issue for us.\n\nBelow, we take a look at Apple (AAPL), which currently has a Momentum Style Score of A. We also discuss some of the main drivers of the Momentum Style Score, like price change and earnings estimate revisions.\n\nIt's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Apple currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of \"A or B\" outperform the market over the following one-month period.\n\nYou can see the current list of Zacks #1 Rank Stocks here >>>\n\nLet's discuss some of the components of the Momentum Style Score for AAPL that show why this maker of iPhones, iPads and other products shows promise as a solid momentum pick.\n\nA good momentum benchmark for a stock is to look at its short-term price activity, as this can reflect both current interest and if buyers or sellers currently have the upper hand. It is also useful to compare a security to its industry, as this can help investors pinpoint the top companies in a particular area.\n\nFor AAPL, shares are up 7.18% over the past week while the Zacks Computer - Micro Computers industry is up 5.78% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 5.98% compares favorably with the industry's 4.61% performance as well.\n\nConsidering longer term price metrics, like performance over the last three months or year, can be advantageous as well. Over the past quarter, shares of Apple have risen 2.58%, and are up 16.31% in the last year. On the other hand, the S&P 500 has only moved 1.65% and 15.6%, respectively.\n\nInvestors should also pay attention to AAPL's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. AAPL is currently averaging 54,882,804 shares for the last 20 days.\n\nThe Zacks Momentum Style Score encompasses many things, including estimate revisions and a stock's price movement. Investors should note that earnings estimates are also significant to the Zacks Rank, and a nice path here can be promising. We have recently been noticing this with AAPL.\n\nOver the past two months, 9 earnings  estimates  moved higher compared to none lower for the full year. These revisions helped boost AAPL's consensus estimate, increasing from $8.16 to $8.41 in the past 60 days. Looking at the next fiscal year, 8 estimates have moved upwards while there have been no  downward  revisions in the same time period.\n\nTaking into account all of these elements, it should come as no surprise that AAPL is a #2 (Buy) stock with a Momentum Score of A. If you've been searching for a fresh pick that's set to rise in the near-term, make sure to keep Apple on your short list.\n\nEach was handpicked by a Zacks expert as the favorite stock to gain +100% or more in the months ahead. They include\n\nStock #1: A Disruptive Force with Notable Growth and Resilience\n\nStock #2: Bullish Signs Signaling to Buy the Dip\n\nStock #3: One of the Most Compelling Investments in the Market\n\nStock #4: Leader In a Red-Hot Industry Poised for Growth\n\nStock #5: Modern Omni-Channel Platform Coiled to Spring\n\nMost of the stocks in this report are flying under Wall Street radar, which provides a great opportunity to get in on the ground floor. While not all picks can be winners, previous recommendations have soared +171%, +209% and +232%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThis article originally published on Zacks Investment Research (zacks.com).\n\nThis page uses Cookies. For proper functioning of the page Cookies are needed. You agree to using Cookies by clicking \"OK\". \nMore infos can be found in our Privacy declaration.\n\nIf you disagree this service is only available in very limited ways."
    },
    {
        "title": "Apple has worst day since April as company faces FTC scrutiny, Siri delay reports",
        "url": "https://www.cnbc.com/2026/02/12/apple-stock-worst-day-ftc-siri.html",
        "source": "CNBC",
        "date": "2026-02-12T20:14:00+00:00",
        "content": "Apple just wrapped up its worst day on the stock market since April after reports surfaced about delays with Siri and as the company's news app faced regulatory scrutiny.\n\nThe stock dropped 5% on Thursday, wiping out its gain for the year and leaving it down almost 4% in 2026.\n\nThe long-awaited artificial intelligence update to the iPhone-maker's personal assistant Siri has been internally pushed back to May and potentially later, Bloomberg reported Wednesday.\n\nThe update was expected to launch within a couple weeks, but the company may roll the features out slowly over several months, the report stated.\n\nApple told CNBC it is still on track to launch in 2026.\n\nOn Wednesday, the FTC Chair Andrew Ferguson told Apple CEO Tim Cook to review the terms of service and curation policies on Apple News.\n\nFerguson cited recent \"reports\" that Apple News was promoting left-leaning news outlets while suppressing conservative content.\n\nLast month, Apple beat Wall Street expectations when it reported first-quarter earnings, however, the stock has been tied to Wall Street's recent concerns about big tech spending too much on AI.\n\nTuesday, UBS downgraded the U.S. tech sector to neutral, citing \"software uncertainty\" and heavy capital expenditure. The Swiss investment bank's move came after a sell-off in software stocks over the past week as investors turned cautious towards the sector.\n\nCNBC's Steve Kovach contributed to this report."
    }
]