[
    {
        "title": "Fractal Analytics IPO Day 3 LIVE: Issue booked over 2.6x as QIBs step in — GMP turns negative. Should you apply or not?",
        "url": "https://www.livemint.com/market/ipo/fractal-analytics-ipo-gmp-remains-flat-last-day-to-apply-for-fractal-analytics-ipo-check-review-11-february-2026-11770782214072.html",
        "source": "Mint",
        "date": "2026-02-11T11:30:00+00:00",
        "content": "Fractal Analytics IPO Day 3 Highlights: The initial public offering (IPO) of AI solutions provider Fractal Analytics has opened for the final day of bidding on Wednesday, February 11. The offer has so far seen a tepid response from investors. As of the second day of bidding, Fractal Analytics IPO was booked 20%.\n\nFractal Analytics’  ₹2,834-crore IPO has a price band of  ₹857 to  ₹900 per share, valuing the company at approximately  ₹15,500 crore.\n\nThe company has reduced the size of its IPO from the initially proposed  ₹4,900 crore. The revised issue consists of a fresh equity issue of up to  ₹1,023.5 crore and an offer for sale (OFS) worth  ₹1,810.4 crore, bringing the total issue size to  ₹2,833.9 crore.\n\nShareholders participating in the OFS include Quinag Bidco Ltd, TPG Fett Holdings Pte Ltd, Satya Kumari Remala Rao, Venkateswara Remala, and GLM Family Trust.\n\nProceeds from the fresh issue will be deployed to invest in its subsidiary, Fractal USA, for debt repayment, purchase of laptops, establishment of new offices in India, research and development initiatives, expansion of sales and marketing efforts under Fractal Alpha, funding acquisitions and strategic initiatives, as well as for general corporate purposes.\n\nFractal Analytics IPO grey market premium (GMP) has slumped to  ₹7 today. This means that shares of Fractal Analytics IPO are trading at  ₹907 as against the offer price of  ₹900.\n\nAt the current levels, Fractal Analytics IPO listing pop could be less than 1% only.\n\nThe company is scheduled to list on the stock exchanges on February 16.\n\nFounded in 2000, Fractal Analytics provides end-to-end AI solutions and data-driven insights to large global enterprises across various industries and business functions.\n\nThe company specialises in sectors such as consumer packaged goods and retail, technology, media and telecom, healthcare and life sciences, and banking, financial services and insurance.\n\nAs of March 31, 2025, Fractal’s client roster included global giants such as Microsoft, Apple, Nvidia, Alphabet, Amazon, Meta and Tesla.\n\nWatch this space for LIVE updates on Fractal Analytics IPO Day 3\n\nAs of September 2025, Fractal’s top ten clients had an average relationship tenure of over eight years, with marquee clients including Citibank, Costco, Franklin Templeton, Mars, Mondelez, Nationwide, Nestlé, and Philips.\n\nFractal Analytics IPO is -  ₹2. This means that shares of Fractal Analytics are trading  ₹2 below the IPO price of  ₹900.\n\nThe company operates through two business segments: Fractal.ai, which delivers AI services and products primarily through its proprietary agentic AI platform, Cogentiq, and Fractal Alpha, which houses independent AI ventures targeting core clients, adjacent markets, and new geographies.\n\nFractal Analytics IPO's NII segment was also fully subscribed as of 4 pm on the final day of bidding. QIB was the most booked segment at 4x bids.\n\nFractal Analytics has a strong presence across its four focus industries and serves large global clients, with the top 10 clients averaging over eight years of engagement. At the upper price band of  ₹900, the issue is valued at 78.9x FY25 P/E (post-issue), there are no listed companies in India or globally for comparison for similar business model , with positive sector outlook with moderate growth—18% revenue CAGR during FY23–25 and 20% YoY growth in 1HFY26.\n\nAttrition remains elevated at 16.3% in FY25 and 15.7% in 1HFY26. also Fractal is India’s first pure-play AI company to list, positioned as a Decision Intelligence player combining AI services with incubated SaaS products (Fractal Alpha ).\n\nWe assign a Subscribe rating for Long Term high-risk growth focused investor. ( 3–5 year horizon)\n\nFractal’s portfolio includes proprietary platforms and models such as Cogentiq (an agentic AI orchestration platform), Vaidya (a multimodal medical foundation model ecosystem), Kalaido.ai (a diffusion‑based generative image model), Pioneer (a multi‑agent system for software development and autonomous data science), and the Fathom family of reasoning and deep‑research models, alongside investments in ecosystem assets such as Qure.ai (AI for radiology) and Analytics Vidhya.\n\nThe global data, analytics and AI industry is undergoing a structural shift toward an AI-native, GenAI-led enterprise stack, with core AI services and platforms emerging as the fastest-growing layers of digital transformation spend.\n\nWithin this rapidly evolving landscape, Fractal Analytics is strategically positioned as a mission-critical, end-to-end enterprise AI partner, combining consulting, services, platforms and product businesses to help large global clients operationalize AI at scale across functions and industries.\n\nIt operates in a long-duration, secular growth market, with its total serviceable addressable market across AI services, platforms and software expected to expand from about US$85 billion in FY25 to around US$171 billion by FY30P, implying a robust mid-teens CAGR in line with, or above, broader DAAI growth.\n\nThis expansion is driven by accelerating GenAI adoption, rising demand for domain-specific AI, and the shift from pilot projects to scaled, production-grade AI and agentic systems embedded in core workflows, providing strong multi-year revenue visibility.\n\nFractal’s offerings are deeply integrated into client decision journeys and technology stacks, supported by high net revenue retention, long-standing relationships with marquee “must win” clients, and an increasing mix of recurring and product-linked revenues, resulting in high switching costs and improving earnings quality.\n\nWe recommend subscribing to the issue with a long-term investment horizon, as sustained execution on its IP- and platform-led strategy, deepening penetration within must-win clients, and powerful GenAI-led industry tailwinds could translate into meaningful value creation over time.\n\nWhile the emergence of Artificial General Intelligence (AGI) poses a long-term disruptive risk to traditional AI business models, Fractal’s dominant position in the analytics niche suggest a strong competitive strength and deep-rooted client trust. As the company continues to capitalize on the global demand for enterprise-grade AI, its ability to maintain high margins and operational leverage, we recommend a ‘SUBSCRIBE’ rating for long-term investors, said Lakshmishree Investment.\n\nFractal, in its RHP, said that it has experience in serving several large enterprises, including the majority of the “magnificent seven” companies (Alphabet, Amazon, Apple, Meta, Microsoft, Nvidia, and Tesla).\n\nFractal Analytics IPO was subscribed 1.45 times as of 1.15 pm, thanks to massive QIB demand. Other segments, however, remained undersubscribed.\n\nQIB quota was booked 2.27 times, QIB segment received 46% bids and the retail portion garnered 78% subscription.\n\nFractal Analytics operates in a niche segment of Data Analytics leveraging AI developed through in-house R&D and resources as well as on external models. It has a healthy presence across its 4 focus industries with top MNCs as its clients and an average tenure of 8+ years across the top 10 clients.\n\nAt the upper price band of  ₹900, the issue is valued at FY25 P/E multiple of 78.9x based on post-issue capital. This looks elevated given the relatively modest revenue growth (18% revenue CAGR between FY23-25 and 20% YoY growth in 1HFY26). Attrition rate for the company continues to be elevated (16.3% in FY25/15.7% in 1HFY26). Risks such as insourcing by clients especially with the advent of AI tools could lead to loss of clients and impact the company’s business model.\n\nConsidering the elevated valuation, we assign a NEUTRAL rating to the issue and would like to track the performance of the company for a few quarters post listing.\n\nThe company works with marquee clients such as Citibank, Costco, Franklin Templeton, Mars, Mondelez, Nationwide, Nestle, Phillips, etc., ensuring participation across its focus industries of CPGR, TMT, HLS, and BFSI. As of Sep’25, the company served 122 Must Win Clients (MWCs)and served its top 10 clients by revenue in 1HFY26 for an average of more than eight years.\n\nFractal Analytics IPO was subscribed 54% so far as QIB investors ramped up buying, with their quota booked 55%.\n\nFractal Analytics IPO subscribed 28% as of 12 pm. The QIB segment was booked 8% and the NII portion was subscribed 38%. The retail portion garnered 73% bids and the employee segment 27%.\n\nAs of 1HFY26/FY25, the company’s top 10 clients contributed 54.2%/53.8% to the total revenue from the Fractal.ai business segment. Thus, failure to maintain and expand relationships with its existing client base or add new clients, may impact the company’s business and financial performance.\n\nThe issue is priced at a P/BV of 7.76 based on its NAV of Rs. 116 as of September 30, 2025 and asking price is at a P/E of ~109.12x if we attribute FY26 annualized earnings. There are no listed peers to compare with as per the RHP. The issue is very aggressively priced.\n\nFractal Analytics offers investors an opportunity to contribute in a rapidly growing sector of DAAI services and generative AI that serves high-end consumer brands in India and globally but, Looking at all the factors, risks, opportunities and Elevated valuation, Investors with High-risk appetite can apply for Long term horizon.\n\nFractal Analytics IPO is a book build issue of  ₹2,833.9 crore, consisting of a fresh issue of 1.1 crore shares, aggregating to  ₹1,023.5 crore and an offer for sale of 2 crore shares aggregating to  ₹1,810.4 crore. The company plans to use the fresh funds raised for the following:\n\n1. Investment in Fractal USA for Debt Repayment –  ₹264.9 crore\n\n2. Purchase of Laptops –  ₹57.1 crore\n\n3. Setting-up New Office Premises in India –  ₹1,211 crore\n\n4. Investment in R&D and Sales & Marketing under Fractal Alpha –  ₹355.1 crore\n\n5. Inorganic Growth and General Corporate Purposes\n\nFractal Analytics IPO subscribed 22% as of 10.30 am. The QIB segment was booked 2% and the NII portion was subscribed 31%. The retail portion garnered 67% bids and the employee segment 23%.\n\nFractal is India’s first pure-play AI company to list, positioned as a Decision Intelligence player combining AI services with incubated SaaS products (Fractal Alpha). The company has seen a sharp turnaround, moving from a  ₹55 crore loss in FY24 to a  ₹221 crore profit in FY25 on the back of 26% revenue growth.\n\nAt the upper band of  ₹900, valuations look expensive at ~79x (post) FY25 P/E, but this reflects a scarcity premium for a listed AI platform. Best suited for high-risk, growth-focused investors with a 3–5 year view looking to ride the global GenAI cycle.\n\nFractal has built a diversified revenue profile. In FY25, revenue from the Fractal.ai segment stood at  ₹2,703.7 Cr, with CPGR contributing  ₹1,061.5 Cr, TMT  ₹808.7 Cr, HLS  ₹374.5 Cr, BFSI  ₹298.0 Cr, and other industries  ₹161.0 Cr.\n\nRevenue from operations grew from  ₹1,985.4 Cr in FY23 to  ₹2,196.3 Cr in FY24, and further to  ₹2,765.4 Cr in FY25, reflecting a 25.9% YoY growth. For the six months ended September 30, 2025, revenue stood at  ₹1,559.0 Cr, up 19.9% YoY.\n\nProfitability improved materially in FY25. EBITDA increased to  ₹398.0 Cr, with an EBITDA margin of 14.4%, compared to  ₹97.2 Cr and 4.4% in FY24. Adjusted EBITDA stood at  ₹482.1 Cr, with an adjusted EBITDA margin of 17.4%.\n\nProfit after tax (PAT) for FY25 was  ₹220.6 Cr, compared to a loss of  ₹54.7 Cr in FY24, with a PAT margin of 8.0%, while adjusted PAT stood at  ₹347.8 Cr, translating into an adjusted PAT margin of 12.6%.\n\nFractal Analytics IPO opened for the final day of bidding today at 10 am. Investors can place their bids till 5 pm today. Issue was booked 20% as of the second day.\n\nInvestors can apply for the IPO in multiples of 16 shares, requring a minimum investment of  ₹14,400.\n\nFractal Analytics IPO grey market premium (GMP) has slumped to  ₹7 today. This means that shares of Fractal Analytics IPO are trading at  ₹907 as against the offer price of  ₹900.\n\nAt the current levels, Fractal Analytics IPO listing pop could be less than 1% only.\n\nThe company is scheduled to list on the stock exchanges on February 16.\n\nFractal Analytics IPO received bids for 36,40,320 shares against 1,85,79,360 shares on offer, according to NSE data, resulting in 20% bids.\n\nThe category for retail individual investors (RIIs) fetched 60 per cent subscription, while the quota for non-institutional investors subscribed 27 per cent. The portion for qualified institutional buyers (QIBs) received a 2 per cent subscription.\n\nCatch all the Business News ,  Market News , Breaking News Events and Latest News  Updates on Live Mint. Download The Mint News App  to get Daily Market Updates."
    },
    {
        "title": "AmEx's Q4 Earnings Miss Isn't the Whole Story: Should You Buy or Sell?",
        "url": "https://finance.yahoo.com/news/amexs-q4-earnings-miss-isnt-170100959.html",
        "source": "Yahoo Finance",
        "date": "2026-02-11T19:19:00+00:00",
        "content": "American Express Company AXP, the global integrated payments leader, saw its shares climb 1.3% following the release of fourth-quarter 2025 results, even though earnings narrowly missed expectations. Investors appeared encouraged by strong customer engagement and resilient premium spending, which together reinforced confidence in the company’s long-term strategy.\n\nWhile macroeconomic headwinds pressure discretionary spending, AmEx’s affluent customer base remains remarkably resilient. Rising revolving loan balances, steady growth in card fees and sustained momentum in Card Member spending helped offset the earnings shortfall and elevated customer engagement and operating cost levels.\n\nThis premium positioning also helps insulate AmEx from potential political and regulatory pressures. President Donald Trump’s proposal to cap credit-card interest rates at 10% for one year could pose challenges for mass-market lenders, but its impact on AmEx is expected to be relatively muted.\n\nFor the fourth quarter of 2025, American Express reported earnings per share (EPS) of $3.53, missing the Zacks Consensus Estimate by a marginal 0.3%. However, earnings still rose 16% year over year, reflecting operating leverage and strong spending trends. Total revenues, net of interest expense, climbed 10% year over year to $19 billion, exceeding consensus estimates by 0.8%. For a detailed analysis, read our blog here.\n\nSegment-wise performance was mixed. U.S. Consumer Services segment’s pre-tax income reached $1.6 billion, up 0.3% year over year, though it fell short of the Zacks Consensus Estimate by 5.3%. The Global Merchant and Network Services segment’s pre-tax net income of $884 million increased 4% year over year but missed the consensus estimate of $1.1 billion.\n\nCommercial Services delivered a standout performance, with pre-tax income climbing 3% to $837 million, beating the estimate of $758.1 million. International Card Services posted a sharp turnaround, with pre-tax income surging to $316 million from just $34 million a year ago and beating the consensus mark of $274.9 million.\n\nAmerican Express projects 2026 revenues to increase between 9% and 10% from the 2025 level of $72.2 billion, while the Zacks Consensus Estimate indicates a 9% increase, followed by another 7.9% growth in 2027. Management expects 2026 EPS in the range of $17.30-$17.90, the midpoint of which indicates an improvement of 14.4% from the 2025 level of $15.38, while the Zacks Consensus Estimate is pegged at $17.51. The consensus mark for 2027 EPS signals 14.7% growth.\n\nAmEx beat earnings estimates thrice in the past four quarters and missed once, the average surprise being 3.9%.\n\nAmerican Express Company price-consensus-eps-surprise-chart | American Express Company Quote\n\nOver the past year, AXP shares have gained 17.3%, comfortably outperforming both the broader industry and the S&P 500. In contrast, competitors Visa Inc. V and Mastercard Incorporated MA posted declines of 6.5% and 4.3%, respectively.\n\nImage Source: Zacks Investment Research\n\nFollowing this run, AXP currently trades about 6.3% below its 52-week high of $387.49. The stock currently trades below the Wall Street average price target of $375.22, suggesting a modest 3.3% upside from current levels.\n\nAmerican Express trades at a forward P/E of 20.4X, above its five-year median of 17.3X and the industry average of 11.3X. While this suggests some valuation premium, it remains below Visa’s 24.4X and Mastercard’s 27.5X multiples, reflecting differences in business models and risk exposure.\n\nImage Source: Zacks Investment Research\n\nAmerican Express continues to differentiate itself through its integrated payments model, operating as both a card issuer and a network operator. This vertically integrated structure allows the company to capture a significantly larger share of transaction economics compared to peers, translating into superior revenue generation, margins and deeper customer relationships. By controlling the entire value chain, from card issuance and merchant acquisition to transaction processing and rewards, AmEx gains valuable data insights, enhances personalization and builds an ecosystem that reinforces long-term spending engagement.\n\nWhile this model exposes AmEx more directly to credit risk than pure-play networks, the company’s underwriting discipline and premium customer focus continue to support credit quality. Provision for credit losses increased just 1% year over year to $5.3 billion in 2025, signaling stable borrower behavior despite elevated interest rates and inflationary pressures. This reflects AmEx’s selective acquisition strategy, conservative risk management framework, and strong historical performance in navigating economic cycles without compromising asset quality.\n\nAmEx is also investing aggressively in building its future customer base by targeting affluent, experience-driven Gen Z and Millennial consumers. These younger cohorts exhibit high spending intensity, strong engagement with lifestyle and travel rewards, and improving income profiles, positioning them as long-duration revenue drivers. By onboarding high-quality customers early in their financial lifecycle, AmEx aims to cultivate sustained profitability through their peak earning years.\n\nFinancially, AmEx is on a solid footing. The company ended 2025 with $47.8 billion in cash and cash equivalents, up sharply from the prior year, providing ample flexibility to invest in growth, absorb macro volatility and return capital to shareholders. During the year, AmEx deployed $5.3 billion toward share repurchases and distributed $2.3 billion in dividends.\n\nOverall, American Express remains a high-quality franchise, supported by resilient premium spending, disciplined credit management and a strong balance sheet. Its integrated payments model, affluent customer base and long-term growth strategy continue to drive stable earnings visibility despite macro and regulatory uncertainties. However, with the stock trading at a valuation premium and near average price target, near-term upside appears limited. AXP currently carries a Zacks Rank #3 (Hold), suggesting investors may await a more attractive entry point.\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMastercard Incorporated (MA) : Free Stock Analysis Report\n\nVisa Inc. (V) : Free Stock Analysis Report\n\nAmerican Express Company (AXP) : Free Stock Analysis Report\n\nThis article originally published on Zacks Investment Research (zacks.com)."
    },
    {
        "title": "Is Wall Street Bullish or Bearish on Targa Resources Stock?",
        "url": "https://finance.yahoo.com/news/wall-street-bullish-bearish-targa-155526993.html",
        "source": "Yahoo Finance",
        "date": "2026-02-11T19:48:00+00:00",
        "content": "With a market cap of $46.6 billion, Targa Resources Corp. (TRGP) owns and operates a diversified portfolio of natural gas, natural gas liquids (NGL), and crude oil assets across North America. Through its Gathering and Processing and Logistics and Transportation segments, the company provides integrated services spanning production, storage, transportation, marketing, and resale of energy commodities.\n\nShares of the Houston, Texas-based company have lagged behind the broader market over the past 52 weeks. TRGP stock has risen 7.7% over this time frame, while the broader S&P 500 Index ($SPX) has rallied 14.9%. However, shares of the company are up 18.6% on a YTD basis, outpacing SPX's 1.8% gain.\n\n'If People in the Rest of the World Knew What I Know': MicroStrategy's Michael Saylor's Viral Message About MSTR Stock and Bitcoin to $10 Million\n\nMicrosoft is Bouncing Back from Its Post-Earnings Price Crash, But Watch This Before You Buy MSFT Stock\n\nMicroStrategy Is Now Down $4.5 Billion On Its $54 Billion Bitcoin Investment: What Does This Mean For Investors?\n\nMarkets move fast. Keep up by reading our FREE midday Barchart Brief newsletter for exclusive charts, analysis, and headlines.\n\nLooking closer, TRGP stock has also underperformed the State Street Energy Select Sector SPDR ETF's (XLE) 19.7% return over the past 52 weeks.\n\nShares of Targa Resources surged 5.3% on Nov. 5, 2025, after the company reported record Q3 2025 adjusted EBITDA of $1.27 billion, up 19% year-over-year, driven by record Permian, NGL transportation, and fractionation volumes. Investor sentiment was further boosted by Targa raising its full-year 2025 adjusted EBITDA outlook toward the top end of its $4.65 billion to $4.85 billion range and announcing multiple growth projects, including new 275 MMcf/d gas plants and major pipeline expansions in the Permian.\n\nFor the fiscal year that ended in December 2025, analysts expect TRGP's EPS to surge 45.8% year-over-year to $8.37. The company's earnings surprise history is mixed. It beat the consensus estimates in one of the last four quarters while missing on three other occasions.\n\nAmong the 22 analysts covering the stock, the consensus rating is a “Strong Buy.” That’s based on 18 “Strong Buy” ratings, one “Moderate Buy,” and three “Holds.”\n\nOn Jan. 28, Morgan Stanley raised its price target on Targa Resources to $266 and maintained an “Overweight” rating.\n\nAs of writing, the stock is trading above the mean price target of $210.91. The Street-high price target of $266 implies a potential upside of 21.5% from the current price levels.\n\nOn the date of publication, Sohini Mondal did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com"
    },
    {
        "title": "Unity Software Inc. (U) Surpasses Q4 Earnings and Revenue Estimates",
        "url": "https://finance.yahoo.com/news/unity-software-inc-u-surpasses-131501847.html",
        "source": "Yahoo Finance",
        "date": "2026-02-11T16:07:00+00:00",
        "content": "Unity Software Inc. (U) came out with quarterly earnings of $0.24 per share, beating the Zacks Consensus Estimate of $0.2 per share. This compares to a loss of $0.3 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of +20.00%. A quarter ago, it was expected that this company would post earnings of $0.17 per share when it actually produced earnings of $0.2, delivering a surprise of +17.65%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates three times.\n\nUnity Software, which belongs to the Zacks Internet - Software industry, posted revenues of $503.09 million for the quarter ended December 2025, surpassing the Zacks Consensus Estimate by 2.21%. This compares to year-ago revenues of $457.1 million. The company has topped consensus revenue estimates four times over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\nUnity Software shares have lost about 34.2% since the beginning of the year versus the S&P 500's gain of 1.4%.\n\nWhile Unity Software has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nAhead of this earnings release, the estimate revisions trend for Unity Software was mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and the current fiscal year change in the days ahead. The current consensus EPS estimate is $0.22 on $494.38 million in revenues for the coming quarter and $0.93 on $2.1 billion in revenues for the current fiscal year.\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Internet - Software is currently in the bottom 44% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nOne other stock from the same industry, Flywire (FLYW), is yet to report results for the quarter ended December 2025. The results are expected to be released on February 24.\n\nThis payments company is expected to post quarterly loss of $0.01 per share in its upcoming report, which represents a year-over-year change of +91.7%. The consensus EPS estimate for the quarter has been revised 34.7% lower over the last 30 days to the current level.\n\nFlywire's revenues are expected to be $143.83 million, up 27.5% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nUnity Software Inc. (U) : Free Stock Analysis Report\n\nFlywire Corporation (FLYW) : Free Stock Analysis Report\n\nThis article originally published on Zacks Investment Research (zacks.com)."
    },
    {
        "title": "Freshworks Q4 Earnings Call Highlights",
        "url": "https://finance.yahoo.com/news/freshworks-q4-earnings-call-highlights-002925923.html",
        "source": "Yahoo Finance",
        "date": "2026-02-11T00:53:00+00:00",
        "content": "Historic profitability and cash generation: Freshworks delivered full-year profitability for the first time with Q4 non-GAAP operating income of $41.6 million (~19% margin) and record free cash flow of over $223 million for the year.\n\nARR momentum with EX leadership: Total ARR reached $907 million (up 18% YoY), with Employee Experience (EX) surpassing $510 million ARR (26% growth) while CX lags at $395 million as management focuses on platform unification and product simplification.\n\nFreddy AI is a growing revenue driver: Freddy AI now has 8,000+ customers and >$25 million ARR, with strong usage and retention metrics, a price increase to $0.50 per interaction, and a target of $100 million in AI-driven ARR by 2028.\n\nInterested in Freshworks Inc.? Here are five stocks we like better.\n\nCRM Stocks Are Hot in 2024 — Should You Hold for 2025 Gains?\n\nFreshworks (NASDAQ:FRSH) executives said the company reached a “historic inflection point” in fiscal 2025, delivering full-year profitability for the first time and record free cash flow, while maintaining what management described as strong momentum in its employee experience (EX) business and continued progress stabilizing customer experience (CX).\n\nFor the fourth quarter, Freshworks reported revenue of $222.7 million, up 14% year over year as reported (13% in constant currency). The company said Q4 results came in above its expectations, marking the fifth consecutive quarter it outperformed internal estimates across growth and profitability metrics. Professional services revenue was $2.5 million, which management attributed to strong bookings and earlier-than-expected project kickoffs and milestone achievement.\n\n→ Once Upon A Farm: Buy the $1B Growth Story?\n\nFreshworks Stock Soars 50% – Is This the Perfect Entry Point?\n\nOn profitability, Freshworks posted non-GAAP operating income of $41.6 million, translating to a non-GAAP operating margin of nearly 19%. Non-GAAP gross margin was 86.8%; the company noted this included a $1.5 million credit from its AWS contract, and that gross margin excluding the credit was in line with prior quarters.\n\nFreshworks reported GAAP net income of $191.4 million for Q4. The company emphasized that GAAP net income benefited from two one-time items: a $41.1 million favorable impact from a reduction in fiscal 2025 stock-based compensation related to its executive chairman’s departure, and a $151.7 million one-time income tax benefit from releasing a valuation allowance on U.S. deferred tax assets due to improved profitability. Management said there was no cash impact from these one-time benefits and that they were excluded from non-GAAP results.\n\n→ 3 ETFs Designed to Survive the Next Market Crash\n\nTop 2 CRM Stocks Positioned to Surge Higher With AI in 2025\n\nFree cash flow in Q4 was $56.2 million, ahead of expectations due to strong cash collections and “disciplined execution,” resulting in a 25% free cash flow margin. For the full year, Freshworks said free cash flow was over $223 million (27% margin), improving from negative free cash flow in 2022.\n\nFreshworks ended 2025 with $907 million in annual recurring revenue (ARR), which management said was up 18% year over year as reported (over 14% in constant currency). EX reached $510 million in ARR, growing 26% as reported (22% constant currency), surpassing the $500 million milestone. CX ended the year at $395 million in ARR, growing 9% as reported (5% constant currency).\n\n→ Verizon: Your Total Return Leader for 2026 Might Be Hiding in Plain Sight\n\nCEO Dennis Woodside said Freshworks is evolving Freshservice into a unified service platform, highlighting the combination of IT service management (ITSM), IT operations management (ITOM), IT asset management (ITAM), and enterprise service management (ESM). Woodside pointed to examples of larger deals and competitive displacements, including a “global semiconductor company” that moved off a long-standing ServiceNow environment and projected cost savings and faster resolution times using Freddy AI.\n\nOn CX, management said it has been working to “bring stabilization” by simplifying the core Freshdesk product experience and improving time-to-value and retention. In the Q&A, executives said they launched a unified CX platform in Q4 that combines conversational and ticketing capabilities, and are now upgrading customers to that platform to enable a single code base for faster innovation. They also noted Q4 CX growth lapped a prior-year “Free to Paid” initiative, which affected year-over-year comparisons.\n\nDevice42 ended 2025 with over $40 million in ARR, which management said reflected new deals and expansion, including cross-sell from the Freshservice base. In Q4, the company recorded a 30% attach rate of Device42 within its top 50 new EX deals, including its three largest deals of the quarter. Management also said it expects to launch an initial cloud offering for Device42 at the beginning of Q2 2026, noting that sales to date have primarily been on-prem.\n\nESM, branded as Freshservice for Business Teams, exceeded $40 million in ARR in Q4 and “nearly doubled” year over year, according to management. Woodside said one in four eligible Freshservice customers now uses the product for non-IT needs and reiterated a target for both ITAM and ESM to exceed $100 million in ARR.\n\nThe company also highlighted its acquisition of FireHydrant, which closed Jan. 1, 2026. Freshworks described FireHydrant as an AI-powered IT incident management and response platform that adds ITOM capabilities and “sets the groundwork” for expansion into AIOps. CFO Tyler Sloat said FireHydrant is expected to have an immaterial impact on revenue growth in Q1 and full-year 2026, but to create roughly a one-point headwind to non-GAAP operating margin in those periods.\n\nFreshworks said more than 8,000 customers are now using Freddy AI. Management reported that Freddy AI ended 2025 with over $25 million in ARR and is targeting $100 million in AI-driven ARR by 2028. Woodside said Freddy AI is “not just a feature” but a standalone revenue line, citing customer examples and operational outcomes discussed on the call.\n\nKey AI metrics shared by management included:\n\nFreddy AI Agent conversations: up more than 80% to 3.5 million in Q4 within CX.\n\nTicket deflection: Freddy AI Agent deflected more than 50% of tickets for CX and EX customers.\n\nFreddy Insights adoption: since general availability to EX customers in June 2025, 1,000 customers have adopted and are active.\n\nAttach and retention: in customers with more than $30,000 ARR, Freddy AI Copilot attach rates were over 50%, and net dollar retention for Copilot customers improved to 116% in Q4 from 112% the prior quarter.\n\nWoodside also discussed pricing changes for agentic AI, stating the company increased pricing to $0.50 per interaction from $0.10 per interaction and expects the change to begin flowing through ARR as adoption scales. Executives said AI attach is now core to the sales motion, particularly in larger deals.\n\nFor Q1 2026, Freshworks guided revenue of $222 million to $225 million (13% to 15% year-over-year growth), non-GAAP operating income of $33 million to $35 million, and non-GAAP EPS of $0.10 to $0.12, assuming about 287.4 million weighted average shares outstanding.\n\nFor full-year 2026, guidance called for revenue of $952 million to $960 million (about 13.5% to 14.5% growth), non-GAAP operating income of $181 million to $189 million, and non-GAAP EPS of $0.55 to $0.57, assuming about 291.5 million weighted average shares outstanding. Sloat said the company is adopting a long-term projected tax rate of 24% for non-GAAP modeling.\n\nManagement said it increased fiscal 2026 revenue growth expectations from its Investor Day outlook, citing strength “particularly in EX,” and expects revenue growth to accelerate in the second half of 2026. Freshworks also forecast free cash flow of about $55 million for Q1 2026 and approximately $250 million for full-year 2026.\n\nNet dollar retention was 108% as reported (104% constant currency) in Q4, including a roughly 70-basis-point headwind from Device42. The company said it expects constant-currency net dollar retention to improve to approximately 105% in Q1 2026, driven by EX momentum and mix shift.\n\nFreshworks, Inc is a global provider of cloud-based customer engagement software designed to help businesses streamline customer support, sales, marketing, and IT service operations. The company's integrated suite of solutions enables organizations of all sizes to deliver seamless experiences across multiple channels, including email, chat, phone, and social media. Freshworks' platform is built on modern, user-friendly interfaces and offers native automation, AI-powered insights, and analytics to improve efficiency and customer satisfaction.\n\nThe company's flagship product, Freshdesk, serves as a helpdesk solution for customer support teams, while Freshservice addresses IT service management needs.\n\nThe article \"Freshworks Q4 Earnings Call Highlights\" was originally published by MarketBeat."
    }
]