[
    {
        "title": "Apple Stock Looked Like It Was Rolling. Now It's on the Back Foot Again",
        "url": "https://www.investopedia.com/apple-stock-looked-like-it-was-rolling-now-it-s-on-the-back-foot-again-aapl-11906277",
        "source": "Investopedia",
        "date": "2026-02-13T16:53:00+00:00",
        "content": "Jakub Porzycki / NurPhoto via Getty Images\n\nApple (AAPL) stock is in the red again.\n\nThe tech giant's shares slumped 5% yesterday after the Federal Trade Commission said it had sent a warning letter to the company over its Apple News service, adding to pressure felt after reports Wednesday that the company was once again delaying the release of some AI-powered Siri features. That added to persistent concerns the iPhone maker’s AI capabilities lag its peers.\n\nThe shares slipped again early Friday, recently falling nearly 1%. Read Investopedia's full coverage of today's trading here.\n\nTech stocks have been the driving force behind a stock market rally that began with the release of ChatGPT in late 2022. Because of tech's weight in stock indexes, recent headwinds for the sector, including concerns about AI spending and stretched valuations, have been a drag on the broader market.\n\nApple and its Magnificent Seven peers are having a rough 2026, with the Roundhill Magnificent Seven ETF (MAGS) in the red and underperforming the S&P 500 so far this year.\n\nShares of hyperscalers Alphabet (GOOG, GOOGL), Microsoft (MSFT), Amazon (AMZN) and Meta (META) have been weighed down by concerns that they are overspending on AI infrastructure. Their massive data center spending has historically been a boon to chipmaker Nvidia (NVDA), but even that stock is treading water amid anxiety about tech sector valuations.\n\nBefore this week’s setbacks, Apple stock appeared to have turned a corner. Apple announced in mid-January that it had selected Alphabet’s (GOOG) Gemini to power its future AI features, including the updated Siri features that are reportedly delayed. Weeks later, Apple reported record results for the all-important holiday quarter, when iPhone and services revenue easily beat estimates.\n\nApple shares rose nearly 8% in the week following that earnings report, lifting the stock into the green for the year. Thursday’s slump erased most of those post-earnings gains."
    },
    {
        "title": "Here's Why Apple's Stock Dropped 5% Today",
        "url": "https://www.investopedia.com/here-s-why-apple-s-stock-dropped-5-today-aapl-11906036",
        "source": "Investopedia",
        "date": "2026-02-12T23:48:00+00:00",
        "content": "Ludovic MARIN / AFP / Getty Images\n\nIt was a rough day for Apple.\n\nShares of the tech giant and Magnificent Seven stock slumped 5% Thursday, the stock's worst session since April, on what was already a rough day for tech shares. The drop followed a string of bad news, as the company's news app drew the ire of federal regulators and reports emerged that its latest AI efforts could face delays.\n\nThe Trump administration hasn't been shy about engaging with U.S. companies—even some of the country's biggest and most valuable—in support of policy goals. Apple today caught the government's eye, leaving unanswered questions that led to a decrease in its value.\n\nThe Federal Trade Commission on Thursday said it sent a letter to Apple (AAPL) CEO Tim Cook about the company's Apple News app, warning it could violate the law if found to be misrepresenting its terms of service and accusing it of systemically favoring \"left-wing\" news outlets over conservative ones.\n\nThe development raised worries that the company's relationship with the Trump administration could be fraying. The iPhone maker made inroads last year with its investments in U.S. manufacturing.\n\nBloomberg, meanwhile, reported Wednesday that an AI-enhanced Siri upgrade has been delayed, adding to concerns the iPhone maker has lagged peers with its AI efforts. Apple could not be reached for comment in time for publication.\n\nThursday's losses erased much of Apple gains in the last few weeks, after the iPhone maker posted  record revenue for the holiday quarter, driven by strong iPhone and services revenue. Apple's shares are in the red for 2026 so far.\n\nFederal Trade Commission. “Federal Trade Commission Chairman Andrew N. Ferguson Issues Warning Letter to Apple CEO Tim Cook.”\n\nBusiness Insider. “Tim Cook's political tightrope is fraying.”\n\nBloomberg. “Apple’s Latest Attempt to Launch New Siri Runs Into Snags.”"
    },
    {
        "title": "CXT Q4 Deep Dive: Currency Demand, Authentication Advances, and Margin Pressures Shape Outlook",
        "url": "https://finance.yahoo.com/news/cxt-q4-deep-dive-currency-161051234.html",
        "source": "Yahoo Finance",
        "date": "2026-02-12T23:30:00+00:00",
        "content": "Payment technology company Crane NXT (NYSE:CXT) reported revenue ahead of Wall Street’s expectations in Q4 CY2025, with sales up 19.5% year on year to $476.9 million. Its non-GAAP profit of $1.27 per share was 1% above analysts’ consensus estimates.\n\nIs now the time to buy CXT? Find out in our full research report (it’s free).\n\nRevenue: $476.9 million vs analyst estimates of $452.3 million (19.5% year-on-year growth, 5.5% beat)\n\nAdjusted EPS: $1.27 vs analyst estimates of $1.26 (1% beat)\n\nAdjusted EBITDA: $121.3 million vs analyst estimates of $119.8 million (25.4% margin, 1.3% beat)\n\nAdjusted EPS guidance for the upcoming financial year 2026 is $4.25 at the midpoint, missing analyst estimates by 5.5%\n\nOperating Margin: 16.7%, down from 17.7% in the same quarter last year\n\nBacklog: $492.8 million at quarter end, up 25% year on year\n\nMarket Capitalization: $2.97 billion\n\nCrane NXT’s fourth quarter performance was marked by robust revenue growth and operational execution, with sales expanding nearly 20% year over year and non-GAAP earnings modestly ahead of Wall Street expectations. Management attributed this growth to strong demand for its currency business, especially international micro-optics solutions, and new wins in authentication technology. CEO Aaron Saak highlighted, “We ended 2025 with a total of 20 new currency denomination wins specifying our micro-optics technology,” underscoring momentum in the company’s strategic segments. Despite these positives, adjusted operating margin declined due to higher costs supporting increased international demand and unfavorable foreign exchange impacts.\n\nLooking ahead, Crane NXT’s guidance for the coming year centers on sustained growth in its currency and authentication segments, but management acknowledged margin headwinds from ongoing investments and tariff-related softness in certain end markets. The company expects a back-end loaded year, with much of the growth weighted to the latter half as the launch of the new U.S. $10 bill and expanded capacity come online. CFO Christina Cristiano emphasized a balanced outlook, stating, “Our range of $4.10 to $4.40 [EPS] reflects continued strength in currency and sales in authentication… and softness in CPI driven mostly by the hardware businesses and vending, which continues to experience softness as a result of the tariff.”\n\nManagement attributed the quarter’s performance to accelerating demand for international currency solutions, operational investments to support volume, and expanded authentication contracts.\n\nInternational currency demand surge: The company saw significant demand for its micro-optics currency technology, surpassing its annual targets with 20 new denomination wins, including a notable contract with Fiji. This momentum was driven by rising concerns about counterfeiting, particularly in emerging markets, and an industry-wide acceleration in currency redesign cycles.\n\nAuthentication technology contracts: Crane NXT secured multi-year contracts with leading sports leagues, such as the NFL and Major League Baseball, to provide authentication and brand protection services. These agreements are expected to generate recurring, sticky revenue and expand the company’s presence in high-profile consumer markets.\n\nCapacity and productivity investments: To address growing demand, the company increased staffing and transitioned key facilities to 24/7 operations, specifically in its micro-optics and banknote printing segments. Additional investments in design and production capabilities are underway, with a plant expansion in Malta enhancing both capacity and geographic reach.\n\nSynergy realization from acquisitions: The integration of De La Rue Authentication and OPSX Security into Crane Authentication yielded operational synergies ahead of schedule, supporting margin accretion in the authentication business despite acquisition-related costs and integration expenses.\n\nMargin pressures from costs and FX: Despite strong top-line growth, margins were impacted by higher operating costs, including increased freight, third-party substrate procurement, and unfavorable foreign exchange rates affecting international production. Management noted that these costs are expected to decline as internal productivity programs take effect.\n\nManagement’s 2026 outlook is shaped by continued momentum in currency and authentication, ongoing cost pressures, and a cautious stance on segments impacted by tariffs.\n\nNew U.S. currency rollout timing: The upcoming launch of the redesigned $10 bill is expected to impact results primarily in the second half of the year. Management is closely coordinating with the U.S. Treasury to ensure inventory and production readiness, and the timing of government announcements will influence the revenue ramp.\n\nSustained international currency growth: Growth in international currency is underpinned by increased counterfeiting, economic expansion in emerging markets, and faster currency redesign cycles. Management believes these trends are durable, but notes that a tough year-over-year comparison in the latter half of 2026 could moderate headline growth rates.\n\nTariff-related headwinds in vending and hardware: The CPI segment, which includes payment technology for vending and gaming, continues to face order delays and softness due to tariff-driven price increases. Management expects these challenges to persist in the near term, with some improvement in the second half of the year as comps become more favorable.\n\nIn the coming quarters, StockStory analysts will track (1) the execution timing and revenue impact of the new U.S. $10 bill launch, (2) the ramp-up and productivity of new and expanded micro-optics and banknote printing operations, and (3) recurring revenue growth from recent authentication technology contracts. Additionally, the progress of the Antares Vision acquisition and integration will be a key focus for assessing longer-term growth and diversification.\n\nCrane NXT currently trades at $51.22, in line with $51.69 just before the earnings. At this price, is it a buy or sell? The answer lies in our full research report (it’s free for active Edge members).\n\nThe market’s up big this year - but there’s a catch. Just 4 stocks account for half the S&P 500’s entire gain. That kind of concentration makes investors nervous, and for good reason. While everyone piles into the same crowded names, smart investors are hunting quality where no one’s looking - and paying a fraction of the price. Check out the high-quality names we’ve flagged in our Top 6 Stocks for this week. This is a curated list of our High Quality stocks that have generated a market-beating return of 244% over the last five years (as of June 30, 2025).\n\nStocks that have made our list include now familiar names such as Nvidia (+1,326% between June 2020 and June 2025) as well as under-the-radar businesses like the once-small-cap company Comfort Systems (+782% five-year return). Find your next big winner with StockStory today."
    },
    {
        "title": "Bright Horizons (BFAM) Q4 2025 Earnings Transcript",
        "url": "https://finance.yahoo.com/news/bright-horizons-bfam-q4-2025-233303965.html",
        "source": "Yahoo Finance",
        "date": "2026-02-13T00:04:00+00:00",
        "content": "Thursday, Feb. 12, 2026 at 5 p.m. ET\n\nChief Executive Officer — Stephen Kramer\n\nChief Financial Officer — Elizabeth J. Boland\n\nChief Operating Officer — Michael Flanagan\n\nNeed a quote from a Motley Fool analyst? Email pr@fool.com\n\nStephen will start by reviewing our results and provide an update on the business. Elizabeth will follow with a more detailed review of the numbers before we open it up to your questions. With that, let me turn the call over to Stephen.\n\nStephen Kramer: Thanks, Mike, and good evening to everyone on the call. I am pleased to report a strong finish to 2025, closing out a year of solid growth and continued progress across the business. In the fourth quarter, revenue increased 9% to $734 million and adjusted EPS increased 17% to $1.15, both ahead of our expectations. For the full year, we delivered revenue of $2,930 million, up 9% over the prior\n\nElizabeth J. Boland: prior year and adjusted EPS of $4.55, representing 31% growth year over year. These results exceeded the expectation shared at the beginning of the year and highlight the continued evolution of Bright Horizons Family Solutions Inc. into a diversified, integrated solutions provider of employer-sponsored education and care. The improvements in our business mix throughout 2025, combined with our growing impact on families and employers, reinforce our confidence in the durability of our model and long-term opportunity for growth. Let me now walk through the segments. First, Backup Care again delivered strong growth and earnings contribution in Q4, as it has done over the course of 2025.\n\nIn Q4, revenue increased 17% to $183 million, driven by solid utilization across center-based, in-home, and school-age programs. Utilization during the quarter reflected a combination of unplanned care when regular arrangements were disrupted, along with more predictable care needs such as scheduled school breaks and holiday coverage. For the full year, Backup Care revenue grew 19% to $728 million and sustained strong operating margins. Our service reach spans more than 1,100 employer clients and millions of eligible employees globally.\n\nImportantly, our existing clients had double-digit growth in backup users, even as their eligible populations remain relatively flat, meaning growth was driven by deeper penetration into the eligible population, underscoring the value of the benefit to an increasing number of working families. Looking forward, our focus remains on scaling the backup business by expanding unique users within existing clients, increasing frequency of use among those utilizing care, continuing to retain and add new employer clients. This growth relied upon an unmatched delivery model that combined owned capacity across our full-service centers and backup operations alongside a broad third-party provider network.\n\nWith still well less than 10% penetration within existing clients, we have a significant opportunity to further expand active user adoption and utilization through targeted marketing, expanded capacity across use types, and our One Bright Horizons initiatives to increase awareness across our services. We remain confident that Backup Care will continue to be a durable source of growth and earnings while also strengthening broader employer partnerships across Bright Horizons Family Solutions Inc. services. Turning to Full Service, revenue increased 6% in the fourth quarter to $515 million, with growth driven by a combination of tuition increases and enrollment growth, tempered by our continued portfolio rationalization.\n\nWe added six new centers this quarter, including four client centers, three of which were transitions of management for Stormont Vail Health and Cone Health. These additions extend our leadership in employer-sponsored child care and reaffirm the critical role on-site care plays in supporting working families and their employers. Enrollment in centers open for more than one year increased approximately 1% in the fourth quarter, and occupancy averaged in the mid-60% range, broadly consistent with seasonal patterns we typically see in the back half of the year. Underlying enrollment dynamics remain similar to what we saw throughout 2025, with solid demand in many geographies, countered by more muted enrollment growth levels in some of our more challenged areas.\n\nStephen Kramer: We are pleased to see continued progress\n\nElizabeth J. Boland: particularly in our lower-occupancy cohort, where centers operating below 40% occupancy declined from 16% to 12% of the portfolio in the fourth quarter year on year. Specifically in the UK, our Full Service business continued to make progress and delivered positive operating profit for the year, a significant milestone post-pandemic and a meaningful turnaround from the $30 million of annual losses we absorbed just two years ago. This progress reflects higher occupancy, more consistent staffing, and improved affordability for families aided by expanded government supports. Looking ahead, our focus remains on serving families where they work and live, continuing to invest in the quality of our services, and strengthening the long-term economics of our portfolio.\n\nWe will continue to operate in locations that are important to our client partners, are strategic in delivering Backup Care, and in areas with strong supply-demand dynamics. At the same time, we will continue to rationalize locations where these characteristics are not present. Turning to Ed Advisory, revenue increased 10% to $36 million in the quarter, and for the full year grew 9% to $125 million, both ahead of our initial expectations. College Coach led the growth in margin performance as more families engage with our college counseling services, while EdAssist also continued to expand its participant base. During the quarter, we added new employer clients to the portfolio, launches with Samsung, Estée Lauder, and Becton Dickinson, among others.\n\nBefore I turn it over to Elizabeth, I want to take a moment to recognize an important milestone. 2026 marks the 40th anniversary of Bright Horizons Family Solutions Inc. When our founders launched the company in 1986, they believed employers could play a meaningful role in supporting working families, and that doing so would benefit children, parents, and employers alike. Over four decades, Bright Horizons Family Solutions Inc. has developed thoughtfully alongside changes in the workforce, employer priorities, and the needs of working families.\n\nCentral to that evolution has been the development of our Backup Care business and the expansion of our services to support families and employees across life and career stages, broadening our impact to a much wider population. That progression reflects our ability to listen to clients, adapt to changing needs, and invest in ways to maximize impact, all while remaining grounded in our mission to support children, families, and employers. We are proud of what this organization has built over four decades, deeply grateful to our employees whose dedication makes it possible, and appreciative of our client partners and customers who place their trust in us.\n\nIn closing, 2025 was a year of solid financial performance and meaningful progress across many dimensions of our business. We grew revenue 9%, expanded adjusted operating margins 200 basis points, and delivered 30% earnings growth. We strengthened our balance sheet, repurchased $225 million of shares, and positioned the company for long-term success. As we look ahead to 2026, we are optimistic about the opportunities in front of us and look to build on the momentum we saw in 2025. Elizabeth will walk through the guidance in more detail, but at a high level, we expect revenue to be in the range of $3,075,000,000 to $3,125,000,000 and adjusted EPS to be in the range of $4.90 to $5.10 per share.\n\nWith that, I will turn the call over to Elizabeth. Thanks, Stephen, and hello to everyone who has joined the call tonight.\n\nElizabeth J. Boland: I will start with our financial highlights. Revenue in the fourth quarter was $734 million, representing 9% growth year over year and modestly ahead of our expectations.\n\nElizabeth J. Boland: The quarter reflected solid execution across the business with continued strength in Backup Care and steady performance in Full Service and Ed Advisory. Adjusted operating income rose 14% to $91 million, with operating margins up roughly 60 basis points over the prior year to 12.3%. Adjusted EBITDA increased 12% to $123 million, representing an adjusted EBITDA margin of 17%. And lastly, adjusted EPS of $1.15 per share, ahead of our expectations, grew 17% over the prior year. Breaking this down into the segment results, Backup Care revenue grew 17% in the fourth quarter to $183 million, driven by solid demand over the fall and holiday season.\n\nAs Stephen mentioned, utilization continues to be driven by both predictable and planned needs, as well as unexpected care disruptions. Operating margins remained strong in the quarter at 32%, in line with our expectations for the higher volume of care that we deliver in the second half of the year, while also reflecting our disciplined expense management and a favorable mix of utilization. Full Service revenue of $515 million was up 6% in Q4, mainly on pricing increases, modest enrollment gains, and an approximate 175-basis-point tailwind from foreign exchange. Centers we have closed as part of our portfolio rationalization since 2024 partially offset these gains, representing an approximate 200-basis-point headwind.\n\nEnrollment in our centers open for more than one year increased approximately 1%, and occupancy levels across our portfolio averaged in the mid-60s for Q4. In the specific center cohorts we have discussed on prior calls, continued to show improvement over the prior year period. Our top-performing cohort, centers above 70% occupied, improved from 39% of those centers in Q4 of 2024 to 40% of centers in 2025. And as Stephen commented, our bottom cohort of centers, those sub-40% occupied, improved from 16% in the prior year period to 12% of the total population this past quarter.\n\nAdjusted operating income of $20 million in the Full Service segment increased roughly 45 basis points to 4%, up $3 million over the prior year. Higher enrollment and improved operating leverage, particularly in our U.S. and UK operations, helped drive the growth in earnings, while higher benefits costs partially offset some of these advances. Lastly, our revenue in Ed Advisory increased 10% over the prior year to $36 million, with operating margins of 30%, consistent with 2024. Net interest expense ticked up to $12 million in 4Q 2025, also consistent with the prior year quarter, and totaled $45 million for the full year.\n\nOur non-GAAP effective tax rate was 26.4% in the fourth quarter, bringing the effective rate for the full year to 27%. Turning to the balance sheet and cash flow. For the full year 2025, we generated $351 million in cash from operations compared to $337 million in 2024. Capital investments totaled $91 million in 2025, as compared to $95 million in the prior year. And with the continued cash build, specifically free cash flow generated in Q4, we repurchased $225 million of stock in 2025, including roughly $120 million in the fourth quarter. We ended the year with $140 million of cash and a leverage ratio of roughly 1.7 times net debt to adjusted EBITDA.\n\nMoving on to our 2026 outlook. In terms of the top line, we currently expect 2026 revenue to be in the range of $3,075,000,000 to $3,125,000,000, or growth of 5% to 6.5%. Looking at this at a segment level, in Full Service, we expect reported revenue to grow in the range of 3.5% to 4.5% on enrollment gains and tuition increases, offset by approximately 200 basis points in headwind from net center closings. In Backup Care, we expect reported revenue to increase 11% to 13% driven by the continued expansion of use, and in Ed Advisory, we expect to grow in the mid-single digits.\n\nIn terms of earnings, we expect 2026 adjusted EPS to be in the range of $4.90 to $5.10 a share. As we look specifically at Q1 2026, our outlook is for total top line growth in the range of 6% to 7.5%. The segment breakdown would be Full Service reported revenue growth of 5.5% to 6.5%, Backup Care of 11% to 13%, and Ed Advisory in the low to mid-single digits. In terms of earnings, we expect Q1 adjusted EPS to be in the range of $0.75 to $0.80 a share. So with that, Paul, we are ready to go to Q&A.\n\nOperator: Thank you. We will now be conducting a question-and-answer session.\n\nOperator: Our first question is from Jeffrey P. Meuler with Baird. Yes. Thank you. Can you help us with how you are thinking about the Full Service margin outlook, including as you close these centers that are\n\nStephen Kramer: 200-basis-point revenue headwind,\n\nStephen Kramer: at a loss? Or just how should we factor in the different drivers of Full Service margin outlook?\n\nElizabeth J. Boland: Yes. Thanks, Jeff. So as we look at 2026, we had, obviously, good performance this year and are building off of where we ended 2025 and into 2026. We mentioned a couple of things in the prepared remarks, including, you know, about 100 basis points of enrollment gain in the year. That will contribute some continued performance in our UK business, which had certainly a strong year in 2025, and that velocity will be, you know, continues to grow, but it will be expanding at a little bit lower pace than it was able to this year. So we are looking overall at about 25 to 50 basis points of margin improvement in the Full Service business in 2026.\n\nThat captures some effect of these closures, as you are highlighting. Most of them are in a loss-making position, yes, because that is the reason for underperformance leading to a closure decision. There is some tail to those costs even as the center ceases, if we are running dark and/or not able to fully exit the lease or are not paying off multiple years of lease expense in advance. So we are having some ongoing effect of that, but it does add modestly to the operating leverage as we are exiting these underperforming centers. But overall, Full Service, 25 to 50 bps.\n\nOperator: Got it. And then just\n\nStephen Kramer: given the headlines and news stories, can you just comment on health and safety protocols, any changes that you are making or considering, and then just how you think about any sort of, like, local market or licensing risks or private-public partnership for UPK opportunities that could be impacted from those issues. Thank you. Sure. Thank you for the question.\n\nOperator: Jeff. As you will know and\n\nStephen Kramer: those who we interact with know, our number one priority continues to always be delivering high-quality care and education for families and ultimately for the clients that we serve. You know, when we have any incident at a center, we take it incredibly seriously. What I would say is that enrolled families at other centers tend to focus on the experience that they are having at their individual center and the relationships that we enjoy with our clients. We focus on transparency and also strong communication so that we can express to them exactly what has occurred and then ultimately the actions that we are taking to make ourselves even stronger going forward.\n\nSo overall, to be very direct with you, you know, we continue to see strong retention of families in our centers. We continue to see stability in our client base. And so overall, while we take these incidents very seriously, you know, from a business impact perspective, I would say at this point, our view is that is not the case. You referenced the relationships that we may have with UPK, so for example, in New York City in particular, and what I would say is that we enjoy contracts in the majority of our centers for UPK.\n\nWe have received feedback from the regulator, having visited almost all of our UPK centers, you know, in recent months, that we continue to perform at a high level. There is never a guarantee that contracts will ultimately be renewed over time. On the other hand, we feel confident in our position at this point within the New York City market and our ability to continue to deliver for the large number of families that we do. That is all perspective. Thank you.\n\nOperator: Thank you. Our next question is from Manav Patnaik with Barclays.\n\nManav Patnaik: Thank you. Elizabeth, maybe just firstly on the guide, if you could help us with\n\nKeen Fai Tong: you know, the assumption on pricing and enrollment growth in the Full Service business. And then also just, if you want to just knock out the margins for the other businesses in Q1 and the full year.\n\nElizabeth J. Boland: Sure. So overall, we are looking at price increases, which would vary, as I am sure most on the call know. We make individual localized decisions on this. But on average, the price increases for 2026 are approximately 4%. And we are looking at overall enrollment for the year plus 100 basis points, give or take. So the two of those, those are the two primary components there. The price increase reflects what we see in the wage, you know, offsetting around the 3% or so range against that 4% for wages. As it relates to the overall margin in the other businesses, so Backup, we would be looking at our long-term average.\n\nJust to reiterate that, we would expect to be 25% to 30% operating margin over time. We certainly have been performing well against that, and we would look in 2026, we would look to be seeing that in the upper half of that range, so call it 27%, 28% to 30% for the year. So that is what we are seeing in Backup Care. And then in our Ed Advisory business, you know, similar to this year, overall in the low twenties.\n\nKeen Fai Tong: Got it. And maybe just, you know, back to New York City, I guess, you know, with the new mayor and the free childcare proposals and stuff. I wanted to just get your take, you know, if you have spoken to the administration, you are involved in there, you know, just some color on what your New York City exposure is. I know in the past with pre-K and those kinds of things, you benefit from wraparound care, but I am not sure what these proposals look like.\n\nStephen Kramer: as I shared, we, at the majority of the centers that we have in New York City proper, we participate in UPK. And that is a good relationship with the city in terms of a good demonstration of the power of private-public partnerships. It is an environment where, you know, the city funds at a level that supports quality and, likewise, is an environment that is open to working with private providers like us. So New York City has been, in our opinion, a really good example of where UPK can work well both for the city, but also for Bright Horizons Family Solutions Inc. and the families that we serve.\n\nThe expectation going forward is there have been conversations about moving to younger age groups, so the twos, so 2K. And there is an indication that it would likely look similar to the UPK program that is in place, only for younger age groups. The expectation also is they are going to be starting with a pilot that is focused on the neediest areas of the city and then potentially expand in the way they did previously to much broader aspects of the city.\n\nIn terms of the relationship, yes, I think we, as one of the largest providers in New York City of UPK, we certainly have a good and ongoing relationship with the folks that manage those programs and continue to feel like we have a good sense of how this may unfold over time.\n\nOperator: Our next question is from Andrew Charles Steinerman with JPMorgan.\n\nKeen Fai Tong: So Bright Horizons Family Solutions Inc. continues to have strong Backup Care growth as employees at the corporate clients engage and use their additional use cases or their backup benefits. I was wondering how do the corporate clients feel about that, kind of the increased spend that comes as employees, you know, realize and use their backup benefits more? And do you see any tightening of backup benefits in terms of like use cases that are allowed by corporate clients?\n\nStephen Kramer: Sure. Happy to answer that, Andrew. So first, it is fair to say that we are very pleased with the 19% growth that we experienced this year, and that is in addition to the last several years of very strong growth. And as you will know, the majority of, you know, the revenue that we derive is directly from the employer's support of these programs, because there is really a limited copay that goes along with it at the employee level. But I think that we have done a really good job of articulating to employers the value in terms of productivity that Backup provides to their employees and then ultimately accrues to them as employers.\n\nAnd so I think that strong ROI has really held us in good stead as it relates to the continued investments that they are making. I would also observe that within the benefits portfolio that HR manages, Backup is still a pretty modest line item, especially as it compares to some of the more traditional and larger benefits that they manage. And so while the increases are significant for us, and obviously for the progress that we have continued to make, from any one employer's perspective, it is still a pretty modest line item, despite the fact that on a percentage basis for them, it is growing more significantly.\n\nBut again, I think our teams have done a really good job of ensuring that we are focused on ROI. And secondly, the feedback from employees around the Backup benefit continues to be incredibly strong.\n\nElizabeth J. Boland: Our next question\n\nOperator: is from George Tong with Goldman Sachs.\n\nMichael Flanagan: Hi, thanks. Good afternoon. You mentioned occupancy averaged mid-60s in 4Q. Based on your\n\nGeorge Tong: guide for this year, can you describe how you expect occupancy to unfold over the course of 2026 by quarter roughly?\n\nElizabeth J. Boland: Yeah. So the seasonal pattern would be pretty consistent where we see a lift in enrollment in the first half of the year, particularly in Q2 is where it would be peaking, you know, in the high—it was in the high sixties in 2025—so it would tick up a bit above that. And then in the second half, it would be back down into the mid-sixties for the second half of the year, Q3, and ending the year similar to Q4 as Q3. So it is a lift in Q1 and Q2, and then similar to the pattern you saw this year.\n\nGeorge Tong: Got it. So by April this year, would you expect it to be better than mid-sixties from April last year, or do you think you have reached the steady state and mid-sixties is a reasonable year-end\n\nElizabeth J. Boland: Yeah. It would be still in the mid-sixties exiting 2026 because, with a growth rate of just 100 basis points in a year, we are making headway against that gradually, but it would not be getting beyond the mid-sixties by the end of the year. Still to come, though, we are heartened by the continued interest, and we have, you know, the overall number of enrollment in the 100-basis-point range masks the improvement in the middle and lower cohorts, which are growing low to mid-single digits because they are more underenrolled than the top cohort, which is very well enrolled and, in fact, cannot really take any more enrollment and may see some cycling.\n\nSo overall, we are pleased with the ongoing momentum. It is modest, and it is year by year, quarter by quarter, but we are seeing growth and think that will continue to allow us to move beyond the mid-sixties over time. That will not happen, we would not expect, in 2026, but certainly has the opportunity down the road. Got it. Very helpful. Thank you. Our next\n\nOperator: question is from Toni Michele Kaplan with Morgan Stanley.\n\nElizabeth J. Boland: Thanks so much. Was hoping you could start just maybe giving a\n\nToni Michele Kaplan: additional color on the closures. Just wondering if there were any sort of commonalities on why the centers could not get\n\nToni Michele Kaplan: to a higher level of utilization, and I am sure there were a number of things that you tried. And so just wanted to understand the reason for that. But were there a number of leases that came up this year? Just trying to understand also, like, how to think about, you know, closures for maybe 2027 as well.\n\nElizabeth J. Boland: Yeah. Yeah. So, you know, I think the common themes probably of the centers that have been circled up for closure—and, in fact, we have closed already in 2026 close to half of what we would expect to close for the year. We would expect to be in the range of 45 to 50 or so closures this year overall, and we have closed more than 20 already in this quarter. And that the circling up of those has been a combination of the things that you mentioned, Toni, which is some were within a year or two or three of the end of their lease.\n\nAnd so the underperformance, the lagging enrollment, and the overall economics of operating compared to covering the fixed cost was, you know, was not sensible. And so we were able to, in many cases, move the families and the staff to other nearby centers and to accommodate the needs of everyone in that way. And so that is obviously the best-case scenario where we can portfolio and retain the enrollment and the staff as well.\n\nAlso, there certainly were some cases where the underperformance is so significant, and there is no particular lease action—the lease is not coming up for still several more years—but we have elected to stop operations and do this either combine or just stop operations because the demand is not sufficient. The operations are quite—the operating performance is quite low, and therefore, we are shutting down operations and may have some tail of costs that carries on for a couple of years if we are not able to sublease the space.\n\nKeen Fai Tong: We will certainly work to do that, but it is not the most amenable market for that. But\n\nElizabeth J. Boland: I think it is just a decision point of persisting, looking at the client relationships. Is there client interest in full-time care? Is there client interest in Backup Care? Is there a landlord negotiation that can get us a more tolerable occupancy cost? Are there other—you know? And, of course, the main ones are can we enlist more enrollment by more parent awareness and more marketing conversion, but that is—all of those things go into a decision, which is a tough one to make.\n\nToni Michele Kaplan: Great. And then for my follow-up on Backup Care, I guess, anecdotally, we are aware of at least one employer who added days during COVID and now is cutting back on days, going back to sort of pre-COVID levels. And so wanted to understand if that is just a one-off situation or if there is sort of a larger trend of cutting back on days. And what I am trying to get at is if you are seeing any changes in the drivers of growth in Backup Care, like, going forward versus, like, recent years?\n\nAre you seeing sort of more growth from, you know, new employers signing on as opposed to those adding days or any difference in usage, etcetera. I just wanted to understand directionally the Backup Care drivers and if that is something that is changing.\n\nStephen Kramer: So, Toni, what I would say is the drivers in 2026 and moving forward, we expect actually will look very similar to the last several years. So the vast, vast majority of the growth comes from the existing client base. Of course, we continue to add clients, but that is not a large source of growth given the maturation that is required of a new client, and it takes time for the benefit to become known and then ultimately used in a more mature way. So when we think about the drivers, number one is continuing to increase the number of unique users. And so as I shared, you know, we grew that at, you know, sort of mid-double-digit\n\nStephen Kramer: And so getting more penetration within our existing base is a really critical component. I would say that to the question around program design and policy changes,\n\nStephen Kramer: not actually the norm for most of our employers to change their program parameters even during COVID. We had a select number that really had some outsized programs that have come back into more of our normalized program policy. But the reality is in the current operating environment, you know, most of those who use do not use their full bank, whether it be an outsized bank or even a more traditional-sized bank. So, again, it is this combination of continuing to drive users, continuing to drive their frequency of use, understanding that most do not use their full bank. And those become the two most important determinants of the continued growth algorithm.\n\nElizabeth J. Boland: Thank you.\n\nOperator: Our next question is from Joshua K. Chan with UBS.\n\nKeen Fai Tong: Hi, good afternoon, Steve and Elizabeth.\n\nElizabeth J. Boland: I guess, yeah, around your expectation to grow enrollment 100 basis points in 2026, which is similar to kind of the exit rate in Q4,\n\nStephen Kramer: have you seen kind of a solid or pretty stable fall enrollment season during Q4 to kind of inform you of that? Just I am just wondering how the enrollment season kind of progressed.\n\nElizabeth J. Boland: Yeah. It was—I would say that, you know, we had a bit of a slowdown in the second half of the year. We were a little faster growth in 1H of 2025, and then it tapered in the second half. So the momentum coming through the fall was—and into and the rest of the year—was similar to what we had expected and stable going into the year. I would say that maybe the notable element as we are looking ahead is a little bit of an uptick in younger age group enrollment. The mix is not dramatically different, but it is, you know, an uptick in younger age interest.\n\nAnd so that is always a positive, of course, for just growing the younger children into the older age groups as they stay with us. So that is one of the elements of positive outlook that we are seeing. And we talked last—throughout 2025, I know it is last year, we are talking about Q4—but some of the supports that we are seeing outside the U.S. have certainly helped to improve affordability to families in the countries that we operate where government funding for child care is available to all families. It is means-tested, but it is available to all families at some level, and that enables more families to afford care.\n\nSo that has driven some good stability also in the enrollment outlook.\n\nKeen Fai Tong: Okay. Yep. Thank you. That makes sense. And then\n\nStephen Kramer: in terms of your center count, I guess, how many centers are you aiming to open next year? And at what point do you feel like you can get to\n\nKeen Fai Tong: kind of net neutral center count in the future?\n\nElizabeth J. Boland: Yeah. So in 2026, we look to be opening plus/minus 20 or so. And I think I mentioned closing 45 to 50. So we would be in the net closure position, as you say, in 2026. We will go a long way closing—getting underperformers closed throughout the rest of this year. We will go a long way toward addressing that bottom cohort. We mentioned there is 12% of centers in the bottom cohort. About, you know, just under 90 of those or so are P&L centers that we control the bottom line.\n\nAnd even after the closures in the early part of this year, it is, you know, it has already ticked down meaningfully to, you know, in the neighborhood of 70. So we will be in a good position to have made progress through many of the centers, but I would still say we would probably be in another year beyond 2026–2027 before we are meaningfully net positive.\n\nKeen Fai Tong: K. Great. Yeah. Thank you for the color and the time.\n\nElizabeth J. Boland: Thank you. Thank you, Josh.\n\nOperator: Our next question is from Stephanie Moore with Jefferies.\n\nStephanie Moore: Is it possible—I was hoping you could talk a little bit about what you are seeing from just an overall pricing standpoint, general appetite from parents and customers on tuition increases,\n\nElizabeth J. Boland: how you view kind of pricing, I guess, going forward now that inflation is kind of, you know, arguably a bit under control, labor is in a little bit better position. So we would just love to get your kind of updated view on general pricing trends. Thanks. Yeah. I mean, obviously the economy has been—many families have been quite stressed with the whole of inflation in general.\n\nOver the last many years, child care has for many years been a higher-than-inflation cost service mainly because of the labor intensity that goes into it, and the pandemic really added some fuel to that with significant increases to the labor cost as, you know, some significant wage steps were made early on in the pandemic. And then we continue to do increases, but they are much more market-leveling increases over the last couple of years. So I think the parents are understanding that the cost of care is very much driven by personnel cost. We mentioned benefits costs on this call in particular because it, you know, is one of the important costs.\n\nWage and benefits is an important element of the total rewards package for our teachers. It is one of the things that is attractive to them about our employee value proposition and why they work here, but it is a cost that we need to be continuing to, you know, bake into the overall cost structure and the tuition recovery over time. So we feel like our algorithm will continue to hold.\n\nParents understand where the increases are coming from, and I think that our measured approach to tuition increases that tries to balance the economics covering costs in the center as well as attracting enrollment, retaining enrollment, and bringing as much economic value to families and to our client partners as we can will ultimately carry the day. So we are always looking for ways that we can be, you know, effective in making the cost of care affordable to families but transparent about the fact that it does increase primarily with those personnel costs each year. Absolutely. No. I think that is fair. And just as a follow-up, and I do apologize if\n\nStephanie Moore: if I missed this, but wondering if you guys could give an update on, you know, getting back to 70% enrollment or what you view as an optimal enrollment level, just kind of update and timeline there.\n\nElizabeth J. Boland: Sure. So we are in the mid-sixties right now across the portfolio, and about half of our centers operate above 70%.\n\nStephanie Moore: And actually they operate above 80% on average.\n\nElizabeth J. Boland: And so I would say that our target would still be to aim for 70%. Many centers perform just fine below that, 60–70%. It is not a magic number, but it is certainly one that we aspire to in terms of critical mass in a center, the right kind of mix of age groups that bring the operating efficiency that is natural in a child care center where this labor intensity is as high as it is. And so our, you know, our view at 100 basis points a year of enrollment gain, we will be making headway on that and getting closer to 70%.\n\nBut the other factor there is as we continue to rationalize the portfolio and we have fewer centers that are operating sub-40%, we will naturally be drifting up, if you will. But it is really having the enrollment that is the most important factor. And it is—the top group is doing well. It is doing great. They are sustaining enrollment above 80% even as the natural age up and cycling happens. So that is the most heartening part of it. It is that middle cohort of, call it, 40% of our centers that have the real opportunity to be adding, you know, 5, 10, 15 percentage points of enrollment to really get us closer to that 70% average.\n\nStephen Kramer: Great. Well, thanks again for joining us on the call. And wishing you all a good night.\n\nOperator: This concludes today's conference. You may disconnect your lines at this time. Thank you again for your participation.\n\nBefore you buy stock in Bright Horizons Family Solutions, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bright Horizons Family Solutions wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $429,385!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,165,045!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 913% — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 12, 2026.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.\n\nBright Horizons (BFAM) Q4 2025 Earnings Transcript was originally published by The Motley Fool"
    },
    {
        "title": "PodcastOne (Nasdaq: PODC) Raises Full-Year Fiscal 2026 Guidance; Revenue Expected $60-$62M and Adjusted EBITDA* $5.5-$6.5M",
        "url": "https://markets.businessinsider.com/news/stocks/podcastone-nasdaq-podc-raises-full-year-fiscal-2026-guidance-revenue-expected-60-62m-and-adjusted-ebitda-5-5-6-5m-1035825763",
        "source": "Markets Insider",
        "date": "2026-02-13T13:13:00+00:00",
        "content": "LOS ANGELES, Feb.  13, 2026  (GLOBE NEWSWIRE) -- PodcastOne (Nasdaq: PODC), a leading publisher and podcast sales network, today announced an increase to its full-year fiscal 2026 guidance. The Company now expects revenue of $60–$62 million and Adjusted EBITDA* of $5.5–$6.5 million.\n\nRobert Ellin, Chairman of PodcastOne, said, “Following the sale of select original IP to one of our streaming partners, we updated our fiscal 2026 guidance to more accurately reflect our expected revenue and Adjusted EBITDA*. This transaction underscores the value of our content portfolio and strengthens our financial outlook.”\n\nPodcastOne (NASDAQ: PODC) is a leading podcast platform that provides creators and advertisers with a comprehensive 360-degree solution in sales, marketing, public relations, production, and distribution. PodcastOne has surpassed 3.9 billion total downloads with a community of 200 top podcasters, including Adam Carolla, Kaitlyn Bristowe, Jordan Harbinger, LadyGang, A&E's Cold Case Files, and Varnamtown. PodcastOne has built a distribution network reaching over 1 billion monthly impressions across all channels, including YouTube, Spotify, Apple Podcasts, and iHeartRadio. PodcastOne is also the parent company of PodcastOne Pro which offers fully customizable production packages for brands, professionals, or hobbyists. For more information, visit www.podcastone.com and follow us on Facebook, Instagram, YouTube, and X at @podcastone.\n\nAll statements other than statements of historical facts contained in this press release are “forward-looking statements,” which may often, but not always, be identified by the use of such words as “may,” “might,” “will,” “will likely result,” “would,” “should,” “estimate,” “plan,” “project,” “forecast,” “intend,” “expect,” “anticipate,” “believe,” “seek,” “continue,” “target” or the negative of such terms or other similar expressions. These statements involve known and unknown risks, uncertainties and other factors, which may cause actual results, performance or achievements to differ materially from those expressed or implied by such statements, including: LiveOne’s reliance on its largest OEM customer for a substantial percentage of its revenue; LiveOne’s and PodcastOne’s ability to consummate any proposed financing, acquisition, merger, distribution or other transaction, the timing of the consummation of any such proposed event, including the risks that a condition to the consummation of any such event would not be satisfied within the expected timeframe or at all, or that the consummation of any proposed financing, acquisition, merger, special dividend, distribution or transaction will not occur or whether any such event will enhance shareholder value; PodcastOne’s ability to continue as a going concern; PodcastOne’s ability to attract, maintain and increase the number of its listeners; PodcastOne identifying, acquiring, securing and developing content; LiveOne’s intent to repurchase shares of its and/or PodcastOne’s common stock from time to time under LiveOne’s announced stock repurchase program and the timing, price, and quantity of repurchases, if any, under the program; LiveOne’s ability to maintain compliance with certain financial and other covenants; PodcastOne successfully implementing its growth strategy, including relating to its technology platforms and applications; management’s relationships with industry stakeholders; LiveOne’s ability to repay its indebtedness when due; LiveOne’s ability to satisfy the conditions for closing on its announced additional convertible debentures financing; LiveOne’s ability to implement its announced digital assets treasury strategy and/or purchase digital assets from time to time pursuant to such strategy, including for up to the maximum announced amount, and other risks related to such strategy; uncertain and unfavorable outcomes in legal proceedings and/or PodcastOne’s and/or LiveOne’s ability to pay any amounts due in connection with any such legal proceedings; changes in economic conditions; competition; risks and uncertainties applicable to the businesses of PodcastOne, LiveOne and/or LiveOne’s other subsidiaries; and other risks, uncertainties and factors including, but not limited to, those described in PodcastOne’s Annual Report on Form 10-K for the fiscal year ended March 31, 2025, filed with the U.S. Securities and Exchange Commission (the “SEC”) on July 2, 2025, PodcastOne’s Quarterly Report on Form 10-Q for the fiscal quarter ended September 30, 2025, filed with the SEC on November 14, 2025, and in PodcastOne’s other filings and submissions with the SEC. These forward-looking statements speak only as of the date hereof, and PodcastOne disclaims any obligation to update these statements, except as may be required by law. PodcastOne intends that all forward-looking statements be subject to the safe-harbor provisions of the Private Securities Litigation Reform Act of 1995.\n\nUse of Non-GAAP Financial Measures*\n\nTo supplement our consolidated financial statements, which are prepared and presented in accordance with the accounting principles generally accepted in the United States of America (“GAAP”), we present Contribution Margin (Loss) and Adjusted Earnings Before Interest Tax Depreciation and Amortization (“Adjusted EBITDA”), which are non-GAAP financial measures, as measures of our performance. The presentation of these non-GAAP financial measures is not intended to be considered in isolation from, or as a substitute for, or superior to, operating loss and or net income (loss) or any other performance measures derived in accordance with GAAP or as an alternative to net cash provided by operating activities or any other measures of our cash flows or liquidity.\n\nWe use Contribution Margin (Loss) and Adjusted EBITDA to evaluate the performance of our operating segment. We believe that information about these non-GAAP financial measures assists investors by allowing them to evaluate changes in the operating results of our business separate from non-operational factors that affect operating income (loss) and net income (loss), thus providing insights into both operations and the other factors that affect reported results. Adjusted EBITDA is not calculated or presented in accordance with GAAP. A limitation of the use of Adjusted EBITDA as a performance measure is that it does not reflect the periodic costs of certain amortizing assets used in generating revenue in our business. Accordingly, Adjusted EBITDA should be considered in addition to, and not as a substitute for operating income (loss), net income (loss), and other measures of financial performance reported in accordance with GAAP. Furthermore, this measure may vary among other companies; thus, Adjusted EBITDA as presented herein may not be comparable to similarly titled measures of other companies.\n\nContribution Margin (Loss) is defined as Revenue less Cost of Sales before (a) Cost of Sales share-based compensation expense, (b) depreciation, and (c) amortization of developed technology. Adjusted EBITDA is defined as earnings before interest, other (income) expense, income tax expense, depreciation and amortization and before (a) non-cash GAAP purchase accounting adjustments for certain deferred revenue and costs, (b) legal, accounting and other professional fees directly attributable to acquisition activity, (c) employee severance payments and third party professional fees directly attributable to acquisition or corporate realignment activities, (d) certain non-recurring expenses associated with legal settlements or reserves for legal settlements in the period that pertain to historical matters that existed at acquired companies prior to their purchase date and a one-time minimum guarantee to effectively terminate a live events distribution agreement post COVID-19, and (e) certain stock-based compensation expense. Management does not consider these costs to be indicative of our core operating results.\n\nWith respect to projected full fiscal year 2026 Adjusted EBITDA, a quantitative reconciliation is not available without unreasonable efforts due to the high variability, complexity and low visibility with respect to purchase accounting adjustments, acquisition-related charges and legal settlement reserves excluded from Adjusted EBITDA. We expect that the variability of these items to have a potentially unpredictable, and potentially significant, impact on our future GAAP financial results.\n\nFor more information on these non-GAAP financial measures, please see the tables entitled “Reconciliation of Non-GAAP Measure to GAAP Measure” included at the end of this release.\n\nPodcastOne Press Contact: Paul Manleypmanley@podcastone.com"
    }
]