[
    {
        "title": "Markets News, Feb. 13, 2026: Stocks Post Worst Week of 2026 as Tech Jitters Trump Encouraging Inflation, Jobs Reports",
        "url": "https://www.investopedia.com/stock-market-today-dow-jones-s-and-p-500-02132026-11906132",
        "source": "Investopedia",
        "date": "2026-02-13T23:06:00+00:00",
        "content": "ANGELA WEISS / AFP via Getty Images\n\nStocks were mixed at the close of a rough week after a crucial inflation report showed prices rose less than expected last month.\n\nThe benchmark S&P 500 and blue-chip Dow Jones Industrial Average each advanced 0.1% on Friday, while the tech-heavy Nasdaq Composite fell 0.2%. Stocks were coming off a bruising session Thursday, when the AI jitters that sparked last week’s “SaaSpocalypse” flared up.\n\nAll three indexes suffered their largest weekly losses of the year. The Dow, which closed at record highs on Monday and Tuesday, finished the week down 1.2%. The S&P 500 dropped 1.4%, and the Nasdaq fell 2.1% to notch its fifth consecutive weekly loss.\n\nInflation slowed to 2.4% in January, its lowest reading since May and a bigger slowdown than economists expected, according to data released Friday. Core inflation, which excludes volatile food and energy prices, fell to 2.5%, its lowest print since March 2021.\n\nFriday’s data will be one of several inflation and labor market reports factoring into the conversation when Federal Reserve officials meet to set monetary policy next month. The odds the Fed cuts interest rates in the next few months dropped sharply on Wednesday when data showed the U.S. added twice as many jobs as economists expected last month.\n\nTreasury yields fell following the release of Friday's inflation report. The yield on the 10-year Treasury, which impacts interest rates on a variety of consumer loans including mortgages, fell to 4.05% from 4.11% at Thursday’s close.\n\nCorporate earnings continued to be a driver of big stock moves on Friday. Coinbase (COIN) stock soared 17% despite reporting a steep drop in revenue due to slumping crypto prices. Shares of Applied Materials (AMAT) jumped 8% after the semiconductor manufacturing equipment maker topped earnings estimates on strong demand for AI chips. The AI data center boom also drove strong results at Arista Networks (ANET), shares of which rose 5%. Pinterest (PINS) stock plummeted 17% on its weak results and DraftKings (DKNG) fell 14% after issuing a disappointing revenue forecast.\n\nBig tech stocks continued to feel the pressure after sliding yesterday. Nvidia (NVDA) and Apple (AAPL) each fell more than 2%, while Alphabet (GOOG) and Meta (META) shed more than 1%. Microsoft (MSFT) and Amazon (AMZN) posted smaller losses. Tesla (TSLA) was the only Magnificent Seven stock to inch higher.\n\nGold futures rebounded from yesterday's sharp drop, rising to $5,050 an ounce. West Texas Intermediate futures, the U.S. crude oil benchmark, were little changed at $62.85 a barrel.\n\nBitcoin rebounded from yesterday's lows around $65,000 to trade at $68,800 in the late afternoon. The U.S. dollar index, which tracks the value of the greenback against a basket of global currencies, dipped 0.1% at 96.85.\n\nPinterest's Stock Is Getting Hammered. Its Earnings Flashed a Warning Signal About Trump’s Tariffs\n\nPinterest’s stock is plunging after the company said its business took a hit from tariffs—though maybe not in the way you'd expect.\n\nShares of Pinterest (PINS) were down nearly 20% Friday afternoon, a day after the social media platform cited the impact of higher tariffs on its ad clients for its disappointing quarterly results.\n\nPinterest CEO Bill Ready told investors in Thursday's earnings call that tariffs are \"disproportionately affecting ad spend from our top retail advertisers\" as they grapple with rising costs, according to an AlphaSense transcript.\n\nPinterest reported adjusted earnings per share of 67 cents on a 14% year-over-year jump in revenue to $1.32 billion for the fourth quarter. Both figures narrowly missed analysts' estimates compiled by Visible Alpha. The company's first-quarter outlook of $951 million to $971 million in revenue also fell short of projections.\n\nJPMorgan and Bank of America analysts downgraded Pinterest's stock to neutral from \"buy\" or equivalent ratings following the results. JPMorgan analysts warned the pressure from large retailers' ad spend could worsen in the current quarter.\n\nPinterest's worries have had a limited impact on other social media stocks. Shares of Snapchat parent Snap (SNAP) and Instagram owner Meta (META) briefly turned lower Friday before recovering later in the session. Ready said Pinterest's “higher mix of large retailers relative to some of our peers has resulted in us feeling more of an impact.\"\n\nWith Friday's move, Pinterest shares have lost over 40% of their value since the start of the year, and more than 60% in the last 12 months.\n\nDraftKing Stock Slumps as Revenue Forecast Comes Up Short\n\nShares of DraftKings (DKNG) dropped 13% on Friday after the online sports betting operator’s full-year revenue guidance came up short of Wall Street estimates.\n\nDraftKings on Thursday evening forecast revenue would be between $6.5 billion and $6.9 billion in 2026. The consensus estimate on Wall Street heading into Thursday’s earnings report was about $7.3 billion.\n\nDraftKings’ soft revenue forecast overshadowed otherwise solid fourth-quarter results. Revenue rose 43% to $1.99 billion, about in-line with estimates. The company swung to a profit of $136 million, or 25 cents a share, from a $135 million loss in the year-ago quarter.\n\nDraftKings revenue forecast was particularly disappointing given the investments it plans to make in prediction markets, a rapidly growing niche that’s increasingly encroaching on sportsbook businesses. Bank of America estimates that about 20% of all Super Bowl-related betting last weekend occurred on prediction markets. DraftKings was the fifth-most downloaded app last Sunday, while prediction market Kalshi, on which trading volume totaled nearly $900 million the day of the game, ranked second.\n\n“We plan to deploy growth capital to build the best customer experience in Predictions and acquire millions of customers,” said DraftKings CEO Jason Robins in a letter to shareholders on Thursday. “We are targeting hundreds of millions in annual revenue for DraftKings Predictions in the years ahead, and we believe there is much more upside over the long-term.”\n\nThe momentum behind prediction markets has been a headwind for DraftKings stock. Shares are down more than 50% in the past year, and have shed 37% of their value in the last month and a half alone.\n\nCoinbase Is Buying the Dip in Bitcoin. Some Experts See More Downside Ahead\n\nCrypto whales are rushing in where other investors fear to tread.\n\nBitcoin is struggling to stage a turnaround. Recent prices are stuck under the $70,000 level, and altcoins including ether and solana are in a similar state. Though the volatility in crypto markets appears to be putting off retail investors, some industry players are buying. Crypto exchange Coinbase Global (COIN), for example, said it will continue to \"buy the dip\" in bitcoin—and its own stock.\n\nThat optimism has yet to meaningfully register in crypto markets, but some crypto-linked stocks are climbing today. Coinbase is up 18%, while shares of the Tyler and Cameron Winklevoss-founded exchange Gemini have risen about 12%. Strategy (MSTR) and Circle (CRCL) are also climbing, though more modestly.\n\nSome experts worry that the reprieve in crypto stocks may be short-lived. One bank is calling for more pain in the near future, citing a lack of new buyers.\n\nArista Networks Stock Rises on Earnings Beat, Steady Margin Forecast\n\nShares of Arista Networks (ANET) rose on Friday after the networking equipment provider topped estimates with its fourth-quarter results and offered a strong outlook for the current quarter.\n\nArista Networks on Thursday afternoon reported fourth-quarter adjusted earnings of $1.05 billion, or 82 cents per share, a nearly 25% increase from a year ago. It was the company’s first quarter in which net income exceeded $1 billion. Revenue grew 29% year-over-year to $2.49 billion.\n\n“We exceeded both our AI networking and campus expansion goals, delivering profitable growth and revenue of $9 billion,” said CEO Jayshree Ullal in a press release.\n\nThe company expects current-quarter of $2.6 billion, and gross margin to fall between 62% and 63%. The latter metric stood in stark contrast to that of networking competitor Cisco (CSCO), which said in its earnings report earlier this week that the soaring cost of memory components would pressure its margins. Cisco shares tumbled 12% after it issued that warning.\n\nShares of Arista Networks were recently up about 6%. The stock has traded sideways since tumbling following its earnings report in November. Still, shares are up about 30% over the past year.\n\nWall Street is overwhelmingly bullish on Arista Networks stock, with 8 of 9 analysts with current ratings tracked by Visible Alpha calling the stock a “buy.” The lone holdout has assigned the stock a neutral rating. The average price target of $178.63 is about 25% above the stock’s intraday level on Friday.\n\nRivian Predicts Big Jump in Sales as R2 SUV Set to Launch Soon. Its Stock Soars\n\nA solid fourth quarter and ambitious plans for 2026 have Rivian stock soaring Friday.\n\nRivian (RIVN) shares jumped more than 25% after the electric vehicle maker narrowly topped revenue estimates at $1.29 billion, while recording a smaller adjusted loss than analysts had forecast at 54 cents per share.\n\nThe company said its plans to start selling the R2, an SUV that will be cheaper than its current vehicles, remain on track for the second quarter. Rivian said that more details about its product lineup will be coming at a March 12 event.\n\nRivian expects to deliver between 62,000 and 67,000 vehicles this year, a more than 50% jump at the midpoint from the 42,247 it delivered in 2025. The company hopes software upgrades and its new model can help drive demand that has slowed in the U.S. after the Trump administration allowed EV tax credits to expire last September.\n\nWedbush analysts said they remain confident in Rivian's long-term plan and said the EV maker is in the midst of a \"massive transformation\" as it looks to streamline production of its R1 vehicles and ramp production of R2s this year. Wedbush has an \"outperform\" rating on the stock and a $25 price target.\n\nRivian shares were up 26% at $17.70 in recent trading. Despite today's surge, the stock is still down more than 10% since the start of 2026 after hitting its highest level in two years in December.\n\nApplied Materials Jumps as AI Chips Drive Profit Growth\n\nShares of Applied Materials (AMAT) jumped 9% on Friday after the maker of semiconductor manufacturing equipment said profit surged last quarter amid booming demand for advanced chips.\n\nApplied Materials’ profit soared more than 70% to $2.03 billion, or $2.45 a share, in the first quarter of its 2026 fiscal year. Revenue declined 2% to $7.01 billion.\n\n“The need for higher performance and more energy-efficient chips is driving high growth rates for leading-edge logic, high-bandwidth memory and advanced packaging,” said CEO Gary Dickerson in a press release. Dickerson said demand in those areas should help Applied Materials grow its semiconductor equipment business by more than 20% this year.\n\nThe AI data center buildout has caused a spike in demand for more powerful, energy-efficient semiconductors. That’s been a boon to companies like Applied Materials whose equipment and processes enable the fabrication of said chips.\n\nDickerson expects demand to remain strong through this year, when he estimates global semiconductor industry revenues will hit $1 trillion.\n\nApplied Materials forecast current quarter revenue will fall between $7.15 billion and $8.15 billion, and adjusted earnings per share between $2.44 and $2.84. The upper-end of those ranges would represent double-digit growth on both metrics.\n\nApplied Materials stock was already flying high heading into Thursday’s report, with shares up nearly 28% since the start of the year. As of midday Friday, the stock is up about 95% in the last 12 months.\n\nAI Fears, Political Pressure Put Apple Stock on the Back Foot Again\n\nApple (AAPL) stock is in the red again.\n\nShares slumped 5% yesterday after the Federal Trade Commission said it had sent a warning letter to the company over its Apple News service. The stock was also pressured by reports Wednesday that the company was once again delaying the release of some AI-powered Siri features, adding to persistent concerns the iPhone maker’s AI capabilities lag peers.\n\nApple and its Magnificent Seven peers are having a rough 2026 so far. Shares of hyperscalers Alphabet, Microsoft (MSFT), Amazon (AMZN) and Meta (META) have been weighed down by concerns that the tech giants are overspending on AI infrastructure. Their massive data center spending has historically been a boon to chipmaker Nvidia (NVDA), but even that stock is treading water amid anxiety about tech sector valuations.\n\nBefore this week’s setbacks, Apple stock appeared to have turned a corner. Apple announced in mid-January that it had selected Alphabet’s (GOOG) Gemini to power its future AI features, including the updated Siri features that are reportedly delayed. Weeks later, Apple reported record results for the all-important holiday quarter, when iPhone and services revenue easily beat estimates.\n\nApple shares rose nearly 8% in the week following that earnings report, lifting the stock into the green for the year. Thursday’s slump erased most of those post-earnings gains. Shares slid about 0.8% Friday morning, putting them down nearly 4.5% year-to-date.\n\nWhat Does the Inflation Report Mean for the Federal Reserve?\n\nSofter inflation will likely give the Federal Reserve breathing room to wait and see how the economy evolves in the coming months.\n\nAccording to the CME Group's FedWatch Tool, traders are pricing in a 70% chance that central bankers will next cut their influential fed funds rate at their June meeting. That was up from 66% just before the report was released. The FedWatch tool forecasts rate movements based on fed funds futures trading data.\n\n\"January’s inflation data, paired with a strong job payroll report, support the FOMC members who think the easing cycle should remain on hold in the coming months,\" wrote Moody’s Analytics Economist Matt Colyar.\n\nThe Consumer Price Index rose 2.4% over the year in January, down from a 2.7% annual increase in December. That was less than economists expected and the lowest since May.\n\nCore inflation fell to a 2.5% annual increase from 2.6% in December, the lowest since March 2021. Economists expect core inflation to be a better measure of inflation because it excludes volatile food and energy prices, which can fluctuate for factors not reflective of the broader economy.\n\nStock Indexes Slip Ahead of January CPI Report\n\nFutures contracts connected to the Dow Jones Industrial Average were down about 0.2% in premarket trading.\n\nS&P 500 futures were also off 0.2%.\n\nNasdaq 100 contracts dipped 0.3%.\n\nDraftKings. “DRAFTKINGS REPORTS FOURTH QUARTER REVENUE GROWTH OF 43%.”\n\nDraftKings. “Letter to Shareholders - February 2026.”\n\nArista Networks. \"Arista Networks, Inc. Reports Fourth Quarter and Year End 2025 Financial Results.\"\n\nApplied Materials. \"Applied Materials Announces First Quarter 2026 Results.\"\n\nApplied Materials. \"Q1 Fiscal 2026 Earnings Call.\"\n\nApplied Materials. \"APPLIED MATERIALS ANNOUNCES SECOND QUARTER 2025 RESULTS.\""
    },
    {
        "title": "BofA revamps Applied Materials stock price target after CEO message",
        "url": "https://finance.yahoo.com/news/bofa-revamps-applied-materials-stock-230700596.html",
        "source": "Yahoo Finance",
        "date": "2026-02-14T00:10:00+00:00",
        "content": "Applied Materials (AMAT) reported its Q1 earnings on February 12. The earnings beat consensus estimates for adjusted EPS and revenue, and the stock is trading 10% higher at the time of writing, Friday morning, Feb. 13, according to Yahoo Finance.\n\nThe supplier of semiconductor and semiconductor-related fabrication equipment reported revenue of $7 billion, a 2% year-over-year decline, yet the earnings report got investors excited and prompted Bank of America analyst Vivek Arya to raise his price target for Applied Materials.\n\nThe cause of excitement was CEO Gary Dickerson’s prepared remarks during the earnings call: “For Applied, we expect to grow our semiconductor equipment business more than 20% this calendar year. We see the demand profile weighted towards the second half of the calendar year, with availability of customer cleanroom space being a key factor pacing the rate of investment.”\n\nDickerson continued by making this great outlook sound even better. “Our largest customers are giving us increased longer-term visibility to ensure we have operational capacity and service support in place for their ramps,\" he added.\n\n\"Based on this visibility, we expect strong growth momentum to be carried into 2027.”\n\nTo put it all in perspective, we can look at the complete Q2 guidance versus what analysts expected. The numbers come from the Bank of America research note shared with TheStreet.\n\nThe great outlook makes even more sense when we consider what the Semiconductor Industry Association (SIA) estimates for 2026.\n\n“The global semiconductor industry posted its highest-ever annual sales in 2025, nearly hitting $800 billion, and global sales in 2026 are projected to reach roughly $1 trillion,” stated SIA CEO John Neuffer.\n\nFollowing the report’s release, Bank of America analyst Vivek Arya and his team updated their view on AMAT stock.\n\nThe team estimates the company will gain approximately 1% in 2026, thanks to cyclical growth, leadership in DRAM, advanced packaging, and deposition and conductor etch systems.\n\nAnalysts raised their non-GAAP EPS estimates for 2026 and 2027 by 18% and 24% to $11.86 and $14.57, respectively.\n\nApplied Global Services could grow at a rate higher than the typical low-double-digit pace through steady install base expansion, with all recurring revenue helping fund capital returns.\n\nApplied Materials captures more than 50% of the serviceable addressable market share in inflection points such as Gate-All-Around (GAA) and backside power delivery, where revenue opportunities increase by 30% versus FinFET.\n\nSystems' gross margins of 54% improved by 1% year over year and can expand further as Applied Materials prices to value.\n\nRelated: Bank of America resets Amazon stock price target after earnings\n\nArya reiterated his buy rating for AMAT stock and raised the price target to $420 from $350, based on his 29 multiple of his price-to-earnings ratio estimate for calendar year 2027.\n\nHe said the multiple is at the high end of Applied Materials’ historical trading range of 10 to 30. The numbers are justified by the potential for wafer fab equipment outgrowth in 2026 and 2027, Arya added, and they remain at a discount relative to other large peers, given a more balanced growth profile and lower profitability.\n\nSlower-than-expected capital spending cycle\n\nMarket share loss in deposition, implant, thermal, chemical mechanical planarization, etch, or process control segments\n\nDemand destruction in PCs and mobile as a headwind\n\nMerger and integration risk, along with macro headwinds\n\nApplied Materials reached a settlement agreement with the U.S. Department of Commerce, Bureau of Industry and Security, regarding allegations that certain customer shipments to China between November 2020 and July 2022 did not comply with the U.S. Export Administration Regulations, based on the company’s misunderstanding of the applicability of those regulations.\n\nThe company has agreed to pay $252.5 million to the Department of Commerce. The U.S. Department of Justice and the SEC have closed their related investigations without action.\n\nMorgan Stanley sets jaw-dropping Micron price target after event\n\nBank of America updates Palantir stock forecast after private meeting\n\nMorgan Stanley drops eye-popping Broadcom price target\n\nApplied Materials announced that Samsung Electronics will join the new, $5 billion Equipment and Process Innovation and Commercialization (EPIC) Center in Silicon Valley. According to Applied Materials, its EPIC Center will open this year as the world’s largest facility for collaborative research and development of semiconductor process technology and manufacturing equipment.\n\nThe co-development programs at the EPIC Center will be designed to speed up the development and deployment of next-generation semiconductor technologies. The joint research and development programs will work on new materials and process technologies for chips, multiple manufacturing processes (nodes) ahead of the current generation.\n\nApplied Materials introduced new deposition, etch, and materials-modification systems that boost the performance of logic chips at 2nm and beyond. The transition to GAA transistors is a pivotal moment for the industry, as it will enable energy-efficient computing needed to deliver more powerful AI chips.\n\n“The rapid progress of AI is pushing compute performance to the limit, and breakthroughs in computing begin with the transistor,” said Dr. Prabu Raja, president of the Semiconductor Products Group at Applied Materials.\n\n“To keep pace in the angstrom era, Applied is delivering materials engineering breakthroughs that improve energy-efficient compute. Together, these new systems extend Applied’s longstanding leadership in driving major transistor and wiring inflections, while helping customers accelerate their chip roadmaps to keep up with the blistering pace of AI.”\n\nRelated: Bank of America resets Qualcomm stock price target after earnings\n\nThis story was originally published by TheStreet on Feb 13, 2026, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here."
    },
    {
        "title": "Why The Narrative Around J. M. Smucker (SJM) Is Shifting After Mixed 2026 Expectations",
        "url": "https://finance.yahoo.com/news/why-narrative-around-j-m-180809960.html",
        "source": "Yahoo Finance",
        "date": "2026-02-14T18:57:00+00:00",
        "content": "Get insights on thousands of stocks from the global community of over 7 million individual investors at Simply Wall St.\n\nThe latest update on J. M. Smucker keeps the modelled fair value steady at about US$114.87, but the thinking behind that target has shifted slightly as analysts reassess both the opportunity and the risks. On one side, more constructive research leans on higher long range earnings forecasts and recent EPS outperformance to argue that the long term story still holds together. In contrast, more cautious views point to slower category growth and pressure on margins through 2026 as reasons to rein in expectations. As you read on, you will see how these mixed signals are shaping the evolving narrative around J. M. Smucker and how you can keep on top of future updates as they come through.\n\nStay updated as the Fair Value for J. M. Smucker shifts by adding it to your watchlist or portfolio. Alternatively, explore our Community to discover new perspectives on J. M. Smucker.\n\nBofA lifted its price target on J. M. Smucker to US$120 from US$118 after Q2 adjusted EPS came in slightly above its forecast, suggesting the firm sees the current execution on earnings as supportive of a somewhat higher valuation.\n\nBofA also raised its FY27 and FY28 adjusted EPS forecasts, citing company commentary that momentum in FY26 could set up for what it calls an algorithm or better FY27. In BofA's view, this leaves room for US$10 plus of EPS next year if that plays out.\n\nUBS, while trimming its target to US$117 from US$120, kept a Buy rating and highlighted solid organic growth. The analyst links this to the longer term growth story even as near term gross margin pressure is acknowledged.\n\nTaken together, BofA and UBS are still framing J. M. Smucker as an execution and earnings story, with cost control and growth momentum watched closely. There is some caution that much of the upside may already be reflected in current price targets.\n\nTD Cowen lowered its price target to US$105 from US$111 and maintained a Hold rating, flagging what it expects to be a challenging year for large cap consumer staples, with volume growth described as unlikely to improve materially and pricing muted.\n\nTD Cowen's stance implies less enthusiasm around near term growth prospects and leaves limited implied upside versus more optimistic targets. This can weigh on how investors frame risk and reward for J. M. Smucker.\n\nMorgan Stanley recently downgraded J. M. Smucker, adding to the cautious side of the debate, although the detailed reasoning is not provided here. This signals that not all firms view the current setup as attractive.\n\nDo your thoughts align with the Bull or Bear Analysts? Perhaps you think there's more to the story. Head to the Simply Wall St Community to discover more perspectives or begin writing your own Narrative!\n\nManagement updated full fiscal 2026 guidance, with expected net sales growth now set in a 3.5% to 4.5% range, compared with the prior 3.0% to 5.0% range. This provides a tighter view of where they see the top line landing.\n\nFrom August 1, 2025 to October 31, 2025, the company reported no share repurchases, with 0 shares bought for US$0m under its existing buyback program, so the share count was unchanged in that period.\n\nUnder the long running share repurchase authorization announced on February 17, 2006, J. M. Smucker has completed the repurchase of 43,028,334 shares, representing 54.31% of the authorization, for a total of US$4,312.03m. This reflects a sizeable capital return over time through buybacks.\n\nFair value: The modelled fair value remains steady at about US$114.87, with no change in the underlying estimate.\n\nDiscount rate: The discount rate has risen slightly from 6.96% to 6.98%. This indicates a marginally higher required return in the updated model.\n\nRevenue growth: The revenue growth assumption has increased from 2.71% to 2.73%. This reflects a very small adjustment to the long run outlook.\n\nNet profit margin: The net profit margin assumption has decreased from 10.13% to 9.97%. This indicates slightly lower expected profitability over time.\n\nFuture P/E: The future P/E multiple has risen from 15.62x to 15.87x. This indicates a somewhat higher assumed valuation for J. M. Smucker's earnings in the model.\n\nNarratives on Simply Wall St are investor written stories that connect what a company is doing to clear forecasts for revenue, earnings and margins, and then to a fair value estimate. They sit inside the Community page, so you can easily see how the story links to the numbers and how fair value compares to the current share price. As news and earnings arrive, Narratives update, helping you decide if J. M. Smucker still fits your view or if it is time to act.\n\nHead to the Simply Wall St Community and follow the Narrative on J. M. Smucker to stay on top of how this story evolves: SJM: Mixed Volume Pressures And EPS Potential Will Shape 2026 Expectations. You will see how contributors are tracking:\n\nCoffee pricing, volume elasticity and how tariff headwinds could affect margins through fiscal 2026.\n\nSKU rationalization in Sweet Baked Snacks, portfolio focus and what that might mean for EBITDA margins into fiscal 2027.\n\nThe link between analyst earnings forecasts, the assumed 17.2x 2028 P/E and how that compares to today’s share price and fair value.\n\nCurious how numbers become stories that shape markets? Explore Community Narratives\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nCompanies discussed in this article include SJM.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com"
    },
    {
        "title": "Unity's CEO Just Explained Why Google's AI Can't Replace Game Engines (And He's Right)",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/GOOGL/pressreleases/223373/unitys-ceo-just-explained-why-googles-ai-cant-replace-game-engines-and-hes-right/",
        "source": "The Globe and Mail",
        "date": "2026-02-14T13:17:00+00:00",
        "content": "Unity stock has tumbled twice recently, first after Google's Project Genie Reveal, and then after a disappointing earnings report.\n\nProject Genie is impressive, but it won't replace video game engines.\n\nAI looks like a tailwind for Unity, not a threat to its business model.\n\nShares of video game engine developer Unity Software(NYSE: U) have been sent through the wringer over the past two weeks. In late January, the stock crashed after Alphabet unveiled Project Genie, an AI-powered tech demo that lets users create virtual worlds from text prompts. Then, earlier this week, Unity stock crashed again after the company's outlook fell short of expectations.\n\nProject Genie is impressive, and Unity stock was severely punished partly because investors have grown concerned that AI world generators could make video game engines obsolete. While AI could disrupt many industries, this fear appears misguided.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nProject Genie can take a text or image prompt and generate a world that the user can navigate for up to 60 seconds. It's incredible, but there are severe limitations. Resolution and frame rates are limited, input lag is a problem, and the generated world may not remain consistent. An article from The Verge noted that, at one point, a section of road unexpectedly turned into grass, along with other visual oddities.\n\nAI technology will certainly improve, but what Project Genie is producing certainly isn't a game. Unity CEO Matthew Bromberg didn't mince words in the fourth-quarter earnings call. \"We believe world models are going to be a source of inspiration and assets for creators, but that they're not in any way going to replace game engines. They are complementary, not duplicative,\" said Bromberg.\n\nBromberg continued, saying that \"Unity is not an interactive video generator; it's a real-time 3D execution platform designed to build once and then run everywhere efficiently and seamlessly. So that's my feeling about Genie.\"\n\nThe idea of creating real-time, AI-generated, interactive video on the fly, while certainly possible, would be an incredibly inefficient and resource-intensive way to make a video game. It would also be non-deterministic. Large language models are statistical and probabilistic, so the same prompt can generate vastly different experiences.\n\nAI is almost certain to play a major role in video game creation, but not in a way that threatens the video game engine industry. World models like Project Genie and other AI tools can generate assets and even write code that powers video game systems, but ultimately, something like the Unity Engine is necessary to tie everything together. AI is an accelerator for video game development, not a replacement for Unity.\n\nUnity isn't sitting still as AI tools become more powerful. The company has already launched a beta of Unity Studio, its new browser-based editor that brings the power of the Unity Engine to the web.\n\nUnity Studio accomplishes a few things. First, it attempts to break down silos between developers, artists, and others working on a video game project by enabling easy sharing of interactive 3D applications. Second, it doesn't require users to write code to create 3D assets.\n\nBromberg sees the combination of this new way of using Unity Engine with AI built into the software as a major opportunity. \"AI inside Unity will lower the barrier to entry, raise productivity for existing users, and democratize game development for non-coders. When combined with our new web-accessible authoring environment, our goal is to remove as much friction from the creative process as possible, becoming the universal bridge between that first spark of creativity and a successful, scalable, and enduring digital experience,\" Bromberg said.\n\nThe stock market is panicking over the AI threat, sending Unity shares tumbling. AI will certainly transform and disrupt the video game industry, but Unity is likely to be a beneficiary, not a victim. While Unity stock could remain under pressure, long-term investors should use this opportunity to seriously consider buying the stock.\n\nEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\n\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nRight now, we’re issuing “Double Down” alerts for three incredible companies, available when you joinStock Advisor, and there may not be another chance like this anytime soon.\n\n*Stock Advisor returns as of February 14, 2026.\n\nTimothy Green has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Unity Software. The Motley Fool has a disclosure policy.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "How The Narrative Around Baytex Energy TSX:BTE Is Shifting After The Eagle Ford Sale",
        "url": "https://finance.yahoo.com/news/narrative-around-baytex-energy-tsx-231146548.html",
        "source": "Yahoo Finance",
        "date": "2026-02-13T23:29:00+00:00",
        "content": "Find winning stocks in any market cycle. Join 7 million investors using Simply Wall St's investing ideas for FREE.\n\nThe very small move in Baytex Energy's fair value estimate from CA$5.05 to CA$5.09, along with the slight uptick in the discount rate from 6.31% to 6.35% and a marginally smaller projected CA$ revenue contraction, reflects how analysts are rebalancing their view after the Eagle Ford sale for US$3.25b and the pivot toward Duvernay and heavy oil assets. Bullish commentary is leaning on the cleaner balance sheet, full debt repayment, and a heavier focus on share repurchases. More cautious voices, however, point out that the recent share rally and execution risks around a debt free, buyback heavy model could limit how much upside they are comfortable building into the numbers. Stay tuned to see how you can keep on top of these subtle but important narrative shifts as new information and analyst updates come through.\n\nAnalyst Price Targets don't always capture the full story. Head over to our Company Report to find new ways to value Baytex Energy.\n\nEven after the recent share rally, some analysts appear comfortable treating Baytex as fairly priced around current levels, with RBC Capital keeping its price target at C$5. This sits close to the latest fair value estimate of about C$5.09.\n\nThe decision by RBC to leave the C$5 target unchanged suggests they still see Baytex as reasonably aligned with their assessment of value, even if they no longer view it as a clear outperformer.\n\nRBC Capital downgraded Baytex Energy to Sector Perform from Outperform on January 13, 2026, explicitly citing valuation after the recent share rally, which they see as limiting further upside.\n\nRBC highlights that, at current levels, they see higher relative rates of return in other names. This reflects a more cautious stance on Baytex's upside potential versus alternatives, even while keeping the stock's C$5 price target unchanged.\n\nDo your thoughts align with the Bull or Bear Analysts? Perhaps you think there's more to the story. Head to the Simply Wall St Community to discover more perspectives or begin writing your own Narrative!\n\nBaytex reported fourth quarter 2025 production averaging 137,087 boe/d, with 114,780 bbl/d of total liquids and 133,845 mcf/d of natural gas. This provides a clear snapshot of how the current production mix is split between liquids and gas.\n\nFor full year 2025, Baytex reported average daily production of 145,079 boe/d, including 122,658 bbl/d of total liquids and 134,516 mcf/d of natural gas. This outlines the recent annual operating profile that underpins current valuation work.\n\nThe company issued first quarter 2026 production guidance of 68,000 to 69,000 boe/d, with an expected mix of 89% liquids and 11% natural gas. This helps gauge how management is framing near term volumes and product exposure.\n\nBaytex guided to average annual production of 67,000 to 69,000 boe/d for full year 2026 and provided an outlook to 2028 that includes a plan for 3% to 5% annual production growth to around 75,000 boe/d. The company also noted that this plan could be adjusted if pricing conditions change.\n\nFair Value: CA$5.05 to CA$5.09, a very small upward adjustment in the modelled estimate that keeps the updated figure close to the prior level.\n\nDiscount Rate: 6.31% to 6.35%, a slight move higher in the required return used in the analysis, which can lean against upward shifts in valuation.\n\nCA$ Revenue Growth: 36.47% decline to 35.75% decline, indicating a marginally smaller projected contraction in revenues in the latest update.\n\nNet Profit Margin: 1.71% to 1.65%, a small reduction in expected profitability on each CA$ of sales that trims back some of the earnings power in the model.\n\nFuture P/E: 341.29x to 344.21x, a minor rise that still leaves the multiple at a very large level in the updated model and highlights how much of the valuation depends on the earnings path assumed.\n\nNarratives on Simply Wall St let you turn Baytex Energy's numbers into a clear story, joining your view on its assets, revenue, earnings and margins to a forecast and a fair value. Each Narrative sits on the Community page, updates automatically when news or earnings arrive, and helps you decide what the current Fair Value and share price might mean for buy or sell decisions.\n\nHead over to the Simply Wall St Community and follow the Narrative on Baytex Energy to stay on top of the full story behind the latest valuation shifts, including the original write up here: Baytex Energy Narrative. You will see:\n\nHow efficiency gains in Eagle Ford and Pembina Duvernay, reserve replacement and heavy oil development plans link to revenue, margins and fair value.\n\nWhat analysts are assuming for Baytex Energy's revenue, profit margins, earnings, share count and future P/E, and how that ties to the CA$3.95 consensus price target.\n\nWhich risks, including tariffs, oil price moves, exchange rates and OPEC decisions, could challenge the Narrative and prompt an update to fair value or sentiment.\n\nCurious how numbers become stories that shape markets? Explore Community Narratives\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nCompanies discussed in this article include BTE.TO.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com"
    }
]