[
    {
        "title": "Universal Health Services Stock Outlook: Is Wall Street Bullish or Bearish?",
        "url": "https://finance.yahoo.com/news/universal-health-services-stock-outlook-130511463.html",
        "source": "Yahoo Finance",
        "date": "2026-02-19T16:30:00+00:00",
        "content": "With a market cap of $14.7 billion, Universal Health Services, Inc. (UHS) owns and operates acute care hospitals, outpatient facilities, and behavioral health centers through its Acute Care Hospital Services and Behavioral Health Care Services segments. It provides a wide range of medical, behavioral health, insurance, and management support services.\n\nShares of the King of Prussia, Pennsylvania-based company have outperformed the broader market over the past 52 weeks. UHS stock has soared 28.6% over this time frame, while the broader S&P 500 Index ($SPX) has gained 12.3%. In addition, shares of the company have risen 7.9% on a YTD basis, compared to SPX's marginal return.\n\nHas Palantir Bottomed? Probably, Based on Huge, Unusual Put Options Activity in PLTR\n\nSoftBank Just Sold $3.6 Billion Worth of Nvidia Stock. Should You Ditch NVDA Too?\n\nRackspace Stock Is Soaring on a Palantir Partnership. Should You Chase RXT Shares Here?\n\nStop Missing Market Moves: Get the FREE Barchart Brief – your midday dose of stock movers, trending sectors, and actionable trade ideas, delivered right to your inbox. Sign Up Now!\n\nLooking closer, shares of the hospital and health facility operator have outpaced the State Street Health Care Select Sector SPDR ETF's (XLV) 9.1% increase over the past 52 weeks.\n\nShares of Universal Health Services rose 2.5% following its Q3 2025 results on Oct. 27 as the company reported adjusted EPS of $5.69, well above Wall Street expectations, driven by steady demand for hospital services. The results were further boosted by a $90 million pre-tax Medicaid reimbursement from a newly approved Washington, D.C. state-directed payment program, which was not included in prior forecasts. Investor sentiment also improved after UHS raised its 2025 revenue outlook to $17.31 billion - $17.45 billion..\n\nFor the fiscal year that ended in December 2025, analysts expect UHS’ adjusted EPS to grow 31.3% year-over-year to $21.80. The company's earnings surprise history is promising. It topped the consensus estimates in the last four quarters.\n\nAmong the 20 analysts covering the stock, the consensus rating is a “Moderate Buy.” That’s based on eight “Strong Buy” ratings, one “Moderate Buy,” 10 “Holds,” and one “Moderate Sell.”\n\nOn Jan. 23, Barclays analyst Andrew Mok CFA reaffirmed a “Buy” rating on Universal Health Services and set a price target of $262.\n\nThe mean price target of $250.35 represents a 6.4% premium to UHS’ current price levels. The Street-high price target of $302 suggests a 28.4% potential upside.\n\nOn the date of publication, Sohini Mondal did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com"
    },
    {
        "title": "Wall Street Wobbles: Private Equity's Plunge and AI's Growing Pains",
        "url": "https://www.devdiscourse.com/article/headlines/3811218-wall-street-wobbles-private-equitys-plunge-and-ais-growing-pains",
        "source": "Devdiscourse",
        "date": "2026-02-19T19:56:00+00:00",
        "content": "Wall Street experienced a downturn on Thursday, driven mainly by declines in private equity stocks and prominent technology companies like Nvidia and Apple. While some industrial earnings reports limited the overall losses, Blue Owl Capital's decision to sell large assets and freeze redemptions highlighted financial strains, dragging down other private equity firms.\n\nMajor players, including Apollo Global Management, Ares, KKR & Co, and Carlyle Group, saw significant stock price drops amid concerns over credit quality and software stock exposure. Additionally, pressures from evolving AI technologies added to market uncertainties, as industries brace for potential business model disruptions.\n\nDespite these challenges, some companies like Deere & Co posted gains, driven by strong profit forecasts. As financial indices showed mixed results, including new highs and lows, investor attention shifts to upcoming economic indicators and Federal Reserve actions regarding interest rate policies.\n\nEmail: info@devdiscourse.com Phone: +91-720-6444012, +91-7027739813, 14, 15"
    },
    {
        "title": "S&P and Dow Jones futures dip as Walmart earnings loom",
        "url": "https://invezz.com/news/2026/02/19/sp-and-dow-jones-futures-dip-as-walmart-earnings-loom/",
        "source": "Invezz",
        "date": "2026-02-19T12:38:00+00:00",
        "content": "US stock futures edged lower on Thursday as investors assessed recent market gains, geopolitical tensions, and the Federal Reserve’s policy outlook while awaiting quarterly results from retail bellwether Walmart.\n\nFutures tied to the Dow Jones Industrial Average fell about 0.31%, or 156 points.\n\nS&P 500 futures slipped 0.26%, and Nasdaq 100 futures declined 0.37%, pausing a three-day winning streak in the broader market.\n\nThe pullback followed a positive session on Wednesday, when the S&P 500 rose nearly 0.6%, the Nasdaq Composite gained 0.8%, and the Dow Jones Industrial Average added roughly 129 points.\n\nStrength in technology, financial, and energy stocks helped lift equities, with Nvidia advancing 1.6% and Amazon climbing 1.8%.\n\nMarkets have recently been driven by movements in mega-cap technology companies, which recovered after earlier volatility tied to artificial intelligence spending and valuations.\n\nOther major stocks, including Apple and Meta Platforms, were lower in premarket trading following the prior day’s gains.\n\nEarlier in the month, AI-linked companies and software firms faced pressure amid concerns that heavy investment in artificial intelligence was not yet translating into significant revenue or profit growth, and that improved AI tools could disrupt multiple industries.\n\nInvestors are closely watching Walmart’s fourth-quarter earnings, scheduled before the opening bell.\n\nThe retailer’s results are widely viewed as an indicator of US consumer health and spending trends.\n\nWalmart shares have climbed more than 13% in 2026 and recently joined the $1 trillion market-capitalization club, making the stock’s reaction potentially influential for broader markets.\n\nOther corporate news included gains in select companies.\n\nDoorDash jumped 10.74% after forecasting first-quarter marketplace gross order value above estimates, while eBay rose 10.06% after projecting higher revenue and announcing the acquisition of fashion marketplace Depop from Etsy.\n\nEtsy shares advanced 19.2%. Carvana, however, dropped 16.5% after missing fourth-quarter profit expectations due to higher costs.\n\nEconomic indicators will also be in focus.\n\nTraders will monitor weekly jobless claims and pending home sales data on Thursday, ahead of Friday’s personal consumption expenditures price index, the Federal Reserve’s preferred inflation gauge.\n\nMinutes from the Federal Reserve’s January policy meeting showed officials were divided on the future path of interest rates.\n\nPolicymakers were largely in agreement to hold rates steady, though several indicated openness to rate hikes if inflation remains elevated, while others would support cuts if inflation declines.\n\nGeopolitical developments also influenced sentiment.\n\nOil prices climbed more than 4% after US Vice President JD Vance said Iran had not addressed core American demands in nuclear negotiations and warned that President Donald Trump retains the option to use military force if diplomatic efforts fail.\n\nRising crude prices lifted shares of energy companies, including Exxon Mobil, Chevron, and Occidental Petroleum.\n\nTogether, earnings expectations, monetary policy uncertainty, and geopolitical tensions left investors cautious, with markets awaiting clearer signals on the economic outlook.\n\nFailed to load articles. Please try again."
    },
    {
        "title": "Samsung shares hit record on HBM4 pricing power and AI demand",
        "url": "https://invezz.com/news/2026/02/19/samsung-shares-hit-record-on-hbm4-pricing-power-and-ai-demand/",
        "source": "Invezz",
        "date": "2026-02-19T05:43:00+00:00",
        "content": "Samsung Electronics shares climbed to a record high on Thursday after reports that the company is negotiating significantly higher prices for its next-generation artificial intelligence memory chips, reinforcing investor optimism about the durability of AI-driven semiconductor demand.\n\nThe stock rose as much as 5.4% to 190,900 won ($132.34) on the Korea Exchange, surpassing the 190,000 level for the first time as trading resumed after a three-day holiday.\n\nIt later traded 3.9% higher at 188,300 won, outperforming the benchmark Kospi’s 2.5% gain.\n\nAccording to local newspaper Chosun Ilbo, Samsung is looking to price its latest high-bandwidth memory chip, HBM4, at around $700 per unit, up to 30% higher than the previous generation.\n\nThe rally also tracked gains in US technology stocks overnight.\n\nNvidia shares advanced after Meta Platforms agreed to deploy “millions” of its AI processors over the coming years, while Apple is accelerating development of three new wearable devices tied to AI-powered hardware.\n\nThe reported pricing move highlights renewed confidence in the profitability of AI memory products. Analysts say the industry continues to benefit from tight supply conditions and strong demand from data center operators.\n\nSamsung’s HBM4 price would imply operating profit margins of roughly 50% to 60%, according to Bloomberg Intelligence analyst Masahiro Wakasugi.\n\nA shortage of advanced memory chips has been supporting both Samsung and rival SK Hynix, helping South Korea’s Kospi index rise 31% this year and making it the world’s best-performing stock market.\n\nSK Hynix had previously priced HBM4 chips supplied to Nvidia in the mid-$500 range and may move closer to Samsung’s higher pricing, the newspaper reported.\n\nSamsung has been attempting to reclaim leadership in high-bandwidth memory after initially trailing domestic rival SK Hynix and US-based Micron Technology in the early stages of the AI boom.\n\nLast week, the company announced it had begun mass production and commercial shipments of HBM4 chips used in AI processors.\n\nThe new chip operates at 11.7 gigabits per second compared with 9.6 Gbps for the earlier HBM3E model, with potential speeds rising to 13 Gbps.\n\nNomura analysts C.W. Chung and Eon Hwang said in a WSJ report that Samsung is likely to benefit from higher average selling prices and greater shipments following the early release.\n\nThe analysts estimate the company could command a 30%–40% premium for HBM4 over HBM3E.\n\nThey also raised their target price for Samsung shares by 32% to 290,000 won while maintaining a buy rating.\n\nThe strengthening outlook for memory demand is expected to support the company’s semiconductor business.\n\nNomura now forecasts operating profit of 44 trillion won for the January-March quarter, up from an earlier estimate of 33 trillion won.\n\nIf Samsung supplies more HBM chips to Nvidia, pricing differences with SK Hynix may narrow in 2026 because those chips command higher prices than products sold to other customers, Wakasugi said.\n\nFailed to load articles. Please try again."
    },
    {
        "title": "Meta: The Market's Surprising Pessimism Offers Us A Solid Buying Opportunity",
        "url": "https://seekingalpha.com/article/4872086-meta-markets-surprising-pessimism-offers-us-solid-buying-opportunity",
        "source": "Seeking Alpha",
        "date": "2026-02-19T15:29:00+00:00",
        "content": "Fritz Jorgensen/iStock Editorial via Getty Images\n\nFritz Jorgensen/iStock Editorial via Getty Images\n\nWell, if you are a Meta Platforms, Inc. (META) investor, I guess I could safely assume that you are feeling somewhat\n\nAnalyst’s Disclosure: I/we have a beneficial long position in the shares of META, AAPL, GOOGL either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body."
    }
]