[
    {
        "title": "Blackstone Inc. boosts Apple stake with 17,763 shares",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/AAPL/pressreleases/340587/blackstone-inc-boosts-apple-stake-with-17763-shares/",
        "source": "The Globe and Mail",
        "date": "2026-02-21T04:55:00+00:00",
        "content": "Blackstone Inc., managed by Stephen A. Schwarzman, recently executed a significant transaction involving Apple Inc ((AAPL)). The hedge fund increased its position by 17,763 shares.\n\nRecent Updates on Apple Inc stock\n\nApple shares have posted modest gains over the past year despite near-term volatility, recently trading around $259–$270 with 12‑month targets clustered near $300 and some top analysts eyeing $325, implying solid upside. Analysts cite record iPhone 17 demand, a sharp China rebound, record gross margins near 48%, and growing Services and AI initiatives, while cautioning about rich valuation and rising memory costs.\n\nAccording to Spark, TipRanks’ AI Analyst, AAPL is a Outperform.\n\nThe score is driven primarily by very strong financial performance (best-in-class margins and massive free cash flow) and a constructive earnings outlook with record results. Offsetting factors are mixed near-term technical momentum and a premium valuation with a low dividend yield, plus execution risks from supply constraints and input-cost pressures.\n\nTo see Spark’s full report on AAPL stock, click here.\n\nAverage Trading Volume: 48,812,071\n\nDisclaimer & DisclosureReport an Issue\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Needham Raises the Price Target on Amkor Technology, Inc. (AMKR) to $65 and Keeps a Buy Rating",
        "url": "https://uk.finance.yahoo.com/news/needham-raises-price-target-amkor-110826506.html",
        "source": "Yahoo Finance UK",
        "date": "2026-02-21T11:08:00+00:00",
        "content": "Your privacy is important to us\n\nYahoo is part of the Yahoo family of brandsThe sites and apps that we own and operate, including Yahoo and Engadget, and our digital advertising service, Yahoo Advertising.Yahoo family of brands.\n\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\n\nIf you would like to customise your choices, click 'Manage privacy settings'.\n\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy and Cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
    },
    {
        "title": "Why Is Commerce (CMRC) Stock Rocketing Higher Today",
        "url": "https://ca.finance.yahoo.com/news/why-commerce-cmrc-stock-rocketing-170109731.html",
        "source": "Yahoo Finance Canada",
        "date": "2026-02-21T08:00:00+00:00",
        "content": "Shares of e-commerce software company Commerce (NASDAQ:CMRC) jumped 8.5% in the morning session after the company's Executive Chair, Ellen F. Siminoff, reported a significant purchase of company stock.\n\nAccording to a filing, Siminoff bought 100,000 shares for a total value of $294,080. The transaction occurred as the stock was trading near its 52-week low. Such a large purchase by a high-level executive is often viewed by investors as a strong signal of confidence in the company's future prospects. It suggested that the leadership believed the shares were undervalued at their current price.\n\nIs now the time to buy Commerce? Access our full analysis report here, it’s free.\n\nCommerce’s shares are very volatile and have had 25 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\n\nThe previous big move we wrote about was 8 days ago when the stock dropped 12% on the news that the company reported fourth-quarter 2025 financial results that missed revenue expectations and provided a weak forecast for the upcoming quarter.\n\nWhile its adjusted earnings of $0.07 per share met analyst estimates, revenue of $89.52 million fell short of forecasts. Looking ahead, the company's outlook for the first quarter of 2026 pointed to revenue of around $83 million, which was below the analyst consensus of $85.99 million. The combination of a revenue miss and a cautious outlook appeared to disappoint investors, leading to the stock's decline.\n\nCommerce is down 21.3% since the beginning of the year, and at $3.20 per share, it is trading 54.9% below its 52-week high of $7.09 from February 2025. Investors who bought $1,000 worth of Commerce’s shares 5 years ago would now be looking at an investment worth $46.81.\n\nThe 1999 book Gorilla Game predicted Microsoft and Apple would dominate tech before it happened. Its thesis? Identify the platform winners early. Today, enterprise software companies embedding generative AI are becoming the new gorillas.  Click here for access to our special report that reveals one profitable leader already riding this wave, it’s free."
    },
    {
        "title": "Wedgewood Partners Cuts Apple Stake as David Rolfe Trims",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/AAPL/pressreleases/340697/wedgewood-partners-cuts-apple-stake-as-david-rolfe-trims/",
        "source": "The Globe and Mail",
        "date": "2026-02-21T04:19:00+00:00",
        "content": "Wedgewood Partners Inc, managed by David Rolfe, recently executed a significant transaction involving Apple Inc ((AAPL)). The hedge fund reduced its position by 23,970 shares.\n\nRecent Updates on Apple Inc stock\n\nApple (AAPL) has seen choppy but positive trading, recently around $259–$270, with weekly gains of 1.6%–5.1%, mixed one‑month moves, and 9%–19% upside over 12 months. Analysts maintain a “Moderate Buy” view, with average 12‑month targets near $299–$306 and several top bulls calling for $300–$330, implying solid upside.\n\nRecent upgrades and reiterations from Goldman Sachs, BofA, J.P. Morgan, and others cite a blockbuster iPhone 17 cycle, record 48% product and Services‑led margins, and rapid growth in China and other key markets. While rising memory costs and a rich ~30x forward P/E pose risks, analysts see AI‑enabled Siri, Apple Intelligence with Google’s Gemini, and the 2.5 billion‑device base driving Services and justifying premium valuations.\n\nAccording to Spark, TipRanks’ AI Analyst, AAPL is a Outperform.\n\nThe score is driven primarily by very strong financial performance (best-in-class margins and massive free cash flow) and a constructive earnings outlook with record results. Offsetting factors are mixed near-term technical momentum and a premium valuation with a low dividend yield, plus execution risks from supply constraints and input-cost pressures.\n\nTo see Spark’s full report on AAPL stock, click here.\n\nAverage Trading Volume: 48,812,071\n\nDisclaimer & DisclosureReport an Issue\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Is a Stock Market Crash Brewing in 2026 Under President Donald Trump? The Data Doesn't Lie.",
        "url": "https://finance.yahoo.com/news/stock-market-crash-brewing-2026-092600002.html",
        "source": "Yahoo Finance",
        "date": "2026-02-21T09:47:00+00:00",
        "content": "The data doesn't lie: Wall Street has thrived with President Donald Trump in the White House.\n\nAlthough a rising stock market is relatively normal, regardless of the political party in power, aggregate stock returns under Trump have been above average. During his first non-consecutive term, the widely followed Dow Jones Industrial Average (DJINDICES: ^DJI), benchmark S&P 500 (SNPINDEX: ^GSPC), and innovation-inspired Nasdaq Composite (NASDAQINDEX: ^IXIC) soared by 57%, 70%, and 142%, respectively.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nThese outsize returns have continued in President Trump's second term. Since his inauguration on Jan. 20, 2025, the Dow, S&P 500, and Nasdaq Composite have respectively rallied by 14%, 14%, and 15%.\n\nBut as Wall Street's major stock indexes have ascended to new heights, so have the potential headwinds threatening to pull the rug out from beneath this supercharged bull market. The question on most investors' minds is: Will a stock market crash take place in 2026 under Donald Trump? While no one can definitively answer this question, a few time-tested data points have clued investors in on what they can likely expect in the not-too-distant future.\n\nAlthough back-tested data sets and correlated events can't guarantee what's to come, they do help remove emotion from the equation, thereby allowing investors to view the stock market objectively. Two data-driven events, in particular, point to an increased likelihood that the Dow, S&P 500, and Nasdaq Composite will endure significant declines in 2026.\n\nTo begin with, the S&P 500's Shiller Price-to-Earnings (P/E) Ratio is nearing uncharted territory. The Shiller P/E, also referred to as the Cyclically Adjusted P/E Ratio, or CAPE Ratio, is based on average inflation-adjusted earnings over the prior 10 years. Incorporating a decade of earnings history into its calculation ensures that recessions and shock events can't render this valuation tool useless.\n\nThough the Shiller P/E wasn't introduced until the late 1980s, it's been back-tested to January 1871. Over this 155-year period, the CAPE Ratio has averaged approximately 17.3. But for the last three months, it's vacillated between 39 and 41. The only time the Shiller P/E has been higher than it is now is in the lead-up to the bursting of the dot-com bubble.\n\nThe Shiller P/E isn't particularly helpful in identifying when corrections will begin. However, the five previous occurrences spanning 155 years in which it exceeded 30 during a continuous bull market were eventually followed by declines of 20% or greater in the Dow, S&P 500, and/or Nasdaq Composite. What the CAPE Ratio conclusively shows is that extended valuation premiums aren't tolerated over long periods on Wall Street. This is one of the stock market's red flags -- and the data doesn't lie.\n\nThe other potentially worrisome data-driven event is the upcoming midterm elections in November.\n\nPresident Trump began his second term with a unified government -- Republicans hold majorities in the House and Senate. However, the party of a sitting president frequently loses seats in one or both houses of Congress during midterm elections. With the GOP holding a slim majority in the House, it wouldn't take much of a shift in voting to create a split Congress. A divided Congress would likely eliminate the president's chance of signing any additional major legislation during his second term.\n\nAccording to data collected by Carson Investment Research and published on X (formerly Twitter) by Chief Market Strategist Ryan Detrick, stock market corrections tend to be larger during midterm years than any other year of a president's term.\n\nSince 1950, the average peak-to-trough downturn during midterm years in the S&P 500 has been 17.5% (i.e., within striking distance of a bear market). What's more, the S&P 500 fell nearly 20% during midterms in President Trump's first term.\n\nThe data demonstrates that Wall Street dislikes pricey stock markets and fiscal uncertainty. While both of these time-tested data sets point to a heightened likelihood of a stock market correction or perhaps even a bear market in 2026, neither indicates that a stock market crash is imminent or even brewing. Since history tends to rhyme on Wall Street, investors should expect a pullback in stocks at some point, but shouldn't be overly concerned with rumblings of a stock market crash.\n\nWhile decades, if not more than a century, of data point to potential stock market weakness in 2026, history offers an entirely different outlook for investors focused on the horizon.\n\nOn the one hand, stock market corrections, bear markets, and those pesky elevator-down moves that pull on investors' heartstrings are normal and inevitable events. Since stock market downturns are often driven, in part, by emotion, there's nothing the federal government or Federal Reserve can do to avoid this part of the investing cycle.\n\nBut what history teaches is that stock market cycles aren't mirror images of each other. Despite corrections, bear markets, and crashes being inevitable and representing the price of admission to the world's greatest wealth creator, bull markets and periods of optimism last substantially longer.\n\nLess than two weeks ago, analysts at Bespoke Investment Group refreshed a data set that examined the length of every S&P 500 bull and bear market, dating back to the beginning of the Great Depression (September 1929).\n\nAmong the 27 bear markets that have occurred over the last 96 years, just a third have reached the one-year mark, with none surpassing 630 calendar days. Further, the average bear market has hit its trough after 286 calendar days, or approximately 9.5 months. In other words, when significant downturns do occur, they tend to resolve quickly -- especially during stock market crashes.\n\nIn comparison, 10 S&P 500 bull markets, including the current one, have lasted longer than 1,200 calendar days. The typical bull market climb has endured for 1,011 calendar days, which is roughly 3.5 times longer than the average bear market.\n\nEven without knowing when stock market corrections will begin or how steep the decline will be, nearly a century of data conclusively shows that maintaining optimism and being patient is the formula for growing your wealth on Wall Street.\n\nBefore you buy stock in S&P 500 Index, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and S&P 500 Index wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $415,256!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,151,865!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 892% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 21, 2026.\n\nSean Williams has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.\n\nIs a Stock Market Crash Brewing in 2026 Under President Donald Trump? The Data Doesn't Lie. was originally published by The Motley Fool"
    }
]