[
    {
        "title": "Apple (AAPL) Trading 10% Below Analyst Targets After This Week's 8% Drop",
        "url": "https://247wallst.com/investing/2026/02/16/apple-aapl-trading-14-2-below-analyst-targets-after-this-weeks-8-drop/",
        "source": "24/7 Wall St.",
        "date": "2026-02-16T19:22:00+00:00",
        "content": "Apple (AAPL) fell 7.95% in a week to $255.78 despite record iPhone sales of $85.27B and $143.76B revenue.\n\nApple faces doubled NAND flash costs starting Q1 2026 and delays in Apple Intelligence 2.0 past March.\n\n29 of 47 analysts maintain Buy ratings with average target of $292.15 despite the selloff.\n\nSending You to Google News in 3\n\n© Photo by Drew Angerer / Getty Images\n\nApple (NASDAQ: AAPL | AAPL Price Prediction) closed at $255.78 on February 13, down 7.95% from the previous week’s $277.86. Yet Wall Street analysts still see the stock climbing to an average target of $292.15, implying 10% upside from current levels. That disconnect raises a question: is the market pricing in risks analysts are missing, or did the selloff create an entry point?\n\nThe drop came despite Apple reporting a blowout quarter in late January. Revenue hit $143.76 billion, beating estimates, while iPhone sales reached an all-time quarterly high of $85.27 billion. The company returned nearly $32 billion to shareholders and saw its installed base surpass 2.5 billion active devices. Yet the stock has struggled in the weeks since, falling 5.83% year to date while the S&P 500 has remained essentially flat at negative 0.02%.\n\nThe decline accelerated in mid-February as specific concerns emerged. Apple agreed to contract terms with Kioxia that will see NAND flash memory prices double starting in Q1 2026, with quarterly repricing thereafter. That signals ongoing component cost inflation even as the company locks in short-term supply.\n\nMore troubling for investors betting on an AI-driven growth cycle, Evercore ISI reported anticipated delays in the Apple Intelligence 2.0 launch, potentially pushing the release past March. The firm cited testing headwinds and Apple’s privacy-first approach as reasons for the multi-phase rollout, with a complete Siri overhaul not expected until fall 2026. Regulatory scrutiny also intensified, with the FTC raising concerns about alleged political bias in Apple News while antitrust litigation continues.\n\nTechnical indicators confirm the severity of the move. The Relative Strength Index dropped to 39.59 as of February 13, down from 69.03 on February 6. That 29-point swing in seven days pushed the stock into oversold territory, a level historically associated with near-term bounces.\n\nDespite the selloff, 29 of 47 analysts covering Apple maintain Buy or Strong Buy ratings. Evercore kept its Outperform rating with a $330 price target even after flagging the AI delays. The firm argued that Apple’s privacy focus and seamless integration justify the slower rollout.\n\nThe bull case centers on durable growth drivers that extend beyond quarterly noise. The iPhone 17 cycle continues to show strength, with 23% year-over-year growth in the most recent quarter. Services reached a record $30.01 billion, up 14% year over year, providing high-margin recurring revenue. Apple’s partnership with Google on AI features reduces R&D burden while maintaining ecosystem control. The company is also expanding into streaming content, recently acquiring rights to Severance for approximately $70 million as it works to make Apple TV+ profitable.\n\nJim Cramer called Apple “the greatest free rider in history” for its Google AI partnership, arguing the company gains cutting-edge capabilities without the massive capital expenditure rivals face. That strategic positioning matters as Nvidia and Microsoft pour billions into AI infrastructure.\n\nThe data shows Apple underperforming the broader market by nearly 6 percentage points year to date, with the gap widening sharply in recent weeks. Yet analyst conviction remains strong, with 62% of coverage at Buy or better. The disconnect suggests either the market is ahead of Wall Street in pricing execution risks, or short-term concerns are masking a compelling setup.\n\nInvestors are monitoring whether Apple can execute on AI features without further delays and manage component cost inflation without margin compression. The fundamental story remains intact: record iPhone demand, expanding services revenue, and a capital-light AI strategy that avoids the massive spending competitors face. Trading at 32 times trailing earnings with 27% profit margins and $42.10 billion in quarterly net income, the valuation reflects expectations for continued execution.\n\nThe technical setup also suggests potential for a near-term bounce. Previous oversold readings in January recovered within two weeks, and the current RSI of 39.59 suggests capitulation selling. If Apple delivers on the delayed AI features by summer and component costs stabilize, the path back to $292 analyst targets becomes more achievable.\n\nKey risks include AI delays extending beyond fall or margin pressure intensifying. The doubled NAND pricing signals that component inflation hasn’t peaked. If Apple Intelligence 2.0 slips further or adoption disappoints when it does launch, the premium valuation becomes harder to justify. Competitive pressure from Nvidia and Microsoft in AI, combined with regulatory headwinds, could keep the stock range-bound even as fundamentals hold up.\n\nThe risk-reward calculation depends on execution. Retail sentiment turned bearish during the decline, with Reddit activity showing sentiment scores between 25 and 42 through mid-February, well into bearish territory. That contrarian indicator, combined with oversold technicals and analyst conviction, suggests the selloff may have been overdone. But the company needs to prove it can deliver on AI promises and protect margins, or the 9% gap to analyst targets could widen rather than close.\n\nOur top personal finance-related articles today. Your wallet will thank you later.\n\nAstera Labs (Nasdaq: ALAB) closed at $129.32 on February 13, 2026, down 23.86% over the past week. Wall Street’s average…\n\nUpstart Holdings (NASDAQ: UPST) has dropped 19.77% over the past week, falling from $38.24 to $30.68 as of February 13.…\n\nApple may have some concerns building around just how many new iPhones it really will be selling in the near…\n\nApple has recovered handily from its March lows as the market recovery has been strong. That said, Apple is running…\n\nTuesday morning brings five major stories, and five ways to profit. Here’s what happened and how you make money from…\n\nThe post-earnings rise in Apple's shares was the push that allowed the Dow to hit 22,000 for the first time…\n\nIt hasn’t gone unnoticed by the broader market that Shares of Qualcomm (NASDAQ:QCOM) fell sharply in early February, coinciding with…\n\nHere are some of the Apple target cuts and other comments that have been seen since the start of March.…\n\nIt’s hard not to be optimistic about Apple in the long term. The most recent earnings report shed more light…"
    },
    {
        "title": "Progressive Investment Management Corp Cuts Apple Inc Stake",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/AAPL/pressreleases/234890/progressive-investment-management-corp-cuts-apple-inc-stake/",
        "source": "The Globe and Mail",
        "date": "2026-02-16T03:34:00+00:00",
        "content": "Progressive Investment Management Corp, managed by Carsten Henningsen, recently executed a significant transaction involving Apple Inc ((AAPL)). The hedge fund reduced its position by 1,442 shares.\n\nRecent Updates on Apple Inc stock\n\nApple (AAPL) has posted modest short-term gains but solid 12‑month returns, recently trading around $259–$270 with analysts maintaining a “Moderate Buy” view and price targets near $300, implying meaningful upside. Recent strength is driven by a powerful iPhone 17 cycle, record gross margins near 48%, robust China demand, and expanding Services, while risks center on rich valuation and rising memory costs.\n\nAccording to Spark, TipRanks’ AI Analyst, AAPL is a Outperform.\n\nThe score is driven primarily by very strong financial performance (best-in-class margins and massive free cash flow) and a constructive earnings outlook with record results. Offsetting factors are mixed near-term technical momentum and a premium valuation with a low dividend yield, plus execution risks from supply constraints and input-cost pressures.\n\nTo see Spark’s full report on AAPL stock, click here.\n\nAverage Trading Volume: 48,514,686\n\nDisclaimer & DisclosureReport an Issue\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Stocks, Bonds Fluctuate in Holiday-Thinned Trade: Markets Wrap",
        "url": "https://finance.yahoo.com/news/stocks-gain-bonds-steady-holiday-124715230.html",
        "source": "Yahoo Finance",
        "date": "2026-02-16T16:51:00+00:00",
        "content": "(Bloomberg) -- Stocks and bonds posted small moves amid muted holiday trading after Friday’s benign US inflation data reinforced expectations that the Federal Reserve will cut interest rates this year.\n\nFutures on the S&P 500 were flat and Europe’s Stoxx 600 index gained 0.1%. NatWest Group Plc climbed 4.8% after Citigroup Inc. raised its price target on the UK lender. German bunds and Treasury futures were steady after US yields touched the lowest since December on Friday.\n\nA Tunnel to Transform Los Angeles\n\nNew Zealand Net Migration Sinks to Lowest Level in More Than a Decade\n\nTexas Airspace Closure Fallout Grows, Senators Seek Answers\n\nNFL’s Houston Texans to Shift HQ to New Suburban Development\n\nWith the US observing the Presidents’ Day holiday and mainland China’s markets closed for Lunar New Year holidays, trading volumes were thin. Still, the path of US interest rates remains in focus following the slower-than-expected US inflation print as traders fully price a Fed cut in July and the strong chance of a move in June.\n\n“The backdrop for equities is positive post CPI,” said Andrea Gabellone, head of global equities at KBC Securities. At the same time, there could be “more dispersion ahead as sentiment around key AI-exposed sectors is still very critical,” he added.\n\nThat sentiment was echoed by other strategists seeking to distinguish between AI losers and winners.\n\nA JPMorgan Chase & Co. team led by Mislav Matejka urged caution on stocks at risk of AI-driven “cannibalization,” including software, business services and media companies.\n\nFutures on the tech-heavy Nasdaq 100 were down 0.2%.\n\nFirms are developing tools to capitalize on the divergence. Goldman Sachs Group Inc. launched a new basket of software stocks that goes long firms that will benefit from AI adoption, while shorting the companies whose workflows could be replaced.\n\nWith AI disruption rippling through markets, a lot will come down to earnings resilience, in particular in the US.\n\n“When you look at the current earnings season, the companies are showing 13% of growth,” Nataliia Lipikhina, head of EMEA equity strategy at JPMorgan, told Bloomberg TV. “Overall, this is the reason why we continue to be positive on the S&P.”\n\nLater this week, traders will be watching for ADP private payrolls numbers on Tuesday and the minutes from the Fed’s January meeting on Wednesday for a fresh read on the economy.\n\nWhat Bloomberg strategists say...\n\nGlobal equities are likely to retreat as the fracturing AI outlook drags down megatechs and sectors vulnerable to disruptions. Stock declines will help bonds extend their rallies.\n\n— Garfield Reynolds, MLIV Team Leader. For full analysis, click here.\n\nElsewhere, gold dipped below $5,000 an ounce, as traders booked profits from a gain in the previous session.\n\nThe dollar was steady. Bitcoin fell 1.5% to $68,505 after posting its fourth consecutive weekly loss, with the cryptocurrency struggling to find clear direction as a weekend rally fizzled.\n\nWarner Bros Discovery Inc. is considering reopening sale talks with rival Hollywood studio Paramount Skydance Corp. after receiving its hostile suitor’s most recent amended offer, people with knowledge of the matter said.\n\nAlibaba Group Holding Ltd. unveiled a major upgrade of its flagship AI model, accelerating a race with a panoply of startups and sectoral leaders aiming to get in ahead of Chinese sensation DeepSeek’s next big platform.\n\nNatWest rose the most since October. Citi analyst Andrew Coombs raised his price target on the UK bank to a Street-high and upped his estimates for pretax profit and earnings-per-share to account for the acquisition of wealth manager Evelyn Partners and higher net interest income.\n\nOrsted A/S advanced as much as 4% after an upgrade from analysts at Kepler Cheuvreux, who were positive on the wind turbines operator’s outlook despite ongoing uncertainty for the industry in the US.\n\nVolkswagen plans to cut costs by 20% by the end of 2028, Manager Magazin reported, without saying where it got the information.\n\nA group led by Macquarie Asset Management will buy Qube Holdings Ltd. in a deal worth around A$11.7 billion ($8.3 billion).\n\nSome of the main moves in markets:\n\nS&P 500 futures were little changed as of 4:49 p.m. New York time\n\nFutures on the Dow Jones Industrial Average were little changed\n\nThe MSCI World Index was little changed\n\nThe Bloomberg Dollar Spot Index rose 0.1%, more than any closing gain since Feb. 5, 2026\n\nThe euro weakened 0.1%,falling for the fifth straight day, the longest losing streak since Nov. 21, 2025\n\nThe British pound fell 0.2% to $1.3627\n\nThe Japanese yen slipped 0.6%, more than any closing loss since Feb. 4, 2026\n\nThe offshore yuan rose 0.2% to the highest in almost three years\n\nThe Mexican peso was little changed at 17.1648\n\nBitcoin fell 0.5% to $68,504.79\n\nThe yield on 10-year Treasuries was little changed at 4.05%\n\nGermany’s 10-year yield was little changed at 2.75%\n\nBritain’s 10-year yield declined two basis points, falling for the fifth straight day, the longest losing streak since Jan. 12, 2026\n\nWest Texas Intermediate crude rose 1.3%, more than any closing gain since Feb. 4, 2026\n\nSpot gold fell 1% to $4,992.08 an ounce\n\nThis story was produced with the assistance of Bloomberg Automation.\n\n--With assistance from Richard Henderson and Sebastian Boyd.\n\nMost Read from Bloomberg Businessweek\n\nThe Georgia Pastor Accused of Defrauding the VA of Nearly $24 Million\n\nAmerica’s Most Powerful CEOs Are Awfully Quiet Lately\n\nDrug Cartels Are Shifting Their Money Laundering to Crypto. Cops Can’t Keep Up\n\nEpstein Files Contain a Big Clue About Cambodia’s Missing Masterpieces\n\nIndustry TV Recap: Shades of Epstein"
    },
    {
        "title": "Cameco (CCJ) Upgraded to Strong Buy: What Does It Mean for the Stock?",
        "url": "https://finance.yahoo.com/news/cameco-ccj-upgraded-strong-buy-170004189.html",
        "source": "Yahoo Finance",
        "date": "2026-02-16T19:16:00+00:00",
        "content": "Cameco (CCJ) could be a solid addition to your portfolio given its recent upgrade to a Zacks Rank #1 (Strong Buy). This rating change essentially reflects an upward trend in earnings estimates -- one of the most powerful forces impacting stock prices.\n\nA company's changing earnings picture is at the core of the Zacks rating. The system tracks the Zacks Consensus Estimate -- the consensus measure of EPS estimates from the sell-side analysts covering the stock -- for the current and following years.\n\nIndividual investors often find it hard to make decisions based on rating upgrades by Wall Street analysts, since these are mostly driven by subjective factors that are hard to see and measure in real time. In these situations, the Zacks rating system comes in handy because of the power of a changing earnings picture in determining near-term stock price movements.\n\nTherefore, the Zacks rating upgrade for Cameco basically reflects positivity about its earnings outlook that could translate into buying pressure and an increase in its stock price.\n\nThe change in a company's future earnings potential, as reflected in earnings estimate revisions, and the near-term price movement of its stock are proven to be strongly correlated. That's partly because of the influence of institutional investors that use earnings and earnings estimates for calculating the fair value of a company's shares. An increase or decrease in earnings estimates in their valuation models simply results in higher or lower fair value for a stock, and institutional investors typically buy or sell it. Their transaction of large amounts of shares then leads to price movement for the stock.\n\nFundamentally speaking, rising earnings estimates and the consequent rating upgrade for Cameco imply an improvement in the company's underlying business. Investors should show their appreciation for this improving business trend by pushing the stock higher.\n\nAs empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock movements, tracking such revisions for making an investment decision could be truly rewarding. Here is where the tried-and-tested Zacks Rank stock-rating system plays an important role, as it effectively harnesses the power of earnings estimate revisions.\n\nThe Zacks Rank stock-rating system, which uses four factors related to earnings estimates to classify stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), has an impressive externally-audited track record, with Zacks Rank #1 stocks generating an average annual return of +25% since 1988. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here >>>> .\n\nFor the fiscal year ending December 2026, this uranium producer is expected to earn $1.57 per share, which is unchanged compared with the year-ago reported number.\n\nAnalysts have been steadily raising their estimates for Cameco. Over the past three months, the Zacks Consensus Estimate for the company has increased 14.1%.\n\nUnlike the overly optimistic Wall Street analysts whose rating systems tend to be weighted toward favorable recommendations, the Zacks rating system maintains an equal proportion of \"buy\" and \"sell\" ratings for its entire universe of more than 4,000 stocks at any point in time. Irrespective of market conditions, only the top 5% of the Zacks-covered stocks get a \"Strong Buy\" rating and the next 15% get a \"Buy\" rating. So, the placement of a stock in the top 20% of the Zacks-covered stocks indicates its superior earnings estimate revision feature, making it a solid candidate for producing market-beating returns in the near term.\n\nYou can learn more about the Zacks Rank here >>>\n\nThe upgrade of Cameco to a Zacks Rank #1 positions it in the top 5% of the Zacks-covered stocks in terms of estimate revisions, implying that the stock might move higher in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCameco Corporation (CCJ) : Free Stock Analysis Report\n\nThis article originally published on Zacks Investment Research (zacks.com)."
    },
    {
        "title": "Dow Jones futures gains as risk sentiment improves on Fed rate cut bets",
        "url": "https://www.fxstreet.com/news/dow-jones-futures-gains-as-risk-sentiment-improves-on-fed-rate-cut-bets-202602160936",
        "source": "FXStreet",
        "date": "2026-02-16T09:37:00+00:00",
        "content": "Dow Jones futures rise 0.36% to around 49,750 during European hours on Monday. S&P 500 and Nasdaq 100 futures rise 0.39% and 0.37%, respectively, trading near 6,880 and 24,900. US regular markets will be closed amid Presidents’ Day, while trading activity in Asia is expected to remain subdued as China, South Korea, and Taiwan observe Lunar New Year holidays.\n\nUS index futures advance as risk sentiment improves following softer January Consumer Price Index (CPI) data, reinforced expectations that the Federal Reserve (Fed) could cut rates later this year. The CME FedWatch tool indicates investors now see nearly a 90% probability of the Fed holding rates steady in March, up from 81% a week earlier. Markets are pricing in a 25-basis-point cut in June at roughly a 52% probability.\n\nWall Street closed last week lower, with the Dow Jones falling 1.23%, the S&P 500 declining 1.39%, and the Nasdaq 100 dropping 2.1%, weighed down by losses in financials, communication services, consumer discretionary, and technology stocks.\n\nTraders may adopt caution due to renewed concerns over elevated AI-related capital spending and potential structural disruptions across certain industries. Among megacap tech stocks, Apple, Amazon, Meta, Alphabet, and Broadcom ended the previous week in the red. Investors now look ahead to another round of corporate earnings for clearer direction on the outlook.\n\nThe Dow Jones Industrial Average, one of the oldest stock market indices in the world, is compiled of the 30 most traded stocks in the US. The index is price-weighted rather than weighted by capitalization. It is calculated by summing the prices of the constituent stocks and dividing them by a factor, currently 0.152. The index was founded by Charles Dow, who also founded the Wall Street Journal. In later years it has been criticized for not being broadly representative enough because it only tracks 30 conglomerates, unlike broader indices such as the S&P 500.\n\nMany different factors drive the Dow Jones Industrial Average (DJIA). The aggregate performance of the component companies revealed in quarterly company earnings reports is the main one. US and global macroeconomic data also contributes as it impacts on investor sentiment. The level of interest rates, set by the Federal Reserve (Fed), also influences the DJIA as it affects the cost of credit, on which many corporations are heavily reliant. Therefore, inflation can be a major driver as well as other metrics which impact the Fed decisions.\n\nDow Theory is a method for identifying the primary trend of the stock market developed by Charles Dow. A key step is to compare the direction of the Dow Jones Industrial Average (DJIA) and the Dow Jones Transportation Average (DJTA) and only follow trends where both are moving in the same direction. Volume is a confirmatory criteria. The theory uses elements of peak and trough analysis. Dow’s theory posits three trend phases: accumulation, when smart money starts buying or selling; public participation, when the wider public joins in; and distribution, when the smart money exits.\n\nThere are a number of ways to trade the DJIA. One is to use ETFs which allow investors to trade the DJIA as a single security, rather than having to buy shares in all 30 constituent companies. A leading example is the SPDR Dow Jones Industrial Average ETF (DIA). DJIA futures contracts enable traders to speculate on the future value of the index and Options provide the right, but not the obligation, to buy or sell the index at a predetermined price in the future. Mutual funds enable investors to buy a share of a diversified portfolio of DJIA stocks thus providing exposure to the overall index.\n\nAkhtar Faruqui is a Forex Analyst based in New Delhi, India. With a keen eye for market trends and a passion for dissecting complex financial dynamics, he is dedicated to delivering accurate and insightful Forex news and analysis.\n\nEUR/USD is still under pressure, drifting back towards the 1.1850 area as Monday’s session draws to a close. The modest decline in spot comes as the US Dollar picks up a bit of support, while thin liquidity and muted volatility, thanks to the US market holiday, are exaggerating price swings and keeping trading conditions choppy.\n\nGBP/USD has quickly given back Friday’s solid gains, turning lower at the start of the week and drifting back towards the 1.3630 area. The focus now shifts squarely to Tuesday’s UK labour market report, which is likely to keep the quid firmly in the spotlight and could set the tone for Cable’s next move.\n\nGold is giving back part of Friday’s sharp rebound, deflating below the key $5,000 mark per troy ounce as the new week gets underway. Modest gains in the US Dollar are keeping the metal in check, while thin trading conditions, due to the Presidents Day holiday in the US, are adding to the choppy and hesitant tone across markets.\n\nThe artificial intelligence (AI) cryptocurrency segment is witnessing heightened volatility, with top tokens such as Near Protocol (NEAR) struggling to gain traction amid the persistent decline in January and February.\n\nIt is likely to be a quiet start to the week, with US markets closed on Monday for Presidents Day. European markets are higher across the board and gold is clinging to the $5,000 level after the tamer than expected CPI report in the US reduced haven flows to precious metals.\n\nRipple is trading in a narrow range between $1.45 (immediate support) and $1.50 (resistance) at the time of writing on Monday. The remittance token extended its recovery last week, peaking at $1.67 on Sunday from the weekly open at $1.43."
    }
]