[
    {
        "title": "1 Small-Cap Stock Worth Your Attention and 2 We Find Risky",
        "url": "https://finance.yahoo.com/news/1-small-cap-stock-worth-043407283.html",
        "source": "Yahoo Finance",
        "date": "2026-02-09T17:42:00+00:00",
        "content": "Many small-cap stocks have limited Wall Street coverage, giving savvy investors the chance to act before everyone else catches on. But the flip side is that these businesses have increased downside risk because they lack the scale and staying power of their larger competitors.\n\nThe downside that can come from buying these securities is precisely why we started StockStory - to isolate the long-term winners from the losers so you can invest with confidence. That said, here is one small-cap stock that could be the next big thing and two that could be down big.\n\nCredited with introducing the first variable-speed pool pump, Hayward (NYSE:HAYW) makes residential and commercial pool equipment and accessories.\n\nWhy Are We Cautious About HAYW?\n\nOrganic revenue growth fell short of our benchmarks over the past two years and implies it may need to improve its products, pricing, or go-to-market strategy\n\nEarnings per share have contracted by 26.9% annually over the last four years, a headwind for returns as stock prices often echo long-term EPS performance\n\nShrinking returns on capital from an already weak position reveal that neither previous nor ongoing investments are yielding the desired results\n\nHayward’s stock price of $16.72 implies a valuation ratio of 19.5x forward P/E. If you’re considering HAYW for your portfolio, see our FREE research report to learn more.\n\nEmploying thousands of drivers across the country to make deliveries, Schneider (NYSE:SNDR) makes full truckload and intermodal deliveries regionally and across borders.\n\nSales trends were unexciting over the last two years as its 1.6% annual growth was below the typical industrials company\n\nFalling earnings per share over the last five years has some investors worried as stock prices ultimately follow EPS over the long term\n\nEroding returns on capital suggest its historical profit centers are aging\n\nSchneider is trading at $29.65 per share, or 35.5x forward P/E. Dive into our free research report to see why there are better opportunities than SNDR.\n\nDeveloping sirens that warned of air raid attacks or fallout during the Cold War, Federal Signal (NYSE:FSS) provides safety and emergency equipment for government agencies, municipalities, and industrial companies.\n\nAnnual revenue growth of 12.3% over the past five years was outstanding, reflecting market share gains this cycle\n\nExciting sales outlook for the upcoming 12 months calls for 15.6% growth, an acceleration from its two-year trend\n\nIncremental sales significantly boosted profitability as its annual earnings per share growth of 27.9% over the last two years outstripped its revenue performance\n\nAt $116.64 per share, Federal Signal trades at 24.8x forward P/E. Is now a good time to buy? See for yourself in our comprehensive research report, it’s free.\n\nIf your portfolio success hinges on just 4 stocks, your wealth is built on fragile ground. You have a small window to secure high-quality assets before the market widens and these prices disappear.\n\nDon’t wait for the next volatility shock. Check out our Top 5 Growth Stocks for this month. This is a curated list of our High Quality stocks that have generated a market-beating return of 244% over the last five years (as of June 30, 2025).\n\nStocks that made our list in 2020 include now familiar names such as Nvidia (+1,326% between June 2020 and June 2025) as well as under-the-radar businesses like the once-small-cap company Exlservice (+354% five-year return). Find your next big winner with StockStory today."
    },
    {
        "title": "Zacks Industry Outlook Highlights S&P Global, Intercontinental Exchange, CME Group, Nasdaq and Cboe Global",
        "url": "https://finance.yahoo.com/news/zacks-industry-outlook-highlights-p-110300273.html?fr=sycsrp_catchall",
        "source": "Yahoo Finance",
        "date": "2026-02-09T12:57:00+00:00",
        "content": "Chicago, IL – February 9, 2026 – Today, Zacks Equity Research discusses S&P Global SPGI, Intercontinental Exchange ICE, CME Group CME, Nasdaq Inc. NDAQ and Cboe Global Markets CBOE.\n\nIndustry: Securities & Exchanges\n\nLink: https://www.zacks.com/commentary/2835878/5-securities-exchanges-stocks-to-watch-amid-increased-volatility\n\nA compelling and diversified product portfolio helps drive the revenues of Zacks Securities and Exchanges industry players. A rise in trading volumes, product expansion through prudent acquisitions and the increased adoption of a greater number of crypto assets are expected to benefit S&P Global, Intercontinental Exchange, CME Group, Nasdaq Inc. and Cboe Global Markets.\n\nIncreased focus on accelerating their non-trading revenue base, which comprises market technology, listing and information revenues, infuses dynamism in the business profile of the industry players. The industry is expected to get an impetus under the Trump administration, given his crypto favoritism. The sector is also witnessing increased retail trading.\n\nHowever, alterations in investment patterns and priorities and compliance with regulations pose challenges. With the increasing digitization of financial markets, cyber threats and data breaches continue to pose serious risks.Mergers and acquisitions are gaining momentum across the industry, with companies leveraging strategic partnerships and acquisitions to fuel growth and innovation. These initiatives help unlock new markets, protect domestic market share, diversify product offerings and reinforce trading platforms. Deloitte observes that exchanges are increasingly embracing consolidation to adapt to rapidly changing technological, regulatory and competitive environments.\n\nThe Zacks Securities and Exchanges industry comprises companies that operate electronic marketplaces, which facilitate the buying and selling of stocks, stock options and bonds or commodity contracts. They facilitate trading across a diverse range of products in multiple asset classes and geographies.\n\nThe companies generate revenues from fees received from the listed companies on their exchanges. They also provide a range of data and listing services to global financial and commodity markets, including pricing and reference data, exchange data, analytics, feeds, index services, investments, risk management, desktops, and connectivity solutions, as well as corporate and ETF listing services, on the cash equity exchanges.\n\nThe industry is witnessing increased adoption of crypto assets. Yet industry players have to comply with a number of regulations, resulting in challenges.\n\n4 Trends Shaping the Future of the Securities and Exchanges Industry\n\nVolatility Fueling Trading Volume: Industry revenues are primarily driven by product and service offerings, including trade execution, clearing and settlement of securities and commodities, listing services, and trading and clearing systems. Growth in trading volumes—often fueled by market volatility—boosts transaction and clearing fees, a key revenue driver.\n\nA supportive crypto environment, with lighter regulation and broader adoption of digital assets, is expected to further lift trading activity and fees. Profitability hinges on maximizing transaction revenues while controlling costs. Technavio estimates the global securities exchanges market will reach $49.6 billion by 2028, growing at a 12.1% CAGR, supported by rising investment demand and cryptocurrency adoption.\n\nDiversification Into Other Recurring Revenue Sources: Securities exchanges are increasingly focusing on recurring revenues to lower reliance on unpredictable trading-driven income. With market volumes often fluctuating, stable revenue streams from data services, listings, clearing, and technology platforms offer consistent cash flows and stronger earnings stability.\n\nThese revenues also support growth by addressing rising demand for market data, compliance, ESG offerings and digital asset infrastructure. The players are strengthening their presence in the evolving landscape and thereby enhancing scalability and margins. Increasing focus on accelerating the non-trading revenue base also infuses dynamism in the business profiles of the industry participants. In fact, exchanges are focusing on market data monetization and earning more from data feeds and analytics.\n\nMergers and Acquisitions: Mergers and acquisitions are gaining momentum across the industry, with companies leveraging strategic partnerships and acquisitions to fuel growth and innovation. These initiatives help unlock new markets, protect domestic market share, diversify product offerings and reinforce trading platforms. Deloitte observes that exchanges are increasingly embracing consolidation to adapt to rapidly changing technological, regulatory and competitive environments.\n\nContinuous Investment in Technology: Industry players are intensifying technology investments to enhance competitiveness and adaptability. There is growing emphasis on creating strategic market models through advanced tools, especially AI, while continually upgrading products and services.\n\nExchanges are increasingly leveraging AI and blockchain to strengthen efficiency and resilience. Recent advancements use machine learning, automation, and algorithms to improve trading accuracy, reduce cyber threats and limit human errors, thereby accelerating trading speed. Moreover, industry players are focusing on automating non-trading operations, which significantly contribute to revenue generation and support sustainable long-term growth.\n\nZacks Industry Rank Indicates Bright Prospects\n\nThe Zacks Securities and Exchanges industry is housed within the broader Zacks Finance sector. It carries a Zacks Industry Rank #48, which places it in the top 20% of the 243 Zacks industries.\n\nThe group’s Zacks Industry Rank, which is basically the average of the Zacks Rank of all the member stocks, reflects encouraging near-term prospects. Our research shows that the top 50% of the Zacks-ranked industries outperforms the bottom 50% by a factor of more than 2 to 1.\n\nThe industry’s positioning in the top 50% of the Zacks-ranked industries is a result of a positive earnings outlook for the constituent companies in aggregate. Looking at the aggregate earnings estimate revisions, it appears that analysts have been gaining confidence in this group’s earnings growth potential. Estimates for 2026 have increased 8.8% in a year.\n\nBefore we present a few securities and exchanges stocks worth considering for your portfolio, let’s take a look at the industry’s recent stock-market performance and valuation picture.\n\nIndustry Underperforms Sector and S&P 500\n\nThe Zacks Securities and Exchanges industry has underperformed the broader Zacks Finance sector as well as the Zacks S&P 500 composite year to date.\n\nThe industry has gained 0.6% compared with the broader sector’s increase of 13% and the Zacks S&P 500 composite’s rise of 17% in the said time frame.\n\nOn the basis of trailing 12-month price-to-earnings (P/E), which is commonly used for valuing exchange stocks, the industry is currently trading at 23.31X compared with the S&P 500’s 22.6X and the sector’s 17.5X.\n\nOver the last five years, the industry has traded as high as 29.62X, as low as 20.4X and at the median of 24.94X.\n\n5 Securities and Exchanges Stocks to Keep An Eye On\n\nWe are presenting two Zacks Rank #2 (Buy) stocks and three Zacks Rank #3 (Hold) stocks from the Securities and Exchanges industry. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nCboe Global Markets: Based in Chicago, IL, Cboe Global is one of the largest stock exchange operators by volume in the United States and globally for ETP trading. This Zacks Rank #2 stock is poised for growth, given its expanding product line across asset classes, broadening geographic reach and a diversifying business mix with recurring revenues and technology.\n\nThe Zacks Consensus Estimate for the company’s 2026 EPS indicates a year-over-year increase of 6.1%. The expected long-term earnings growth rate is pegged at 16.5%, better than the industry average of 11.6%. The consensus mark for 2026 earnings has moved 3.8% north in the past 30 days. It came up with a four-quarter average earnings surprise of nearly 2.93%.\n\nS&P Global: Headquartered in New York, this Zacks Rank #2 company is a leading provider of transparent and independent ratings, benchmarks, analytics and data to the capital and commodity markets worldwide. It remains well-positioned to gain from the growing demand for business information services. While buyouts help it innovate, increase differentiated content and develop products, continued service launches have been aiding the company's growth and enhancing its market reach.\n\nThe Zacks Consensus Estimate for 2026 earnings per share indicates an increase of 11.4% year over year. SPGI came up with a four-quarter average earnings surprise of 6.22%. The expected long-term earnings growth rate is pegged at 11.8%, better than the industry average. The consensus mark for 2026 earnings has moved 0.8% north in the past 30 days.\n\nNasdaq: Headquartered in New York, Nasdaq is a leading provider of trading, clearing, marketplace technology, regulatory, securities listing, information, and public and private company services. Its strategy of accelerating its non-trading revenue base, successfully maximizing opportunities as a technology and analytics provider, growing core marketplace businesses and intensifying its focus on Market Technology and Information Services businesses should continue to drive this Zacks Rank #3 stock.\n\nThe Zacks Consensus Estimate for 2026 and 2027 earnings per share indicates an increase of 8.9% and 12.3%, respectively, year over year. NDAQ came up with a four-quarter average earnings surprise of 4.78%. The expected long-term earnings growth rate is pegged at 16%, better than the industry average.\n\nCME Group: Headquartered in Chicago, IL, CME Group is the largest futures exchange in the world in terms of trading volume as well as notional value traded. Its efforts to expand future products in emerging markets, non-transaction-related opportunities, OTC offerings, cross-selling through alliances, global presence and liquidity should drive growth.\n\nThe Zacks Consensus Estimate for this Zacks Rank #3 company’s 2026 and 2027 EPS indicates a year-over-year increase of 4.5% and 5.3%, respectively. It came up with a four-quarter average earnings surprise of 1.18%. The expected long-term earnings growth rate is pegged at 7.6%. The consensus mark for 2026 earnings has moved north but that for 2027 has moved south in the past 30 days.\n\nIntercontinental Exchange: This Atlanta, GA-based company is a leading global operator of regulated exchanges, clearing houses and listings venues and a provider of data services for commodity, financial, fixed-income and equity markets. Its compelling portfolio, expansive risk-management services, strategic buyouts and a solid balance sheet bode well. It is the second-largest global fixed-income provider. This Zacks Rank #3 company, with the largest mortgage network across the United States, remains well-positioned to benefit from accelerated digitization in the U.S. residential mortgage industry.\n\nThe Zacks Consensus Estimate for this Zacks Rank #3 company’s 2026 EPS indicates a year-over-year increase of 9.3%. It came up with a four-quarter average earnings surprise of 2.75%. The expected long-term earnings growth rate is pegged at 7.6%. The consensus mark for 2026 earnings has moved 1 cent north in the past 30 days.\n\nFree: Instant Access to Zacks' Market-Crushing Strategies\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\n\nToday you can tap into those powerful strategies – and the high-potential stocks they uncover – free. No strings attached.\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nIntercontinental Exchange Inc. (ICE) : Free Stock Analysis Report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nNasdaq, Inc. (NDAQ) : Free Stock Analysis Report\n\nCboe Global Markets, Inc. (CBOE) : Free Stock Analysis Report\n\nS&P Global Inc. (SPGI) : Free Stock Analysis Report\n\nThis article originally published on Zacks Investment Research (zacks.com)."
    }
]