[
    {
        "title": "Why Mercury General (MCY) Stock Is Falling Today",
        "url": "https://finance.yahoo.com/news/why-mercury-general-mcy-stock-205545172.html",
        "source": "Yahoo Finance",
        "date": "2026-02-18T21:27:00+00:00",
        "content": "Shares of auto insurance provider Mercury General (NYSE:MCY) fell 8.6% in the afternoon session after the company's weak forward guidance overshadowed its strong fourth-quarter 2025 earnings report.\n\nAlthough the company posted impressive results, beating analysts' expectations on both revenue and profit, investors focused on the dimmer outlook. For the quarter, revenue grew 11.3% year over year to $1.54 billion, and GAAP earnings per share of $3.66 beat consensus estimates by 43%. However, the earnings report also highlighted that Wall Street expects the company's full-year earnings per share to shrink by 14% over the next 12 months, with revenue growth also projected to deteriorate. This negative forecast signaled potential challenges ahead, leading investors to sell off the stock despite the solid past performance.\n\nThe stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks. Is now the time to buy Mercury General? Access our full analysis report here, it’s free.\n\nMercury General’s shares are not very volatile and have only had 4 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful, although it might not be something that would fundamentally change its perception of the business.\n\nThe biggest move we wrote about over the last year was 5 months ago when the stock gained 3.4% on the news that Raymond James reaffirmed its \"Strong Buy\" rating and increased its price target on the stock. The financial services firm boosted the price target by 11.11% from $90.00 to a new target of $100.00. This adjustment reflected continued confidence in the company's financial performance and growth outlook. The positive sentiment was also reflected in the market, as the stock reached a new all-time high, underscoring solid investor confidence.\n\nMercury General is down 4.4% since the beginning of the year, but at $87.80 per share, it is still trading close to its 52-week high of $96.19 from February 2026. Investors who bought $1,000 worth of Mercury General’s shares 5 years ago would now be looking at an investment worth $1,548.\n\nThe 1999 book Gorilla Game predicted Microsoft and Apple would dominate tech before it happened. Its thesis? Identify the platform winners early. Today, enterprise software companies embedding generative AI are becoming the new gorillas.  Click here for access to our special report that reveals one profitable leader already riding this wave, it’s free."
    },
    {
        "title": "Stock Market Today: Stocks Rise as Tech Gains Ground Amid Easing AI Fears",
        "url": "https://www.investopedia.com/stock-market-today-dow-jones-s-and-p-500-02182026-11908516",
        "source": "Investopedia",
        "date": "2026-02-18T19:11:00+00:00",
        "content": "ANGELA WEISS / AFP via Getty Images\n\nStocks rose on Wednesday, but pared their gains as investors questioned the outlook for interest rates in light of the minutes of January's Federal Reserve meeting.\n\nThe tech-heavy Nasdaq Composite rose 0.8% on Wednesday, while the benchmark S&P 500 advanced 0.6% and the blue-chip Dow Jones Industrial Average gained 0.3%. All three major indexes eked out tiny gains on Tuesday in a volatile session driven by rising and ebbing tech jitters.\n\nThe minutes of the Federal Reserve's last meeting revealed starkly diverging views among policymakers on the appropriate path of monetary policy. Some officials want to leave the door open for the Fed to raise rates if inflation remains sticky, while others are eager to continue cutting, according to the minutes released Wednesday.\n\nThe majority of officials voted in late January to leave interest rates unchanged for the first time since July. The odds of more cuts in the next few months dwindled last week following surprisingly rosy inflation and jobs reports. The December Personal Consumption Expenditures price index, the Fed's preferred inflation gauge, is set to be released on Friday morning.\n\nTech stocks found their footing Wednesday. Shares of Nvidia (NVDA) rose 1.6% after social media giant Meta (META) announced a new deal to buy millions of its chips. Several of Wall Street's favorite AI \"pick and shovel\" stocks rose, including Micron (MU) and Western Digital (WDC). Meta shares rose 0.6%.\n\nThe remainder of the Magnificent Seven closed in the green. Shares of Amazon (AMZN) rose nearly 2% despite Berkshire Hathaway reporting on Tuesday it had sold nearly all of its stake in the e-commerce giant. Apple (AAPL), Alphabet (GOOG), Microsoft (MSFT), and Tesla (TSLA) posted marginal gains.\n\nOn the earnings front, shares of Palo Alto Networks (PANW) slid 7% after its earnings guidance came up short of expectations. The stocks of chip firms Cadence Design Systems (CDNS) and Analog Devices (ADI) rose 8% and 3%, respectively, after each topped estimates on the top and bottom lines.\n\nThe 10-year Treasury yield, which impacts interest rates on a variety of consumer loans including mortgages, was recently 4.08%, up from 4.06% at Tuesday's close.\n\nWest Texas Intermediate futures, the U.S. crude oil benchmark, rose about 4.5% to $65.10 a barrel after Vice President JD Vance cast doubt on the progress of diplomatic negotiations between the U.S. and Iran. Gold and silver futures rebounded from their slump yesterday. Gold climbed 1.8% to $4,995 an ounce, while silver rose 4.9% to $77.10 an ounce.\n\nBitcoin traded around $66,300 in the late afternoon, down from its overnight highs above $68,000. The U.S. dollar index, which tracks the value of the greenback against a basket of currencies, ticked up 0.6% to 97.70.\n\nHoops or Hockey? Investors Might Get to Own Shares of the Knicks and Rangers\n\nIf you've always wanted to own a piece of a pro basketball team, this deal might be a slam dunk. (If you prefer ice hockey, insert your favorite metaphor here.)\n\nMadison Square Garden Sports (MSGS), which owns the NBA's New York Knicks and NHL's New York Rangers, said its board would explore a spinoff that would create publicly traded companies for each team. (The stadium itself is owned by Madison Square Garden Entertainment (MSGE), which was created by the 2020 separation of the teams from the facility.)\n\n\"We believe this proposed transaction would provide each company with enhanced strategic flexibility, its own defined business focus, and clear characteristics for investors,\" MSGS CEO Jim Dolan said.\n\nThe company's statement said no timetable had been set for a deal, and that it was not certain one would happen. League approval would be required, the company said.\n\nThe deal would offer investors an opportunity to do something comparatively rare: put their money where their rooting mouths are.\n\nMost sports teams are privately owned, and none of the organizations in the top U.S. leagues—the NBA and NHL, but also the NFL, Major League Baseball and MLS—are traded as single stocks. Some teams are owned by larger conglomerates; the Green Bay Packers do offer public ownership, though through a somewhat unconventional arrangement.\n\nThe Knicks are faring better than the Rangers so far in their respective seasons, but Madison Square Garden Sports stock is hot. The shares are up substantially today on the news, bringing their rise to roughly 30% this year—and they've added almost three-quarters of their value over the past five years.\n\nIn 2025, the Knicks were ranked among the top 10 most valuable sports franchises worldwide at some $9.5 billion, according to Forbes.\n\nCiti analysts on Wednesday said they value the stock at $337, about 15% above yesterday's close; the Knicks, they said, accounted for $226 of that. \"We like the proposed spin-off and see it as a viable step to potentially unlock value,\" they wrote.\n\nHere's How Much Traders Expect Carvana Stock To Move After Earnings on Wedneday\n\nCarvana is set to report earnings after the market closes today, with traders expecting a big move in the online used car dealer's stock following the results.\n\nBased on recent options pricing, traders expect Carvana's (CVNA) stock could swing up to 13.5% in either direction by the end of the week. A move of that magnitude from Tuesday's close near $351 would lift Carvana shares to about $398. The low end of the range would see the stock slip below $304, its lowest point since last November.\n\nCarvana has had a difficult start to 2026, as a short-seller report released last month sent the stock tumbling from its record highs. Carvana stock had rallied to end 2025 as it joined the S&P 500 and analysts laid out bullish visions for the company.\n\nJPMorgan analysts said the basis of the short-seller report appeared to include an incorrect reading of some of Carvana's finances by the authors, leading to a \"significant misrepresentation of facts.\" The analysts recently lifted their price target for Carvana to $510 from $490, and said they expect the company to report strong sales growth for the fourth quarter that could carry through to the first quarter of 2026.\n\nCarvana is projected to report a 48% year-over-year jump in revenue to $5.25 billion, while earnings per share are seen rising to $1.01 from 56 cents the same time a year ago.\n\nAnalysts have stayed bullish on Carvana stock despite the recent slump, with 12 of the 13 analysts with current ratings tracked by Visible Alpha calling the company a \"buy,\" with just one \"hold\" rating. Their mean target of $500 would suggest 40% upside from Tuesday's close.\n\nThe shares, which were up about 2% in recent trading ahead of the company's earnings report, have lost about 15% since the start of the year.\n\nNvidia Sold Its Stakes in These Firms. The Stocks Are Sliding.\n\nNvidia is backing out of some of its bets.\n\nShares of three AI-focused firms fell Wednesday following the news that Nvidia (NVDA) sold its stakes in the companies in the fourth quarter. Data center service provider Applied Digital (APLD) dropped nearly 10%, while drug developer Recursion Pharmaceuticals (RXRX) plunged 14% and driverless tech company WeRide (WRD) slipped close to 4%, before paring their losses later in the session.\n\nA regulatory filing revealed Nvidia's sales of the companies' shares but didn't specify the company's reasoning. Nvidia declined to comment on the changes to its portfolio.\n\nNvidia's stock climbed about 2%, bringing it back into positive territory for 2026 after a rough start to the year marked by lingering worries about an AI bubble. Read Investopedia's full daily markets roundup here.\n\nNvidia's latest 13F filing also revealed it dropped its shares of Arm (ARM), the chip designer and long-term partner it tried to acquire in 2020. Shares of Arm were up about 1% recently, building on gains earlier this month after the company posted better-than-expected earnings.\n\nNvidia added positions in struggling rival Intel (INTC), chip design software maker Synopsys (SNPS), and Finnish telecom Nokia (NOK). Synopsys shares climbed about 5% in recent trading, while Nokia shares added 1.5%. Intel shares were little changed.\n\nWhile the investment in Intel shouldn't come as a surprise, after Nvidia's September announcement of a multibillion-dollar investment and partnership, rumors have continued to swirl lately about deepening ties and a possible foundry deal in the works.\n\nNvidia kept its holdings in AI cloud infrastructure providers CoreWeave (CRWV) and Nebius Group (NBIS) unchanged. CoreWeave and Nebius shares climbed about 5% and 4%, respectively.\n\nPalo Alto Networks' Deals Are Dragging on Its Profit Outlook. The Stock Is Falling\n\nPalo Alto Networks' string of recent deals is hurting its profit outlook, weighing on its stock.\n\nShares of Palo Alto Networks (PANW) were down 6% to about $153 in recent trading after the cybersecurity provider's full-year outlook disappointed. It was the worst-performing stock in the S&P 500 and Dow on a day when broader markets gained.\n\nPalo Alto Networks said late Tuesday that it now expects adjusted earnings per share of $3.65 to $3.70 for the full fiscal year, down from its previous range of $3.80 to $3.90. The company is grappling with higher integration costs tied to its recent acquisitions, including its $25 billion purchase of CyberArk.\n\nMorgan Stanley analysts trimmed their price target for Palo Alto Networks stock to $223 from $245 following the results. However, they maintained an \"overweight\" rating and called its post-earnings drop \"overdone,\" citing the company's \"compelling argument for AI as a tailwind.\"\n\nMeanwhile, analysts at Wedbush stood by their \"outperform rating\" and $225 target Wednesday, calling Palo Alto Networks \"one of our favorite cyber names to own in 2026.\" Though ratings are still in flux, most analysts tracked by Visible Alpha have stood by their bullish ratings for the stock.\n\nPalo Alto Networks reported adjusted earnings per shares of $1.03 on a 15% year-over-year jump in revenue to $2.59 billion for its fiscal second quarter. Both figures came in above analysts' estimates compiled by Visible Alpha.\n\nWith Wednesday's slide, Palo Alto Networks shares have lost about 16% of their value since the start of the year.\n\nThe S&P 500 Is Flat For the Year, But There Are Big Moves Below the Surface\n\nWall Street is behaving a lot like Capitol Hill so far this year.\n\nAs of Tuesday’s close, the S&P 500 was down 0.03% since the start of the year. That's about as unexceptional as it gets, but it belies a lot of churn below the surface.\n\nAccording to a recent analysis by Bespoke Investment Group, 117 stocks in the S&P 500 have gained or lost more than 20% so far this year. Meanwhile, just 94 of the index’s components are up or down less than 5%.\n\nAs in Washington, D.C., “we’ve seen an increase in concentration at the extremes with nothing to show for it,” wrote Bespoke’s analysts in a note on Wednesday.\n\nThe massive disparity in performance is pronounced in the tech sector, where more than 40% of stocks are either up or down more than 20% this year. Seventeen stocks are sharply higher, including AI “pick and shovel” plays like memory device makers Sandisk (SNDK) and Western Digital (WDC), up 150% and 70%, respectively. On the flip side are the dozen (mostly software) stocks that have been battered by concerns about AI disruption. They include Intuit (INTU) and ServiceNow (NOW), down a respective 40% and 30%.\n\nExtreme moves are causing the capitalization-weighted S&P 500 to trail the equal-weight index by about 5.5 percentage points, the cap-weighted index’s worst relative performance since 1992, according to Bespoke.\n\nWedbush Sees Big Gains for These Cybersecurity Stocks. Here's Why\n\nIt's been a rough start to the year for the software sector, but one group of experts said they see big gains ahead for some beaten-down cybersecurity stocks.\n\nAs the use of AI spreads, companies could face growing risks that drive up demand for cybersecurity services, according to analysts at Wedbush, who named three stocks they see as likely \"winners\" in a note Tuesday.\n\nOne of them is CrowdStrike (CRWD), which Wedbush said remains a \"gold standard of cybersecurity\" despite the stock's recent selloff. The shares are down about 13% year-to-date, with Wedbush's $600 price target suggesting nearly 45% upside from Wednesday's level around $420.\n\nWedbush also identified ZScaler (ZS) as a \"premier name to own in the cyber space,\" with a strong product pipeline and AI strategy. The analysts said they see the stock roughly doubling to $350 in the next 12 months.\n\nPalo Alto Networks (PANW), which reported disappointing earnings after the closing bell Tuesday, rounded out Wedbush's trio. The analysts said the company, which has sought to expand its offerings with several acquisitions recently, has seen its value proposition improve as companies look to consolidate vendors. Wedbush's price target at $225 is about 45% above the stock's recent level.\n\nInvestors could also get more insights when ZScaler reports next week on Feb. 26, with CrowdStrike scheduled to release its latest quarterly results on March 3.\n\nModerna Stocks Rises After FDA Reverses Course on New Flu Vaccine Review\n\nModerna (MRNA) stock rose 6% on Wednesday after the company said the Food and Drug Administration agreed to review its application for a new flu shot that regulators had previously refused to consider.\n\nModerna on Wednesday said that, after meeting with the FDA, it had submitted an amended application for its new mRNA influenza vaccine. Federal drug regulators last week surprised investors when they refused to review Moderna’s application. Moderna is seeking full approval for adults 50 to 64, and accelerated approval for adults over 65. The review is expected to be complete by Aug. 5.\n\n“We appreciate the FDA's engagement in a constructive Type A meeting and its agreement to advance our application for review,\" said CEO Stéphane Bancel in a press release.\n\nWith Wednesday’s gains, Moderna shares have risen nearly 60% since the start of the year. The stock got a boost last month after the release of encouraging data from a cancer clinical trial.\n\nIn Buffett's Last Quarter as CEO, Berkshire Slashed Amazon Stake and Sold More Apple\n\nBerkshire Hathaway (BRK.A)(BRK.B), the conglomerate formerly led by famed investor Warren Buffett, reduced its holdings in tech giants Apple (AAPL) and Amazon (AMZN) in the final quarter of 2025, according to a regulatory filing released Tuesday.\n\nBerkshire sold about 10.3 million shares of Apple, about 4% of the firm’s stake in the iPhone maker. Berkshire has been steadily trimming its stake in Apple—its largest position—since late 2023, though the pace of its sales has slowed. Berkshire’s stake, once worth about $175 billion, totaled about $60 billion as of Tuesday’s close. Shares were down about 0.3% in early trading Wednesday.\n\nBerkshire made a bigger cut to its Amazon holdings, selling 7.7 million shares, or more than 75% of its stake in the e-commerce giant. The holdings, worth about $2.1 billion at the end of the third quarter, were valued at about $457 million as of Tuesday. Amazon stock rose 1.5% Wednesday morning.\n\nTuesday's filing is the last Berkshire portfolio update overlapping with Warren Buffett's tenure as chief executive. Buffett, who took over Berkshire in 1965 and built it into an insurance and investment behemoth worth more than $1 trillion, officially handed the reins over to current CEO Greg Abel when he retired at the end of last year.\n\nApple stock rose nearly 7% in the fourth quarter. Apple, unlike Big Tech peers such as Meta (META) and Alphabet (GOOG), is not spending hand over fist on AI infrastructure, and that became a tailwind for the stock when the AI rally wavered last quarter. Amazon shares rose 5% in the same period.\n\nFutures Point To Higher Open as Tech Stocks Find Footing\n\nFutures contracts connected to the Dow Jones Industrial Average were up 0.3% in premarket trading on Wednesday.\n\nNasdaq 100 contracts gained 0.5%.\n\nBeSpoke Investment Group. “A Flat Market with Extreme Single-Stock Moves.”\n\nModerna. “Moderna Announces the U.S. Food and Drug Administration will Initiate the Review of Its Investigational Seasonal Influenza Vaccine Submission.”"
    },
    {
        "title": "Bank of America resets Nvidia stock forecast",
        "url": "https://sg.finance.yahoo.com/news/bank-america-resets-nvidia-stock-224700217.html",
        "source": "Yahoo Finance Singapore",
        "date": "2026-02-17T22:47:00+00:00",
        "content": "Nvidia (NVDA) stock has gained about 32% over the past year, at the time of writing, Tuesday afternoon, Feb. 17, according to Yahoo Finance. Meanwhile, the SPDR S&P 500 index (SPY) is up about 11% in the same period.\n\nIt is impressive that Nvidia has outpaced the S&P 500 by more than 20%, but even more so when we look at other members of the Magnificent 7:\n\nMeta is 13% down in the same period.\n\nApple is only up a little more than 7%.\n\nThe only exception, a Mag 7 member that fared better than Nvidia, is Google, which is 62% up in the same period.\n\nHyperscalers have announced huge capital expenditures (capex) for this year. I’ve covered Amazon earnings and capex outlook here, and Meta’s earnings and capex outlook here. Nvidia will release its Q4 earnings on February 25.\n\nBank of America analyst Vivek Arya and his team updated their cloud capex outlook, AI data center total addressable market estimates, and revised forecast for Nvidia ahead of earnings.\n\nTo refresh your memory on how Nvidia Q3 earnings looked, read my article “Goldman Sachs, JPMorgan and BofA drop verdicts on Nvidia earnings.”\n\nRevenue is expected to be $65.0 billion, plus or minus 2%.\n\nGAAP gross margins are expected to be 74.8% plus or minus 0.5%.\n\nGAAP operating expenses are expected to be approximately $6.7 billion.\n\nArya and his team believe that capital expenditures for 2026 and 2027 will reach $748 billion and $869 billion, respectively. These numbers represent year-over-year growth of 56% and 16%, respectively.\n\nGiven this exceptionally strong 2026 cloud capex outlook, the team has now updated its 2030 AI data center systems total addressable market estimate to approximately $1.4 trillion, up from the prior estimate of $1.2 trillion.\n\nRelated: BofA revamps Applied Materials stock price target after CEO message\n\nAnalysts expect the overall data center systems total addressable market to accelerate in 2026, growing by 64% YoY, with AI systems growing even faster at approximately 100% YoY, driven by new AI accelerator deployments.\n\nThe team expects that AI accelerator vendors will generally pass on their rising HBM/DDR costs to customers, maintaining margins as scale and system sales increase.\n\nAnalysts said that even after excluding Google due to its reliance on its own TPUs, 2026 cloud capex is expected to increase approximately 45% YoY, to $180 billion.\n\nAssuming two-thirds of this spending will go toward servers, analysts estimate an increase of approximately $120 billion in potential compute chip sales this year, which is in line with their new Nvidia outlook of a $110 billion increase in data center compute sales.\n\nThe team added that the remaining $10 billion to $20 billion of sales will be split across AMD and non-TPU ASICs.\n\nRelated: History of Nvidia: Company timeline and facts\n\nAnalysts raised their sales estimates for Nvidia for fiscal years 2027, 2028, and 2029 by +7%/+2%/+2% to $342.33 billion/$422.75 billion/$496.3 billion, and raised EPS estimates by +8%/+3%/+3% to $8/$9.98/$11.94.\n\nThe team said that Google’s Gemini 3 Pro AI model, which was trained on Google’s custom TPU v7 Ironwood chips co-designed with Broadcom, may be the best AI model for now, but that it may soon change with Blackwell-trained LLMs.\n\nMorgan Stanley sets jaw-dropping Micron price target after event\n\nBank of America updates Palantir stock forecast after private meeting\n\nMorgan Stanley drops eye-popping Broadcom price target\n\nThey noted that all GPU-based models on the market today were trained on older-generation Nvidia Hopper GPUs, except Grok-4. However, even Grok-4 was mostly trained on older Nvidia chips, as xAI’s Collosus cluster, on which it was trained, consists of 150,000 H100, 50,000 H200, and only 30,000 Blackwell chips, B200/GB200.\n\nThe team expects any Blackwell-majority-trained LLMs to “rewrite the reasoning/coding benchmarks” once broadly available in early 2026.\n\nIn a research note shared with me, Arya reiterated a buy rating for Nvidia stock and the target price of $275, based on 28 multiple his estimate for price-to-earnings ratio excluding cash for calendar year 2027, which is within Nvidia’s historical forward year price-to-earnings range of 25 to 56.\n\nWeakness in consumer-driven gaming market\n\nCompetition with major public firms\n\nLarger-than-expected impact from restrictions on compute shipments to China\n\nLumpy and unpredictable sales in new enterprise, data center, and autosmarkets\n\nPotential for decelerating capital returns\n\nEnhanced government scrutiny of Nvidia’s dominant market position in AIchips\n\nRelated: Morgan Stanley flags $45B hidden cybersecurity opportunity\n\nThis story was originally published by TheStreet on Feb 17, 2026, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here."
    },
    {
        "title": "PLTR Stock Rises as Palantir Relocates HQ from Denver to Miami",
        "url": "https://blockonomi.com/pltr-stock-rises-as-palantir-relocates-hq-from-denver-to-miami/",
        "source": "Blockonomi",
        "date": "2026-02-18T16:39:00+00:00",
        "content": "Palantir Technologies Inc. (PLTR) announced the relocation of its headquarters from Denver to Miami. The decision follows strong earnings reports and signals a strategic shift for the data analytics firm. In response, PLTR stock saw a slight increase, reaching $133.02, with pre-market trading pushing it to $136.06.\n\nPalantir’s decision to move its headquarters from Denver to Miami follows a growing trend of tech companies expanding into Florida. The state’s favorable tax and regulatory environment has attracted major firms such as Apple, Amazon, and Microsoft. By relocating, Palantir positions itself alongside other companies in the tech industry, strengthening its presence in Miami.\n\nExecutives from Palantir did not offer much insight into the reasons behind the move, but it is clear the firm sees advantages in Miami. Florida’s economic landscape, including tax incentives, plays a key role in the relocation. Palantir’s move further solidifies Miami’s status as an emerging tech hub, especially as the company expands its operations.\n\nPLTR stock has seen fluctuations in recent months, with its year-to-date performance showing a 25% decrease. Despite this, investors responded positively to Palantir’s strong fourth-quarter earnings, which exceeded expectations. These results gave a boost to the stock, raising optimism about its short-term prospects.\n\nPalantir Technologies Inc., PLTR\n\nAlthough PLTR stock has struggled in 2026, with a 25% drop this year, its longer-term outlook remains robust. Over the past year, Palantir delivered a gain of 11.63%, and the stock surged over 1,300% in the past three years. These figures highlight the company’s consistent growth despite sector-wide challenges.\n\nDespite strong earnings, PLTR stock’s valuation remains a point of debate among analysts. Some market experts express concerns over the company’s high price-to-earnings ratio, while others highlight its solid revenue growth. The move to Miami may provide a competitive edge in attracting new business, but it also puts pressure on the firm to sustain its expansion efforts.\n\nFor now, Palantir’s long-term growth potential in AI-driven data analytics continues to be the main focus for investors. The relocation to Miami is part of a broader trend in the technology sector, with many firms seeking to benefit from Florida’s business-friendly environment. As the company integrates its new headquarters, PLTR stock may see further fluctuations, depending on its ability to maintain steady growth.\n\nDiscover top-performing stocks in AI, Crypto, and Technology with expert analysis.\n\nMaxwell is a crypto-economic analyst and blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. His goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nType above and press Enter to search. Press Esc to cancel.\n\nZunaBet New Crypto Casino: 250% Bonus & 75 Free Casino Spins, Claim!"
    },
    {
        "title": "Stock market today: Dow, S&P 500, Nasdaq rise as AI worries recede, Fed minutes released",
        "url": "https://au.finance.yahoo.com/news/stock-market-today-dow-sp-500-nasdaq-rise-as-ai-worries-recede-fed-minutes-released-190742804.html",
        "source": "Yahoo Finance Australia",
        "date": "2026-02-18T19:07:00+00:00",
        "content": "US stocks edged higher on Wednesday as AI fears waned and investors digested the release of the Federal Reserve minutes.\n\nThe S&P 500 (^GSPC) added 0.6%, while the tech-heavy Nasdaq Composite (^IXIC) picked up 0.8%. The Dow Jones Industrial Average (^DJI), which is less exposed to tech, moved up 0.3% after the major US gauges closed Tuesday with modest gains.\n\nTechnology stocks were recovering composure after a turbulent stretch that saw software names in particular take a bruising. But while the pressure is easing, investors are still weighing the long-term impact of AI on business models and corporate competition, and whether AI investments will pay off.\n\nMeanwhile, minutes of the Fed's January meeting showed some policymakers leaning toward holding rates steady, though others suggested rate cuts could be in store if inflation comes down.\n\nThe minutes said \"several participants commented that further downward adjustments to the target range for the federal funds rate would likely be appropriate if inflation were to decline in line with their expectations.\" Markets are currently pricing in at least two rate cuts this year, and the minutes did little to shake faith in a cut by June.\n\nOn the earnings calendar, DoorDash (DASH), eBay (EBAY), and Analog Devices (ADI) report results Wednesday.\n\nUS stocks gained on Wednesday as investors brushed aside worries about AI and digested the release of the Federal Reserve minutes.\n\nThe S&P 500 (^GSPC) rose for a third day in a row, adding 0.6%. The tech-heavy Nasdaq Composite (^IXIC) gained 0.8%. The Dow Jones Industrial Average (^DJI) increased 0.3%.\n\nEnergy (XLE) stocks outperformed the rest of the sectors. Meanwhile, Amazon (AMZN) and Nvidia (NVDA) were among the \"Magnificent Seven\" gainers.\n\nEnergy (XLE) stocks rose more than 1% on Wednesday, outperforming the broader market amid a surge in oil prices.\n\nThe sector has rallied sharply this year, gaining 22%. Oil prices have trended higher since December, driven by heightened geopolitical tensions and an AI-fueled economic expansion.\n\nShares of MSG Sports (MSGS) were surging on Wednesday after the owner of the New York Knicks basketball team and Rangers hockey team said it was exploring spinning off the franchises into separate, publicly traded companies.\n\nAnd it's a move Ariel Investments has been waiting for.\n\nAriel, the storied value-investing firm, is the third-largest owner of MSGS stock. The spinoff \"is a great idea,\" Charlie Bobrinskoy, vice chairman and head of the investment group at Ariel, told Yahoo Finance in a video call.\n\n\"The stock has been trading at a huge discount to the value in a sale.\"\n\nForbes pegged the Knicks' value at $9.75 billion last year. The magazine estimated the Rangers could fetch $4 billion in a sale. That means the company's current market value, at just over $8 billion, remains a significant discount to its potential total sale value.\n\nThe perception has been that Jim Dolan, the longtime colorful owner of the teams and executive chairman and CEO of the company, didn't want to sell.\n\n\"It’s still a big discount, because [Dolan] hasn’t announced a sale, just this new structure,\" Bobrinskoy said. \"But this is a step in the right direction.\"\n\nAs Bobrinskoy explained, the spinoff will be more tax-efficient than an outright sale, but it also means Dolan has to attest that he doesn't intend to sell the teams for two years. If he does sell within that period, he'll have to prove the negotiations didn't pre-date the spinoff.\n\nAriel Investments owns about 720,000 shares of MSGS and is the largest shareholder in Dolan's other corporate progeny, Sphere Entertainment (SPHR) and MSG Entertainment (MSGE).\n\n\"We've owned all these entities because we thought there was a Dolan discount,\" Bobrinskoy said. \"This has been the one that didn’t go anywhere for a long time.\"\n\nOil prices rose surged throughout Wednesday's trading session, picking up more than 4.5% as traders evaluated ongoing tensions in talks between Ukraine and Russia on a potential end to the conflict between the two countries, and between the US and Iran over a renegotiated nuclear deal.\n\nYahoo Finance's Jake Conley reports:\n\nThe Roundhill Sports Betting and iGaming ETF (BETZ) is having its best day since last April (+2.9%) — with betting operators (CZR +12.7%, RSI +8.9%, MGM +8.5%, DKNG +3.7%) doing most of the heavy lifting.\n\nCaesar's Q4 results are driving the action, helping reset the \"Vegas demand is cracking\" narrative and pulling peers along with it. But the long-term trend is still down; Caesar's stock has gotten whacked by 80% since its 2021 record high.\n\nAnd it's a similar story for the ETF, which has nearly been cut in half over the same time frame — and is on track for its sixth straight losing month.\n\nTechnically, CZR is dangling from a cliff, without much support until the $10 level (which would imply another 50% haircut).\n\nBETS does have near-term support around $17 — lose it, and the downtrend reasserts to as low as $14.\n\nFederal Reserve minutes released on Wednesday show some policy members leaning toward holding rates steady \"for some time\" as they assess incoming data. However, rate cuts could be in store if inflation declines further.\n\nThe Federal Open Market Committee (FOMC) minutes are from its January meeting, in which the policy makers held rates unchanged.\n\n\"In considering the outlook for monetary policy, several participants commented that further downward adjustments to the target range for the federal funds rate would likely be appropriate if inflation were to decline in line with their expectations,\" said the minutes.\n\n\"Some participants commented that it would likely be 12 January 27–28, 2026 appropriate to hold the policy rate steady for some time as the Committee carefully assesses incoming data,\" said the minutes.\n\nAs of Wednesday, Polymarket bettors assigned a 93% probability that the Fed will keep interest rates unchanged again at its next meeting in March.\n\nMeanwhile, bets on the platform indicate that traders expect two to three rate cuts this year.\n\nFollowing the release of the minutes, the S&P 500 (^GSPC) remained steady, trading up 0.7%, while the tech-heavy Nasdaq Composite (^IXIC) increased 1%. The Dow Jones Industrial Average (^DJI) picked up about 0.4%.\n\nWendy's (WEN) stock rose as much as 17% on Wednesday after an SEC filing from activist investor Trian Partners said the company was exploring strategic alternatives for the company, including a possible deal to acquire the struggling fast food chain, in which it holds a roughly 16% stake.\n\nIn an updated 13D filing on Wednesday, Trian said it planned to exchange information with existing or potential co-investors and reach other agreements that would contemplate transactions \"including an acquisition or other extraordinary transaction resulting in the Filing Person (and/or their affiliates), either alone or with other parties (including one or more Potential Partners), acquiring control of the Company, and which transactions could result in a de-listing or de-registration of the Company's Common Stock.\"\n\nAs The Wall Street Journal noted Wednesday, Trian — led by Nelson Peltz — previously pushed for strategic changes at Wendy's in 2022 before changes at the company led Trian to back off these demands the following year.\n\nLast week, Wendy's reported its global same-store sales fell 8.3% in the fourth quarter, which included a 10.5% decline in its US comp sales. Wendy's stock has lost over 40% in the last year.\n\nYahoo Finance's Jen Schonberger reports:\n\nWalmart (WMT) is set to release its first earnings report under new CEO John Furner in what should be a key reading for investors on the holiday shopping season. The retailer, which recently crossed $1 trillion in market cap for the first time, is expected to report adjusted earnings per share of $0.73 and revenue of $190 billion.\n\nYahoo Finance's Brooke DiPalma reports:\n\nGold (GC=F) jumped 2% on Wednesday, reclaiming the $5,000 level as tensions between the Trump administration and Iran escalated and the odds of US. military action increased.\n\n\"The precious metals sector has so far been the primary beneficiary of heightened U.S. attack concerns,\" wrote Ole Sloth Hansen, head of commodities strategy at Saxo Bank, in a post on X.\n\nGold futures rebounded from a 2% drop on Tuesday when Asian markets closed for the Chinese New Year.\n\nSilver (SI=F) and platinum (PL=F) also rallied 6% and 4% respectively.\n\nIn addition to strains between the US and Iran, peace talks over the ongoing conflict between Russia and Ukraine appeared to falter.\n\nGasoline prices remained on track to notch their 12 consecutive week below $3 per gallon on Wednesday, though that picture could swing with the coming uptick in driving as warmer weather arrives.\n\nTransportation and logistics stocks plunged last week after a little-known company that historically sold karaoke machines published a press release saying its new AI-powered logistics platform was scaling clients' freight volumes by 300% to 400%. On this morning's Yahoo Finance Opening Bid, we spoke with the CEO of C.H. Robinson.\n\nYahoo Finance executive editor Brian Sozzi reports:\n\nRead more here, and watch below:\n\nUS industrial production increased in January by the largest month-on-month percentage since March 2025, according to data released Wednesday morning by the Federal Reserve Board.\n\nIndustrial production grew by 0.7% month on month, marking a steep jump over December's growth of 0.25%. Economists had expected growth of 0.4%, according to consensus estimates compiled by Bloomberg.\n\nThe industrial production figures were supported by strong growth in manufacturing, which grew 0.6% month on month compared to economists' estimates of 0.4% and last month's month-on-month loss of 0.02%.\n\nCompared to a year ago, industrial production and manufacturing activity were up 2.3% and 2.4%.\n\nShares in Moderna (MRNA) jumped more than 6% in the first minutes of Wednesday's trading session after the US Food and Drug Administration agreed to review the drugmaker's first flu shot of the season, reversing course on a decision to reject the review last week.\n\nModerna recently developed a new flu vaccine using the same mRNA technique that underpins its COVID-19 vaccine. But after requesting review from the federal government, the FDA initially declined to review the drug — a necessary regulatory step toward bringing the drug to market — saying that it wasn't satisfied with Moderna's trials.\n\nOn Wednesday morning, however, Moderna announced in a press release that the FDA had reversed course and agreed to review the drug. The drugmaker said that, to expedite approval, it had proposed a \"regulatory pathway based on age, seeking full approval for adults 50 to 64 years of age and accelerated approval for adults 65 and older.\"\n\n\"We appreciate the FDA's engagement in a constructive Type A meeting and its agreement to advance our application for review,\" said Stéphane Bancel, Chief Executive Officer of Moderna said in the statement. \"Pending FDA approval, we look forward to making our flu vaccine available later this year so that America's seniors have access to a new option to protect themselves against flu.\"\n\nUS stocks started Wednesday's trading session heading into the green as investors looked to Federal Reserve meeting minutes out later for guidance on its thinking around interest rates.\n\nThe S&P 500 (^GSPC), the tech-heavy Nasdaq Composite (^IXIC), and the Dow Jones Industrial Average (^DJI) all picked up roughly 0.2% to start the session.\n\nThe minutes of the Fed's January meeting are set for release at 2 p.m. ET, with traders continuing to price in at least two rate cuts this year as of Wednesday morning. The notes will set the stage for the next update on inflation, the Personal Consumption Expenditures index on Friday.\n\nOn the corporate front, DoorDash (DASH), eBay (EBAY), and Analog Devices (ADI) report results Wednesday.\n\nMSG (MSGS) stock rose as much as 10% in premarket trade on Wednesday after the company said it was exploring splitting up the New York Knicks and New York Rangers, which it owns under the same corporate umbrella, Madison Square Garden Sports Corp.\n\nThe split would create two publicly traded companies. Both separate entities would also include minor league affiliates of each franchise.\n\n“Both the Knicks and Rangers are premier teams in their respective leagues, with storied histories and large and passionate fan bases,\" said Jim Dolan, exec. chairman and CEO of the company. \"We believe this proposed transaction would provide each company with enhanced strategic flexibility, its own defined business focus, and clear characteristics for investors.”\n\nThe Knicks are currently in third place in the Eastern Conference, a half-game behind the Boston Celtics. The Rangers are in last place in the Eastern Conference.\n\nThe pace of construction of new homes in the US rose to a five-month high in December as the housing market tries to show some signs of life with interest rates leveling out.\n\nThe number of new single-family homes under construction in December hit an annualized rate of 1.4 million homes, up 6.2% from November and ahead of forecasts for an annualized rate of 1.32 million homes, according to data from the Census Bureau. This pace of building, however, is still 7.3% below December 2024.\n\nThis report followed Tuesday's read on homebuilder confidence from the NAHB, which showed sentiment fell by another point to 36 this month, the lowest reading since September.\n\nIn an email on Wednesday, Alexandra Brown, North America economist at Capital Economics, wrote:\"Even though homebuilders are still benefiting from the modest decline in mortgage rates over the past few months, this is unlikely to last. We expect the Fed to cut only once more this year.\n\n\"With almost three cuts currently priced into markets, financial conditions should re-tighten later this year as fewer cuts are realised,\" Brown added.\n\n\"As a result, we do not expect the uptick in housing starts to be sustained throughout this year.\"\n\nOil prices rose on Wednesday as traders priced in continued geopolitical risk and stringent sanctions after peace talks between Russia and Ukraine appeared to collapse after only two hours.\n\nFutures on Brent crude (BZ=F), the international pricing benchmark, rose over 2% to trade around $69, while those on US benchmark West Texas Intermediate (WTI) crude (CL=F) picked up a slightly stronger 2.5% to trade around $63.80.\n\nIn comments after the talks ended, Ukrainian president Volodymyr Zelensky said the Russian delegation made the negotiations \"difficult\" and accused Russia of intentionally delaying progress toward a deal that could end the war between the two countries, according to Reuters.\n\nRussia's chief negotiator, Vladimir Medinsky, also described the US-led talks, held in Geneva, Switzerland, as \"difficult\" in comments after the negotiations ended.\n\nThe oil market has, since the Russian invasion of Ukraine began four years ago, priced in an increasingly high-risk profile around disrupted Russian oil and gas exports. Surprise sanctions from the US Treasury late in 2025 against major Russia oil companies Rosneft and Lukoil have only furthered those tensions.\n\nAt the same time, traders are also closely watching the Middle East. While Iran's foreign minister said talks between Tehran and Washington had reached a potential framework for a deal on Iran's nuclear program, the X account for Ayatollah Ali Khamenei spent Tuesday posting incendiary comments about the deal, and Iran partially closed the Strait of Hormuz for several hours for naval military exercises.\n\nThe Strait of Hormuz is seen as Iran's biggest lever to pull in any conflict, as the strait sees roughly 20 million barrels of petroleum products per day traverse its waters.\n\nAnalog Devices (ADI) stock rose 6% before the bell on Wednesday following the release of its second quarter earnings, which beat analysts' estimates. The company cited strong demand from its industrial and data ‌center customers as the artificial intelligence boom continues ​to drive semiconductor sales.\n\nThe US stock market, typically considered the engine of the global economy, has struggled to find its footing through the first months of 2026, even as the rest of the world has surged ahead.\n\nAs a result, US stocks are off to their worst start to the year since 1995 relative to the global market, according to data from Goldman Sachs.\n\nYahoo Finance's Jake Conley reports:"
    }
]