[
    {
        "title": "Down 32%, Booking Holdings Announces 25-to-1 Stock Split. Time to Buy?",
        "url": "https://247wallst.com/investing/2026/02/19/down-32-booking-holdings-announces-25-to-1-stock-split-time-to-buy/",
        "source": "24/7 Wall St.",
        "date": "2026-02-19T21:36:00+00:00",
        "content": "Booking Holdings (BKNG) beat Q4 estimates with $6.35B in revenue. Booking raised its dividend 9.4%.\n\nBooking’s free cash flow surged 120% to $1.42B as operational margins expanded to 34.6%.\n\nBooking stock fell 27% year-to-date despite strong results as 2026 guidance disappointed investors.\n\nSending You to Google News in 3\n\nBooking Holdings (NASDAQ:BKNG) just reported fourth-quarter results that beat top and bottom line estimates, raised its dividend, and announced a 25-to-1 stock split. The company continues to show strength in its core travel booking operations amid a recovering global market.\n\nHowever, Citi trimmed its price target, citing market volatility and slightly weaker-than-expected earnings and growth guidance. With shares down sharply in morning trading today, investors are questioning the outlook and asking if Booking Holdings is a buy.\n\nBooking delivered solid results this morning, with key metrics highlighting the resilience in its primary business of online travel reservations. Gross bookings reached $43 billion, up 16% year-over-year, driven by favorable currency effects and steady demand for accommodations and flights. Room nights — a central indicator of booking volume — grew 9%, marking the fourth straight quarter of acceleration and exceeding the company’s own 4% to 6% guidance range. This growth was fueled by investments in Asia and improved marketing efficiency in the U.S.\n\nRevenue climbed 16% to $6.35 billion, surpassing analyst estimates of $6.12 billion. Adjusted EBITDA also rose to $2.2 billion, with margins expanding to 34.6% from 33.8% a year ago, thanks to $250 million in savings from the company’s transformation program. Adjusted earnings came in at $48.80 per share, beating the consensus forecast by $0.30, while free cash flow surged 120% to $1.42 billion, underscoring Booking’s efficient operations in facilitating hotel, rental car, and restaurant reservations through brands like Booking.com, Priceline, and OpenTable.\n\nThese figures reflect Booking’s dominance in the online travel sector, where Booking.com alone accounts for about 90% of revenue. The company benefited from double-digit growth in alternative accommodations and connected trip features, which enhance user retention by bundling services.\n\nTo reward shareholders, Booking raised its quarterly dividend by 9.4% to $10.50 per share, marking a continued commitment to capital returns, alongside $2.1 billion in stock buybacks, with $21.8 billion still authorized. For the full year 2025, the company returned $8.2 billion to shareholders through buybacks and dividends.\n\nGuidance for 2026, however, tempered enthusiasm. The company projects Q1 revenue growth of 14% to 16% and full-year adjusted revenue growth in the low double digits. Adjusted EBITDA is expected to grow faster than revenue, with adjusted EPS advancing in the mid-teens. Management cited rising marketing costs and cautious consumer spending as headwinds, despite plans for $700 million in reinvestments to drive 100 basis points of faster revenue growth.\n\nBased on that guidance, Citi analysts trimmed their price target on Booking’s stock from $6,500 to $6,250, while maintaining a Buy rating, as guidance fell slightly short of some expectations. Other firms like UBS also adjusted targets downward, though they maintained positive outlooks.\n\nBooking stock is down 27% year-to-date and off 32% from its 52-week high.\n\nThe 25-to-1 stock split — the first forward split in company history (it did have a 1-for-6 reverse split in 2003) — will take effect on April 2, and aims to boost liquidity and attract retail investors, given the pre-split price above $3,900 per share.\n\nInterestingly, it wasn’t all that long ago that CEO Glenn Fogel said that if you were looking for a stock split, he didn’t “want that kind of investor.” He did add, however, “ I’m not saying that we shouldn’t [split the stock]. Because what does matter is what do the shareholders want. I’m not saying we’d never do it. Maybe we would.”\n\nIn reality, Fogel’s comments were targeted at investors focused on short-term gains from events like splits; he was more interested in long-term value creation, a mindset investors should seek in executives. Notably, Booking Holdings trades around the same price as when Fogel made those remarks in 2024.\n\nInvestors shouldn’t buy a stock simply because it is splitting shares, as it alters nothing about fundamentals like earnings or cash flow, despite splits often seen as bullish signals of confidence. Yet Booking’s stock is trading down after the announcement, indicating investors might not be so enthused about it after shares lost a third of their value.\n\nStill, with consistent booking growth, margin expansion, and shareholder returns, Booking Holdings appears to be a good long-term buy for those betting on sustained travel demand.\n\nOur top personal finance-related articles today. Your wallet will thank you later.\n\nBooking Holdings (NASDAQ: BKNG) posted Q4 2025 results yesterday evening, reporting $6.35 billion in revenue, up 16% year-over-year. This morning,…\n\nLive Updates Earnings Call Pull Quotes Jul 29, 2025 at 4:47 PM EDT “Room nights, gross bookings and revenue all…\n\nHas Booking CEO Glenn Fogel been increasing or decreasing his share count over the past year? Does he know something…\n\nThe broader market has surged to record highs in 2025, with the S&P 500 up about 14% year-to-date. Yet this…\n\nBooking Holdings (NASDAQ: BKNG) delivered a beat on both earnings and revenue after the close Tuesday, with adjusted EPS of…\n\nA new report from RBC details the firm's top Internet picks for what should prove to be an interesting finish…\n\nJefferies continues to stay the course on the top technology stocks that the firm has rightly championed for some time.…\n\nA Merrill Lynch report focuses on five top stocks that underperformed this year but that could outperform in 2016.\n\nAirbnb (NASDAQ: ABNB) posted Q3 results that split the difference. Revenue beat expectations modestly, but earnings per share missed, leaving…"
    },
    {
        "title": "Dow Jones Futures Decline: Apple, Google, Amazon, Meta & NVIDIA Face the Heat",
        "url": "https://www.analyticsinsight.net/stocks/dow-jones-futures-decline-apple-google-amazon-meta-nvidia-face-the-heat",
        "source": "Analytics Insight",
        "date": "2026-02-19T19:02:00+00:00",
        "content": "Dow Jones futures slipped as investors reacted to mixed momentum in tech stocks and uncertain signals on rates.\n\nApple, Google, Amazon, and Meta remain strong in revenue growth but face pressure from high valuations.\n\nAI spending continues to drive long-term optimism, yet short-term volatility remains elevated.\n\nDow Jones futures moved lower in premarket trading after a strong run in large technology stocks. Recent datasets show that trading is slightly below earlier highs, reflecting a cautious mood among investors. After weeks of gains powered by artificial intelligence excitement, traders are now slowing down and locking in profits.\n\nTreasury yields have also shifted in recent sessions. Comments from the Federal Reserve’s latest meeting minutes showed that policymakers are divided on when to cut interest rates. That uncertainty is creating pressure on high-growth companies, especially big technology names whose valuations are sensitive to expectations about interest rates.\n\nThe decline in futures signals that the market is digesting both company news and broader economic signals at the same time.\n\nApple Inc. reported record quarterly revenue. The company reached all-time highs in iPhone sales and saw strong growth in its services business during the first quarter. Even with these strong results, the stock price has fluctuated.\n\nInvestors are watching demand for new products and growth in services. Some believe the stock price is already very high. When a stock is expensive, even good news may not push it much higher.\n\nThis shows that the market is very sensitive right now, especially for large companies that have a big impact on major indexes.\n\nAlphabet Inc., the parent company of Google, has seen its stock move unevenly. Investors are focused on growth in artificial intelligence and on advertising revenue. AI spending is strong, but worries about high costs and rising competition are making investors wary.\n\nAmazon.com, Inc. is getting similar attention. Its cloud business plays a big role in the AI boom. However, investors are watching profit margins and spending closely.\n\nLarge investments in data centers and infrastructure may reduce short-term profits, even if long-term growth stays solid.\n\nBoth companies are leaders in their fields, but their stock prices are now reacting more to the overall economy than to single company updates.\n\nAlso Read - NVIDIA or Palantir: Which AI Stock Has More Upside in 2026?\n\nMeta Platforms, Inc. and NVIDIA Corporation are at the heart of the AI expansion. A major multi-year deal between the two companies to deploy advanced GPUs and networking equipment has highlighted rising demand for AI infrastructure.\n\nThis agreement shows that companies are still investing heavily in artificial intelligence. However, market reaction has not been one-directional. Chip stocks often rise on AI-spending news, but they also fall quickly when investors rotate into other sectors, such as energy or financials.\n\nNVIDIA remains one of the biggest beneficiaries of AI demand, yet its high valuation makes it sensitive to even small shifts in sentiment. When expectations are extremely high, small disappointments can cause noticeable swings.\n\nThe Dow Jones and other major indexes are heavily influenced by a small group of large technology companies. When these stocks move together, they can push futures sharply in one direction.\n\nRecent trading data shows that market breadth has narrowed, meaning fewer stocks are driving overall gains. This concentration increases the chance of short-term volatility. If investors reduce exposure to mega-cap technology, indexes can fall quickly even if other sectors remain stable.\n\nAlso Read - Top Meme Stocks to Watch and Buy Right Now\n\nUpcoming earnings and new economic data will help decide where the market goes next. Investors are closely watching the company's spending plans, especially for AI data centers and cloud systems.\n\nInterest rates are still uncertain. If the Federal Reserve delays rate cuts, growth stocks could come under more pressure.\n\nRight now, Dow Jones futures show caution. Big technology companies are still reporting strong revenue, but high stock prices and policy uncertainty are causing market swings. More spikes and dips are expected to occur in the coming weeks.\n\nWhy did Dow Jones futures decline?\n\nFutures moved lower due to profit-taking in major technology stocks and uncertainty around Federal Reserve interest rate decisions.\n\nAre Apple and Google still performing well financially?\n\nYes, both companies continue to report solid revenue figures, but stock prices are reacting to broader market conditions.\n\nHow is Amazon affected by current trends?\n\nAmazon’s cloud and AI investments remain strong, but rising costs and capital spending are being closely monitored.\n\nWhat role does Meta play in the AI rally?\n\nMeta is investing heavily in AI infrastructure, which supports long-term growth but also increases near-term spending.\n\nIs the market outlook negative?\n\nNot necessarily. The decline reflects caution and short-term adjustments rather than a major shift in long-term growth expectations.\n\nJoin our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance on cryptocurrencies and stocks. Also note that the cryptocurrencies mentioned/listed on the website could potentially be risky, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. This article is provided for informational purposes and does not constitute investment advice. You are responsible for conducting your own research (DYOR) before making any investments. Read more about the financial risks involved here."
    },
    {
        "title": "Walmart furthers gains with higher-income shoppers",
        "url": "https://www.retaildive.com/news/walmart-gains-higher-income-shoppers-q4-earnings/812573/",
        "source": "Retail Dive",
        "date": "2026-02-19T17:51:00+00:00",
        "content": "Let Retail Dive's free newsletter keep you informed, straight from your inbox.\n\nThe retailer released a conservative outlook as lower-income households remain stretched, with CEO John Furner saying some spend “paycheck to paycheck.”\n\nJohn Furner officially took on the CEO role earlier this month and stepped into the spotlight Thursday during his first earnings call as chief executive.\n\nGeneral merchandise sales grew globally and by low single digits for Walmart U.S., with fashion being a bright spot in stores and online, Furner told analysts on the Thursday call.\n\nThe quarter also continued to build on existing consumer trends related to household income.\n\n“Again this quarter, the majority of our share gains came from households making more than $100,000,” Furner said. “For households earning below $50,000 we continue to see that wallets are stretched and, in some cases, people are managing spending paycheck to paycheck. That said, even these households are emphasizing convenience nearly as much as price.”\n\nFurner in recent months has repeatedly beaten the drum on how AI will change the retail industry. Customers using the retailer's AI assistant Sparky have an average order value that’s about 35% higher than non-Sparky customers, according to Furner.\n\nIndustry analysts called out the retailer’s forward-looking guidance as being more conservative than expected.\n\n“Overall, while we expect the below‑consensus outlook to create near‑term stock pressure, we believe Walmart remains well positioned heading into [FY27],” Jefferies analysts led by Corey Tarlowe said in a note Thursday. “The company’s balanced growth algorithm, improving earnings quality, and multiple self‑help levers underpin our view that the recent sell‑off represents an attractive entry point for investors.”\n\nWalmart is overall “constructive on the economy,” but the company is taking into consideration economic indicators — such as a hiring recession and student loan delinquencies — when taking a more balanced approach to forward guidance, CFO John David Rainey told analysts.\n\n“Despite offering a conservative forecast, Walmart is in good shape for the year ahead,” Emarketer senior analyst Rachel Wolff said in emailed comments Thursday. “Its efforts to upgrade and expand its assortment, as well as speed up delivery, are winning it e-commerce share and greater loyalty from higher-income shoppers.”\n\nGet the free daily newsletter read by industry experts\n\nAs retailers race to meet consumers on external AI platforms, they risk losing data and direct interaction with shoppers. Experts say disruption has only just begun.\n\nFrom pricing dynamics to the shifting state of malls, here are the trends we’ve got our eye on in 2026.\n\nGet the free daily newsletter read by industry experts\n\nAs retailers race to meet consumers on external AI platforms, they risk losing data and direct interaction with shoppers. Experts say disruption has only just begun.\n\nFrom pricing dynamics to the shifting state of malls, here are the trends we’ve got our eye on in 2026."
    },
    {
        "title": "Gold Prices Falling? Experts Explain When To Buy, Sell Yellow Metal Or Invest In ETFs, Coins",
        "url": "https://www.news18.com/explainers/gold-prices-falling-experts-explain-when-to-buy-sell-yellow-metal-or-invest-in-etfs-coins-shil-ws-l-9913994.html",
        "source": "News18",
        "date": "2026-02-19T05:29:00+00:00",
        "content": "After months of relentless rallies and record-breaking prices, gold is finally showing signs of cooling. The yellow touched Rs 15,420 per gram for 24 karat, Rs 14,135 per gram for 22 karat, and Rs 11,565 per gram for 18 karat on Wednesday. Is this shift the beginning of a correction or merely a pause before another surge?\n\nUrban buyers tracking daily rates on mobile apps, families planning wedding jewellery, and small investors accumulating digital gold are asking whether they should invest now, hold what they own, or wait.\n\nConsiderations such as upcoming weddings, festive purchases, and savings habits often override textbook investment logic. Yet with volatility rising and mixed global signals, the line between emotional buying and tactical investing has never been thinner.\n\nWhat’s Driving The Price Movement Globally\n\nGold’s recent correction is not occurring in isolation. Due to holiday seasons in the US and China, trade activity fell, reducing investor participation and increasing price pressure\n\nMoreover, the strengthening US dollar has made precious metals costlier for buyers using other currencies, dampening global demand. At the same time, robust US employment data has reduced the appeal of traditional safe-haven assets such as gold and silver. Expectations that interest rates will remain stable have also discouraged investment in non-yielding commodities.\n\nAs of February 18, gold prices in the US are trading around $4,930–$4,950 per troy ounce.\n\nWhen the US dollar strengthens, gold typically becomes more expensive for buyers using other currencies, dampening demand. Conversely, a weaker dollar often boosts gold prices as investors look for alternative stores of value. Bond yields also play a crucial role; when government bonds offer attractive returns, gold, which does not generate interest, can temporarily lose appeal.\n\n“Gold has historically experienced meaningful interim corrections even during powerful bull phases. In past cycles, 10-20% drawdowns were common before prices resumed upward momentum. For example, during previous global easing cycles, gold corrected sharply multiple times before making new highs. This pattern reflects profit-booking, currency movements, and interest rate shifts. Investors must understand that volatility is inherent to gold and corrections are part of its long-term price discovery process,\" said Harshal Dasani, Business Head, INVasset PMS – a Mumbai-based investment company.\n\nCentral banks around the world have been significant buyers of gold over the past few years, seeking to diversify reserves away from traditional currencies. However, even subtle changes in these buying patterns can influence global sentiment.\n\nWill The Gold Price Correction Happen In The Coming Days?\n\nLast month, gold prices in India hit an all-time peak at Rs 1.75 lakh, continuing their significant rise by almost 20%.\n\nDarshan Rathod, Chief Operating Officer (COO), Multifyi a stock market advisory firm, said gold can see a short-term correction after a strong rise. “This is a normal market behaviour. Gold prices depend on factors such the US interest rates, inflation, dollar strength, and global uncertainty. When interest rates stay high or the dollar strengthens, gold may fall slightly. Historically, gold often corrects 5-10% after sharp rallies. Such corrections are part of normal price movement and do not change the long-term trend. Investors should understand that short-term volatility is common in gold.\"\n\nIs It The Right Time To Buy Gold?\n\nOne of the most common mistakes buyers make is treating jewellery purchases and investment decisions as identical. Jewellery is primarily a form of consumption. Making charges, design premiums, and resale deductions significantly reduce returns. Buying a necklace for a wedding is about aesthetics and sentiment, not yield optimisation.\n\nInvestment gold, on the other hand, functions differently. Coins and bars offer better price transparency but still involve storage and security considerations. Digital gold removes physical handling but relies heavily on platform credibility and regulatory safeguards. Exchange-traded funds provide liquidity and ease of trading, while sovereign gold bonds often offer interest earnings in addition to price appreciation. Each avenue carries its own mix of risk, taxation rules, and liquidity benefits. Understanding this distinction can prevent buyers from conflating emotional purchases with financial strategies.\n\nDasani said, “Instead of trying to perfectly time the market, investors should focus on allocation discipline. Gold is not a momentum trade; it is a hedge against macro uncertainty and currency volatility. If gold is underrepresented in your portfolio, gradual accumulation through staggered buying makes sense. However, aggressive lump-sum buying after a sharp rally can expose investors to near-term volatility. Ideally, gold should constitute around 10-15% of a diversified portfolio depending on risk appetite.\"\n\nRathod stressed that gold is a “long-term asset used for stability, not quick profit\". “Instead of investing all money at once, gradual buying over time helps manage price risk. Many financial experts suggest keeping about 5-15% of total investment in gold for diversification. Even when prices are high, staggered investment can give a better average cost. Timing the exact bottom is difficult, so disciplined and long-term investment is usually more effective.\"\n\nWhat About Those Who Want To Sell Gold?\n\nRathod pointed out that selling gold should depend on financial needs and portfolio balance. “If gold becomes a large share of total investment after the price rise, partial profit booking may be reasonable. Selling may also be needed for planned expenses.\"\n\nHowever, selling during small price declines is usually not necessary, he added. A gradual selling approach can help achieve a better average price. Gold is generally held for long-term stability, so decisions should be based on financial goals, not the short-term price movement.\n\nDasani also echoed similar views. He said selling decisions should be “allocation-driven, not price-driven\". “If gold has rallied sharply and now exceeds your intended portfolio allocation, partial profit booking can be prudent. However, exiting completely may not be wise, especially in an environment of global uncertainty and shifting monetary cycles. Gold plays a strategic role as a hedge during market stress. Unless there is a pressing liquidity requirement, trimming exposure gradually is more sensible than making an emotional exit.\"\n\nMarket analysts generally caution against interpreting early corrections as definitive downturns. Gold historically moves in cycles influenced by inflation, currency trends, and geopolitical stress. Short-term fluctuations can be sharp, but long-term trajectories tend to stabilise as global uncertainties resurface. Many experts suggest that while prices may cool in the near term due to currency realignments or profit-booking by institutional investors, the broader outlook remains tied to inflation hedging and reserve diversification.\n\nIs This The Right Time To Invest In Gold?\n\nFor the middle class, a softening gold price brings mixed emotions. On one hand, it offers relief to families planning weddings or festive purchases. On the other hand, investors who bought at peak levels may worry about temporary erosion in value. The decision to buy or wait often depends on financial priorities rather than purely market signals.\n\nGold remains relevant as a portfolio diversifier, but timing should be staggered, highlighted Dasani. “Investors today have multiple options beyond physical gold—Gold ETFs, Gold Mutual Funds, and Sovereign Gold Bonds (when issued). Financial gold is generally more efficient and transparent. Instead of making a lump-sum allocation at current levels, systematic accumulation over months can reduce volatility risk while ensuring exposure to long-term structural drivers supporting gold.\"\n\nRathod says gold can be included in a balanced portfolio when investment is done gradually. “Gold ETFs provide easy buying and selling through the stock market. Sovereign Gold Bonds offer gold price returns plus 2.5% yearly interest but require long-term holding. Physical gold provides ownership but includes storage and spread costs. Investors usually keep a limited portion of their portfolio in gold for stability,\" he explained.\n\nGold Coins Vs Jewellery vs ETF vs Bonds: Risks, Charges Explained\n\nRathod says for investment purposes, gold coins or bars are “usually better than jewellery\". “Jewellery includes making charges and wastage, which reduce resale value. Coins and bars usually have lower additional costs and clearer purity through hallmark certification. Jewellery is more suitable for personal use rather than investment. If the objective is price exposure or wealth preservation, investment products like coins, ETFs, or bonds are generally more efficient.\"\n\nGold ETFs provide high liquidity, transparent pricing, and no making charges, though they carry a small annual expense ratio, said Dasani. “They are suitable for tactical or flexible allocations. Sovereign Gold Bonds offer an additional 2.5% annual interest and capital gains tax exemption if held till maturity, making them attractive for long-term investors. However, SGB liquidity in secondary markets can be limited, and new issuances depend on government schedules. Choice depends on liquidity needs and investment horizon.\"\n\nUltimately, gold’s enduring appeal lies in its ability to act as a stabiliser rather than a quick-profit vehicle. While short-term price movements capture headlines, its true strength has historically been in long-term wealth preservation and portfolio diversification.\n\nConsiderations such as upcoming weddings, festive purchases, and savings habits often override textbook investment logic. Yet with volatility rising and mixed global signals, the line between emotional buying and tactical investing has never been thinner.\n\nWhat’s Driving The Price Movement Globally\n\nGold’s recent correction is not occurring in isolation. Due to holiday seasons in the US and China, trade activity fell, reducing investor participation and increasing price pressure\n\nMoreover, the strengthening US dollar has made precious metals costlier for buyers using other currencies, dampening global demand. At the same time, robust US employment data has reduced the appeal of traditional safe-haven assets such as gold and silver. Expectations that interest rates will remain stable have also discouraged investment in non-yielding commodities.\n\nAs of February 18, gold prices in the US are trading around $4,930–$4,950 per troy ounce.\n\nWhen the US dollar strengthens, gold typically becomes more expensive for buyers using other currencies, dampening demand. Conversely, a weaker dollar often boosts gold prices as investors look for alternative stores of value. Bond yields also play a crucial role; when government bonds offer attractive returns, gold, which does not generate interest, can temporarily lose appeal.\n\n“Gold has historically experienced meaningful interim corrections even during powerful bull phases. In past cycles, 10-20% drawdowns were common before prices resumed upward momentum. For example, during previous global easing cycles, gold corrected sharply multiple times before making new highs. This pattern reflects profit-booking, currency movements, and interest rate shifts. Investors must understand that volatility is inherent to gold and corrections are part of its long-term price discovery process,” said Harshal Dasani, Business Head, INVasset PMS – a Mumbai-based investment company.\n\nCentral banks around the world have been significant buyers of gold over the past few years, seeking to diversify reserves away from traditional currencies. However, even subtle changes in these buying patterns can influence global sentiment.\n\nWill The Gold Price Correction Happen In The Coming Days?\n\nLast month, gold prices in India hit an all-time peak at Rs 1.75 lakh, continuing their significant rise by almost 20%.\n\nDarshan Rathod, Chief Operating Officer (COO), Multifyi a stock market advisory firm, said gold can see a short-term correction after a strong rise. “This is a normal market behaviour. Gold prices depend on factors such the US interest rates, inflation, dollar strength, and global uncertainty. When interest rates stay high or the dollar strengthens, gold may fall slightly. Historically, gold often corrects 5-10% after sharp rallies. Such corrections are part of normal price movement and do not change the long-term trend. Investors should understand that short-term volatility is common in gold.”\n\nIs It The Right Time To Buy Gold?\n\nOne of the most common mistakes buyers make is treating jewellery purchases and investment decisions as identical. Jewellery is primarily a form of consumption. Making charges, design premiums, and resale deductions significantly reduce returns. Buying a necklace for a wedding is about aesthetics and sentiment, not yield optimisation.\n\nInvestment gold, on the other hand, functions differently. Coins and bars offer better price transparency but still involve storage and security considerations. Digital gold removes physical handling but relies heavily on platform credibility and regulatory safeguards. Exchange-traded funds provide liquidity and ease of trading, while sovereign gold bonds often offer interest earnings in addition to price appreciation. Each avenue carries its own mix of risk, taxation rules, and liquidity benefits. Understanding this distinction can prevent buyers from conflating emotional purchases with financial strategies.\n\nDasani said, “Instead of trying to perfectly time the market, investors should focus on allocation discipline. Gold is not a momentum trade; it is a hedge against macro uncertainty and currency volatility. If gold is underrepresented in your portfolio, gradual accumulation through staggered buying makes sense. However, aggressive lump-sum buying after a sharp rally can expose investors to near-term volatility. Ideally, gold should constitute around 10-15% of a diversified portfolio depending on risk appetite.”\n\nRathod stressed that gold is a “long-term asset used for stability, not quick profit”. “Instead of investing all money at once, gradual buying over time helps manage price risk. Many financial experts suggest keeping about 5-15% of total investment in gold for diversification. Even when prices are high, staggered investment can give a better average cost. Timing the exact bottom is difficult, so disciplined and long-term investment is usually more effective.”\n\nWhat About Those Who Want To Sell Gold?\n\nRathod pointed out that selling gold should depend on financial needs and portfolio balance. “If gold becomes a large share of total investment after the price rise, partial profit booking may be reasonable. Selling may also be needed for planned expenses.”\n\nHowever, selling during small price declines is usually not necessary, he added. A gradual selling approach can help achieve a better average price. Gold is generally held for long-term stability, so decisions should be based on financial goals, not the short-term price movement.\n\nDasani also echoed similar views. He said selling decisions should be “allocation-driven, not price-driven”. “If gold has rallied sharply and now exceeds your intended portfolio allocation, partial profit booking can be prudent. However, exiting completely may not be wise, especially in an environment of global uncertainty and shifting monetary cycles. Gold plays a strategic role as a hedge during market stress. Unless there is a pressing liquidity requirement, trimming exposure gradually is more sensible than making an emotional exit.”\n\nMarket analysts generally caution against interpreting early corrections as definitive downturns. Gold historically moves in cycles influenced by inflation, currency trends, and geopolitical stress. Short-term fluctuations can be sharp, but long-term trajectories tend to stabilise as global uncertainties resurface. Many experts suggest that while prices may cool in the near term due to currency realignments or profit-booking by institutional investors, the broader outlook remains tied to inflation hedging and reserve diversification.\n\nIs This The Right Time To Invest In Gold?\n\nFor the middle class, a softening gold price brings mixed emotions. On one hand, it offers relief to families planning weddings or festive purchases. On the other hand, investors who bought at peak levels may worry about temporary erosion in value. The decision to buy or wait often depends on financial priorities rather than purely market signals.\n\nGold remains relevant as a portfolio diversifier, but timing should be staggered, highlighted Dasani. “Investors today have multiple options beyond physical gold—Gold ETFs, Gold Mutual Funds, and Sovereign Gold Bonds (when issued). Financial gold is generally more efficient and transparent. Instead of making a lump-sum allocation at current levels, systematic accumulation over months can reduce volatility risk while ensuring exposure to long-term structural drivers supporting gold.”\n\nRathod says gold can be included in a balanced portfolio when investment is done gradually. “Gold ETFs provide easy buying and selling through the stock market. Sovereign Gold Bonds offer gold price returns plus 2.5% yearly interest but require long-term holding. Physical gold provides ownership but includes storage and spread costs. Investors usually keep a limited portion of their portfolio in gold for stability,” he explained.\n\nGold Coins Vs Jewellery vs ETF vs Bonds: Risks, Charges Explained\n\nRathod says for investment purposes, gold coins or bars are “usually better than jewellery”. “Jewellery includes making charges and wastage, which reduce resale value. Coins and bars usually have lower additional costs and clearer purity through hallmark certification. Jewellery is more suitable for personal use rather than investment. If the objective is price exposure or wealth preservation, investment products like coins, ETFs, or bonds are generally more efficient.”\n\nGold ETFs provide high liquidity, transparent pricing, and no making charges, though they carry a small annual expense ratio, said Dasani. “They are suitable for tactical or flexible allocations. Sovereign Gold Bonds offer an additional 2.5% annual interest and capital gains tax exemption if held till maturity, making them attractive for long-term investors. However, SGB liquidity in secondary markets can be limited, and new issuances depend on government schedules. Choice depends on liquidity needs and investment horizon.”\n\nUltimately, gold’s enduring appeal lies in its ability to act as a stabiliser rather than a quick-profit vehicle. While short-term price movements capture headlines, its true strength has historically been in long-term wealth preservation and portfolio diversification.\n\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere."
    },
    {
        "title": "3 Reasons to Buy MDB Stock Despite 10.2x P/S Premium Valuation",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/MSFT/pressreleases/308029/3-reasons-to-buy-mdb-stock-despite-102x-ps-premium-valuation/",
        "source": "The Globe and Mail",
        "date": "2026-02-19T09:54:00+00:00",
        "content": "MongoDB MDB stock may trade at a premium valuation that gives some investors pause, but the modern database software company has built a competitive moat. Its flexible document model supports unstructured and semi-structured data for AI workloads, while Atlas unifies operational database, vector search and Voyage AI embeddings within a single architecture, eliminating fragmented data stacks. That differentiation is translating into performance. In the fiscal third quarter, MDB generated revenues of $628.3 million, up 19% year over year, with non-GAAP operating margins expanding to 20% from 19% in the year-ago period.MDB raised its full-year fiscal 2026 revenue guidance to $2.434 billion–$2.439 billion, representing 21-22% year-over-year growth, signaling management's confidence in sustained growth momentum.The Zacks Consensus Estimate for MDB's fiscal 2026 revenues is pegged at $2.44 billion, indicating 21.45% year-over-year growth. The consensus mark for earnings is pegged at $4.79 per share, indicating a 30.87% increase from the previous year.\n\nMongoDB, Inc. price-consensus-chart | MongoDB, Inc. Quote\n\nMDB has delivered impressive returns for shareholders over the past six months, with shares surging 70.6%, outpacing the broader Zacks Computer and Technology sector's increase of 10.5%, as well as the Zacks Internet-Software industry, which has declined 20.1% in the same timeframe.\n\nImage Source: Zacks Investment Research\n\nAtlas has evolved beyond a cloud database into a unified operational platform supporting transactional workloads, full-text search, vector search and stream processing within a single architecture. Its document model accommodates structured, semi-structured and unstructured data under one schema, giving enterprises the flexibility that rigid relational systems struggle to deliver. As organizations modernize application stacks, Atlas is increasingly becoming the preferred platform.Deployments during the fiscal third quarter demonstrate the depth. A major global insurance provider has standardized on Atlas to modernize mission-critical systems, expanding to nationwide operations while accelerating product rollouts. A global media company has rebuilt its recommendation infrastructure on Atlas and Atlas Vector Search across over 70 websites, cutting latency by 90%, lowering operating costs by 65% and increasing click-through rates by 35%.Atlas revenues grew 30% year over year in the fiscal third quarter and constituted 75% of total revenues, up from 68% in the year-ago period. The Zacks Consensus Estimate for fiscal 2026 Atlas revenues is pegged at $1.8 billion, indicating 28% year-over-year growth, reinforcing Atlas as MDB’s primary growth engine.\n\nMongoDB has been steadily expanding its AI capabilities, and the Voyage AI acquisition earlier in fiscal 2026 marked a pivotal move. By January 2026, MDB will have integrated Voyage AI’s embedding and reranking models directly into Atlas, creating a unified data intelligence layer. Developers can now build and deploy production-grade AI applications without moving or duplicating data across separate systems. This integration signals stronger AI positioning, greater enterprise stickiness and expanding long-term monetization potential for MDB.MDB’s JSON native document architecture provides a structural edge by allowing transactional data, search and vector retrieval to operate within a single environment. The introduction of Automated Embedding for Vector Search further simplifies deployment by automatically generating and storing embeddings whenever data is inserted or updated, eliminating the need for separate embedding pipelines and reducing complexity for enterprise AI teams.Adoption is becoming visible among AI native companies. Mercor runs its hiring platform on Atlas using Voyage embeddings and Atlas Vector Search to support 50% month-over-month growth, indicating Voyage AI's role as a meaningful growth catalyst.\n\nMongoDB has been building a go-to-market model that draws on enterprise sales, self-serve adoption and deep integrations with hyperscalers. Native integrations with Microsoft's MSFT Azure, Amazon's AMZN AWS and Alphabet's GOOGL Google Cloud Platform place Atlas directly inside enterprise cloud environments, reducing deployment friction and reinforcing MDB's role as the operational database layer across hybrid and multi-cloud architectures. The January 2026 expansion of MongoDB for Startups, announced alongside launch partners Fireworks AI and Temporal, further widens this funnel. MongoDB for Startups companies represent over $200 billion in combined valuation, and the program gives early-stage companies a production-ready data foundation with matched credits and coordinated onboarding. As the global AI market is projected to reach $1.77 trillion by 2032, per Fortune Business Insights, this positions MDB as the default data infrastructure choice for the next generation of AI-native companies building on Amazon, Microsoft and Alphabet cloud environments.Customer momentum remains robust. MDB added 2,600 customers in the fiscal third quarter, bringing the total to more than 62,500, up 18.8% year over year. Year-to-date customer additions reached 8,000, representing 65% growth versus the prior-year period, driven primarily by the self-serve channel. The Zacks Consensus Estimate for fiscal 2026 total customers is pegged at 64,200, up 17.8% year over year.\n\nInvestors should buy MDB stock now despite the elevated forward 12-month price-to-sales ratio of 10.2x, which compares to 6.37x for the sector and 3.86x for the industry.\n\nImage Source: Zacks Investment Research\n\nMDB's Atlas platform acceleration, deepening Voyage AI integration, and an expanding partner ecosystem spanning Microsoft, Amazon and Alphabet collectively justify the premium. The company represents a compelling combination of durable revenue growth, improving profitability and a structurally differentiated platform that is increasingly central to both enterprise modernization and AI application development. MDB currently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nOur team of experts has just released the 5 stocks with the greatest probability of gaining +100% or more in the coming months. Of those 5, Director of Research Sheraz Mian highlights the one stock set to climb highest.\n\nThis top pick is a little-known satellite-based communications firm. Space is projected to become a trillion dollar industry, and this company's customer base is growing fast. Analysts have forecasted a major revenue breakout in 2025. Of course, all our elite picks aren't winners but this one could far surpass earlier Zacks' Stocks Set to Double like Hims & Hers Health, which shot up +209%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThis article originally published on Zacks Investment Research (zacks.com).\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    }
]