[
    {
        "title": "S&P 500 scores back-to-back gains as tech rises, Dow touches new record: Live updates",
        "url": "https://www.cnbc.com/2026/02/08/stock-market-today-live-updates.html",
        "source": "CNBC",
        "date": "2026-02-09T19:17:00+00:00",
        "content": "The S&P 500 rose on Monday, boosted by technology stocks, while the Dow Jones Industrial Average reached new heights as investors awaited critical economic data and another batch of earnings reports following a volatile week that ended with the 30-stock index reaching a key milestone.\n\nThe broad-based index advanced for a second straight day, rising 0.47% and ending at 6,964.82. The blue-chip Dow eked out a 20.20-point gain, or 0.04%, and settled at 50,135.87. The Dow Industrials scored a fresh all-time intraday high and closing record. The Nasdaq Composite jumped 0.9%, closing at 23,238.67.\n\nNvidia and Broadcom were standouts yet again Monday, extending their gains from the previous session with an advance of 2.5% and 3.3%, respectively. Shares of fellow artificial intelligence player Oracle were up 9.6% after receiving an upgrade to buy from neutral at D.A. Davidson due to optimism around OpenAI and its beneficiaries.\n\nThe developments come after the major averages rebounded Friday, with the Dow exceeding 50,000 for the first time ever, following sizable losses suffered earlier in the week. The rout was sparked by a sell-off in tech, led by software stocks. Bitcoin also plunged before recovering a bit as investors took a risk-off posture.\n\n\"Investors are saying, 'Okay, we had a tremendous bounce back. Does that have staying power? Is this something that I could get sucked into and only end up getting trounced, or is this really another buying opportunity?'\" said Sam Stovall of CFRA Research.\n\n\"We went from a 17% premium to an 8% discount,\" the chief investment strategist said about tech's forward price-to-earnings ratio compared with its average for the past five years. \"You could say, 'Well, gee, that's pretty good, and so maybe it's time not to bail out on technology just yet.'\"\n\nTo be sure, the market's recent rotation out of tech could play out again this week, if the week's earnings releases are favorable. Coca-Cola and Ford Motor are both slated to report on Tuesday, for instance.\n\nInvestors will also be watching for the delayed January jobs report from the Bureau of Labor Statistics, which is due out Wednesday. The release was initially scheduled for last Friday but was postponed due to the partial government shutdown. It also comes after ADP reported last week that private payrolls increased by a mere 22,000 in January, well below expectations. Economists polled by Dow Jones anticipate the closely watched jobs report will show a gain of 55,000 in January.\n\nThe January consumer price index reading — which was also delayed by the shutdown — is due out Friday, with the consensus looking for a 2.5% annual rate.\n\nThe three leading U.S. indexes finished higher on Monday.\n\nThe S&P 500 rose 0.47% to end the day at 6,964.82, while the Nasdaq Composite gained 0.9% to close at 23,238.67. The Dow Jones Industrial Average inched up 20.20 points, or 0.04%, to 50,135.87.\n\nThe \"Magnificent Seven\" could be left behind as the market rally broadens, according to JPMorgan.\n\n\"In the US, the broadening macro recovery creates room for the equal-weighted S&P 500 to outperform the Mag7,\" Fabio Bassi, head of cross-asset strategy at JPMorgan, said in a note Friday.\n\nBitcoiners need not be bearish, even as the world's oldest cryptocurrency continues to trade more than 40% off its record high, according to Bernstein.\n\nIn a recent note to clients, tinvestment firm pointed to several factors, including U.S. government support for the asset, spot bitcoin ETFs and growing institutional adoption of cryptocurrencies as bullish for bitcoin.\n\n\"The Bitcoin bear case is the weakest in its history,\" Bernstein analysts said in the note. \"The current Bitcoin price action is a mere crisis of confidence. Nothing broke, no skeletons will show up.\"\n\nTheir analysis comes just a few days after bitcoin lost plunged about 15%, sinking last Thursday to below $61,000 — its lowest level in roughly 16 months. Since then, the token has rebounded to $70,918.\n\nThe analysts added that they expect bitcoin to hit $150,000 by the end of this year.\n\nThe small cap leadership investors are seeing this year will continue to have legs, according to BTIG.\n\nSmall caps have hit all-time highs, outperforming large cap indexes this year. The Russell 2000 is higher by more than 8%, while the higher quality S&P Small Cap 600 is up by 10%.\n\nBy comparison, the S&P 500 is up about 2%, while the Nasdaq Composite is marginally higher.\n\nBTIG's Jonathan Krinsky said he expects that trend will continue. He pointed out that the Mag7 ETF has broken key relative support, while the broader market has outperformed, as investors rotate out of megacap tech.\n\n\"We continue to think small-cap leadership is a new and sustainable trend for 2026,\" Krinsky wrote. \"After a brief pullback, small > large looks to be resuming including a new all-time high for the S&P 600 on Friday.\"\n\nInvestors hoping for a broadening of the bull market rally continued to get welcome news in Monday trading.\n\nThe Equal-Weight S&P 500 moved into slightly positive territory midday after being down in earlier trading. If it closes in the green Monday, it would be the index's third record close in its last four sessions.\n\nFor 2026, The Equal-Weight S&P 500 is up more than 5%, while the S&P 500 is up about 2%. Similarly, the Nasdaq Composite is little changed on the year, while the Russell 2000 is up more than 8% as investors have at times in 2026 rotated out of tech and into small caps.\n\nInvestor Jim Lebenthal is taking advantage of the current sell-off in Cleveland-Cliffs to add more to his position in the steel manufacturer.\n\nLebenthal, the chief market strategist at Cerity Partners, joined CNBC's \"Halftime Report\" on Monday afternoon to share his thoughts on the stock. He attributed Cleveland-Cliffs' Monday move lower to it being overbought heading into its latest earnings report.\n\nShares of Cleveland-Cliffs were last trading 17% into the red. The company reported a narrower-than-expected fourth-quarter earnings loss on Monday morning. Its revenue for the last quarter also came in below expectations.\n\nDespite this revenue miss, Lebenthal is optimistic on the stock this year.\n\n\"You got to look forward. What we're seeing is prices on hot rolled coil steel going up. You see volumes going up, you're seeing costs going down. 2026 is going to be a good year,\" Lebenthal said.\n\nHe added that five years ago, Cleveland-Cliffs' sales sat at around $2 billion, versus $20 billion today. Lebenthal attributed this increase to the company \"taking the cash flows and investing it in acquisitions.\"\n\n\"And those acquisitions that they have now digested are going to show the free cash flow generation this year,\" he added.\n\nKyndryl Holdings, an information technology infrastructure services provider spun out from IBM in late 2021, plunged a record 54% Monday on the second-largest trading volume ever. More than 38 million shares changed hands in early afternoon trading, against usual daily volume of just 2.3 million over the past month.\n\nKyndryl disclosed in a regulatory filing that its audit committee is reviewing the company's cash management practices, and said chief financial officer David Wyshner and general counsel Edward Sebold had left their positions, effective immediately. Kyndryl also reported third-quarter results.\n\nMonday's slump pushed Kyndryl's loss just since New Year's to 60%, after the New York-based company, with 73,000 employees, dropped more than 23% in 2025.\n\nWith Monday's decline, Kyndryl now sells for some 60% below its closing price of $26.38 the day of spinoff from IBM a little more than four years.\n\nMonday.com's stock plummeted more than 21% on Monday after the project management platform issued weak guidance as it grapples with rising concerns that artificial intelligence is disrupting the software business model.\n\nThe Israel-based company called for revenue between $338 million and $340 million in the current quarter, short of the $343 million expected by analysts polled by FactSet. For the full year, Monday.com forecasted between $1.452 billion and $1.462 billion in revenue, versus a FactSet estimate of $1.48 billion.\n\nSoftware stocks have sold off in recent weeks on rising AI disruption fears and worries that new agentic tools can replace them. Read more.\n\nWolfe Research upgraded Robinhood to outperform as the firm sees growth in prediction markets compensating for pressure in cryptocurrency.\n\nRobinhood's 2027 earnings per share estimates have been revised more than 60% higher over the past 12 monts, Wolfe analysts led by Sharon Leung told clients in a Sunday note.\n\n\"We view most of the sources of EPS improvement as fairly durable, with higher prediction market volumes offsetting pressures in other areas such as crypto,\" Leung wrote.\n\nWolfe sees \"ample room\" for Robinhood's revenue stream from prediction markets to grow, despite risks from state restrictions and an uptick in litigation against prediction market venues.\n\n\"While we still have mixed feelings about HOOD leaning into sports betting in Prediction Markets, the heads of the regulatory agencies have a more lax stance here,\" Leung said.\n\nCheck out some of the companies making the biggest moves midday:\n\nConsumer are growing more optimistic about near-term inflation, according to a New York Federal Reserve survey Monday.\n\nThe central bank's monthly Survey of Consumer Expectations for January showed the outlook at the one-year horizon dipping to 3.1%, down 0.3 percentage point from December and the lowest level since last summer. Expectations at the three- and five-year time spans were unchanged at 3%.\n\nSentiment also improved on the labor market, with the mean perceived probability of losing one's job in the next 12 months declining to 14.8%, a 0.4 percentage point decrease. The expected quit rate, a reading on worker mobility, increased to 18.7%, up 1.2 percentage points.\n\nThe Dow Jones Industrial Average rose more than 100 points, or 0.2%, on Monday to reach a new all-time high of 50,219.40.\n\nThat marks its seventh high of the year, and the move was propelled by gains in Goldman Sachs, Caterpillar and Microsoft.\n\nAfter the gaming company beat estimates in its fourth-quarter earnings report, Roth is upgrading its rating on Roblox to buy from neutral.\n\nThe investment firm also hiked its price target to $84 from $78, indicating a more than 26% from Friday's close.\n\nRoblox on Thursday reported fourth-quarter revenue and losses that were better than consensus estimates, along with a better-than-expected bookings forecast for the current quarter. The company also said it had more than 144 million daily active users, higher than analysts' projection for 138 million users.\n\nRoth analyst Eric Handler wrote in a Monday note Roblox's efforts to expand its presence among adults is working, with 18-year-old and older users seeing 50% year-over-year growth. New games, he added, have had a strong return on investment.\n\n\"We are increasingly appreciative of the underlying mechanics of the platform having created a strong, sustainable virtuous circle where continuously improving creator/development tools are producing higher quality games, which enhances the user experience, and drives higher engagement,\" Handler wrote.\n\nRoblox shares are down more than 44% in the last six months, but were up 7% in morning trading.\n\nThe three major averages opened in negative territory.\n\nThe Dow Jones Industrial Average shed 128 points, or 0.2%. The S&P 500 traded down 0.2%, while the Nasdaq Composite lost 0.4%.\n\nHere are some of the stocks making moves before the bell:\n\nD.A. Davidson says that OpenAI is back on track after correcting several strategic missteps, a shift the firm believes could lift key beneficiaries in its ecosystem such as Oracle.\n\nThe investment firm sees a brighter future ahead for the artificial intelligence company, upgrading it in a Monday note.\n\nAnalyst Gil Luria wrote that OpenAI has \"corrected several missteps\" since September, with the company refocusing on ChatGPT and its core frontier model.\n\n\"This includes going down the path of turning on ads, which will be critical for increased monetization and reduced cash burn. Management also appears to have realized that they need to align with NVDA, MSFT and AMZN, instead of trying to compete with them,\" Luria wrote.\n\nCNBC Pro subscribers can read more here.\n\nNovo Nordisk said Monday it is suing Hims & Hers Health for making cheaper copycat versions of its new Wegovy obesity pill and injections in the U.S.\n\nThis comes after Hims said over the weekend that it's pulling its copycat weight-loss pill after threats of legal action from Novo and the U.S. Food and Drug Administration.\n\nThe latest developments sent shares of Hims & Hers Health down around 20% in early trading, while Novo Nordisk shares gained more than 5%.\n\n— Annika Kim Constantino, Laya Neelakandan, Sean Conlon\n\nJapanese stocks surged to a record high, leading gains in the region after Japanese Prime Minister Sanae Takaichi won a landmark election victory.\n\nThe ruling Liberal Democratic Party captured a two-thirds supermajority in the 465-seat lower house, public broadcaster NHK reported.\n\nJapan's Nikkei 225 jumped over 4% to cross 56,000 for the first time, while the Topix added 2.27%, also notching a record high.\n\nThe first trading week of February saw major volatility, with the three major averages surging Friday after seeing sizable losses earlier in the weekly period. Here's how they performed last week:\n\nAdditionally, the small-cap Russell 2000 index posted a one-week rise of 2.17%.\n\nU.S. equity futures moved slightly higher on Sunday night.\n\nS&P 500 futures traded up 0.1% shortly after 6 p.m. ET, alongside Nasdaq 100 futures. Dow Jones Industrial Average futures climbed 100 points, or 0.2%."
    },
    {
        "title": "Amazon, Alphabet and Nvidia are part of Zacks Earnings Preview",
        "url": "https://www.sharewise.com/us/news_articles/Amazon_Alphabet_and_Nvidia_are_part_of_Zacks_Earnings_Preview_Zacks_20260209_1052",
        "source": "sharewise",
        "date": "2026-02-09T11:12:00+00:00",
        "content": "Chicago, IL – February 9, 2026 – Zacks.com releases the list of companies likely to issue earnings surprises. This week’s list includes Amazon AMZN, Alphabet GOOGL and Nvidia NVDA.\n\nBreaking Down Mag 7 Earnings: Good or Bad?\n\nAmazon missed EPS estimates in its December-quarter report, but the business is otherwise literally firing on all cylinders.\n\nThe market’s negative reaction to the Amazon report wasn’t due to the EPS miss, but rather to management’s eye-popping capital spending budget for 2026, which coincided with renewed worries about the broader AI space and growing fears that this new technology could seriously erode the earnings power of legacy technology businesses like software.\n\nThe market’s reaction to Amazon is broadly in the same category as Alphabet's after its quarterly release, with the severity of Amazon’s ‘punishment’ reflecting investors’ shock at learning of management’s AI plans. Amazon plans to spend $200 billion in capital expenditures in 2026, up from $132 billion in 2025 and $83 billion in 2024. Amazon’s operating cash flows modestly exceeded its $132 billion capex outlays in 2025, but the company’s 2026 capex budget will most likely exceed its operating cash flows.\n\nBefore we learnt of these lofty spending plans, many in the market expected 2026 to be the capex peak for Amazon (Alphabet and others). But management’s commentary about the mission-critical nature of these outlays likely means that it may be premature to declare peak capex. Amazon shares are now down -8.8% over the past year, lagging the broader market’s +15.8% gain and Alphabet’s impressive +74.1% rise.\n\nAmazon is doing great in its core businesses, with its cloud unit enjoying accelerating growth and coming out with the best growth in three years. Revenues in Amazon Web Services (AWS) increased +24% in 2025 Q4, which compares to year-over-year growth rates of +20% in Q3, +19% in Q2, and +17% in Q1. Backlog for the business increased +40% from the same period last year to $244 billion, with management describing a robust demand environment.\n\nWhile Amazon remains the cloud leader, the Alphabet report showed accelerating momentum at the search giant’s Google Cloud business. Revenues for Google Cloud increased +48% from the same period last year in 2025 Q4, which compares to growth rates of +35%, +32%, and +28% in Q3, Q2, and Q1, respectively. The strong cloud gains at Amazon and Alphabet put the spotlight on Microsoft’s lack of momentum in this key business area.\n\nAt this stage in the Q4 reporting cycle, Nvidia is the only Mag 7 member that has yet to report December-quarter results. Nvidia is scheduled to report Q4 results on February 25th, with EPS and revenues for the period expected to be up +70.8% and +66.7% from the same period last year, respectively.\n\nCombining the actual results for the 6 Magnificent 7 members that have reported already with estimates for Nvidia, total Q4 earnings for the group are expected to be up +24.2% from the same period last year on +18.9% higher revenues, which would follow the group’s +28.3% earnings growth on +18.1% revenue growth in 2025 Q3.\n\nPlease note that the Mag 7 group is on track to bring in 26.6% of all S&P 500 earnings in 2026 and account for 33.5% of the index’s market capitalization.\n\nThe Mag 7 group has been enjoying a steadily improving earnings outlook, with analysts raising their estimates. We saw that trend in play ahead of the start of the Q3 earnings season, and something similar is in place for the 2025 Q4 period as well.\n\nThrough Friday, February 6th, we have seen Q4 results from 293 S&P 500 members or 58.6% of the index’s total membership. Total earnings for these companies are up +14.1% from the same period last year on +9.2% higher revenues, with 77.5% beating EPS estimates and 72% beating revenue estimates.\n\nWe have more than 500 companies on deck to report results this week, including 77 index members. The week’s lineup includes a blend of Tech operators like Spotify, Lyft, and Cisco, and traditional bellwethers like DuPont, Ford, Coca-Cola, BP, and others.\n\n2026 Q1 estimates have increased modestly for 5 of the 16 Zacks sectors since the start of January, including Tech, Industrials, Retail, Utilities, and Business Services. On the negative side, Q1 estimates have come down for 10 of the 16 Zacks sectors, with the biggest declines at the Energy, Medical, and Consumer Discretionary sectors.\n\nFor a detailed look at the overall earnings picture, including expectations for the coming periods, please check out our weekly Earnings Trends report >>>> Earnings Outlook Improves: A Closer Look\n\nFree: Instant Access to Zacks' Market-Crushing Strategies\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\n\nToday you can tap into those powerful strategies – and the high-potential stocks they uncover – free. No strings attached.\n\nJoin us on Facebook:  https://www.facebook.com/ZacksInvestmentResearch/\n\nZacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.\n\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nThis under-the-radar company specializes in semiconductor products that titans like NVIDIA don't build. It's uniquely positioned to take advantage of the next growth stage of this market. And it's just beginning to enter the spotlight, which is exactly where you want to be.\n\nWith strong earnings growth and an expanding customer base, it's positioned to feed the rampant demand for Artificial Intelligence, Machine Learning, and Internet of Things. Global semiconductor manufacturing is projected to explode from $452 billion in 2021 to $971 billion by 2028.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThis article originally published on Zacks Investment Research (zacks.com).\n\nThis page uses Cookies. For proper functioning of the page Cookies are needed. You agree to using Cookies by clicking \"OK\". \nMore infos can be found in our Privacy declaration.\n\nIf you disagree this service is only available in very limited ways."
    },
    {
        "title": "Analysis: Sterling remains undervalued despite strong 2025 results",
        "url": "https://nairametrics.com/2026/02/09/analysis-sterling-remains-undervalued-despite-strong-2025-results/",
        "source": "Nairametrics",
        "date": "2026-02-09T08:22:00+00:00",
        "content": "Sterling Financial Holdings Company Plc has released its 2025 unaudited financial statements, reporting a strong performance.  The share price has also been bullish.\n\nThe stock returned about 26% to investors last year, and as of the close of trading last week, the share price stood at N7.60, reflecting a 7.8% Year-to-Date (YTD) gain.\n\nNotwithstanding, the share price is still 15% short of its 52-week high, indicating that there’s still room for growth.\n\nWhether it will reach and surpass that high largely depends on investor sentiment, market fundamentals, and if the stock is seen as undervalued.\n\nFirstly, the fundamentals, as reflected in Sterling’s 2025 unaudited results, are nothing short of impressive.\n\nEarnings per share (EPS) climbed to N1.57, the highest in five years, depicting a 4% growth.\n\nSterling Bank’s stock appears to be undervalued. Its market capitalization of N396 billion still lags its net asset value (N424 billion), and the P/B ratio of 0.93 further suggests that the stock is trading below book value.\n\nA PEG ratio below 1 typically signals that a stock is undervalued relative to its future growth prospects.\n\nFor Sterling Bank to sustain its performance, the key will be continuing the momentum in interest income, particularly from its loan portfolio.\n\nHowever, there are potential outliers that could affect the bank’s growth.\n\nThe outlook for the spread will largely depend on Sterling’s ability to control deposit costs while continuing to grow its loan portfolio.\n\nIf interest rates on deposits continue to climb or if loan growth slows, the bank could face pressure on its profitability.\n\nIf these factors are not carefully managed, they could squeeze the bank’s margins and impact overall performance.\n\nSterling Bank’s 2025 results demonstrate a strong and resilient performance, with solid profit growth and an undervalued stock.\n\nThe stock performance reflects positive market sentiment, but the undervaluation signals that the market has not fully priced in the bank’s earnings potential.\n\nInvestors looking for an opportunity in a strong, yet undervalued stock should consider Sterling Bank, particularly as the market catches up to its true value.\n\nIdika is a Chartered Stockbroker with expertise in financial analysis, equity research, perspective analysis, and investment commentary.\n\nYour email address will not be published. Required fields are marked *\n\nSave my name, email, and website in this browser for the next time I comment.\n\nFill the forms below to register\n\nPlease enter your username or email address to reset your password."
    },
    {
        "title": "Google and Meta Just Rewrote Broadcom's AI Story—While Shares Drop",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/GOOGL/pressreleases/107634/google-and-meta-just-rewrote-broadcoms-ai-storywhile-shares-drop/",
        "source": "The Globe and Mail",
        "date": "2026-02-09T15:08:00+00:00",
        "content": "Early in 2026, shares of semiconductor giantBroadcom (NASDAQ: AVGO) are continuing on their negative trajectory that characterized the end of 2025. As of the Feb. 5 close, AVGO stock has fallen 10% on the year. Overall, shares are now down 23% since the company last reported earnings on Dec. 11, 2025. However, the outlooks provided by key U.S. hyperscalers make this drop in shares look like an opportunity.\n\nWith hyperscaler capital expenditure (CapEx) guidance coming in much higher than anticipated, Broadcom’s future looks bright amid the sell-off.\n\nHyperscaler CapEx is a key indicator of Broadcom’s future, providing an approximation of the company’s opportunity to generate artificial intelligence semiconductor revenue. Take the firm that is well-known to be Broadcom’s largest chip partner, Google parent company Alphabet (NASDAQ: GOOG). Alphabet reported earnings on Feb. 4, and provided its 2026 CapEx guidance. In the year, it expects to spend between $175 billion and $185 billion on CapEx. At the midpoint, this would mark an approximately 97% increase versus the firm’s 2025 CapEx of $91.4 billion. This is important for multiple reasons.\n\nFirst off, CapEx guidance massively exceeded expectations near $120 billion, which implied spending growth of just 31%. Given that expectations for Broadcom’s revenue growth are substantially anchored to Google’s CapEx, higher-than-expected spending should also push Broadcom's revenue estimates up.\n\nAdditionally, in 2025, Google’s CapEx rose by 74% from $52.5 billion in 2024. By indicating a 97% increase in 2026, the company is clearly showing that its AI spending growth is accelerating. This is great news for Broadcom, one of the market’s top beneficiaries of Google’s AI spending.\n\nNotably, Broadcom shares rose by approximately 1% on Feb. 5, one day after Google’s earnings release, as investors took notice of this relationship. Still, this gain is a drop in the bucket compared to the steep downward decline in AVGO shares over recent months.\n\nCapEx guidance provided by Meta Platforms (NASDAQ: META) adds further weight to the bullish case around Broadcom. Although their relationship has not been officially confirmed, it is widely believed that Meta also has a large partnership with Broadcom. This comes through Broadcom’s co-development of the company’s Meta Training and Inference Accelerator (MTIA).\n\nIn its latest earnings, Meta said it expects to spend between $115 billion and $135 billion on CapEx in 2026. This solidly exceeded expectations of around $110 billion. At the midpoint, Meta’s guidance implies CapEx growth of 73%. This would be a deceleration from 84% growth in 2025, but not a massive one. This growth rate is still very high, providing support for Broadcom’s outlook. Furthermore, it’s possible that Broadcom could receive a greater share of Meta’s spending in 2025 than it has in the past.\n\nIn Q1 2026, Meta said it will “extend our MTIA program to support our core ranking and recommendation training workloads in addition to the inference workloads it currently runs.\" Thus, the firm plans to start using MTIA for model training going forward, not just inference.\n\nFor Broadcom, this is a clear positive sign, implying that Meta will increase its demand for MTIA as it extends the chip’s use-cases. The statement also signals that MTIA is becoming a more strategically important asset to Meta. This is a strong, long-term indicator for Broadcom, increasing the likelihood that Meta will continue to co-develop chips with the firm for years to come. For reference, Google is currently deploying the seventh generation of its Broadcom co-developed tensor processing units (TPUs). Meanwhile, Meta has only deployed the second generation of MTIA.\n\nOverall, these developments provide significant support to the bullish case on Broadcom shares. This news comes at a time when Broadcom shares are trading at a forward price to earnings (P/E) ratio near 30x.\n\nThis is around 19% below the stock’s average forward P/E during the past 52 weeks. Furthermore, the consensus price target on Broadcom is near $437, implying around 41% upside potential. Considering all this, Broadcom shares look like an enticing proposition at current levels.\n\nBefore you make your next trade, you'll want to hear this.\n\nMarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis.\n\nOur team has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and none of the big name stocks were on the list.\n\nThey believe these five stocks are the five best companies for investors to buy now...\n\nThe article \"Google and Meta Just Rewrote Broadcom’s AI Story—While Shares Drop\" first appeared on MarketBeat.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Does Spotify Still Have the (Pricing) Power?",
        "url": "https://finance.yahoo.com/news/does-spotify-still-pricing-power-050100759.html?fr=sycsrp_catchall",
        "source": "Yahoo Finance",
        "date": "2026-02-09T12:42:00+00:00",
        "content": "If you had to pick a soundtrack for Spotify shares in 2026, a Baroque lament or a mopey darkwave number might work best, considering their 27% drop.\n\nAs the music and podcast streaming giant prepares to report its fourth-quarter and full-year 2025 earnings tomorrow, its vaunted pricing power and the business potential of new offerings will face the music. More optimistic analysts are keeping the faith that it will be a mix heavy on sunshine pop.\n\nSUBSCRIBE:  Receive more of our free The Daily Upside newsletter. READ ALSO: PayPal Struggles to Keep Its Spot in Digital Checkout ‘Friend Zone’ and Is Coca-Cola’s Unmatched Pricing Power Finally Fizzling?\n\nSpotify’s stock has slid lower amid a broader tech sell-off. Markets, therefore, will be listening closely to what executives say about the streaming service’s outlook as they seek out value in the wake of the dip.\n\nOne major consideration will be price hikes, which Spotify has used to drive revenue growth in recent years. In November, executives said past hikes led to only a “small amount of churn.” Spotify had 713 million active users at the end of the third quarter, during which time the number of paid subscribers increased 12%. Meanwhile, the company plans to keep testing its pricing power: This month, the US Premium subscription fee went up $1 to $12.99 per month. Another consideration for investors will be the earnings potential of new offerings:\n\nLast week, Spotify entered the physical book business, partnering with online retailer Bookshop.org to let audiobook listeners buy books in its app. That puts it toe-to-toe with e-commerce giant Amazon, whose business was built on a foundation of online bookselling.\n\nLast month, Spotify expanded its creator monetization program and added new video tools for podcasters, pitting it against YouTube. That followed another encroachment on the Google-owned video giant’s market share in December, when Spotify made music videos available to its Premium subscribers in the US and Canada.\n\nWith Spotify shares at $422 as of Friday, many analysts are bullish on its buy-the-dip potential. Goldman Sachs upgraded the company’s rating to “buy” last month and has a $700 price target, implying significant upside. The bank said the company’s gross margin, which came in at 32% in the third quarter, could rise by 80 to 100 basis points annually over the next four years thanks to booming ad revenue, modest podcast costs and a strong position to negotiate royalty payments. Citi ($650 price target), UBS ($800) and Wells Fargo Securities ($710) feel much the same.\n\nGhost in the Machine: Spotify recently said that it accounts for 30% of global music industry revenue, having paid $11 billion to the industry last year, a 10% increase. That money, however, goes to a combination of rights-holders, including labels, distributors and publishers, and does not give a clear picture of how much goes to artists, who are often subject to low earnings in the streaming era.\n\nThis post first appeared on The Daily Upside. To receive razor sharp analysis and perspective on all things finance, economics, and markets, subscribe to our free The Daily Upside newsletter."
    }
]