[
    {
        "title": "Apple (AAPL) Trading 10% Below Analyst Targets After This Week's 8% Drop",
        "url": "https://247wallst.com/investing/2026/02/16/apple-aapl-trading-14-2-below-analyst-targets-after-this-weeks-8-drop/",
        "source": "24/7 Wall St.",
        "date": "2026-02-16T23:13:00+00:00",
        "content": "Apple (AAPL) fell 7.95% in a week to $255.78 despite record iPhone sales of $85.27B and $143.76B revenue.\n\nApple faces doubled NAND flash costs starting Q1 2026 and delays in Apple Intelligence 2.0 past March.\n\n29 of 47 analysts maintain Buy ratings with average target of $292.15 despite the selloff.\n\nSending You to Google News in 3\n\n© Photo by Drew Angerer / Getty Images\n\nApple (NASDAQ: AAPL | AAPL Price Prediction) closed at $255.78 on February 13, down 7.95% from the previous week’s $277.86. Yet Wall Street analysts still see the stock climbing to an average target of $292.15, implying 10% upside from current levels. That disconnect raises a question: is the market pricing in risks analysts are missing, or did the selloff create an entry point?\n\nThe drop came despite Apple reporting a blowout quarter in late January. Revenue hit $143.76 billion, beating estimates, while iPhone sales reached an all-time quarterly high of $85.27 billion. The company returned nearly $32 billion to shareholders and saw its installed base surpass 2.5 billion active devices. Yet the stock has struggled in the weeks since, falling 5.83% year to date while the S&P 500 has remained essentially flat at negative 0.02%.\n\nThe decline accelerated in mid-February as specific concerns emerged. Apple agreed to contract terms with Kioxia that will see NAND flash memory prices double starting in Q1 2026, with quarterly repricing thereafter. That signals ongoing component cost inflation even as the company locks in short-term supply.\n\nMore troubling for investors betting on an AI-driven growth cycle, Evercore ISI reported anticipated delays in the Apple Intelligence 2.0 launch, potentially pushing the release past March. The firm cited testing headwinds and Apple’s privacy-first approach as reasons for the multi-phase rollout, with a complete Siri overhaul not expected until fall 2026. Regulatory scrutiny also intensified, with the FTC raising concerns about alleged political bias in Apple News while antitrust litigation continues.\n\nTechnical indicators confirm the severity of the move. The Relative Strength Index dropped to 39.59 as of February 13, down from 69.03 on February 6. That 29-point swing in seven days pushed the stock into oversold territory, a level historically associated with near-term bounces.\n\nDespite the selloff, 29 of 47 analysts covering Apple maintain Buy or Strong Buy ratings. Evercore kept its Outperform rating with a $330 price target even after flagging the AI delays. The firm argued that Apple’s privacy focus and seamless integration justify the slower rollout.\n\nThe bull case centers on durable growth drivers that extend beyond quarterly noise. The iPhone 17 cycle continues to show strength, with 23% year-over-year growth in the most recent quarter. Services reached a record $30.01 billion, up 14% year over year, providing high-margin recurring revenue. Apple’s partnership with Google on AI features reduces R&D burden while maintaining ecosystem control. The company is also expanding into streaming content, recently acquiring rights to Severance for approximately $70 million as it works to make Apple TV+ profitable.\n\nJim Cramer called Apple “the greatest free rider in history” for its Google AI partnership, arguing the company gains cutting-edge capabilities without the massive capital expenditure rivals face. That strategic positioning matters as Nvidia and Microsoft pour billions into AI infrastructure.\n\nThe data shows Apple underperforming the broader market by nearly 6 percentage points year to date, with the gap widening sharply in recent weeks. Yet analyst conviction remains strong, with 62% of coverage at Buy or better. The disconnect suggests either the market is ahead of Wall Street in pricing execution risks, or short-term concerns are masking a compelling setup.\n\nInvestors are monitoring whether Apple can execute on AI features without further delays and manage component cost inflation without margin compression. The fundamental story remains intact: record iPhone demand, expanding services revenue, and a capital-light AI strategy that avoids the massive spending competitors face. Trading at 32 times trailing earnings with 27% profit margins and $42.10 billion in quarterly net income, the valuation reflects expectations for continued execution.\n\nThe technical setup also suggests potential for a near-term bounce. Previous oversold readings in January recovered within two weeks, and the current RSI of 39.59 suggests capitulation selling. If Apple delivers on the delayed AI features by summer and component costs stabilize, the path back to $292 analyst targets becomes more achievable.\n\nKey risks include AI delays extending beyond fall or margin pressure intensifying. The doubled NAND pricing signals that component inflation hasn’t peaked. If Apple Intelligence 2.0 slips further or adoption disappoints when it does launch, the premium valuation becomes harder to justify. Competitive pressure from Nvidia and Microsoft in AI, combined with regulatory headwinds, could keep the stock range-bound even as fundamentals hold up.\n\nThe risk-reward calculation depends on execution. Retail sentiment turned bearish during the decline, with Reddit activity showing sentiment scores between 25 and 42 through mid-February, well into bearish territory. That contrarian indicator, combined with oversold technicals and analyst conviction, suggests the selloff may have been overdone. But the company needs to prove it can deliver on AI promises and protect margins, or the 9% gap to analyst targets could widen rather than close.\n\nOur top personal finance-related articles today. Your wallet will thank you later.\n\nSuper Micro Computer (Nasdaq: SMCI | SMCI Price Prediction) is trading at $30.54, down 11.2% over the past week. Yet…\n\nCisco Systems (NASDAQ: CSCO) has dropped 9.4% over the past week. That’s seven times worse than the S&P 500’s 1.28%…\n\nAstera Labs (Nasdaq: ALAB) closed at $129.32 on February 13, 2026, down 23.86% over the past week. Wall Street’s average…\n\nUpstart Holdings (NASDAQ: UPST) has dropped 19.77% over the past week, falling from $38.24 to $30.68 as of February 13.…\n\nApple may have some concerns building around just how many new iPhones it really will be selling in the near…\n\nApple has recovered handily from its March lows as the market recovery has been strong. That said, Apple is running…\n\nTuesday morning brings five major stories, and five ways to profit. Here’s what happened and how you make money from…\n\nThe post-earnings rise in Apple's shares was the push that allowed the Dow to hit 22,000 for the first time…\n\nIt hasn’t gone unnoticed by the broader market that Shares of Qualcomm (NASDAQ:QCOM) fell sharply in early February, coinciding with…"
    },
    {
        "title": "AI Capital Expenditure (Capex) Is Off the Charts: Who Stands to Lose?",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/NFLX/pressreleases/257400/ai-capital-expenditure-capex-is-off-the-charts-who-stands-to-lose/",
        "source": "The Globe and Mail",
        "date": "2026-02-17T14:32:00+00:00",
        "content": "In this podcast, Motley Fool analyst Tim Beyers and contributors Jason Hall and Travis Hoium discuss:\n\nDon't wait! Be sure to get to your favorite bookseller and pick up a copy of David Gardner's new book -- Rule Breaker Investing: How to Pick the Best Stocks of the Future and Build Lasting Wealth.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nTo catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. When you're ready to invest, check out this top 10 list of stocks to buy.\n\nBefore you buy stock in Monday.com, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Monday.com wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $414,554!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,120,663!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 884% — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 17, 2026.\n\nThis podcast was recorded on Feb. 09, 2026.\n\nTim Beyers: Big Tech is spending big. Who could lose amid all the winning? You're listening to Motley Fool Money. Welcome, Fools. I'm your host, Tim Byers, and with me are two top Fool contributors and recurring guests. It's Travis Hoium. Jason Hall. Thanks for being here, Fools. How are you feeling?\n\nTravis Hoium: Good. This is a wild market. This is one of the crazier markets that I've seen. We're near all-time highs, and yet we've got some stocks that are just getting absolutely crushed. Kind of crazy.\n\nJason Hall: There's a lot of investors trying to figure out which part of the market is right.\n\nTim Beyers: To that point, Jason, let's talk about two that are on the radar this morning as we are taping. This is on Monday late morning Mountain Time. Both Monday.com, ticker MNDY, and Kyndryl, ticker KD, are getting absolutely slaughtered. Monday has been down more than 20% through various parts of the day. Kyndryl down more than 50%. These two are a little different, though. We'll talk about Monday in a second, but just the story on Kyndryl as the CFO and the General Counsel both appear to have been dismissed. Kyndryl is going to delay its quarterly filings because it cannot verify that its internal controls over financial reporting are sound, and they need to report on this for lack of a better term and explain what the heck is going on here. I'm sure, Vasoas of the market, that sounds like fraud or chicanery or just incompetence. But either way, it's terrible. This is not one of those deep value plays that I think you spend a lot of time putting money behind. Monday might be different. I know you had a question about this one, Jason, because it did report. It beat estimates in its most recent report. The outlook, though, came in a little short on the revenue side and on the margin side. I'm guessing that that codes to the market as this company is getting disrupted. I'm not sure that's true.\n\nJason Hall: Tim, the company comes and reports mid-20s revenue growth, and you see a 20% haircut, you're like, what's going on here? You look at the existing results, and we saw operating income and margins fell. It really looks like in the second half of the year, they're guiding for substantially slowing growth and continued deterioration of the margins. To me, I think that's really the story. Sure, the revenue decline is slowing growth is that, but revenue growth is slowing, and you're losing. You're supposed to be getting more operating leverage for a business like Monday.com. That's not happening.\n\nTim Beyers: Well, it's not, but there's a couple of mitigating factors here. I will point you those of you who are listening who are members of the Motley Fool. First of all, we really appreciate you. We love our entire audience, but we appreciate you, those who are tuning in as members. There is guidance on the site. Please go to your services. You will see some guidance that we have issued, a little bit of analysis on these results from my co-captain on Super Nova Odyssey, David Meyer, and also Alicia Alfieri on the Rule Breakers team, she's also issued a bit of guidance here. But sum it up, Jason, super quickly, there are some foreign exchange effects here. That does have a drag on margins. Also, really early in the deployment of AI agents for monday.com. It's only right now at 1 million in trailing 12-month annual recurring revenue because they were just launched in October, but that's scaled really quickly. Now, over time, do I think that's going to be much higher margin revenue as that scales up across the entire customer base? Yeah, I do.\n\nJason Hall: There's a lot of expense that's coming along with that first group of customers.\n\nTim Beyers: You're going to invest in that to build it. But the customers are taking them up on it and putting AI agents into their Monday.com environment. That's a good sign. I don't see a lot to be really worried about here. But as I've said many times, it's always good to take a breath, pause. You don't have to buy more right now. You don't have to sell right now. It's a good time to let everybody else light their hair on fire. You do not need to join them. It's painful to light your hair on fire anyway. You really don't want to do that. But let's talk about lighting hair on fire. Boy, has there been a lot of spending, Travis? Like, huge amounts of spending, just a metric ton of cash on CapEx. That did seem to be the story of last week's earnings. I did a short analysis here. I looked at Gemini. I did not fully check the numbers, but I eyeballed it, and it looked right. At 400 billion over the last four reported quarters. This is among the top six companies. In terms of net capital expenditures. This is Amazon, Alphabet, Microsoft, Meta, Apple, and Nvidia. That's a huge amount of money. Here's what I want to know from both of you, starting with you, Travis. Is this worth it? Like, is this really worth it? Because this is one of the stories. Do we expect as investors to get something out of all this?\n\nTravis Hoium: It really depends. It depends who you look at. I think it's the answer there. Let's start with Alphabet, because I think they were the talk of the market in 2025. The question for Alphabet was, are they going to be disrupted by OpenAI and by all these chatbots and stuff like that? The one way to not be disrupted is to outspend all of these companies so that your infrastructure is better so that your models are better. Alphabet, this is a scorched earth story. They are ensuring that no one is going to disrupt them. The momentum that they have with Gemini, with putting our AI tools into search, they are foreclosing, I think, that opportunity for disruption. It reminds me a little bit of Facebook [Meta's]. Was it about 10 years ago when Snap had a ton of momentum, and they said, You know what? We're going to copy exactly what you're doing, and their growth just stalled out. We're starting to see the Cary and the coal mine with that with OpenAI. Their growth is slowing, and Alphabet is actually starting to pull away some of those users. Actually, I thought a really effective ad at the Super Bowl last night. But that's the story for them. The other companies are a little bit different. Meta is going to have ROI on their own business. Mark Zuckerberg gets to do whatever he wants spending in AI because he controls the company. I don't know if we're necessarily going to get a payoff for them. Amazon, I don't know. They're late to the party, but you got to spend the money to play. Then Apple is not putting a huge amount toward this in the first place. When you look at those four companies and add Microsoft in there, too. They need to be in this game. They need to grow Azure. They are tied to OpenAI. It's all very rational. By the way, they may say in 2027, we're going to pull this back a little bit. Instead of spending $600 billion, we're only going to spend $400 billion. That could also be another rational move because those competitive threats by then may not be what they were six months ago and what they are today.\n\nTim Beyers: Jason, are we going to bigfoot this market? Is this Travis right here? Is that the strategy?\n\nJason Hall: I think so, but thinking about it from the next second-order impact. What we're seeing, with the exception of Amazon, really, is these companies are substantially changing the way they have managed their balance sheets. For years and decades before taking on the substantial amount of capital, a lot of it we're seeing is starting to be funded by debt, which is new for a lot of these companies to be using debt in this way in these large quantities. Now, they mostly have the money to do it. They have the cash flows to do it. But Meta, for example, has gone from a company that had massive amounts of net cash to, if they're not there now, they certainly will be within a few more quarters of having substantially more debt than cash. With this kind of capital investment, it's a hamster wheel, where you're constantly having to reinvest, to refresh, to stay ahead. It is an all-out sprint for these businesses. It is a land war right now. There's no doubt about it. Everybody's trying to capture market share. If AI is even remotely close to what we're starting to think that it could be, this probably will be a multiple-winners space because so much of what so many of these businesses do is providing the access to the compute, where they don't necessarily have to have the best AI, but you have to have good enough AI to sell to people, to monetize it for the ones that are doing AI that they're building themselves. In a way, I think Apple's strategy for what they do is really compelling to me because they are going to be positioned to do what they've always done really well, and that's have great hardware, a great ecosystem and interface that they build that they own, and then highly curate the things that have access to it. They could actually still be a winner in this, even though they're clearly way behind on building AI themselves, and they've walked away from it because they've been so bad at it. What I don't know is when inevitably we do outrun the demand because right now, let's remember that. Every single CEO that we've heard from has been clear. This is a demand issue. There is still far more demand than they can meet because they can't even get enough electricians and permits in place to connect these data centers to the grid. As long as that's the case, I think the inevitable outrunning of demand and overbuilding is probably farther into the future than maybe we realize.\n\nTravis Hoium: Let's also keep in mind that the economics of this is probably going to be very different than tech has typically been in the past.\n\nTravis Hoium: I think the analogy is going to be something either the airline industry or the oil industry, where if you buy an Nvidia GPU, you spend $100 billion on CapEx. If you're not running that at 100% utilization, then how do you get more demand? Do you lower your prices? Do you just run it under 100% utilization? The economics start to get a little bit more hairy when your demand does not quite hit supply. That's why you get all these games with businesses like airlines. How do you maximize the return? How do you keep the flight full, maximize the dollars that you're getting from each one of those flights? That's not necessarily something they're going to be able to do quite as easily. That's why I thought oil is the other thing where it's just a commodity. If tokens are just a commodity in the future, is that the business that they want to be in? That's why I think the first thing we need to look at is, what was the threat, and have they eliminated the threat? If you do that, then you can look at, are we spending this money wisely? In 2026, maybe not.\n\nTim Beyers: There's OK, let me make sure I heard you both correctly here. We are in the scorched earth stage of the market, and we have not yet got to the stage where we're fixing the land, starting to water the plants, and actually get a harvest out of this thing. We're still just burning crops, baby. This is what we're doing.\n\nJason Hall: I think that's right.\n\nTim Beyers: We're going to talk about in our next segment a couple of companies that are doing exactly that, and whether or not these are winners or are they losers? You're going to want to stay tuned. You're listening to Motley Fool Money.\n\nADVERTISEMENT: Could AI help you do more of what you love? Workday is the next-gen ERP powered by AI that actually knows your business. We help you handle the have-to-dos so you can focus on the can't-wait-to-dos. It's a new workday.\n\nTim Beyers: Fools, let's talk about a couple of companies that are subject. I picked these two, Jason and Travis, because I think they are especially sensitive to how much spending is going on in the AI sector. That is CoreWeave, ticker CRWV, and Oracle, ticker ORCL. Now, full disclosure here, guys. I have said publicly, and I am sticking to this, that I think that CoreWeave is overstretched and might go bankrupt. I've said this before, so I'm going to start with them, and I'm going to kick it to you to start here, Jason. I want to give you some data here. Feel free to tell me I am wrong about this because they have absolutely crushed it. CoreWeave has beaten the market by over 136% over the past year. That is absolutely outstanding. If you had this stock for a while, you have been a winner. But this is a company that has about $14 billion in debt, pays over 300 million in interest in recent quarters. They are levering up massively. They do have high-interest rate debt. They have some that is double-digit interest rate debt. The thesis here is that they have more than $50 billion in backlog that they cannot yet realize. They're building. It's what Travis said. It's scorched earth. We're building, we're building, we're building, and someday we're going to be able to harvest. Do you believe it?\n\nJason Hall: I don't think believing it is really the right question to answer. I think what it comes down to is, are the things that they're bringing to the table, and probably the biggest one is what makes CoreWeave a little bit different from the hyperscalers that are selling bandwidth is it's faster. It is faster. Like OpenAI, for example, is going to be able to speed up their process. They're going to be able to develop AI works faster. It's going to happen faster. Technically, that should lead to them being able to advance the product faster, make it better, get to a point where their ROI is better more quickly. The question is twofold. Number one, how long is that 10-15% advantage in speed? You can say speed. It's not exactly speed, but it's latency more than anything. Like, how long is that going to be something that's worth more money? Is the pause the stop and take your breath from all of the other hyperscalers, is that going to happen before they do get to scale? Here's the other biggest question. Is OpenAI going to be able to make their commitments, that's tied to the big CapEx and the debt that's there? Lastly, to make it even more complicated. Are partners like Nvidia going to continue to have the purse strings connected to the CoreWeaves of the world as providers of capital at need? How long is that going to continue to be the case before a Jensomong says, now we're at the point where it's good money after bad, and we have to just walk away? I don't know the answer to all of those complexities, but this is what I do know. I do know that it means that CoreWeave is heavily reliant on a lot of things that they have absolutely no control over and minimal influence to survive any sort of a slowdown in this sprint. If there is a slowdown, they get in trouble faster than anybody.\n\nTim Beyers: I'm going to give you a stat, Travis. I know you want to get in here 'cause it's important, but I ought to give you a stat. 2026 CAPEX is estimated to come in at about 220% of revenue. That seems absolutely bonkers to me.\n\nTravis Hoium: It is. What I think it is is a confidence game. If you remember, I know Jason and I were covering a company called Sun Edison about a decade ago. The idea with Sun Edison was they could build wind and solar projects basically to infinity by simply selling some debt here, selling some equity there. As long as your cost of capital, your combination of the cost of those two funding sources, were lower than what your return was going to be on the asset that you were building, you were good to go. You could just do this over and over and over and over again. The problem becomes, when does the department of the market say no? When does the market say, You know what? You already mentioned the debt. CoreWeave doesn't exactly have cheap debt. You're not doing solar projects where the debt was 4%, 5% interest rates. This is higher-cost debt. The debt market is already telling us what it thinks. They're already saying, Hey, we don't quite believe this. If the equity market goes the same direction, then the whole thing topples over. That's really the risk that you have to look at with these companies. It's a very, very different calculation if you're Sundar Pichai, and you're looking at Google's cash flow and balance sheet, and you're just saying, why don't we spend everything that we possibly can to make sure that we're not disrupted by OpenAI? Because at the end of the day, if we need to pull that back, that's fine. We still got more cash coming in the next year. CoreWeave is in the same position. There is no next year if they don't get that funding, if they don't get the next project. It's a very, very different risk profile, and you start adding to debt. Everybody who has studied bubbles in the past will tell you the two signs that it's surely a bubble is when people start using debt and when nobody thinks it's a bubble anymore. That is terrifying. I will say, in CoreWeave's defense, what they say the CapEx that they are committing to is success-based, so they will not commit the CapEx until they have a contract that would allow them to apply the CapEx they're buying.\n\nJason Hall: But a contract doesn't matter if the counterparty papers and meets theirs.\n\nTravis Hoium: It's paper. I have some doubts about that. Quickly, because we're running short on time here. Let's talk about Oracle. Oracle has a $523 billion backlog. They also have quite a bit of debt, but they also generate quite a bit of free cash flow here, so they just did, Jason, a $50 billion capital raise, half through debt, half through equity. They are just raising money hand over fist. It does seem to me that of all of the companies that are going scorched earth, this company is scorching the most earth relative to what it can bring to bear in terms of resources. Tell me, both of you quickly, do you think that this strategy for Oracle in particular, which has an interesting place, by the way, in the market, playing Switzerland in the data center market with these Exadata machines, it makes sense. Yet, I mean, this is a heck of a bet, Jason.\n\nJason Hall: I think in a lot of ways, it's a necessary bet, though.\n\nTim Beyers: We're back to it again. You must go scorched earth. There is no choice.\n\nJason Hall: Oracle's future would look vastly different if the company doesn't make an attempt to be a substantial part of the AI infrastructure, where AI lives, and having it connected to its own data because of its enterprise customers. It's become table stakes for a business like Oracle. I think the saving grace, though, is that if things don't turn out, if we don't have a panacea, Oracle still has a pretty good business that's there. It's going to be heavily encumbered. I don't think it goes away. Like, I don't think it goes to zero, and then somebody's buying the pieces off the scrap heap, like you could see with our CoreWeave. But I do think that they're taking a necessary risk. I guess if we were to ask the question between Oracle and CoreWeave, which of those do I think that there's a better risk profile? I think it's Oracle because the floor is higher, and the business is more stable. But I want to point out that at 7.5 times sales, before the past couple of years, this is the most expensive Oracle has ever been. As much as the stock has fallen, it's still not cheap.\n\nTim Beyers: Travis, where are you on this?\n\nTravis Hoium: One correction for you. They are operating cash flow positive. As of three quarters of the growth, they are not free cash flow positive. Because of all the CapEx. But I want to clarify that because they have $100 billion worth of debt, and they're only adding to that debt load. They are leveraging up the company, betting on it. By the way, you mentioned the RPO, the remaining performance obligations. That was when the stock jumped in the fall. Who is providing all of that backlog? Most of it is OpenAI. Again, it's a confidence game. Does OpenAI get to be the thing that you think it could be in the future and live up to all these high expectations? Maybe, but we talked about the one problem with that early on. Alphabet is spending $180 billion making sure that doesn't happen. That's what's got to worry you if you're Oracle.\n\nJason Hall: Well, I mean, look at how quickly things change, though. I mean, we were talking about Gemini and Alphabet, how much it had moved from a really troubled business to a big leader. The past six weeks, the story has been clawed.\n\nTim Beyers: By the way, I will tell you, I have access to full Claude, and it's good. It's very, very good.\n\nJason Hall: We're going to be talking different names this summer. That's my point.\n\nTim Beyers: I'm sure that we will be. Fools, we're going to preview tomorrow's show. Stay tuned. You're listening to Motley Fool Money.\n\nADVERTISEMENT: The world moves fast. You workday, even faster, pitching products, drafting reports, analyzing data. Microsoft 365 Copilot is your AI assistant for work built into Word, Excel, PowerPoint, and other Microsoft 365 apps you use, helping you quickly write, analyze, create, and summarize. You can cut through clutter and clear a path to your best work. Learn more at microsoft.com/365Copilot.\n\nTim Beyers: Coming up tomorrow, more interesting stuff. We got a lot more earnings coming. Emily Flipping is going to be doing a Rule Breakers earnings roundup. She's going to be welcoming Toby Bordelon, and guess who else is going to be back. Jason Hall will be back. They will be talking, Datadog, Ferrari, and Spotify, all of which will be reporting on Tuesday morning. Please make sure to tune in and leave a comment for us if you have thoughts about that show, and leave a comment for us today so you can tell us what you think about this show. I know we went through quite a lot here, and we will take your questions and maybe do some follow-ups on them. As always, people on the program may have interest in the stocks they talk about, and the Motley Fool may have formal recommendations for or against, so don't buy or sell stocks based solely on what you hear. All personal finance content follows Motley Fool editorial standards and is not approved by advertisers. Advertisements are sponsored content and provided for informational purposes only. To see our full advertising disclosure, please check out our show notes for Jason Hall and Travis Hoium, our producer is Anan Choco Balu. Our engineer, as always, is the incomparable Dan Boyd. Fools, I am your host, Tim Byers. See you again soon, Fools. Fool on.\n\nJason Hall has no position in any of the stocks mentioned. Tim Beyers has positions in Alphabet. Travis Hoium has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet, Kyndryl, Meta Platforms, Monday.com, and Oracle. The Motley Fool has a disclosure policy.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Earnings live: Palo Alto Networks stock sinks after company cuts full-year-forecast",
        "url": "https://finance.yahoo.com/news/live/earnings-live-palo-alto-networks-stock-sinks-after-company-cuts-full-year-forecast-221504665.html",
        "source": "Yahoo Finance",
        "date": "2026-02-17T22:24:00+00:00",
        "content": "The software trade is still under pressure.\n\nLate Tuesday, shares of cybersecurity giant Palo Alto Networks (PANW) fell as much as 6% after the company cut its full-year earnings outlook.\n\nThe company's report comes as fourth quarter earnings season enters its final stretch.\n\nAs of Feb. 13, 74% of S&P 500 (^GSPC) companies had reported results, according to FactSet data, and blended earnings growth — meaning a combination of reported results from companies and projected profits from analysts — stood at 13.2%.\n\nIf that growth rate holds, it would represent the 10th consecutive quarter of annual earnings growth for the index and the fifth consecutive quarter of double-digit growth.\n\nEarlier on Tuesday, shares of General Mills (GIS) fell after its earnings disappointed, while online trading platform eToro (ETOR) saw its stock rise more than 20% following a strong quarter.\n\nOver the balance of the week, investors will digest results from Walmart (WMT), Deere & Co. (DE), Analog Devices (ADI), Booking Holdings (BKNG), DoorDash (DASH), and eBay (EBAY).\n\nGeneral Mills (GIS) stock fell 6% on Tuesday after the maker of Cheerios cereal lowered its fiscal 2026 sales forecast due to a more challenging consumer environment.\n\nTrading platform eToro's (ETOR) stock jumped 11% before the bell on Tuesday after beating estimates for fourth quarter profit.\n\nFourth quarter earnings season is entering the final stretch.\n\nIn the week ahead, the consumer will be in focus, with results from Walmart before the open on Thursday the headline event.\n\nThis report will be the first under its new CEO, John Furner, and the first since the company joined the trillion-dollar market cap club.\n\nOther notable companies reporting results include Booking Holdings (BKNG), DoorDash (DASH), and eBay (EBAY), all of which are set to report on Wednesday.\n\nData from FactSet published Friday noted some 74% of S&P 500 companies have reported results through the end of the week. Blended earnings growth for the quarter — meaning actual reported results and forecast earnings from analysts — has the pace of growth at 13.2% for the fourth quarter.\n\nThis puts the index on track to record a fifth straight quarter of double-digit profit gains.\n\nHere's the full calendar for the week ahead. And note that US markets are closed on Monday for Presidents' Day, but a few companies are still expected to report results.\n\nMonday: BHP Group (BHP), Sonoco Products Company (SON), Otter Tail Corporation (OTTR), ReNew Energy Global (RNW)\n\nTuesday: Medtronic (MDT), Palo Alto Networks (PANW), Constellation Energy (CEG), Cadence Design Systems (CDNS), Republic Services (RSG), Energy Transfer (ET), Vulcan Materials (VMC), EQT Corporation (EQT), Kenvue (KVUE), DTE Energy Company (DTE), FirstEnergy Corp. (FE), Devon Energy (DVN), Expand Energy (EXE), Leidos Holdings (LDOS), InterContinental Hotels Group (IHG), Genuine Parts Company (GPC), Sunoco (SUN)\n\nWednesday: Analog Devices (ADI), Booking Holdings (BKNG), Lloyds Banking Group (LYG), CRH (CRH), Moody's Corporation (MCO), Carvana (CVNA), DoorDash (DASH), Occidental Petroleum (OXY), Kinross Gold Corporation (KGC), Garmin (GRMN), eBay (EBAY), Nutrien (NTR), Texas Pacific Land Corporation (TPL), Edison International (EIX), American Water Works Company (AWK), Verisk Analytics (VRSK), Pan American Silver Corp. (PAAS), Royal Gold (RGLD), Global Payments (GPN), Reliance (RS), Western Midstream Partners (WES), Host Hotels & Resorts (HST), Jones Lang LaSalle (JLL), Equinox Gold Corp. (EQX), Figma (FIG), HF Sinclair (DINO), Molson Coors (TAP), Wingstop (WING), Wyndham Hotels & Resorts (WH)\n\nThursday: Walmart (WMT), Rio Tinto (RIO), Deere & Company (DE), Newmont Corporation (NEM), The Southern Company (SO), Quanta Services (PWR), Targa Resources (TRGP), Comfort Systems USA (FIX), Consolidated Edison (ED), Cenovus Energy (CVE), Live Nation Entertainment (LYV), Copart (CPRT), Extra Space Storage (EXR), Teck Resources (TECK), CenterPoint Energy (CNP), Alliant Energy Corporation (LNT), Fidelity National Financial (FNF), Guardant Health (GH), DT Midstream (DTM), American Homes 4 Rent (AMH), Gaming and Leisure Properties (GLPI), Texas Roadhouse (TXRH)\n\nFriday: AngloGold Ashanti (AU), PPL Corporation (PPL), Lamar Advertising Company (LAMR), Sibanye Stillwater (SBSW), Hudbay Minerals (HBM), Portland General Electric Company (POR), Balchem Corporation (BCPC), Array Digital Infrastructure (AD), The Western Union Company (WU)\n\nCoinbase (COIN) posted a quarterly loss in the fourth quarter amid a sharp retrenchment in the crypto trade that saw bitcoin (BTC-USD) fall 45% over the past six months.\n\nThe crypto exchange reported a loss of $667 million, compared with a $1.3 billion profit in the same quarter a year ago. Revenue of $1.78 billion fell below expectations of $1.83 billion, according to S&P Global Market Intelligence.\n\nTransaction revenue of $983 million also fell slightly below estimates. Coinbase said it has seen $420 million of transaction revenue in the first quarter through Feb. 10.\n\nFor the first quarter, Coinbase expects subscription and services revenue of $550 million to $630 million, compared to $710 million to $790 million in Q4.\n\nThe stock initially sold off but then reversed course and rose 3% in after-hours trading. Shares had fallen about 8% heading into the earnings report as Coinbase users experienced issues buying and selling on the exchange. \"Your funds are safe,\" a Coinbase customer support account posted on X.\n\nListen to the Q4 earnings call here at 5:30 p.m. ET.\n\nApplied Materials (AMAT) stock climbed 9% after the ⁠semiconductor equipment maker beat Wall Street expectations on the top and bottom lines.\n\nThe after-hours reaction to Applied Materials' results added to the strong run for the stock in 2026. Year to date, shares are up 27%.\n\nAirbnb (ABNB) stock gained 4% in extended trading after the travel company issued an upbeat first quarter revenue outlook, suggesting it's seeing strong demand for premium bookings.\n\nAirbnb forecast revenue between $2.59 ​billion and $2.63 billion for the quarter, compared with analysts' expectations of $2.52 billion, according to S&P Global Market Intelligence consensus estimates.\n\nFourth quarter revenue of $2.78 billion beat expectations of $2.71 billion, but Airbnb's earnings per share in the quarter of $0.56 missed estimates of $0.65, as the company invested heavily in new experiences and offerings.\n\nYahoo Finance's Pras Subramanian reports:\n\nMcDonald's (MCD) said its value campaign to get customers to return to the fast food chain after high prices tarnished its reputation for affordable food is working. And with fourth quarter US same-store sales growing 6.8% during the quarter, there may be some truth to that.\n\n\"We're not going to not win on value,\" CFO Ian Borden told Yahoo Finance. \"We've made, I think, significant progress on our value and affordability platforms and how those are resonating with consumers.\"\n\nIn the first quarter, McDonald's is expected to pull back on the support it sent franchisees for the Extra Value Meal push. But Borden suggested that many locations would keep the meal deal, calling it \"fundamental in the environment that we're operating in today.\"\n\nBorden and McDonald's CEO Chris Kempczinski also indicated that they're aware of the growing adoption of GLP-1 weight-loss medications, especially now that pill versions are rolling out.\n\n\"As adoption grows, we know that consumers' behavior changes,\" Kempczinski said. \"We know that in general, they eat fewer calories in the day, but also what they eat, the mix of that changes.\"\n\nKempczinski added that the company is factoring in changing diet preferences, such as customers opting for less sugary drinks, into the offerings it is testing.\n\nRead more about how McDonald's is responding to weight-loss drugs here.\n\nShares of Crocs (CROX) soared more than 13% in premarket trading on Thursday, after the company reported better-than-expected fourth quarter earnings and a solid earnings outlook for 2026.\n\nFor the fourth quarter, Crocs reported earnings per share of $2.29, well above the consensus estimate of $1.91 per share. Revenue totaled $958 million for the quarter, lower than in the same quarter a year ago, but ahead of expectations of $916.09 million.\n\nCrocs noted that it came off a strong holiday season. Sales in Crocs' direct-to-consumer channel grew 3.6%, while its wholesale revenue declined 15.5%.\n\nThe company's outlook was also upbeat: The company issued full-year profit guidance of $12.88 to $13.35 per share, beating analysts' estimates of $11.92.\n\nBirkenstock (BIRK) shares fell 3% in premarket trading after the 250-plus-year-old footwear maker missed analyst expectations for its first quarter revenue.\n\nUS healthcare company Baxter's (BAX) stock sank 14% before the bell on Thursday following the release of its fourth quarter earnings, forecasting annual profit below Wall Street estimates. The company cited persistent problems from hurricane-related issues at one of its manufacturing plants.\n\nMagnum Ice Cream's (MICC) stock fell 12% during premarket hours on Thursday. The group, which was recently spun off from Unilever (UL) and makes popular ice creams such as Ben & Jerry's and Cornetto, reported a 3% decline in sales for its fourth quarter earnings.\n\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "title": "Why Is ImmunityBio Stock Gaining Tuesday?",
        "url": "https://www.benzinga.com/news/health-care/26/02/50652094/why-is-immunitybio-stock-gaining-tuesday",
        "source": "Benzinga",
        "date": "2026-02-17T13:44:00+00:00",
        "content": "A newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.\n\nImmunityBio Inc. (NASDAQ:IBRX) shares are up during Tuesday’s premarket session as the company is reportedly advancing its regulatory efforts.\n\nThis positive movement follows the announcement of productive discussions with the Saudi Food and Drug Authority regarding the submission of a regulatory package for recombinant BCG, aimed at addressing the global BCG shortage.\n\nDuring these discussions, the Saudi FDA encouraged ImmunityBio to submit a regulatory package for its recombinant BCG (rBCG) to improve access in Saudi Arabia. The company plans to submit this package in the coming weeks, which could significantly impact bladder cancer treatment availability in the region.\n\nAdditionally, ImmunityBio is also exploring the expansion of its product Anktiva (nogapendekin alfa inbakicept) in combination with checkpoint inhibitors (CPI) for various tumor types.\n\nThe scientific rationale for expanding into additional tumor types in the CPI relapsed population is supported by data from the QUILT-3.055 Phase 2b basket trial (N=147), which enrolled patients across multiple tumor types.\n\nIn the NSCLC cohort (N=86), the addition of Anktiva to the same checkpoint inhibitor on which patients had progressed demonstrated a median overall survival of 14.1 months, with 12-month and 18-month survival rates of 57% and 34%, respectively.\n\nImmunityBio announced preliminary net product revenue for Anktiva reached approximately $113 million for fiscal 2025, reflecting a remarkable 700% increase year-over-year.\n\nThe stock is currently trading 5.47% above its 20-day simple moving average (SMA) and 12.3% above its 100-day SMA, indicating a strong short-term trend. Shares have increased 77.46% over the past 12 months and are currently positioned closer to their 52-week highs than lows, reflecting robust long-term performance.\n\nThe RSI is at 50, indicating a neutral position, while MACD is above its signal line, suggesting bullish momentum. The combination of neutral RSI and bullish MACD indicates mixed momentum, suggesting potential for upward movement.\n\nThe countdown is on: ImmunityBio is set to report earnings on March 2, 2026.\n\nAnalyst Consensus & Recent Actions: The stock carries a Buy Rating with an average price target of $11.80. Recent analyst moves include:\n\nBelow is the Benzinga Edge scorecard for ImmunityBio, highlighting its strengths and weaknesses compared to the broader market:\n\nIBRX Price Action: ImmunityBio shares were up 1.51% at $6.040 at the time of publication on Tuesday, according to Benzinga Pro data.\n\n© 2026 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nTo add Benzinga News as your preferred source on Google, click here.\n\nIn January, ImmunityBio said it plans to submit additional information to the U.S. Food and Drug Administration (FDA) within 30 days following a Type B end-of-phase meeting related to its supplemental biologics license application for Anktiva in papillary non-muscle invasive bladder cancer (NMIBC)."
    }
]