[
    {
        "title": "Market Highlights: Sensex settles 316 pts higher, Nifty above 25,550; NTPC rises 3%, L&T 2%",
        "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-nifty50-stock-market-live-updates-gift-nifty-hul-federal-bank-share-price-20-february-2026/liveblog/128586085.cms",
        "source": "The Economic Times",
        "date": "2026-02-20T12:13:00+00:00",
        "content": "Sensex Today | Nifty 50 | Stock Market Live Updates: India's heartbeat indices rebounded from day's lows to finish the session on a high note. In a volatile session, IT stocks were major laggards, though broad-based buying trends held the markets firm.\n\nUS President Donald Trump preempted the official release of GDP figures on Friday, saying that a record-long government shutdown last year had slowed growth by at least two points.\n\n\"The Democrat Shutdown cost the U.S.A. at least two points in GDP. That's why they are doing it, in mini form, again,\" he wrote on Truth Social about a half-hour before the Commerce Department releases it fourth quarter and 2025 full-year growth estimates.\n\nThe government is currently in a partial shutdown, only impacting the Department of Homeland Security.\n\nEuropean stocks rebounded and oil prices fell Friday as investors reassessed the chances of a US strike on Iran, after heightened geopolitical tensions sparked by President Donald Trump's threats amid talks on a nuclear deal.\n\nIt followed a weak session in Asia, where several markets remained closed for the Lunar New Year break.\n\nCrude prices pulled back after climbing to six-month highs this week on worries that nuclear talks between the United States and oil-rich Iran might not avert a new conflict that could threaten supplies.\n\n\"Threats of military action against Iran from the Trump administration... created some jitters in the market yesterday -- with selling in US stocks being matched in most Asian markets,\" said AJ Bell investment director Russ Mould.\n\nTrump warned Thursday that Tehran should make a \"meaningful deal\" in negotiations with Washington in the next 10 days or else \"bad things happen\".\n\nBritain's FTSE indexes gained on Friday and were set to end the week higher, led by ‌defence stocks, while ⁠expectations for ⁠a March rate cut from the Bank of England and easing AI-disruption worries globally also aided sentiment.\n\nThe blue-chip ​FTSE 100 was up 0.6% at around 1134 GMT and was trading just shy of a record ​high, while the domestically focused FTSE 250 rose 0.5%.\n\nGeopolitical tensions between Iran and the U.S. and the greater likelihood of defence cooperation within Europe helped defence stocks gain 6% this ​week.\n\n- Vinod Nair, Head of Research at Geojit Investments\n\nThe NSE will levy an extra 15% margin on 18 F&O stocks starting March 2026, focusing on securities where top clients account for over 20% of the market-wide position limit. The move is aimed at curbing risks from excessive leverage, while margins on gold and silver futures have been relaxed. Read more\n\n- Dr. VK Vijayakumar, Chief Investment Strategist, Geojit Investments\n\nEurope’s richest individuals are once again allocating capital to hedge fund-style strategies, aiming to capture the industry’s strong returns after years of growing personal wealth.\n\nThe bond market’s expectation that the Federal Reserve will deliver at least two more rate cuts this year clashes with the strength of the US economy, according to portfolio managers at Invesco and Carmignac, who say they are positioning against US Treasuries.\n\nBajaj Finserv’s alternative investment arm is planning to raise up to $1 billion, as it looks to expand beyond its core businesses of lending, mutual funds, and insurance into non-traditional asset classes, a senior group executive told The Economic Times.\n\nShares of oil exploration companies advanced in an otherwise weak market on Thursday as renewed geopolitical tensions between the United States and Iran heightened fears of supply disruptions and lifted crude prices. Oil India jumped 5.2%, while ONGC rose 3.6%, tracking gains in Brent crude. In contrast, oil marketing firms came under pressure, with HPCL slipping nearly 5% and Bharat Petroleum Corporation Ltd (BPCL) declining 3.4%.\n\nOverseas investors channelled their biggest allocations into capital goods, financials, and oil & gas stocks in the first half of February, investing ₹33,487 crore across 15 sectors — marking their highest fortnightly inflows since the second half of April 2025.\n\nIndian equity indices tumbled on Thursday, pressured by a renewed flare-up between the United States and Iran that pushed Brent crude above $71 a barrel, highlighting the oil-import-reliant economy’s sensitivity to rising energy costs amid a gradual weakening of the rupee against the US dollar over the past year.\n\nOil prices rose on Friday as concerns over a potential conflict between the U.S. and Iran intensified, after Washington warned that Tehran would face consequences if it failed to reach an agreement on its nuclear programme within days.\n\nThe dollar was on track Friday to post its strongest weekly gain since October, supported by a string of stronger-than-expected economic data, a more hawkish outlook from the Federal Reserve, and heightened tensions between the U.S. and Iran that kept markets cautious.\n\nNvidia and Apple weighed on sentiment as Wall Street closed lower on Thursday, with declines in private equity firms adding pressure, while earnings-led strength in industrial stocks helped cap the overall losses.\n\nAsian equities declined as rising tensions in Iran dampened investor sentiment, while oil prices climbed to their highest level since August.\n\nIn today’s trade, shares of Federal Bank, Waaree Energies, ICICI Prudential Life Insurance, Zydus Lifesciences, and Hindustan Unilever, among others, are likely to remain in focus amid various news-driven developments and corporate updates.\n\nComments are moderated and will be allowed if they are about the topic and not abusive.\n\nChoose your reason below and click on the Report button. This will alert our moderators to take action\n\nYour Reason has been Reported to the admin."
    }
]