[
    {
        "title": "Moderna's Earnings Outlook",
        "url": "https://www.benzinga.com/insights/earnings/26/02/50575337/modernas-earnings-outlook",
        "source": "Benzinga",
        "date": "2026-02-12T13:01:00+00:00",
        "content": "A newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.\n\nModerna (NASDAQ:MRNA) is preparing to release its quarterly earnings on Friday, 2026-02-13. Here's a brief overview of what investors should keep in mind before the announcement.\n\nAnalysts expect Moderna to report an earnings per share (EPS) of $-2.60.\n\nThe announcement from Moderna is eagerly anticipated, with investors seeking news of surpassing estimates and favorable guidance for the next quarter.\n\nIt's worth noting for new investors that guidance can be a key determinant of stock price movements.\n\nThe company's EPS beat by $1.66 in the last quarter, leading to a 0.86% increase in the share price on the following day.\n\nHere's a look at Moderna's past performance and the resulting price change:\n\nShares of Moderna were trading at $40.51 as of February 11. Over the last 52-week period, shares are up 22.79%. Given that these returns are generally positive, long-term shareholders should be satisfied going into this earnings release.\n\nFor investors, staying informed about market sentiments and expectations in the industry is paramount. This analysis provides an exploration of the latest insights on Moderna.\n\nModerna has received a total of  ratings from analysts, with the consensus rating as . With an average one-year price target of $, the consensus suggests a potential .\n\nTo track all earnings releases for Moderna visit their earnings calendar on our site.\n\nThis article was generated by Benzinga's automated content engine and reviewed by an editor.\n\n© 2026 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nTo add Benzinga News as your preferred source on Google, click here."
    },
    {
        "title": "Nvidia (NVDA) Stock: Top Analyst Raises Target to $245 on Strong Revenue Outlook",
        "url": "https://blockonomi.com/nvidia-nvda-stock-top-analyst-raises-target-to-245-on-strong-revenue-outlook/",
        "source": "Blockonomi",
        "date": "2026-02-12T12:39:00+00:00",
        "content": "UBS analyst Timothy Arcuri boosted his Nvidia price target to $245 from $235 ahead of the company’s Q4 earnings report on February 25. The upgrade maintains a Buy rating on the stock.\n\nArcuri ranks fifth among over 12,000 analysts on TipRanks. His track record shows a 77% success rate with 41.4% average returns per rating.\n\nThe new price target implies 28% upside from current trading levels. Nvidia stock has gained 45% over the past year despite recent sideways movement.\n\nThe UBS analyst now models Q4 fiscal 2026 revenue at approximately $67.5 billion. This projection sits $2.5 billion above Nvidia’s official guidance.\n\nFor the April quarter, Arcuri forecasts around $76 billion in revenue. Current investor expectations range between $74 billion and $75 billion.\n\nRecent supply chain checks continue showing strength. The analyst views the earnings setup as favorable heading into the February 25 report.\n\nNvidia’s GTC developer conference takes place in March. The event could provide additional momentum for shares.\n\nChina remains an uncertain factor in Nvidia’s revenue outlook. Local companies are increasingly adopting domestically produced chips.\n\nHowever, Arcuri notes potential China orders could still add several billion dollars to results. UBS expects the company may exclude China from formal guidance.\n\nInvestors have raised concerns about margin sustainability. Large technology companies are developing their own AI processors.\n\nThe analyst sees limited near-term risk to Nvidia’s 75% gross margin target. Management will likely address competition from Google and Broadcom TPU chips during the earnings call and at GTC.\n\nNvidia currently trades at a P/E ratio of 47.47 with a market capitalization of $4.65 trillion. Revenue growth reached 65.22% over the last twelve months.\n\nWall Street maintains a Strong Buy consensus on the stock. TipRanks data shows 37 Buy ratings, one Hold, and one Sell from analysts.\n\nThe average analyst price target stands at $260.38, implying 37% upside potential. UBS believes steady AI demand and clearer guidance could improve investor sentiment heading into the earnings report.\n\nDiscover top-performing stocks in AI, Crypto, and Technology with expert analysis.\n\n📈 Futures & Crypto Trader 🔍 Sharing charts, strategies, & mindset tips to help you level up 🚨 Not Financial Advice Follow on X @Pro_Trader_Edge\n\nType above and press Enter to search. Press Esc to cancel.\n\nGet Up To $100k Back! Exclusive Thrill Originals!"
    }
]