[
    {
        "title": "S&P and Dow Jones futures slip as AI fears weigh on markets",
        "url": "https://invezz.com/news/2026/02/17/sp-and-dow-jones-futures-slip-as-ai-fears-weigh-on-markets/",
        "source": "Invezz",
        "date": "2026-02-17T12:47:00+00:00",
        "content": "US stock index futures moved lower on Tuesday, as investors struggled to regain confidence following another losing week on Wall Street and continued uncertainty around artificial intelligence’s impact on business models.\n\nFutures tied to the S&P 500 fell 0.29%, while Nasdaq 100 futures dropped 0.76%.\n\nDow Jones Industrial Average futures declined 62 points, or about 0.13%.\n\nMarkets will reopen on Tuesday after the New York Stock Exchange was closed Monday for Presidents’ Day.\n\nMajor technology names weighed on sentiment in premarket trading.\n\nMeta Platforms and Nvidia each lost around 0.8%, while Palantir Technologies fell 2%.\n\nMicrosoft and Apple also edged down about 0.4%.\n\nWall Street’s recent weakness has been driven largely by concerns about artificial intelligence changing traditional industries.\n\nSoftware firms, brokerages, and trucking companies were among the sectors hit hardest last week, contributing to the steepest weekly declines for the three major US indexes since mid-November.\n\nThe S&P 500 and Dow Jones Industrial Average both fell more than 1% last week, while the Nasdaq Composite lost more than 2%.\n\nThe Dow and S&P 500 have posted four losing weeks out of the last five, and the Nasdaq recorded its fifth straight negative week, its longest losing streak since 2022.\n\nEconomists say the technology shift is being interpreted more as sector rotation than broad risk aversion.\n\nPotential risks from Chinese artificial intelligence developments added to the uncertainty.\n\nAlibaba unveiled its Qwen 3.5 AI model designed to independently perform complex tasks, and its US-listed shares rose about 1% in premarket trading.\n\nDespite a softer-than-expected consumer price index reading last week, markets remained cautious.\n\nInvestors are now focused on the personal consumption expenditure report due Friday, the Federal Reserve’s preferred inflation gauge, along with Fed meeting minutes scheduled for Wednesday.\n\nThe cooler inflation data slightly increased expectations for monetary easing.\n\nAccording to CME’s FedWatch Tool, traders are pricing in a 25-basis-point rate cut in June with roughly 52% probability, compared with about 49% a week earlier.\n\nSpeeches from Federal Reserve Governor Michael Barr and San Francisco Fed President Mary Daly later in the day are also expected to provide additional policy guidance.\n\nCorporate earnings will play a central role this week.\n\nPalo Alto Networks reports results Tuesday, with DoorDash, Walmart, and Wayfair set to follow.\n\nMore than 73% of S&P 500 companies have reported earnings this quarter, and 74.5% have exceeded analysts’ estimates, above the typical 67% beat rate, according to LSEG data.\n\nOther corporate developments generated notable moves in individual stocks.\n\nNorwegian Cruise Line rose about 6.4% after reports that activist investor Elliott had built a stake exceeding 10%.\n\nShares of Zim Integrated Shipping jumped roughly 35% after Germany’s Hapag-Lloyd agreed to acquire the company for $4.2 billion.\n\nMasimo surged about 34% following reports that Danaher was nearing a nearly $10 billion acquisition deal, though Danaher shares fell 6.8%.\n\nInvestors will also watch Friday for a potential Supreme Court ruling related to US President Donald Trump’s tariffs, adding another layer of uncertainty to markets.\n\nFailed to load articles. Please try again."
    },
    {
        "title": "S&P 500 closes little changed Tuesday as declines in software shares weigh on index: Live updates",
        "url": "https://www.cnbc.com/2026/02/16/stock-market-today-live-updates.html",
        "source": "CNBC",
        "date": "2026-02-17T19:22:00+00:00",
        "content": "The S&P 500 inched higher on Tuesday, but declines in software stocks kept the index's gains in check.\n\nThe broad market benchmark advanced 0.1% and closed at 6,843.22, while the Nasdaq Composite ticked up 0.14% to close at 22,578.38. The Dow Jones Industrial Average climbed 32.26 points, or 0.07%, and settled at 49,533.19.\n\nInvestors rotated out of beaten-down software names, which added to the losses they've seen this year, and into financial stocks such as Citigroup and JPMorgan. Shares of Citi jumped 2.6%, while shares of JPMorgan were up more than 1%.\n\nServiceNow, however, was more than 1% lower, with its drop in 2026 standing at about 31%. Autodesk and Palo Alto Networks were down more than 2%. The former has notched a roughly 24% decline this year, while the latter has fallen 11%. Salesforce and Oracle shares declined nearly 3% and almost 4%, and their year-to-date losses were at 30% and 21%, respectively. The iShares Expanded Tech-Software Sector ETF (IGV) slid more than 2%, putting its loss for the year at 23%.\n\nThe software sector has been getting hit on fears that artificial intelligence tools could replace industry-specific software providers.\n\n\"We just need time to see what earnings are going to look like from some of these companies,\" Leah Bennett, chief investment strategist at Concurrent Investment Advisors, said in an interview with CNBC. \"I think those that aren't able to compete and don't really have moats around their business, you're going to see a deterioration,\" she continued, adding that such a disruption will also lead the market to decipher winners in the space.\n\nAI disruption worries hit industries such as software, real estate, trucking and financial services last week, pushing the S&P 500 to its second consecutive losing week. Both the S&P 500 and blue-chip Dow lost more than 1% last week, while the technology-heavy Nasdaq lost more than 2%.\n\nThe Dow and S&P 500 both logged their fourth losing weeks of the last five. The Nasdaq recorded its fifth straight negative week, its longest losing streak since 2022.\n\n\"AI innovation and its disruption are calling into question terminal multiples in various corners of the market that is driving investors to focus on specific risks, rather than broader exposure changes,\" said Scott Chronert, Citi U.S. equity strategist. \"For now, the narrative is disconnected from good medium-term fundamental trends. The onus is on companies to convince markets of longer-run business moats, likely a Q1 reporting season theme, absent a renewed focus on a macro soft landing.\"\n\nThose concerns appeared to overshadow the latest consumer price index reading released Friday. The headline CPI data came in softer than economists polled by Dow Jones predicted for January. That followed a better-than-expected jobs report earlier in the week.\n\nInvestors will get more insight into the path of inflation this week, with the personal consumption expenditures price index report slated for Friday. Before then, they'll monitor Federal Reserve meeting minutes on Wednesday.\n\nThe New York Stock Exchange was closed on Monday in observance of Presidents' Day.\n\nThe S&P 500 has traded sideways since first topping 6,800 in October, with some parts of the market showing strength while others are showing severe weakness. Energy, materials, staples and industrials are rallying, while financials, discretionary and tech has slid.\n\nThat level of extreme dispersion usually results in broad weakness, as the stronger parts of the market catch down to the weaker ones, according to BTIG. However, the new leaders have yet to correct, the firm observed. Krinsky said semiconductors is a key sector to watch to see which way the market will go.\n\n\"For most participants this is not a new revelation, but does continue to highlight how much dispersion there is below the surface,\" Jonathan Krinsky wrote on Monday. \"The million-dollar question is which way does the bifurcation resolve?\"\n\nInvestors are loading up on stocks at a high enough level to trigger a contrarian sell signal, according to the latest Bank of America Fund Manager Survey.\n\nPortfolios are holding their biggest overweight position on stocks since December 2024 and their most underweight on bonds since September 2022, BofA investment strategist Michael Hartnett said. One caveat: Wall Street professionals are rotating out of U.S. offerings and into emerging markets and EU, though shying away from Japan.\n\nThe bullish move has triggered the BofA Bull & Bear Indicator, a measure of stock market sentiment that is now sending a \"sell\" signal with a reading of 8.2. On a global scale, Hartnett said bullishness was last this strong in June 2021. High levels of market optimism can mean stocks are overvalued and should be sold.\n\nHartnett recommends investors reduce risk in the first quarter and implement a number of pair trades that include going long bonds and short gold, long the U.S. dollar and short emerging markets and long tech stocks and short banks.\n\nIn other developments, Wall Street also has taken its most overweight commodities position since May 2022 and has edged up cash holdings to 3.4% of portfolios, just 0.2 percentage point off the record low. Investors are betting on a \"run it hot\" economy, with the most optimism on growth since February 2022, Hartnett said.\n\nGemini Space Station fell about 14% after clearing out part of its c-suite.\n\nThe crypto exchange let go of its chief operating officer, chief financial officer and chief legal officer, according to its disclosure filed Tuesday with the US Securities and Exchange Commission.\n\nThe elimination of the roles comes less than two weeks after Gemini said it would lay off 25% of its workforce.\n\nThe company first went public last September.\n\nInvestor Jenny Harrington believes that buying hard asset, low obsolescence dividend stocks could be a good hedge against growing artificial intelligence threats.\n\n\"They're stocks that, assuming humanity survives AI, we're going to be using these products throughout in the next 10, 15, 20 years,\" the CEO of Gilman Hill Asset Management said on CNBC's \"Halftime Report\" on Tuesday afternoon. \"Nothing too exciting, just slow and steady.\"\n\nTo that end, Harrington listed stocks such as Amcor, Kimberly-Clark, Bristol-Myers Squibb and Dominion Energy as ones that fit the bill. She added that these dividend names all have \"decent earnings growth ahead\" and yields of between 4% and 6%.\n\nEconomic data is pointing the way toward more interest rate cuts this year, according to Citigroup economists.\n\nEven with a stronger than expected employment report and core inflation still above target, \"details point to a clear path for further rate cuts,\" Citi economist Andrew Hollenhorst said in a note. Hollenhorst said that same sentiment is likely to be reflected in minutes from the Federal Reserve's January meeting that will be released Wednesday.\n\n\"Markets have appropriately recognized the residual seasonality in jobs data and cooling trend in inflation,\" he added. \"That means policy rates are likely to fall further this year. It also means pricing of Fed rate cuts is free to increase further as part of the general risk-off in markets.\"\n\nChicago Fed President Austan Goolsbee told CNBC on Tuesday that he expects additional rate cuts this year so long as the inflation data cooperates.\n\nGeneral Mills shares headed for their worst day in nearly six years on Tuesday after the Lucky Charms and Progresso parent lowered its 2026 outlook.\n\nGeneral Mills said organic net sales would slide between 1.5% and 2% after previously forecasting between a loss of 1% to a gain of 1%. The company said operating profit and adjusted earnings per share would plunge between 16% and 20% despite an earlier prediction of 10% to 15% down.\n\nShares dropped more than 7% in afternoon trading. If that holds through Tuesday's closing bell, it would mark the stock's biggest one-day retreat since a slide of more than 11% in March 2020.\n\nOn Tuesday, 37 stocks in the S&P 500 traded at new 52-week highs.\n\nTickers that hit this milestone included:\n\nThe nine stocks trading at new 52-week lows were:\n\n— Lisa Kailai Han, Christopher Hayes\n\nAmazon entered its 9th day of consecutive losses on Friday. If red by market close, the stock will tie for its longest losing streak ever. Amazon first saw 10 days of consecutive losses in 1997, nearly three decades ago. Its forward price-to-earnings ratio is also the lowest since 2008. So far, the stock has shed nearly $450 billion from its market valuation.\n\nThe streak began after Amazon revealed it plans to spend $200 billion in capital expenditures this year. The company plans to invest in AI by scaling its data centers and servers.\n\n\"Every single customer is seeing more and more demand for moving their workloads to the cloud, putting their data on AWS and then layering AI on top of that to get value for their business,\" AWS CEO Matt Garman said in an interview with CNBC.\n\nThe news comes after investors have expressed concerns about hyperscalers like Amazon overspending on AI. \"It's an indication of how bullish we are about the future and growth of AWS,\" Garman said of the investment.\n\nAmazon is down 12% year to date.\n\nRothschild & Co. Redburn upgraded Dollar Tree to buy on Tuesday, pointing to its attractive valuation, earnings growth and potential upside from the acceleration of its multi-price roll-out.\n\nSince it sold Family Dollar last July, Dollar Tree has refocused on its core operations for the first time in a decade, analyst Sam Hudson said in a note to clients.\n\n\"Following the Family Dollar divestment, we argue that Dollar Tree is a higher-quality, higher-return, more cash-generative opportunity than it has been for the past decade, warranting a higher valuation than recent history,\" he wrote.\n\nHudson's price target of $165 implies nearly 31% upside from Friday's close.\n\nFederal Reserve Governor Michael Barr said Tuesday he sees risks to both employment and inflation and sees keeping interest as they are the best policy for now.\n\nOn the labor market, Barr said he sees a \"tentative balance\" between both low hiring and low firing rates but says the picture is \"delicate\" and \"especially vulnerable to negative shocks.\" On inflation, he noted that the Fed's preferred gauge is still stuck around 3% with a \"significant\" risk that it sticks there, Barr said in a speech to the New York Association for Business Economics.\n\n\"Based on current conditions and the data in hand, it will likely be appropriate to hold rates steady for some time as we assess incoming data, the evolving outlook, and the balance of risks,\" Barr said.\n\nAs a governor, Barr is a permanent voting member of the rate-setting Federal Open Market Committee.\n\nJapanese equities just had one of their best 2-week relative returns compared to the rest of the world ever, according to Goldman Sachs. And the firm sees more strength ahead.\n\nGoldman moved its rating on the country's equities in a Monday note to overweight from neutral.\n\nIt comes after the Nikkei 225's nearly 5% jump last week after incumbent Prime Minister Sanae Takaichi's Liberal Democratic Party romped to victory in the country's national elections. Analyst Andrea Ferrario said in the note that the moves after the election are consistent with months-long developments in the market.\n\n\"Markets started pricing higher growth in Japan in September, and growth pricing increased further at the start of 2026, catching up with EM and outpacing both Europe and US,\" Ferrario wrote. \"Japan equities re-rated vs. the World and the long-end of the JGB yield curve flattened, driven by lower uncertainty and investors' increased confidence in the Government and the BOJ's ability to resolve the 'bad' fiscal tail.\"\n\nGoldman recommends owning defense companies, shipbuilding stocks and names with exposure to corporate governance reforms in Japan. The firm added that despite the expectation for room to expand, implied volatility in Japanese equities is elevated.\n\nTrivariate Research has adopted a more bearish stance on U.S. equities this year, citing an increased level of volatility in the market due to a higher number of companies potentially disrupted by artificial intelligence.\n\nThis list includes industries that caught some investors off guard, wrote Trivariate Research co-founder Adam Parker, such as those that could be disrupted by AI tools automating financial work flows and the introduction of AI freight tools.\n\n\"While several of these stocks bounced higher late last week, we remain concerned that these stocks are 'guilty until proven innocent,' meaning they are more likely to have multiple contraction than expansion for the foreseeable future. We think a useful exercise for investors is to imagine that they are the CEO of a company and focus on businesses that are making a high margin off of them,\" Parker wrote. \"This likely means certain data companies, and other expensive service companies are vulnerable.\"\n\nOutside of AI, other industries could also see higher volatility introduced by the Trump administration, such as companies affected by metals tariff rollbacks and credit card fee caps. As such, Parker sees a greater likelihood of multiple contraction this year.\n\n\"The bottom line is this: when there is uncertainty, we should pay a lower multiple for equities than when there is certainty. We reiterate the view laid out in our 2026 year-ahead outlook that the probability of multiple contraction for the U.S. equity market this year is greater than the probability of multiple expansion,\" he wrote. \"That makes us more bearish than consensus.\"\n\nChicago Federal Reserve President Austan Goolsbee told CNBC on Tuesday that further interest rate cuts are possible if inflation shows more progress lower.\n\nTaking a cautious view on last week's consumer price index report, which showed headline inflation down to 2.4%, Goolsbee said he remains wary that the easing in prices will continue and wants to see what the longer-term impact from tariffs will be.\n\n\"If this proves to be transitory, and we can show that we're on the path back to 2% inflation, I still think there's several more rate cuts that can happen in 2026,\" he said. \"But we've got to see it.\"\n\nGoolsbee does not vote this year on the rate-setting Federal Open Market Committee but will vote in 2027.\n\nThe S&P 500 began Tuesday's session in negative territory.\n\nThe broad-based index fell 0.2% shortly after the opening bell, while the Nasdaq Composite dropped 0.7%. The Dow Jones Industrial Average added 140 points, or 0.3%.\n\nCheck out the companies making headlines before the bell:\n\nThe CBOE Volatility Index, or VIX, was above the 20 level on Tuesday, hitting 22.50.\n\nThe index — otherwise known as Wall Street's \"fear gauge\" — was trading around 17 at the beginning of last week's trading period.\n\nSilver and gold fell in early premarket trading on Tuesday as investors awaited delayed economic data, with little geopolitical news during the holiday-shortened week.\n\nSpot silver was last seen down 2% to trade at around $74.85 per ounce, while silver futures fell 4% to trade at $74.7 dollars per ounce.\n\nHecla Mining, which owns one of the biggest silver mines in the world, Green Creek Mine in Alaska, was down 3% before the market opened. Meanwhile, Endeavour Silver shed 3.5%, First Majestic Silver was down nearly 4%, Coeur Mining lost nearly 3.4%, Teck Resources and Silvercorp Metals were roughly 3% lower, and Wheaton Precious Metals was down over 2%. Read more.\n\nJPMorgan sees shares of AeroVironment rising as demand for drones and space capabilities swell.\n\nThe bank initiated the aerospace and defense stock with an overweight rating. Analyst Seth Seifman's $320 price target implies that shares of AeroVironment could rally 31% from here.\n\n\"AeroVironment (also known as AV) looks well-positioned to deliver mid-teens growth thanks to its exposure to fast-growing areas within defense, both domestically and internationally, including drones, counter-drone systems, and space,\" Seifman wrote. \"AVAV is also one of the more experienced defense companies that could benefit from DoD efforts to expand the industrial base and adopt a more commercial approach.\"\n\nCNBC Pro subscribers can read more here.\n\nWarner Bros. Discovery on Tuesday said it will reopen deal talks with Paramount Skydance under a seven-day waiver from Netflix to explore \"deficiencies\" in Paramount's offer to buy the entirety of WBD.\n\nThe legacy media company has a pending transaction with Netflix for its streaming and studio businesses. Paramount launched a hostile tender offer straight to WBD shareholders at $30 per share after losing out to Netflix in a bidding war.\n\n\"Netflix has provided WBD a limited waiver under the terms of WBD's merger agreement with Netflix, permitting WBD to engage in discussions with Paramount Skydance (\"PSKY\") (NASDAQ: PSKY) for a seven-day period ending on February 23, 2026 to seek clarity for WBD stockholders and provide PSKY the ability to make its best and final offer,\" Warner Bros. Discovery said in a release. Read more.\n\nShares of health tech giant Masimo rallied more than 33% after The Wall Street Journal and Financial Times reported, citing sources, that the company was nearing a deal with Danaher to be acquired for $180 per share, or $10 billion, in cash.\n\nTech stocks began the week on the back foot, adding to their struggles from the past month.\n\nThe State Street Technology Select Sector SPDR ETF (XLK) dropped nearly 1% in the premarket, led by declines in Autodesk and Teledyne. Both stocks lost more than 3% each. Nvidia also pulled back around 1%.\n\nTech-related names such as Meta Platforms and Amazon declined 1.1% and 0.2%, respectively.\n\nStocks aren't coming into the holiday-shortened trading week with momentum.\n\nThe Dow and S&P 500 each finished last week down more than 1%. Each index notched its fourth losing week of the last five, while the S&P 500 also recorded two negative weeks in a row.\n\nThe Nasdaq Composite slid more than 2%. That marked the technology-heavy index's fifth straight losing down week, its first losing streak of that length since 2022.\n\n— Alex Harring, Christopher Hayes\n\nStock futures are little changed shortly after 6 p.m. ET.\n\nDow and S&P 500 futures rose 0.2% and 0.1%, respectively. Nasdaq 100 futures slipped 0.2%."
    },
    {
        "title": "The Hackett Group Announces Fourth Quarter 2025 Results",
        "url": "https://finance.yahoo.com/news/hackett-group-announces-fourth-quarter-210800925.html",
        "source": "Yahoo Finance",
        "date": "2026-02-17T21:24:00+00:00",
        "content": "MIAMI, February 17, 2026--(BUSINESS WIRE)--The Hackett Group, Inc. (NASDAQ: HCKT), a leading generative artificial intelligence (Gen AI) consultancy and digital transformation firm that enables Digital World Class® performance, today announced its financial results for the fourth quarter, which ended on December 26, 2025.\n\n\"We reported operating results with revenues and adjusted earnings per share that were above and at the high end of our guidance, respectively. While we cannot control short-term market sentiment or demand volatility, we can - and do - control the intrinsic value we create,\" stated Ted A. Fernandez, Chairman and CEO of The Hackett Group, Inc. \"The current environment also creates the opportunity for new leaders to emerge. Over the past two years, we have been systematically expanding our suite of Gen AI enabled platforms to lead in the rapidly emerging Agentic Enterprise era. By embedding our IP into our new platforms and models, we believe we will be able to generate new revenue with higher margins, in entirely new ways that allow us to deliver breakthrough ROI. We are looking forward to 2026!\"\n\nTotal revenue in the fourth quarter of 2025 was $75.8 million and revenue before reimbursements was $74.8 million, which exceeded the high end of our guidance. This compares to total revenue of $79.2 million and revenue before reimbursements of $77.5 million in the fourth quarter of the prior year.\n\nGAAP diluted earnings per share was $0.21 in the fourth quarter of 2025, as compared to $0.12 in the fourth quarter of 2024. 2025 fourth quarter GAAP net income was impacted by non-cash compensation expense recognized in association with the stock price award program announced in September 2024 of $1.8 million, or $0.08 per diluted earnings per share. In addition, 2025 GAAP net income was impacted by the LeewayHertz acquisition related non-cash compensation and related expenses of $1.1 million, or $0.04 per diluted earnings per share.\n\nAdjusted diluted earnings per share, a non-GAAP measure, for the fourth quarter of 2025 was $0.40, which was at the high end of our guidance, as compared to $0.47 in the fourth quarter of 2024. Adjusted financial information is provided to enhance the understanding of the Company’s financial performance and is reconciled to the Company’s GAAP information in the accompanying tables.\n\nDuring the fourth quarter of 2025, the Company completed its \"Dutch auction\" tender offer through which it repurchased 2.0 million shares for a total cost of $41.2 million, or $20.29 per share, including transaction related fees; lowering the outstanding shares by approximately 7%. As of the end of the fourth quarter, the Company’s remaining share repurchase program authorization was $11.4 million.\n\nAs of December 26, 2025, the Company’s cash balances were $18.2 million, with $76.0 million outstanding on the Company’s credit facility. Cash flows from operations were $19.1 million in the fourth quarter of 2025, as compared to $20.6 million in the fourth quarter of 2024.\n\nSubsequent to the end of the fourth quarter, the Company's Board of Directors approved an additional $13.6 million under its share repurchase program and declared the first quarterly dividend of $0.12 per share for its shareholders of record on March 20, 2026, to be paid on April 3, 2026.\n\nBusiness Outlook for the First Quarter of 2026\n\nBased on the Company’s current outlook:\n\nThe Company estimates total revenue before reimbursements for the first quarter of 2026 will be in the range of $70.5 million to $72.0 million.\n\nThe Company estimates adjusted diluted earnings per share for the first quarter of 2026 to be in the range of $0.34 and $0.36, assuming a GAAP effective tax rate of 26.3%.\n\nConference Call and Webcast Details\n\nOn Tuesday, February 17, 2026, senior management will discuss fourth quarter results in a conference call at 5:00 P.M. ET. The number for the conference call is (800) 593-0486, [Passcode: Fourth Quarter]. For International callers, please dial (517) 308-9371. Please dial in at least 5-10 minutes prior to start time. If you are unable to participate on the conference call, a rebroadcast will be available beginning at 8:00 P.M. ET on Tuesday, February 17, 2026 and will run through 5:00 P.M. ET on Tuesday, March 3, 2026. To access the rebroadcast, please dial (800) 568-3652. For International callers, please dial (203) 369-3289.\n\nIn addition, The Hackett Group® will also be webcasting this conference call live. To participate, simply visit https://www.thehackettgroup.com approximately 10 minutes prior to the start of the call and click on the conference call link provided. An online replay of the call will be available after 8:00 P.M. ET on Tuesday, February 17, 2026 and will run through 5:00 P.M. ET on Tuesday, March 3, 2026. To access the replay, visit www.thehackettgroup.com.\n\nUse of Non-GAAP Financial Measures\n\nThe Company provides adjusted earnings results (which excluded non-cash stock-based compensation expense, acquisition-related non-cash stock-based compensation expense, legal settlement and related costs and includes a GAAP tax rate) as a complement to results provided in accordance with Generally Accepted Accounting Principles (GAAP). These non-GAAP results are provided to enhance the users' overall understanding of the Company's current financial performance and its prospects for the future. The Company believes the non-GAAP results provide useful information to both management and investors and by excluding certain expenses that it believes are not indicative of its core operating results. The non-GAAP measures are included to provide investors and management with an alternative method for assessing operating results in a manner that is focused on the performance of its ongoing primary operations and to provide a consistent basis for comparison between quarters. Further, these non-GAAP results are one of the primary indicators management uses for planning and forecasting. The presentation of this additional non-GAAP information should be considered in addition to, and not as a substitute for or superior to, any results prepared in accordance with GAAP. See the reconciliation of actual results titled \"Reconciliation of GAAP to Non-GAAP Measures\" in the accompanying tables.\n\nThe Company believes that the presentation of non-GAAP financial information on a forward-looking basis, including the guidance contained in this release, provides important supplemental information to management and investors regarding its anticipated results of operations. The Company is unable to provide a reconciliation of GAAP measures to corresponding forward-looking non-GAAP measures without unreasonable effort due to the high variability and low visibility of most of the items that have been excluded from these non-GAAP measures. For example, non-cash stock-based compensation expense is impacted by the Company’s future hiring needs, the type and volume of equity awards necessary for such future hiring, and the price at which the Company’s stock will trade in those future periods. In addition, the provision or benefit for income taxes is impacted by non-recurring income tax adjustments, valuation allowance on deferred tax assets, and the income tax effect of non-GAAP exclusions. The effects of these reconciling items may be significant, as the items that are being excluded are difficult to predict.\n\nAbout The Hackett Group®The Hackett Group, Inc. (NASDAQ: HCKT) is a Gen AI strategic consulting and digital transformation firm that enables Digital World Class® performance. Using Hackett AI XPLR™, ZBrain™, XT™, AIXelerator™, AskHackett™ and Quantum Leap® platforms, the company’s experienced professionals and engineers help organizations realize the power of Gen AI from ideation through implementation to achieve quantifiable, breakthrough results with unprecedented speed, allowing it to be key architects of their Gen AI journey. The company’s expertise is grounded in unparalleled best practices insights from enterprise performance benchmarks from the world’s leading businesses – including 97% of the Dow Jones Industrials, 90% of the Fortune 100, 68% of the DAX 40 and 53% of the FTSE 100. Visit us at www.thehackettgroup.com.\n\nTrademarksThe Hackett Group®, quadrant logo, Digital World Class® and Quantum Leap® are the registered marks of The Hackett Group®.\n\nCautionary Statement Regarding \"Forward-Looking\" Statements\n\nThis release contains \"forward-looking\" statements within the meaning of Section 27A of the Securities Act of 1933 as amended and Section 21E of the Securities Exchange Act of 1934, as amended. Statements including without limitation, words such as \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" seeks,\" \"estimates,\" or other similar phrases or variations of such words or similar expressions indicating, present or future anticipated or expected occurrences or outcomes are intended to identify such forward-looking statements. Forward-looking statements are not statements of historical fact and involve known and unknown risks, uncertainties and other factors that may cause the Company’s actual results, performance or achievements to be materially different from the results, performance or achievements expressed or implied by the forward-looking statements. Factors that could impact such forward-looking statements include, among others, changes in worldwide and U.S. economic conditions that impact business confidence and the demand for our products and services, our ability to transition our capabilities to support generative artificial intelligence (AI)-related consulting services and solutions, our ability to effectively integrate acquisitions, including the Leeway acquisition, into our operations, our ability to manage joint ventures and successfully cooperate with our joint venture partners, our ability to retain existing business, our ability to attract additional business, our ability to effectively market and sell our product offerings and other services, the timing of projects and the potential for contract cancellation by our customers, changes in expectations regarding the business consulting and information technology industries, our ability to attract and retain skilled employees, possible changes in collections of accounts receivable due to the bankruptcy or financial difficulties of our customers, risks of competition, price and margin trends, foreign currency fluctuations, the impact of the geopolitical conflict involving Russia and Ukraine and in the Middle East on our business and changes in general economic conditions, interest rates and our ability to obtain additional debt financing if needed as well as other risk detailed in The Hackett Group’s reports filed with the United States Securities and Exchange Commission. The Hackett Group does not undertake any duty to update this release or any forward-looking statements contained herein.\n\nCONSOLIDATED STATEMENTS OF OPERATIONS\n\n(in thousands, except per share data)\n\nPersonnel costs before reimbursable expenses (includes $3,107 and $14,600 and $5,324 and $10,491 of non-cash stock based compensation expense in the three and twelve months ended December 26, 2025 and December 27, 2024, respectively)\n\nSelling, general and administrative costs (includes $2,240 and $16,028 and $4,928 and $9,033 of non-cash stock based compensation expense in the three and twelve months ended December 26, 2025 and December 27, 2024, respectively)\n\nLegal settlement and related costs\n\nTotal costs and operating expenses\n\nBasic net income per common share:\n\nWeighted average common shares outstanding\n\nDiluted net income per common share:\n\nWeighted average common and common equivalent shares outstanding\n\nCONDENSED CONSOLIDATED BALANCE SHEETS\n\nAccounts receivable and contract assets, net\n\nPrepaid expenses and other current assets\n\nProperty, software and equipment, net\n\nOperating lease right-of-use assets\n\nLIABILITIES AND SHAREHOLDERS' EQUITY\n\nAccrued expenses and other liabilities\n\nLong-term deferred tax liability, net\n\nTotal liabilities and shareholders' equity\n\nSelling, general and administrative costs\n\nSelling, general and administrative costs\n\nSelling, general and administrative costs\n\nItems not allocated to segment level (4):\n\nCorporate general and administrative expenses\n\nNon-cash stock based compensation expense\n\nStock price award program compensation expense\n\nAcquisition-related cash compensation expense\n\nAcquisition-related non-cash stock based compensation expense\n\nLegal settlement and related costs\n\n(1) Global S&BT includes the results of our North America and International Gen AI Consulting, Implementation and Licensing, Benchmarking and Business Transformation offerings, Executive Advisory, Market Intelligence and IP as-a-Service, OneStream and eProcurement.\n\n(2) Oracle Solutions includes the results of our EPM/ERP and AI Enablement practices.\n\n(3) SAP Solutions includes the results of our SAP applications and related SAP service offerings.\n\n(4) Segment contributions consist of the revenue generated by the segment, less the direct costs of revenue and selling, general and administrative expenses that are incurred directly by the segment. Items not allocated to the segment level include corporate costs related to administrative functions that are performed in a centralized manner that are not attributable to a particular segment. Items not allocated to the segment level include corporate general and administrative expenses, non-cash stock based compensation expense, acquisition related cash and non-cash stock based compensation expense, depreciation and amortization expense, legal settlement and related costs, interest expense and foreign currency gains and losses. Corporate general and administrative expenses primarily include costs related to business support functions including accounting and finance, human resources, legal, information technology and office administration. Corporate general and administrative expenses exclude one-time, non-recurring expenses and benefits.\n\nRECONCILIATION OF GAAP TO NON-GAAP MEASURES\n\n(in thousands, except per share data)\n\nNon-cash stock based compensation expense (2)\n\nStock price award program compensation expense (2)(3)\n\nAcquisition-related cash compensation expense (4)\n\nAcquisition-related non-cash stock based compensation expense (4)\n\nLegal settlement and related costs\n\nADJUSTED NET INCOME BEFORE INCOME TAXES ON ADJUSTMENTS (1)\n\nTax effect of adjustments above (5)\n\nGAAP diluted net income per common share\n\nAdjusted diluted net income per common share (1)\n\nWeighted average common and common equivalent shares outstanding\n\n(1) The Company provides adjusted earnings results (which excludes non-cash stock based compensation expense, stock price award program compensation expense, acquisition-related cash and non-cash stock based compensation expense, amortization expense, acquisition related costs and legal settlement and related costs and includes a GAAP tax rate) as a complement to results provided in accordance with Generally Accepted Accounting Principles (GAAP). These non-GAAP results are provided to enhance the users' overall understanding of the Company's current financial performance and its prospects for the future. The Company believes the non-GAAP results provide useful information to both management and investors and by excluding certain expenses that it believes are not indicative of its core operating results. The non-GAAP measures are included to provide investors and management with an alternative method for assessing operating results in a manner that is focused on the performance of its ongoing primary operations and to provide a consistent basis for comparison between quarters. Further, these non-GAAP results are one of the primary indicators management uses for planning and forecasting. The presentation of this additional non-GAAP information should be considered in addition to, and not as a substitute for or superior to, any results prepared in accordance with GAAP.\n\n(2) Non-cash stock based compensation expense is accounted for under Financial Accounting Standards Board Accounting Standards Codification Topic 718, Compensation-Stock Compensation. The Company excludes non-cash stock based compensation expense and the related tax effects for the purposes of adjusted net income and adjusted diluted earnings per share. The Company believes that non-GAAP measures of profitability, which exclude non-cash stock based compensation expense, are widely used by investors.\n\n(3) The stock price award program compensation expense relates to equity awards that were granted with certain market share price hurdles and service conditions to meet before they are vested. The market price hurdles include twenty consecutive trading days of equal to or greater than $30, $40 and $50 per share price. As of December 26, 2025, the first market condition had been met, and although the shares have not vested they are included in the Company's dilutive shares outstanding for the quarter ended December 26, 2025. As of December 26, 2025, the second and third market conditions had not been met and as such the shares have not vested and are not included in the Company's basic or dilutive shares outstanding. Non-cash compensation of $1.8 million and $16.8 million was recorded in the fourth quarter and twelve months of 2025, respectively.\n\n(4) The Company incurs cash and non-cash stock based compensation expense for acquisition related consideration that is recognized over time under GAAP. The Company believes excluding these amounts more consistently presents its ongoing results of operations because they are related to acquisitions and not due to normal operating activities. The acquisition-related non-cash stock based compensation expense is also accounted for under Financial Accounting Standards Board Accounting Standards Codification Topic 718, Compensation-Stock Compensation.\n\n(5) The adjustment for the income tax expense is based on the accounting treatment and income tax rate for the jurisdiction of each item. The impact of all of the non-cash stock based compensation expense was $0.4 million and $0.7 million the fourth quarters of 2025 and 2024, respectively, and $3.8 million and $2.4 million for the twelve months of 2025 and 2024, respectively. The impact of acquisition related cash compensation expense was $26 thousand and $45 thousand in the fourth quarter and twelve months in 2025, respectively. The impact of the acquisition related costs including amortization was $81 thousand and $0.4 million in the fourth quarter and twelve month period of 2025, respectively. The impact of the legal settlement and related costs was $27 thousand in the twelve months in 2024. The impact of the restructuring cost was $0.8 million in the twelve months in 2025.\n\nSegment Total Revenue and Revenue Before Reimbursements (in thousands):\n\nKey Metrics and Other Financial Data:\n\nCash provided by operating activities (in thousands)\n\nCapital expenditures (in thousands)\n\nShares purchased (in thousands) (1)\n\nCost of shares repurchased (in thousands) (1)\n\nAverage price per share of shares purchased (1)\n\nRemaining Plan authorization (in thousands) (2)\n\nShares Purchased to Satisfy Employee Net Vesting Obligations:\n\nShares purchased (in thousands)\n\nCost of shares purchased (in thousands)\n\nAverage price per share of shares purchased\n\n(1) Includes the shares repurchased through the Tender Offer transaction in December 2025 from which the Company acquired 2.0 million shares at $20.29 per share, or $41.2 million, inclusive of transaction related fees.\n\n(2) The Company's Board of Directors approved an additional $40.0 million to its share repurchase plan in the fourth quarter of 2025.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20260217371666/en/\n\nRobert A. Ramirez, CFO, 305-375-8005 or rramirez@thehackettgroup.com"
    },
    {
        "title": "Waystar (WAY) Q4 2025 Earnings Call Transcript",
        "url": "https://finance.yahoo.com/news/waystar-way-q4-2025-earnings-152047935.html",
        "source": "Yahoo Finance",
        "date": "2026-02-17T15:38:00+00:00",
        "content": "Tuesday, Feb. 17, 2026 at 8:30 a.m. ET\n\nChief Executive Officer — Matthew J. Hawkins\n\nChief Financial Officer — Steven M. Oreskovich\n\nNeed a quote from a Motley Fool analyst? Email pr@fool.com\n\nMatthew J. Hawkins, Waystar Holding Corp.'s Chief Executive Officer, and Steven M. Oreskovich, Waystar Holding Corp.'s Chief Financial Officer. This morning, we issued a press release announcing our financial results and published an accompanying presentation deck. You can find these materials at investors.waystar.com. Before we begin, I would like to remind you that this call contains forward-looking statements, which are predictions or beliefs about future events or performance, growth, and margins. Examples of these statements include expectations of future financial results. These statements involve a number of risks and uncertainties that may cause results to differ materially from those expressed in these statements.\n\nFor a full discussion of the risks and other factors that may impact these forward-looking statements, please refer to this afternoon's press release and the reports we file with the SEC, all of which are available on the Investor Relations page of our website. Any forward-looking statements made on this call are only as of today and will not be updated unless required by law. We will also discuss certain non-GAAP financial measures. These measures are intended to provide additional insight into our performance and should not be considered in isolation or as a substitute for financial information prepared in accordance with GAAP.\n\nWe have provided reconciliations of the non-GAAP financial measures included in our remarks to the most directly comparable GAAP measures, together with explanations of these measures, in the appendix of the presentation slide deck and our earnings release. With that, I would like to turn the call over to Matthew. Thank you, Edward, and good morning, everyone. Thank you for joining our Q4 2025 earnings call. Today, we are pleased to share Waystar Holding Corp.'s strong Q4 and full year 2025 results, reflecting the durability of our business model, the execution of our team, and the trust providers place in our platform. 2025 was a defining year for Waystar Holding Corp.\n\nWe crossed $1 billion in revenue, exceeded both our revenue and EBITDA guidance, and achieved\n\nMatthew J. Hawkins: strategic milestones that strengthened our competitive position. We completed the acquisition of Iodine Software, adding more than 1,000 hospitals and health systems, deep clinical intelligence, and significantly expanding our addressable market. This combination positions Waystar Holding Corp. as the only platform with both clinical encounter visibility and financial outcome intelligence at scale. We also extended our AI leadership. In 2025, Waystar Altitude AI prevented more than $15,000,000,000 in denials for our clients, reduced appeal time by 90%, and drove double-digit increases in denial overturn rates. We launched new agentic capabilities that cut documentation analysis by 40%, powered by data from one in three U.S. hospital discharges and more than 7,000,000,000 annual transactions.\n\nThese results demonstrate accelerating demand for mission-critical AI revenue cycle software and validate Waystar Holding Corp.'s ability to deliver meaningful ROI for providers. I am proud of what our team accomplished in 2025. We entered 2026 with strong momentum, a clear leadership position, and a platform we built to sustain durable, profitable growth while delivering exceptional value to our clients. Let me walk through our fourth quarter performance. Q4 revenue reached $304,000,000, growing 24% year over year and 12% organically. Both subscription and volume-based revenue contributed to this strength. These results underscore the mission-critical nature of our platform, elevated patient utilization, and the successful onboarding of new clients.\n\nWaystar Holding Corp. added 85 clients with trailing twelve months spend above $100,000, up from 30 a year ago and more than double last quarter. Win rates improved beyond our historical average of more than 80%, reflecting sustained competitive momentum and clear provider preference for Waystar Holding Corp.'s cyber-secure unified platform. We delivered a 112% net revenue retention with 97% gross revenue retention and a net promoter score above 70. Cross-sell and upsell momentum in our large installed base drove this performance and reinforces how deeply Waystar Holding Corp. is embedded in our clients' daily operations, serving as the central infrastructure for getting paid.\n\nWaystar Holding Corp. delivered a record bookings quarter in Q4, and we closed several sizable deals to cap off a strong 2025. We enter 2026 with a robust sales pipeline and the largest implementation backlog in our history. This demand signals strong customer confidence in our platform and reinforces our conviction in the durability of our low double-digit long growth outlook. Adjusted EBITDA reached $129,000,000, up 29% year over year, with an adjusted EBITDA margin of 42.5%, exceeding our long-term target of 40%. Waystar Holding Corp. continues to operate as a rule of 50 business, pairing strong revenue growth with increasingly efficient operations. Our core business delivers durable organic growth.\n\nIodine extends that strength through disciplined platform expansion, moving Waystar Holding Corp. into the mid-cycle, a critical stage where payers deny roughly 60,000,000 claims each year. Together, we deliver full revenue cycle visibility through our unified financial and clinical platform. Iodine adds more than 1,000 hospitals and health systems with only 35% customer overlap, expanding our addressable market and cross-sell opportunity. Integration is ahead of plan, and we now expect to realize over 90% of committed cost synergies in fiscal 2026. We fully integrated our commercial teams and they are already producing results. In Q4, we generated cross-sell traction in both directions and built a robust new business pipeline. Market demand for the Waystar Holding Corp. platform is strong.\n\nUnified financial and clinical data unlocks unique value and accelerates our innovation roadmap. Our next-generation prebill anomaly detection solution demonstrates this opportunity. We expect a midsized health system to recover $7,000,000 annually in previously missed reimbursement, a 5x return over three years. This is the first of many innovations only our integrated platform can deliver, advancing us toward a fully autonomous revenue cycle, including using clinical data to prove medical necessity for prior authorization and overturn denials requiring clinical documentation, all without human intervention. Now let me take a broader view on AI because it is core to who we are and where we are headed.\n\nWhile many new AI entrants add lightweight tools that sit on top of fragmented revenue cycle workflows, Waystar Holding Corp. takes a fundamentally different approach. Our end-to-end platform gives us full visibility across the revenue cycle, including authorizations, claims, denials, and payments, and deep into the layers where complexity resides: payer policy, adjudication logic, diagnosis-related grouping, and denial reasoning. This breadth and depth makes Waystar Holding Corp. the system of action, identifying issues upstream, resolving them inside the workflow, and closing the loop on payment with minimal human intervention.\n\nFor more than a decade, Waystar Holding Corp. has deployed AI, including machine learning and advanced decisioning engines across revenue cycle workflows at scale, grounded in proprietary data and embedded processes few in the industry can match. We are extending those capabilities with LLMs, generative and agentic AI, while maintaining control of the data, decisioning logic, and outcomes that matter most to providers. Today, approximately 50 of our solutions leverage AI, and nearly 40% of our revenue is driven by AI embedded in mission-critical reimbursement workflows. In 2025, roughly 30% of new bookings came from AI-powered capabilities. This signal is clear. Clients trust Waystar Holding Corp. to deliver AI that goes beyond assistance to enable agentic, outcome-driven revenue cycle automation.\n\nWe believe Waystar Holding Corp. is well positioned to lead the next era of health care revenue cycle automation. The foundations of software moats are shifting in the age of AI, from workflow stickiness and switching costs to a new set of structural advantages. Our strength comes from four interconnected pillars: mission-critical infrastructure, unmatched proprietary data, an extensively deployed network and scale distribution paired with deep domain expertise. First, our platform is the mission-critical infrastructure providers need to get paid. Waystar Holding Corp. is embedded directly in the flow of dollars, decisions, and denials, and our 97% gross revenue retention proves it. Once clients implement Waystar Holding Corp., they stay.\n\nWe reduce administrative burden, prevent billions in avoidable denials, accelerate cash flow, and ensure reimbursement accuracy at scale. Our commercial model is aligned with consumption, which is a function of providers seeing patients. As agentic AI streamlines workflows and reduces manual work, the durability of our model strengthens. Pricing is tied to claims, payments, or prescribing providers, directly matching how value is created in the revenue cycle.\n\nOperator: Our multiyear partnership with Google Cloud\n\nMatthew J. Hawkins: Gemini LLM accelerates innovation and we retain control of the data, decisioning, and outcomes providers care most about. As RCM moves toward agentic AI and autonomous workflows, our role deepens. Our agents act on behalf of providers, resolving issues, correcting errors, and closing the loop on payment. Second, Waystar Holding Corp. has an unmatched proprietary data advantage. AI strength ultimately comes down to data: its scale, richness, structure, and proximity to action. We operate one of the largest health care payment datasets in the United States, processing more than 7,000,000,000 transactions annually. With Iodine, we pair that financial depth with unmatched clinical data, and our models now learn from approximately one third of U.S. hospital discharges each year.\n\nWe deploy AI across the full revenue cycle continuum, from authorization and eligibility to denials and appeals. Our data advantage is self-reinforcing. Every claim, denial, and payment improves our models. When a provider uses Waystar Holding Corp., they benefit from the learnings of tens of thousands of organizations like theirs: similar size, similar payer mix, similar challenges. And because our data spans the full care continuum—hospitals, physician practices, outpatient surgery centers—our models see patterns no single organization or new entrant can match. General purpose model vendors lack this real-time closed-loop proprietary data. Third, Waystar Holding Corp.'s platform is a deeply deployed multisided network, creating scale and connectivity that others cannot replicate.\n\nWe sit at the center of the payer-provider-patient ecosystem, connecting over 1,000,000 providers to every major payer, powered by more than 100,000 live integrations across EHRs, practice management systems, clearinghouses, and clinical platforms. We touch approximately 60% of the U.S. patient population each year and process billions of dollars in patient payments across our network annually. We built this network over more than a decade. It represents scale, trust, and connectivity that cannot be bought or quickly engineered. Every transaction flowing through Waystar Holding Corp. increases network intelligence, sharpens model accuracy, and expands our distribution advantage—the result: a platform that strengthens continuously with every client we serve and every workflow we power.\n\nFourth, Waystar Holding Corp. combines scale distribution with deep domain expertise. We serve providers across all care settings with low concentration; our top 10 clients represent approximately 11% of revenue, driving resilience, reach, and durable bookings growth. Our go-to-market organization consistently delivers strong win rates, rapid time to value, and compelling client ROI. Forward-deployed teams—product management, revenue integrity, clinical documentation, and client success experts—work directly alongside real workflows. Dozens of clients co-develop and pilot new AI capabilities with us, validating outcomes before broad release. We have already seen our AI-enabled engineering tools reduce manual work, in some cases by more than 75%, and we expect further improvement as we scale these capabilities in 2026.\n\nThese pillars enable our AI to deliver outcomes at scale. In less than a year, Waystar Altitude AI has prevented $15,000,000,000 in denials and accelerated appeal package generation by 90%, turning work that once took days into minutes. Our network consistently achieves approximately 99% clean claim and first pass acceptance rates, driving faster, more accurate reimbursement. These outcomes expand our footprint, build trust, and help providers improve margins while freeing staff for higher-value work. Last month, we shared our vision for Waystar Holding Corp.'s autonomous revenue cycle—a dynamic, end-to-end agentic network that acts continuously within workflows, learns from outcomes, and delivers meaningful financial results with minimal intervention. Providers do not want point solutions.\n\nThey need trusted cybersecurity platforms that unify financial, clinical, and operational outcomes. Our product roadmap is robust, and we expect to launch several new AI agents this year on Waystar Holding Corp.'s platform. We have the data, the deployment, the distribution, and the discipline to lead this next era of health care revenue cycle automation. We are moving with the urgency and the mindset of a disruptor because this moment demands nothing less. With that, I will turn the call over to Steve.\n\nSteven M. Oreskovich: Thanks, Matthew.\n\nMatthew J. Hawkins: Note that my comments regarding fourth quarter and full year 2025 results\n\nSteven M. Oreskovich: include a full quarter of contribution from Iodine. Revenue increased 24% year over year in the fourth quarter to $304,000,000. Organic revenue grew 12%,\n\nMatthew J. Hawkins: and Iodine contributed $31,000,000 in the quarter, slightly ahead of our previously communicated expectation.\n\nSteven M. Oreskovich: The growth reflects strong client retention and expansion, healthy patient utilization of the health care system,\n\nMatthew J. Hawkins: and new client implementations. The quarterly results highlight our durable, predictable model of low double-digit revenue growth annually on a normalized basis, and the highly recurring volume aspect of health care provides us predictability,\n\nSteven M. Oreskovich: creating a notable differentiation compared to most consumption models. For the full year,\n\nMatthew J. Hawkins: revenue increased 17% year over year to $1,100,000,000. On an organic basis, revenue increased 13%, consistent with our long-term target of low double-digit growth. Clients generating more than $100,000 of LTM revenue increased by 85 in the fourth quarter, to 1,391 at quarter end, an increase of 16% year over year.\n\nSteven M. Oreskovich: Roughly one half of the increase in the fourth quarter from the inclusion of Iodine clients. On an organic basis, the year-over-year growth rate is consistent\n\nMatthew J. Hawkins: with the quarterly average over the past three years. Our net revenue retention rate, or NRR, was 112% for the last twelve months, compared to 13% organic growth rate over the same period.\n\nSteven M. Oreskovich: As we have discussed over the past several quarters,\n\nMatthew J. Hawkins: NRR benefited from the rapid time to revenue from clients impacted by a competitor's cyber event in early 2024. Subscription revenue of $168,000,000 for the fourth quarter increased 38% year over year and 25% sequentially. On an organic basis, subscription revenue grew sequentially at a similar pace as the past few quarters.\n\nSteven M. Oreskovich: From a mix perspective,\n\nMatthew J. Hawkins: subscription revenue was 55% of total revenue, which aligns with previously communicated expectations. For the full year, subscription revenue of $558,000,000 increased 22% year over year.\n\nSteven M. Oreskovich: Volume-based revenue of $134,000,000 for the fourth quarter increased 11% year over year and 1% sequentially. Consistent with our seasonality expectations, revenue from patient payment solutions was lower than the prior quarter,\n\nMatthew J. Hawkins: this was more than offset by sequential growth from provider solution volumes. For the full year, volume-based revenue of $535,000,000 increased 11% year over year with steady double-digit growth from both provider solution transactions and patient payment dollars.\n\nSteven M. Oreskovich: Adjusted EBITDA was $129,000,000 for the fourth quarter at a 43% margin and increased 29% year over year. On a full-year basis,\n\nMatthew J. Hawkins: adjusted EBITDA was $462,000,000 at a 42% margin and increased 21% year over year. Our adjusted EBITDA margin of 43% for the fourth quarter benefits from approximately $2,000,000 of realized acquisition cost synergies, reflecting 1% of margin improvement for the quarter.\n\nSteven M. Oreskovich: Turning to the balance sheet and cash flow. We ended the quarter with $86,000,000 in cash, equivalents, and short-term investments, and $1,500,000,000 in gross debt. Unlevered free cash flow is $80,000,000 in the fourth quarter and $365,000,000 for the full year. We converted 79% of adjusted EBITDA to unlevered free cash flow, enabling us to continue sustained deleveraging.\n\nMatthew J. Hawkins: As of December 31, net leverage was three times, which is down almost a half turn since the beginning of the quarter when we closed the Iodine acquisition. We expect to run the business at or below a three times leverage ratio and delever in line with our historical rate of approximately one turn annually.\n\nSteven M. Oreskovich: We continue to maintain flexibility within our overall capital structure, and our allocation priorities remain unchanged.\n\nMatthew J. Hawkins: Invest in the business to drive top-line growth, evaluate disciplined acquisition opportunities, and explore ways to enhance shareholder value. Looking ahead to 2026 full-year guidance, we expect revenue of $1,274,000,000 to $1,294,000,000, with a midpoint of $1,284,000,000, representing 17% year-over-year growth.\n\nSteven M. Oreskovich: Our full-year guidance at the midpoint assumes normalized organic growth of approximately 10%, with a similar implied growth rate for Iodine.\n\nMatthew J. Hawkins: We also expect revenue to grow 1% to 3% sequentially throughout the year, with the third quarter at the low end due to seasonality of patient payments. Further,\n\nSteven M. Oreskovich: we assume utilization of the health care system by patients remains healthy throughout 2026, as the diversity of our client base,\n\nMatthew J. Hawkins: and ROI from our solutions insulate us from the reimbursement rate pressures that may impact our clients. Lastly,\n\nSteven M. Oreskovich: as Matthew mentioned,\n\nMatthew J. Hawkins: the record level of bookings and several sizable deals we generated this quarter contribute to our forward visibility. As a reminder, these larger agreements typically take six to eighteen months to fully ramp.\n\nSteven M. Oreskovich: And we would expect many to land towards the longer end of that range.\n\nMatthew J. Hawkins: Supporting our confidence in a normalized low double-digit revenue growth profile\n\nSteven M. Oreskovich: for 2026 and beyond. Please note that we have included a bridge from the 17% growth rate at the midpoint of guidance\n\nMatthew J. Hawkins: to the 10% normalized organic growth rate in the IR deck on our website. We expect adjusted EBITDA of $530,000,000 to $540,000,000, with a midpoint of $535,000,000, representing 16% year-over-year growth and a margin of approximately 42% for 2026.\n\nSteven M. Oreskovich: This includes gross margins of approximately 68%.\n\nMatthew J. Hawkins: Which is consistent with 2025. The 42% margin also includes an uplift of approximately 1% from realizing acquisition cost savings. Said differently, we expect to realize approximately $14,000,000 of savings in 2026, which is over 90% of the committed $15,000,000 we previously communicated and well ahead of the prior timeline. This reflects our commitment to quickly and successfully integrate Iodine. We are focused on reinvesting in the business in key areas we expect to drive long-term top-line growth and remain confident in our ability to do so while being mindful of our long-term adjusted EBITDA margin target of 40%. This concludes our opening remarks. With that, we are ready for your questions. Operator, please open up the call.\n\nOperator: Certainly. As a reminder, to ask a question, please press 11 on your telephone and wait for your name to be announced. To withdraw your question, please press 11 again. In the interest of time, please limit yourself to one question. Our first question will be from Brian Christopher Peterson of Raymond James. Your line is open.\n\nMatthew J. Hawkins: Congrats on the quarter. Matt, maybe I want to start off on AI, and I appreciate all the color you gave, the advantages you have in an AI world. But I wanted to understand, when you talk to your customers and say, looking at RCM specifically, what is their appetite to use LLMs and build on their own versus buy from somebody like Waystar Holding Corp.? I just wanted to understand how those conversations are going and how you can unlock some of that AI opportunity over the long term. Thanks, guys.\n\nOperator: Okay. And one moment for our next question. Our next question will be coming from Elizabeth Hammell Anderson of Evercore ISI. Your line is open. Hey. I will just let you respond to Brian's question, and then I can go. Please stand by.\n\nMatthew J. Hawkins: Because we are muted. I do not understand. You are not muted.\n\nMatthew J. Hawkins: Okay. Can you hear us okay?\n\nOperator: Yes. We can hear you.\n\nMatthew J. Hawkins: Excellent. Let me go back to Brian's question about AI. I appreciate his comments regarding our quarter and also our position and our strength and the opportunity that we see in front of us to win in the delivery of AI. I would note that the vast majority of clients we talk to would rather integrate AI capability into their systems of record or action that run the backbone of their business.\n\nAnd while there is some experimentation willingness and some exploration around how we can deploy AI or do some type of science experiment within our organization, what we see is the vast majority of providers want to work with a trusted partner where they have a history of deploying AI in a cybersecurity environment that is integrated and interoperable with other systems that they are utilizing. And quite frankly, most provider organizations do not have the abundance of engineering talent that they need to test and deploy AI, and it really is not true to their core competency of taking care of patients.\n\nSo we feel like Waystar Holding Corp. is very well positioned to deliver AI as we have done so far and to continue that track record. Thank you, Brian, for the question, and sorry for the sound confusion.\n\nElizabeth Hammell Anderson: Hey, guys. It is Elizabeth from Evercore now. Thanks for the question. You have mentioned several new AI agents launching this year. How do you think about that launching? Are those individually incremental revenue opportunities for Waystar Holding Corp. or combined with Iodine too? Or is that something that you see as helping to increase the moat of your current AI offering, or maybe some of both? Thank you.\n\nMatthew J. Hawkins: I believe it is a bit of both, Elizabeth. We are very excited about the product roadmap that we have in place, what we have ahead of us as far as delivering agentic capability to our clients and on our platform. Some of that will be brand new. It will be a new SKU with new price to value, reflective of the value that agent is delivering to our clients. Other AI capability will add on to existing software modules that will bring incremental automation, and we are excited about that as well. As we think about monetization in general, the way to think about monetization of AI is this.\n\nMatthew J. Hawkins: if we deliver AI, it tends to drive retention and an elongation of a relationship with the client. So that tends to show up in strong retention results like the ones that we produce. We also can impose an annual price increase that is reflective of the value that we deliver. And in this case, we are watching closely and seeing that when AI delivers incremental automation, we are able to reduce\n\nElizabeth Hammell Anderson: headcount.\n\nMatthew J. Hawkins: associated with a manual task that is now automated given the agent capability that we launched. We have the opportunity to price to value in that setting. And then the third, as I mentioned a moment ago, is the introduction of a new SKU, a new pricing, putting it in the hands of our go-to-market teams and selling it that way. So we look forward to further monetizing AI, but a lot of that is already showing up and monetizing through our core business model.\n\nElizabeth Hammell Anderson: Great. Thank you very much.\n\nOperator: And our next question will be coming from Kevin Caliendo of UBS. Your line is open, Kevin.\n\nMatthew J. Hawkins: Hi. Thanks for taking my question. Just looking at the fourth quarter, you had G&A, R&D, D&A all stepped up. I am assuming that is largely Iodine coming into the numbers. And I appreciate you gave us the $14,000,000 in expected synergies to get to the margin guidance for the full year. Should we look at the Q4 margin as the run rate for those individual cost centers and take out the synergies? I am just trying to think about modeling the margins and where you might have additional leverage above and beyond that $14,000,000 in synergy, thinking through the fourth quarter?\n\nSteven M. Oreskovich: Yes, Kevin. Thanks for the question. This is Steve. I think to answer your first part of that question, you are correct. The step up there does include the additional cost of one full quarter of Iodine. As you think about the guide for 2026, a couple of things to think about, and as mentioned in the prepared comments, we would expect similar gross margin in the high 60s for 2026 as we saw in 2025. In addition, to your point, there are opportunities that we are continually focused on to improve the overall margin profile. We have set guidance at the midpoint of about 42%\n\nMatthew J. Hawkins: EBITDA. Sorry.\n\nSteven M. Oreskovich: of 42% for 2026, which includes about 1% benefit from those cost synergies. And again, we are continuing to look and will find additional opportunities for cost savings. So that does exist. But right now, the focus, from a capital allocation approach, and I mentioned it in the prepared comments, is to continue to reinvest in the business for long-term revenue and growth expansion. We have set the target, and we have probably beat it for the drum for quite a while now, low double-digit revenue growth, long-term target. But obviously, the opportunities we see in front of us—how do we reinvest now to expand that ultimately in the years going forward.\n\nOperator: And our next question will be coming from Ryan McDonald of Needham & Company. Your line is open, Ryan.\n\nKevin Caliendo: Hi, thanks for taking my question. Congrats on a great quarter. I would be curious, Matt, as you are having customer conversations, you talked about, obviously, there are a lot of new vendors in this space that are trying to overlay generative AI functionality on top of their existing systems versus your approach, which obviously is deeply integrated and built in an end-to-end platform. As you look at how budgets are being developed and being allocated, are you seeing more demand or conversations heading towards one-off, more point solution functionality or SKUs from a generative AI perspective?\n\nOr is this creating a broader refresh cycle where we might look at a full end-to-end modernization within RCM, and how do we think those conversations develop over the next twelve to eighteen months? Thanks so\n\nMatthew J. Hawkins: Yes. Thank you, Ryan. We are not necessarily seeing a clear delineation between a normal technology budget and an AI-specific budget. We are seeing willingness from clients to embrace AI. And again, speaking to the prepared remarks, they want to consume AI, but they want to do it in a very thoughtful way. I point to our recent Q4 results: the best quarter in our history, a really nice mix of new clients, cross-sell opportunities, AI embedded in those conversations, and we have, as we start 2026, a very robust pipeline of opportunities. And what we are seeing is not necessarily just a point solution willingness.\n\nWe are seeing clients wanting to embrace, to your proper question, Ryan, more and more of the platform approach where there is an assumption that AI will be included in part of that platform. If you looked at our last two quarters of bookings in 2025, the number of $1,000,000-plus bookings in the last two quarters of 2025 were more than two times the quarterly average of the past three years. And so what this signals to us is that our platform approach is working. It is displacing, oftentimes, point solutions and multiple vendors, and there is willingness by clients to embrace and explore AI in that context.\n\nWe do not necessarily see that being purely partitioned as a separate budget.\n\nOperator: And our next question will be coming from George Robert Hill of Deutsche Bank. Your line is open, George.\n\nKevin Caliendo: Yes. Good morning, guys, and thanks for taking the question. I guess, Steve, I would ask you to break apart Iodine a little bit. The business did $31,000,000 in the fourth quarter. The back-of-the-napkin math looks like you are guiding to $125,000,000 to $130,000,000 for full year '26. So I guess it implies a little bit of flattening there. I know that you guys are historically conservative as it relates to guidance. I would like you to talk about that a little bit. And then maybe, Matt, the question that goes with that is, what do you feel like you are seeing for AI market growth in the health care space?\n\nI know that health care has historically been slow to adopt new technology solutions. It would seem like the macro AI market may be growing faster than the AI market in health care, which is probably to talk about those dynamics. Thank you.\n\nSteven M. Oreskovich: Yes. George, I will go first. We did, in the prepared comments, mention we expect an Iodine year-over-year growth rate to be similar to the 10% normalized organic growth rate that we set aside, or I commented on, for Waystar Holding Corp. for 2026. So I think our expectation would be a little higher than what you had mentioned, but somewhat in the ballpark there. And I think we see really good opportunities as it pertains to the totality of the solution set from the bookings that we saw in the fourth quarter that Matthew had mentioned, and especially as we think through the $1,000,000-plus bookings, the metric that Matthew had provided.\n\nMaybe I will just give a little bit more color on that before turning it to Matthew to answer the second part of the question because I figured you guys are going to ask at some point. Maybe to put a range for you on the account for the Q4 and Q3 $1,000,000-plus bookings number, that was in the 15 to 20 count range for each of the individual quarters. And as Matthew had indicated earlier, that is two times the amount we had typically seen on a quarterly basis for the past three years. So a healthy mix of both Iodine legacy Iodine solutions\n\nMatthew J. Hawkins: in that fourth quarter number as well. Matt?\n\nSteven M. Oreskovich: Yes. Great.\n\nMatthew J. Hawkins: George, and let me speak to the general question about AI. We feel like it is the biggest opportunity in our lifetime, and we are seizing it and making the most of it. What I would say is LLMs are great tools, and they are needed. And specific to health care, it is time for the industry to embrace technology, perhaps instead of services and manual work that has taken place for far too long. We see curiosity and interest there. This underscores, when you think about the LLMs in general, how important it is for us to have this now multiyear relationship with Google.\n\nI think we talked about our relationship with Google's LLM even a couple years ago in 2024 on one of our earnings calls. And we are delivering AI, and I think there is some real interest. A few thoughts come to mind. While some software may be displaced by AI, other software platforms like Waystar Holding Corp. are actually being strengthened, and AI is accelerating our ability to deliver capability. It is delivering strong results for our clients, and that is very important. I think trust, reliability, and scalability matter more than ever, especially in regulated environments like health care. Production-grade software has to be secure, scalable, and accurate.\n\nMatthew J. Hawkins: so we are really grateful for the relationship that we have with Google. As I think about the things that are required, a few things to keep in mind with respect to the mission-critical problems within the revenue cycle. I will not opine broadly on health care. But just within the mission-critical problems in revenue cycle management, there are a number of things that are required. First, it is required to have\n\nKevin Caliendo: rich and real-time proprietary data. Not\n\nSteven M. Oreskovich: publicly available data.\n\nMatthew J. Hawkins: you need a payment source of truth. And we have that at Waystar Holding Corp. What else is required? Well, cybersecurity is required when you are thinking about deploying AI. Regulatory compliance is required. Deep subject matter expertise is required. Deep integration and connectivity, strong distribution, and client trust are required. And so when you think about this opportunity that we are seeing in health care, LLMs by themselves cannot deliver those things. But companies can. Companies like Waystar Holding Corp. can, so we are excited about the AI opportunity before us.\n\nOperator: And our next—excuse me. Our next question will come from Steven James Valiquette of Mizuho Securities. Your line is open, Steven.\n\nKevin Caliendo: Yes. Good morning. Thanks for taking the question. I was curious if you could provide a little more color on your assumption around the utilization of health care by patients to remain, you said, I think, healthy throughout 2026. How should we think about that in the context of your historical baseline assumption of that 1% to 2% that you have talked about previously? Thanks.\n\nSteven M. Oreskovich: Yes, Steven. This is Steve. We have been on the higher side of that 1% to 2% historically. That aligns with what we have seen coming through the fourth quarter and the prepared comments as well that I made surrounding that. And we would expect continued nice healthy growth in both that volume-based aspect as it pertains to both patient payments revenue, which has historically been about 30% of our total revenue—mixing Iodine in going forward, it probably gets closer to 25%—but also then from those provider solutions, as Matthew had mentioned in the prepared comments, the transaction volumes that come from processing claims, eligibility checks, etc. So hopefully, that is helpful commentary.\n\nSteven James Valiquette: Yes. That is helpful. Thank you.\n\nOperator: And our next question will come from Alexei Gololobov of JPMorgan. Your line is open.\n\nSteven James Valiquette: Hello, everyone. Thank you for letting me ask a question. I was wondering if you can double-click on some of the comments you made last quarter about the timeline for patients meeting their deductibles, which impacted the patient volumes that we see you just talked about. What trends did you see at the end of Q4, and maybe how are you thinking about 2026?\n\nSteven M. Oreskovich: Yes. Certainly, Alexei. We did see sequential decrease from Q3 to Q4 as patients on high deductible health plans continue to hit their deductibles. That was more than nicely offset by the volumes coming through the provider solutions aspect of the business that led to less of an impact Q3 versus Q4 than we would have expected in the commentary that we had made last quarter. As we think about that aspect into 2026, I provided some commentary surrounding quarterly sequential growth expectation. As you hit on, Alexei, typically, with that 30% of revenue from patient payment solutions now getting closer to 25% going forward, we typically see a first half, second half of the year dynamic.\n\nObviously, with the change in revenue mix, we would expect that to be not as notable as prior years. And we would expect nice sequential growth throughout the quarters in 2026. I mentioned a range of sequential growth of 1% to 3%, with calling out specifically the third quarter of the year being closer to that 1% of the range, and that is typically due to the dynamic expectations of over the past number of years, we typically see those patients that are on high deductible health plans start to hit those deductibles in the second half of the year, tend to see it most notably between the second and third quarter.\n\nSo that is contextually a little bit more detail surrounding the sequential growth expectations in 2026.\n\nSteven James Valiquette: Appreciate it, Steve. And our next question would be\n\nOperator: will be coming from Allen Charles Lutz of Bank of America. Allen, your line is open.\n\nSteven James Valiquette: Good morning, and thanks for taking the questions. Matt, you mentioned 35% of bookings are now coming from AI-related products. You are speaking to these health system customers and prospects, and they are exploring AI. Does this, in your conversation, make them more hesitant to spend in the near term because they are trying to figure out where they want to put dollars to work? Or is this actually accelerating total spend? And I guess I am asking that question in the context of what you saw in the fourth quarter and how you think about 2026. Thanks.\n\nMatthew J. Hawkins: Yes. What we see is some constants. First, decision makers want efficiency. They want cost takeout. They want cybersecurity. They want to work with partners that can help them get paid faster, accurately, and efficiently. And so within that, what we are seeing is we continue to get prioritized in their decision-making process because the revenue cycle is mission critical. It is truly mission critical.\n\nMatthew J. Hawkins: you take a system of record, system of action like Waystar Holding Corp.'s, it is easier for clients to think through how do we work with Waystar Holding Corp. to deploy more AI. Obviously, very interested in using AI because it can drive efficiency, reduce cost, and drive automation—those things we talked about. And so where we tend to focus is on the ROI nature of the conversation. That is what is driving these types of record bookings and strong pipeline of opportunity. We highlight the fact that our prior authorization, for example, is 90% touchless and\n\nMatthew J. Hawkins: actually do the work that previously it took 12 employees to do in a mid-sized hospital. We highlight the fact that our Coverage-to-Care solution, which also uses AI capability, is helping to discover more than $20,000,000 of incremental insurance coverage to help aid these hospitals’ reimbursements, and that is in a typical-sized setting. We also highlight things like—I will give you one more example—for our digital patient payments and patient financial care suite, we use AI to help automate and create self-service for 80% of the patients that are interacting with our digital payment suite,\n\nMatthew J. Hawkins: that is lifting patient payments by 20% because we are driving better patient payment plan adherence. That typically is finding more than $8,000,000 of annual impact for a typical hospital. So these are the types of things that we highlight as we go and engage with clients, where they know they are going to be able to use AI in a setting, in a platform that they trust. That is why you are starting to see it show up in the bookings the way that we are.\n\nOperator: And our next question will be coming from Ryan Scott Daniels of William Blair. Your line is open, Ryan.\n\nMatthew J. Hawkins: Good morning. Thanks for taking the question. Maybe just sticking with questions about AI and the competitive landscape. A lot of the color you provided today so far has been incredibly helpful, but maybe to dig in a little further on the competitive landscape, when you are presenting your ROI, are you hearing any feedback from your customers about the competitive nature of some of the ROI that these other platforms are potentially offering, or these other solutions—maybe not necessarily platforms—that they are offering? How should we think about your ROI versus what maybe others are putting out there? Well, we will not disclose exactly what our ROI is.\n\nWhat I will say, Ryan, and thank you for the question, we have a very robust ROI calculator. We go through and go through a rich discovery process with clients, and we present to them a platform. Oftentimes, as you have heard us talk in the past, there is a compounding benefit when a client uses more and more of our solutions together on the platform. Again, those solutions are AI-infused, AI-enabled, and are driving tremendous results. I am sure that those clients are going through a process of\n\nRyan Scott Daniels: comparing what\n\nMatthew J. Hawkins: Waystar Holding Corp. offers versus what an upstart or a newcomer or a point solution may offer. But I think what stands the test of time and what we are seeing is really robust win rates. We noted improvement in the quarter above our strong 80% win rates. We noted that even higher in the last little bit. And so we feel like our ROI is very compelling,\n\nMatthew J. Hawkins: more and more clients are buying into this idea of the importance of a platform approach as they begin, and they want to consume AI on a platform.\n\nOperator: Our next question will be coming from Ryan Scott Daniels of William Blair. Your line is open, Ryan.\n\nRyan Scott Daniels: Yes. Thanks for taking the question. Matt, maybe a\n\nMatthew J. Hawkins: strategic one for you on AI and the improvements you are seeing in the platform, especially with Iodine and their solutions and data assets. You have talked about the perfect claim, and I am curious if this can provide you with a contracting advantage longer term strategically where you can go in with a fully integrated platform but maybe increase the total value add, maybe share in some of those savings.\n\nSo are there any potential thoughts on risk-based contracts or tying to other KPIs you know you can improve on an accelerated basis and maybe see not only a win rate delta from doing that versus some of your peers but also maybe greater revenue enhancement or an accelerated timeframe with novel contracting? Thanks.\n\nRyan Scott Daniels: Thanks, Ryan.\n\nMatthew J. Hawkins: Appreciate that thoughtful question as well. You know, we talk a lot at Waystar Holding Corp. about building the autonomous revenue cycle platform. This dynamic, end-to-end agentic network that acts continuously within workflows, learns from outcomes with real sources of payment truth, and then delivers the perfect, undeniable claim—real financial results with minimal intervention. It is on our roadmap. We have teams of people focused on how we create, with minimal intervention, this environment where we keep a human in the loop appropriately as AI continues to learn from our massive proprietary data. How do we march toward that perfect, undeniable claim? We are absolutely willing to explore some performance-based pricing opportunity in this space.\n\nIt is something that we will not talk a lot about in the public domain here, but it is something that we contemplate internally as we think about how to price to the value that we are delivering to our clients.\n\nOperator: And our next question will be coming from Brian Scott Daniels of William Blair. Your line is open, Brian.\n\nSteven M. Oreskovich: Hey, good morning, guys, and congrats on the quarter. I really appreciate all the comments today, Matt. But as I think about\n\nAdam R. Hotchkiss: you talked about how important the platform is and the one-stop shop approach from your clients. One question we are getting a lot is when we think of the traditional EHR players or vendors trying to build AI capabilities that touch into RCM, how do you think about that? And maybe how does the clearinghouse factor into that decision, which platform your clients—these hospitals or provider groups—would build on when they choose the one-stop shop solution going forward? Thanks. Right. Yes.\n\nMatthew J. Hawkins: Thanks for the question, Brian. We are very focused on revenue cycle,\n\nRyan Scott Daniels: clearinghouse,\n\nMatthew J. Hawkins: successful payment. And so as you know, we connect to over 500 different instances\n\nMatthew J. Hawkins: practice management and electronic health systems, including some of the largest in the United States. We have not seen a successful test or result of anybody creating an EHR system and creating a clearinghouse. It tends to be a different development motion, a very different set of capabilities required to build and sustain a network. We have been building Waystar Holding Corp.'s\n\nRyan Scott Daniels: cloud-native modern clearinghouse\n\nMatthew J. Hawkins: for over a decade. And we monitor it and pressure test it and update it continuously,\n\nRyan Scott Daniels: intradaily.\n\nMatthew J. Hawkins: That is very different from developing an electronic health record solution or a practice management system, quite frankly. And so as we stay focused\n\nMatthew J. Hawkins: our platform, and being highly interoperable and deeply deployed with all the electronic health record systems in the market, we think that is the winning approach. We can specialize in what we are doing. We can be a linchpin solution to those EHR systems and a great partner to our clients in helping them get paid.\n\nRichard Collamer Close: will be coming from Richard Collamer Close of Canaccord Genuity. Your line is open, Richard.\n\nMatthew J. Hawkins: Yes. Thanks for the question. Congratulations on the year. Just\n\nSandy Draper: maybe a little bit more on the AI, and\n\nRichard Collamer Close: OpenAI, Cloud for Healthcare, both had some notable organizations listed in their press releases on the launches, like HCA, Boston Children’s, Stanford, and some, I assume, are Waystar Holding Corp. clients. I am just curious what your thoughts are. Do you see situations where clients will have multiple vendors for certain AI functionality, meaning it is not necessarily a zero-sum game, which the market seems to be pricing in? And then also just your thoughts on the health care landscape overall. There are a lot of the haves and the have-nots, and maybe some of these larger AI companies are not necessarily good fits for certain customers.\n\nSandy Draper: Thank you, Richard.\n\nMatthew J. Hawkins: I would say,\n\nMatthew J. Hawkins: it is an exciting time in health care. This is the moment of a lifetime where generative AI capability is available to hospitals and health systems and any organization. LLMs are great tools to develop and deliver features and functions. We see that internal to Waystar Holding Corp., again, as we utilize Google's LLM. What I would say is having a heterogeneous deployment of technology is not a new phenomenon in health care. It tends to not be a zero-sum game in health care. There may be some misunderstanding or a lack of appreciation for how heterogeneous health care technology is being deployed.\n\nBut again, to solve the mission-critical problems that are demanded in the revenue cycle that, quite frankly, Waystar Holding Corp. solves, you have to have a deeply deployed, multisided network to connect organizations to payers and to patients. It is required to have rich and real-time data that you can use to real-time train your network so that you do not have the luxury of having a science experiment in your revenue cycle. There is a limited tolerance for any type of fault. RCM has to be 100% right; otherwise, there are penalties. There are fines. There are all sorts of other things that can go bad. So having rich and real-time data is important.\n\nHaving subject matter expertise—It is tough to get all of that within one hospital or health system. Most hospitals and health systems, to your second part of your question, do not necessarily have the abundance of engineering talent that they need to build and then sustain and support AI capability. So we think the longer-term\n\nRichard Collamer Close: benefit is really\n\nMatthew J. Hawkins: what Waystar Holding Corp. can do, and vendors like Waystar Holding Corp. can do, to help deliver AI that can be consumed thoughtfully in workflows that employees understand, etc. The last thing I would say is speaking of the haves and have-nots that you highlighted, Richard, I think there are very few hospitals and health systems that have the resources to deploy AI and sustain it and manage it themselves, and meet regulatory requirements, and do all the things that you are obligated to do if you are working and using technology inside a hospital and health system. The vast majority of our clients, for example, especially on the ambulatory side, the non-hospital side,\n\nRichard Collamer Close: we are bringing\n\nMatthew J. Hawkins: we are bringing equity and fairness and modern AI capability to them that they would never be able to develop by themselves. There is something really cool about that inspires our work.\n\nGeorge Robert Hill: question will be coming from Michael Cherny of Leerink Partners. Your line is open, Mike. Michael.\n\nMatthew J. Hawkins: Good morning, and thanks for taking the question.\n\nSteven M. Oreskovich: Another AI one for me, but\n\nAdam R. Hotchkiss: along all those same lines, as you think about your role, your integration with various different\n\nMatthew J. Hawkins: how do you make sure that your organic, inorganic R&D investments\n\nSteven M. Oreskovich: stay on top of the curve so that you are continuing to deliver value? You are continuing to make\n\nAdam R. Hotchkiss: sure that you box out\n\nSteven M. Oreskovich: other providers, be it purpose-built or some of these larger companies relative to their ability to try and deploy AI either to disrupt you, to intermediate you, or whatever term you might want to use. Thank you.\n\nMatthew J. Hawkins: Yes. I would say we have talked a lot about LLM tools right now. They are good for coding efficiency. We are deploying LLM tools, as I have mentioned. We feel like basically everybody is using LLM tools.\n\nRyan Scott Daniels: It is the LLM advantage.\n\nMatthew J. Hawkins: Is the use of the LLM the advantage? We would argue that you need other capability to be competitive and to deliver value to clients. So from an organic perspective, how do we stay ahead? We are investing in innovation. We are using LLM capability ourselves. We are seeing productivity gains amongst our development teams as we highlighted in our prepared remarks. We are delivering hundreds and hundreds of feature improvements in any typical quarter that help our clients achieve fantastic results.\n\nWe also have a dedicated corporate development team, and we scan the market all the time to look at some of the startups that are creating novel and unique AI capabilities that may not have the distribution or the deeply deployed network that we have. We think we can be a great home for the right types of companies. But it is a very exciting time, and Waystar Holding Corp. is very motivated to continue to deliver value to our clients and to our shareholders.\n\nOperator: I would now like to turn the conference back to Matthew J. Hawkins, CEO, for closing remarks.\n\nMatthew J. Hawkins: Great. Okay. Thanks so much for the time and the thoughtful questions today. To summarize, Waystar Holding Corp. is executing from a position of strength. We are delivering durable growth, strong margins, and meaningful cash generation while extending our leadership in AI-powered revenue cycle automation. Our AI is not experimental. It is embedded, monetized, and delivering measurable outcomes inside mission-critical workflows our clients rely on every day. With unmatched data, deep deployment and domain expertise, strong distribution, and a disciplined operating model, we believe Waystar Holding Corp. is exceptionally well positioned to compound value over the long term. I would especially like to thank our outstanding team for their dedicated and impactful work.\n\nThey are the reason that Waystar Holding Corp. continues to perform at this level. We appreciate your interest and support, and we look forward to updating you on our continued progress. Thank you, everybody.\n\nOperator: And this concludes today's program. Thank you for participating. You may now disconnect.\n\nBefore you buy stock in Waystar, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Waystar wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $414,554!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,120,663!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 884% — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 17, 2026.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.\n\nWaystar (WAY) Q4 2025 Earnings Call Transcript was originally published by The Motley Fool"
    },
    {
        "title": "AI Capital Expenditure (Capex) Is Off the Charts: Who Stands to Lose?",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/META-Q/pressreleases/257400/ai-capital-expenditure-capex-is-off-the-charts-who-stands-to-lose/",
        "source": "The Globe and Mail",
        "date": "2026-02-17T07:42:00+00:00",
        "content": "In this podcast, Motley Fool analyst Tim Beyers and contributors Jason Hall and Travis Hoium discuss:\n\nDon't wait! Be sure to get to your favorite bookseller and pick up a copy of David Gardner's new book -- Rule Breaker Investing: How to Pick the Best Stocks of the Future and Build Lasting Wealth.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nTo catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. When you're ready to invest, check out this top 10 list of stocks to buy.\n\nBefore you buy stock in Monday.com, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Monday.com wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $414,554!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,120,663!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 884% — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 17, 2026.\n\nThis podcast was recorded on Feb. 09, 2026.\n\nTim Beyers: Big Tech is spending big. Who could lose amid all the winning? You're listening to Motley Fool Money. Welcome, Fools. I'm your host, Tim Byers, and with me are two top Fool contributors and recurring guests. It's Travis Hoium. Jason Hall. Thanks for being here, Fools. How are you feeling?\n\nTravis Hoium: Good. This is a wild market. This is one of the crazier markets that I've seen. We're near all-time highs, and yet we've got some stocks that are just getting absolutely crushed. Kind of crazy.\n\nJason Hall: There's a lot of investors trying to figure out which part of the market is right.\n\nTim Beyers: To that point, Jason, let's talk about two that are on the radar this morning as we are taping. This is on Monday late morning Mountain Time. Both Monday.com, ticker MNDY, and Kyndryl, ticker KD, are getting absolutely slaughtered. Monday has been down more than 20% through various parts of the day. Kyndryl down more than 50%. These two are a little different, though. We'll talk about Monday in a second, but just the story on Kyndryl as the CFO and the General Counsel both appear to have been dismissed. Kyndryl is going to delay its quarterly filings because it cannot verify that its internal controls over financial reporting are sound, and they need to report on this for lack of a better term and explain what the heck is going on here. I'm sure, Vasoas of the market, that sounds like fraud or chicanery or just incompetence. But either way, it's terrible. This is not one of those deep value plays that I think you spend a lot of time putting money behind. Monday might be different. I know you had a question about this one, Jason, because it did report. It beat estimates in its most recent report. The outlook, though, came in a little short on the revenue side and on the margin side. I'm guessing that that codes to the market as this company is getting disrupted. I'm not sure that's true.\n\nJason Hall: Tim, the company comes and reports mid-20s revenue growth, and you see a 20% haircut, you're like, what's going on here? You look at the existing results, and we saw operating income and margins fell. It really looks like in the second half of the year, they're guiding for substantially slowing growth and continued deterioration of the margins. To me, I think that's really the story. Sure, the revenue decline is slowing growth is that, but revenue growth is slowing, and you're losing. You're supposed to be getting more operating leverage for a business like Monday.com. That's not happening.\n\nTim Beyers: Well, it's not, but there's a couple of mitigating factors here. I will point you those of you who are listening who are members of the Motley Fool. First of all, we really appreciate you. We love our entire audience, but we appreciate you, those who are tuning in as members. There is guidance on the site. Please go to your services. You will see some guidance that we have issued, a little bit of analysis on these results from my co-captain on Super Nova Odyssey, David Meyer, and also Alicia Alfieri on the Rule Breakers team, she's also issued a bit of guidance here. But sum it up, Jason, super quickly, there are some foreign exchange effects here. That does have a drag on margins. Also, really early in the deployment of AI agents for monday.com. It's only right now at 1 million in trailing 12-month annual recurring revenue because they were just launched in October, but that's scaled really quickly. Now, over time, do I think that's going to be much higher margin revenue as that scales up across the entire customer base? Yeah, I do.\n\nJason Hall: There's a lot of expense that's coming along with that first group of customers.\n\nTim Beyers: You're going to invest in that to build it. But the customers are taking them up on it and putting AI agents into their Monday.com environment. That's a good sign. I don't see a lot to be really worried about here. But as I've said many times, it's always good to take a breath, pause. You don't have to buy more right now. You don't have to sell right now. It's a good time to let everybody else light their hair on fire. You do not need to join them. It's painful to light your hair on fire anyway. You really don't want to do that. But let's talk about lighting hair on fire. Boy, has there been a lot of spending, Travis? Like, huge amounts of spending, just a metric ton of cash on CapEx. That did seem to be the story of last week's earnings. I did a short analysis here. I looked at Gemini. I did not fully check the numbers, but I eyeballed it, and it looked right. At 400 billion over the last four reported quarters. This is among the top six companies. In terms of net capital expenditures. This is Amazon, Alphabet, Microsoft, Meta, Apple, and Nvidia. That's a huge amount of money. Here's what I want to know from both of you, starting with you, Travis. Is this worth it? Like, is this really worth it? Because this is one of the stories. Do we expect as investors to get something out of all this?\n\nTravis Hoium: It really depends. It depends who you look at. I think it's the answer there. Let's start with Alphabet, because I think they were the talk of the market in 2025. The question for Alphabet was, are they going to be disrupted by OpenAI and by all these chatbots and stuff like that? The one way to not be disrupted is to outspend all of these companies so that your infrastructure is better so that your models are better. Alphabet, this is a scorched earth story. They are ensuring that no one is going to disrupt them. The momentum that they have with Gemini, with putting our AI tools into search, they are foreclosing, I think, that opportunity for disruption. It reminds me a little bit of Facebook [Meta's]. Was it about 10 years ago when Snap had a ton of momentum, and they said, You know what? We're going to copy exactly what you're doing, and their growth just stalled out. We're starting to see the Cary and the coal mine with that with OpenAI. Their growth is slowing, and Alphabet is actually starting to pull away some of those users. Actually, I thought a really effective ad at the Super Bowl last night. But that's the story for them. The other companies are a little bit different. Meta is going to have ROI on their own business. Mark Zuckerberg gets to do whatever he wants spending in AI because he controls the company. I don't know if we're necessarily going to get a payoff for them. Amazon, I don't know. They're late to the party, but you got to spend the money to play. Then Apple is not putting a huge amount toward this in the first place. When you look at those four companies and add Microsoft in there, too. They need to be in this game. They need to grow Azure. They are tied to OpenAI. It's all very rational. By the way, they may say in 2027, we're going to pull this back a little bit. Instead of spending $600 billion, we're only going to spend $400 billion. That could also be another rational move because those competitive threats by then may not be what they were six months ago and what they are today.\n\nTim Beyers: Jason, are we going to bigfoot this market? Is this Travis right here? Is that the strategy?\n\nJason Hall: I think so, but thinking about it from the next second-order impact. What we're seeing, with the exception of Amazon, really, is these companies are substantially changing the way they have managed their balance sheets. For years and decades before taking on the substantial amount of capital, a lot of it we're seeing is starting to be funded by debt, which is new for a lot of these companies to be using debt in this way in these large quantities. Now, they mostly have the money to do it. They have the cash flows to do it. But Meta, for example, has gone from a company that had massive amounts of net cash to, if they're not there now, they certainly will be within a few more quarters of having substantially more debt than cash. With this kind of capital investment, it's a hamster wheel, where you're constantly having to reinvest, to refresh, to stay ahead. It is an all-out sprint for these businesses. It is a land war right now. There's no doubt about it. Everybody's trying to capture market share. If AI is even remotely close to what we're starting to think that it could be, this probably will be a multiple-winners space because so much of what so many of these businesses do is providing the access to the compute, where they don't necessarily have to have the best AI, but you have to have good enough AI to sell to people, to monetize it for the ones that are doing AI that they're building themselves. In a way, I think Apple's strategy for what they do is really compelling to me because they are going to be positioned to do what they've always done really well, and that's have great hardware, a great ecosystem and interface that they build that they own, and then highly curate the things that have access to it. They could actually still be a winner in this, even though they're clearly way behind on building AI themselves, and they've walked away from it because they've been so bad at it. What I don't know is when inevitably we do outrun the demand because right now, let's remember that. Every single CEO that we've heard from has been clear. This is a demand issue. There is still far more demand than they can meet because they can't even get enough electricians and permits in place to connect these data centers to the grid. As long as that's the case, I think the inevitable outrunning of demand and overbuilding is probably farther into the future than maybe we realize.\n\nTravis Hoium: Let's also keep in mind that the economics of this is probably going to be very different than tech has typically been in the past.\n\nTravis Hoium: I think the analogy is going to be something either the airline industry or the oil industry, where if you buy an Nvidia GPU, you spend $100 billion on CapEx. If you're not running that at 100% utilization, then how do you get more demand? Do you lower your prices? Do you just run it under 100% utilization? The economics start to get a little bit more hairy when your demand does not quite hit supply. That's why you get all these games with businesses like airlines. How do you maximize the return? How do you keep the flight full, maximize the dollars that you're getting from each one of those flights? That's not necessarily something they're going to be able to do quite as easily. That's why I thought oil is the other thing where it's just a commodity. If tokens are just a commodity in the future, is that the business that they want to be in? That's why I think the first thing we need to look at is, what was the threat, and have they eliminated the threat? If you do that, then you can look at, are we spending this money wisely? In 2026, maybe not.\n\nTim Beyers: There's OK, let me make sure I heard you both correctly here. We are in the scorched earth stage of the market, and we have not yet got to the stage where we're fixing the land, starting to water the plants, and actually get a harvest out of this thing. We're still just burning crops, baby. This is what we're doing.\n\nJason Hall: I think that's right.\n\nTim Beyers: We're going to talk about in our next segment a couple of companies that are doing exactly that, and whether or not these are winners or are they losers? You're going to want to stay tuned. You're listening to Motley Fool Money.\n\nADVERTISEMENT: Could AI help you do more of what you love? Workday is the next-gen ERP powered by AI that actually knows your business. We help you handle the have-to-dos so you can focus on the can't-wait-to-dos. It's a new workday.\n\nTim Beyers: Fools, let's talk about a couple of companies that are subject. I picked these two, Jason and Travis, because I think they are especially sensitive to how much spending is going on in the AI sector. That is CoreWeave, ticker CRWV, and Oracle, ticker ORCL. Now, full disclosure here, guys. I have said publicly, and I am sticking to this, that I think that CoreWeave is overstretched and might go bankrupt. I've said this before, so I'm going to start with them, and I'm going to kick it to you to start here, Jason. I want to give you some data here. Feel free to tell me I am wrong about this because they have absolutely crushed it. CoreWeave has beaten the market by over 136% over the past year. That is absolutely outstanding. If you had this stock for a while, you have been a winner. But this is a company that has about $14 billion in debt, pays over 300 million in interest in recent quarters. They are levering up massively. They do have high-interest rate debt. They have some that is double-digit interest rate debt. The thesis here is that they have more than $50 billion in backlog that they cannot yet realize. They're building. It's what Travis said. It's scorched earth. We're building, we're building, we're building, and someday we're going to be able to harvest. Do you believe it?\n\nJason Hall: I don't think believing it is really the right question to answer. I think what it comes down to is, are the things that they're bringing to the table, and probably the biggest one is what makes CoreWeave a little bit different from the hyperscalers that are selling bandwidth is it's faster. It is faster. Like OpenAI, for example, is going to be able to speed up their process. They're going to be able to develop AI works faster. It's going to happen faster. Technically, that should lead to them being able to advance the product faster, make it better, get to a point where their ROI is better more quickly. The question is twofold. Number one, how long is that 10-15% advantage in speed? You can say speed. It's not exactly speed, but it's latency more than anything. Like, how long is that going to be something that's worth more money? Is the pause the stop and take your breath from all of the other hyperscalers, is that going to happen before they do get to scale? Here's the other biggest question. Is OpenAI going to be able to make their commitments, that's tied to the big CapEx and the debt that's there? Lastly, to make it even more complicated. Are partners like Nvidia going to continue to have the purse strings connected to the CoreWeaves of the world as providers of capital at need? How long is that going to continue to be the case before a Jensomong says, now we're at the point where it's good money after bad, and we have to just walk away? I don't know the answer to all of those complexities, but this is what I do know. I do know that it means that CoreWeave is heavily reliant on a lot of things that they have absolutely no control over and minimal influence to survive any sort of a slowdown in this sprint. If there is a slowdown, they get in trouble faster than anybody.\n\nTim Beyers: I'm going to give you a stat, Travis. I know you want to get in here 'cause it's important, but I ought to give you a stat. 2026 CAPEX is estimated to come in at about 220% of revenue. That seems absolutely bonkers to me.\n\nTravis Hoium: It is. What I think it is is a confidence game. If you remember, I know Jason and I were covering a company called Sun Edison about a decade ago. The idea with Sun Edison was they could build wind and solar projects basically to infinity by simply selling some debt here, selling some equity there. As long as your cost of capital, your combination of the cost of those two funding sources, were lower than what your return was going to be on the asset that you were building, you were good to go. You could just do this over and over and over and over again. The problem becomes, when does the department of the market say no? When does the market say, You know what? You already mentioned the debt. CoreWeave doesn't exactly have cheap debt. You're not doing solar projects where the debt was 4%, 5% interest rates. This is higher-cost debt. The debt market is already telling us what it thinks. They're already saying, Hey, we don't quite believe this. If the equity market goes the same direction, then the whole thing topples over. That's really the risk that you have to look at with these companies. It's a very, very different calculation if you're Sundar Pichai, and you're looking at Google's cash flow and balance sheet, and you're just saying, why don't we spend everything that we possibly can to make sure that we're not disrupted by OpenAI? Because at the end of the day, if we need to pull that back, that's fine. We still got more cash coming in the next year. CoreWeave is in the same position. There is no next year if they don't get that funding, if they don't get the next project. It's a very, very different risk profile, and you start adding to debt. Everybody who has studied bubbles in the past will tell you the two signs that it's surely a bubble is when people start using debt and when nobody thinks it's a bubble anymore. That is terrifying. I will say, in CoreWeave's defense, what they say the CapEx that they are committing to is success-based, so they will not commit the CapEx until they have a contract that would allow them to apply the CapEx they're buying.\n\nJason Hall: But a contract doesn't matter if the counterparty papers and meets theirs.\n\nTravis Hoium: It's paper. I have some doubts about that. Quickly, because we're running short on time here. Let's talk about Oracle. Oracle has a $523 billion backlog. They also have quite a bit of debt, but they also generate quite a bit of free cash flow here, so they just did, Jason, a $50 billion capital raise, half through debt, half through equity. They are just raising money hand over fist. It does seem to me that of all of the companies that are going scorched earth, this company is scorching the most earth relative to what it can bring to bear in terms of resources. Tell me, both of you quickly, do you think that this strategy for Oracle in particular, which has an interesting place, by the way, in the market, playing Switzerland in the data center market with these Exadata machines, it makes sense. Yet, I mean, this is a heck of a bet, Jason.\n\nJason Hall: I think in a lot of ways, it's a necessary bet, though.\n\nTim Beyers: We're back to it again. You must go scorched earth. There is no choice.\n\nJason Hall: Oracle's future would look vastly different if the company doesn't make an attempt to be a substantial part of the AI infrastructure, where AI lives, and having it connected to its own data because of its enterprise customers. It's become table stakes for a business like Oracle. I think the saving grace, though, is that if things don't turn out, if we don't have a panacea, Oracle still has a pretty good business that's there. It's going to be heavily encumbered. I don't think it goes away. Like, I don't think it goes to zero, and then somebody's buying the pieces off the scrap heap, like you could see with our CoreWeave. But I do think that they're taking a necessary risk. I guess if we were to ask the question between Oracle and CoreWeave, which of those do I think that there's a better risk profile? I think it's Oracle because the floor is higher, and the business is more stable. But I want to point out that at 7.5 times sales, before the past couple of years, this is the most expensive Oracle has ever been. As much as the stock has fallen, it's still not cheap.\n\nTim Beyers: Travis, where are you on this?\n\nTravis Hoium: One correction for you. They are operating cash flow positive. As of three quarters of the growth, they are not free cash flow positive. Because of all the CapEx. But I want to clarify that because they have $100 billion worth of debt, and they're only adding to that debt load. They are leveraging up the company, betting on it. By the way, you mentioned the RPO, the remaining performance obligations. That was when the stock jumped in the fall. Who is providing all of that backlog? Most of it is OpenAI. Again, it's a confidence game. Does OpenAI get to be the thing that you think it could be in the future and live up to all these high expectations? Maybe, but we talked about the one problem with that early on. Alphabet is spending $180 billion making sure that doesn't happen. That's what's got to worry you if you're Oracle.\n\nJason Hall: Well, I mean, look at how quickly things change, though. I mean, we were talking about Gemini and Alphabet, how much it had moved from a really troubled business to a big leader. The past six weeks, the story has been clawed.\n\nTim Beyers: By the way, I will tell you, I have access to full Claude, and it's good. It's very, very good.\n\nJason Hall: We're going to be talking different names this summer. That's my point.\n\nTim Beyers: I'm sure that we will be. Fools, we're going to preview tomorrow's show. Stay tuned. You're listening to Motley Fool Money.\n\nADVERTISEMENT: The world moves fast. You workday, even faster, pitching products, drafting reports, analyzing data. Microsoft 365 Copilot is your AI assistant for work built into Word, Excel, PowerPoint, and other Microsoft 365 apps you use, helping you quickly write, analyze, create, and summarize. You can cut through clutter and clear a path to your best work. Learn more at microsoft.com/365Copilot.\n\nTim Beyers: Coming up tomorrow, more interesting stuff. We got a lot more earnings coming. Emily Flipping is going to be doing a Rule Breakers earnings roundup. She's going to be welcoming Toby Bordelon, and guess who else is going to be back. Jason Hall will be back. They will be talking, Datadog, Ferrari, and Spotify, all of which will be reporting on Tuesday morning. Please make sure to tune in and leave a comment for us if you have thoughts about that show, and leave a comment for us today so you can tell us what you think about this show. I know we went through quite a lot here, and we will take your questions and maybe do some follow-ups on them. As always, people on the program may have interest in the stocks they talk about, and the Motley Fool may have formal recommendations for or against, so don't buy or sell stocks based solely on what you hear. All personal finance content follows Motley Fool editorial standards and is not approved by advertisers. Advertisements are sponsored content and provided for informational purposes only. To see our full advertising disclosure, please check out our show notes for Jason Hall and Travis Hoium, our producer is Anan Choco Balu. Our engineer, as always, is the incomparable Dan Boyd. Fools, I am your host, Tim Byers. See you again soon, Fools. Fool on.\n\nJason Hall has no position in any of the stocks mentioned. Tim Beyers has positions in Alphabet. Travis Hoium has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet, Kyndryl, Meta Platforms, Monday.com, and Oracle. The Motley Fool has a disclosure policy.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    }
]