[
    {
        "title": "S&P 500 rises, led by Nvidia, even with Fed rate outlook uncertain: Live updates",
        "url": "https://www.cnbc.com/2026/02/17/stock-market-today-live-updates.html",
        "source": "CNBC",
        "date": "2026-02-18T19:27:00+00:00",
        "content": "The S&P 500 moved higher on Wednesday, supported by gains in key technology names, as traders weighed the release of the minutes from the Federal Reserve's most recent policy meeting.\n\nThe broad-based index climbed 0.56% to end at 6,881.31, while the Nasdaq Composite added 0.78% to close at 22,753.63. The Dow Jones Industrial Average rose 129.47 points, or 0.26%, and settled at 49,662.66.\n\nNvidia shares advanced 1.6% on the heels of Meta Platforms announcing Tuesday that it's going to use millions of Nvidia's chips in its data center buildout.\n\nSimilarly, fellow \"Magnificent Seven\" member Amazon moved higher by nearly 2% after regulatory filings showed Bill Ackman's Pershing Square grew its stake in the e-commerce giant by 65% during the fourth quarter. That makes Amazon the fund's third-largest holding. The move comes after the stock snapped a nine-day losing streak.\n\nMicron Technology also saw gains after David Tepper's Appaloosa Management increased its holdings in the chipmaker. The stock closed more than 5% higher.\n\nWhile those stocks are bolstering the broader market, Stephen Lee of Logan Capital Management noted that \"lesser-known\" names in the tech space are also performing well, including those in industrial tech such as Trimble. Shares of that company were up about 2% in the session.\n\n\"I'm not sure today is actually eliminating the broadening out thesis when we kind of peel the onion and look at relative winners,\" the founding principal said, adding that the market is growing \"a little bit more discerning.\"\n\nInvestors mulled over the minutes from the Fed's January meeting, which revealed that participants largely approved of the central bank's decision to leave its key interest rate unchanged at a range of 3.5% to 3.75%. However, officials were divided on the direction of monetary policy thereafter.\n\nElsewhere, oil prices jumped as those on Wall Street digested the latest developments between the U.S. and Iran. Vice President JD Vance said Tuesday that Iran failed to address U.S. red lines in this week's nuclear talks and that military action is still a possibility.\n\nWall Street is coming off a muted session, with the major averages eking out small gains. The software sector, which has already been under pressure due to fears of disruption by artificial intelligence, fell during the trading day.\n\nThe three leading U.S. indexes finished with gains on Wednesday.\n\nThe S&P 500 rose 0.56% to end the session at 6,881.31, while the Nasdaq Composite advanced 0.78% to 22,753.63. The Dow Jones Industrial Average moved higher by 129.47 points, or 0.26%, to 49,662.66.\n\nU.S. plans to sell a large package of armaments to Taiwan are \"in limbo\" in anticipation of President Trump's trip to China in early April and in response to pressure from the Peoples Republic, the Wall Street Journal said Wednesday, citing unnamed administration officials.\n\nThe move came in response to a phone call to Trump by Chinese President Xi Jinping on Feb. 4, the newspaper said.\n\nThe U.S. drew complaints from Beijing when it agreed to sell $11.1 billion in arms to Taiwan in December, and U.S. officials had been considering adding to those sales before Xi's call to Trump.\n\nCongress \"hasn't officially been notified of new arms sales, but a congressional aide said it had been expected to include Patriot antimissile interceptors and other weapons,\" the Journal said. Lockheed Martin is the lead contractor for the Patriots, with RTX making radar and ground systems and Boeing providing guidance components.\n\nLa-Z-Boy posted an earnings and revenue beat in its third-quarter report delivered Tuesday afternoon, but weak guidance is sending the stock lower.\n\nShares of the furniture retailer and manufacturer fell 7% in afternoon trading Wednesday, though that was off lows shortly after the open when it was down more than 12%.\n\nThe company delivered revenue guidance for the current quarter of $560 to $580 million. Analysts surveyed by FactSet expected revenue guidance that totaled $590.2 million. Same-store sales, which fell 4%, also weighed on the stock.\n\nLa-Z-Boy CEO Melinda Whittington in an appearance on CNBC's \"The Exchange\" explained challenged consumers are weighing on the company.\n\n\"We still have consumers that are able to invest in and really want to do big projects in their homes,\" she said. \"We're also seeing those strapped consumers, that really want to be able to invest in our quality and our customization we're able to deliver with our North America footprint, and so we're doing all we can to make sure we have a select set of offerings for that consumer as well while times are a little more challenging.\"\n\nGlobal Payments jumped 16% after posting a rosier-than-expected outlook for the current year.\n\nThe company said it expects to notch earnings of $13.80-$14 per share by the end of 2026, topping a FactSet consensus of $13.58 per share. It also said that adjusted net revenue growth will come in at roughly 5% by the end of this year, or slightly higher than analysts' forecast of 4.7%.\n\nShares of the company are surging even as the software names are largely pulling back. The retreat comes as investors reevaluate the value of software stocks due to concerns that the use of artificial intelligence could eclipse that of traditional technologies.\n\nA divided Fed indicated that further rate cuts should be paused. However, they could resume later in the year if inflation trends lower.\n\n\"In considering the outlook for monetary policy, several participants commented that further downward adjustments to the target range for the federal funds rate would likely be appropriate if inflation were to decline in line with their expectations,\" the meeting summary stated. Read more.\n\nCheck out the companies making headlines in midday trading:\n\nModerna said on Wednesday the Food and Drug Administration has agreed to review its experimental mRNA flu shot, reversing the agency's earlier decision to refuse to accept the application in a move that stunned Wall Street and the medical community.\n\nThe announcement clears a path forward for the vaccine, which is key to Moderna's experimental combination Covid-flu jab and the company's goal of breaking even by 2028. The FDA is slated to make a decision on the flu shot on Aug. 5, which will allow Moderna to make the vaccine available for the upcoming influenza season.\n\n\"Pending FDA approval, we look forward to making our flu vaccine available later this year so that America's seniors have access to a new option to protect themselves against flu,\" said Moderna CEO Stéphane Bancel in a release.\n\nShares of the biotech company rose more than 6% on Wednesday. Read more.\n\nWhite House economic advisor Kevin Hassett said Wednesday that the authors of a recent New York Federal Reserve paper that found U.S. companies and consumers are shouldering most of the tariff burden should be \"disciplined.\"\n\nIn a CNBC interview, the National Economic Council director ripped the report, saying that central bank researchers ignored key aspects of how the duties worked and instead simply focused on prices. Hassett said the research also should have included the upward impact on wages and benefits that U.S. companies see by bringing more production onshore.\n\n\"I mean, the paper is an embarrassment,\" Hassett said during the \"Squawk Box\" interview. \"It's, I think, the worst paper I've ever seen in the history of the Federal Reserve system. The people associated with this paper should presumably be disciplined, because what they've done is they've put out a conclusion which has created a lot of news that's highly partisan based on analysis that wouldn't be accepted in a first-semester econ class.\" Read more.\n\nOil prices rose 3% on Wednesday, after Vice President JD Vance said Iran did not address U.S. red lines in nuclear talks this week and President Donald Trump reserves the right to use military force.\n\nU.S. crude oil rose $1.99, or 3.19%, to $64.32 per barrel by 10:09 a.m. ET. Global benchmark Brent was up $2.04, or 3.03%, to $69.46 per barrel.\n\nU.S. envoys Steve Witkoff and Jared Kushner held nuclear talks with Iran in Geneva on Tuesday. Iran's Foreign Minister Abbas Araghchi described the discussions as \"constructive,\" according to Iranian media. Araghchi said the talks yielded a general agreement on guiding principles.\n\nOil prices closed lower Tuesday as traders interpreted the foreign minister's comments as a sign that the U.S. and Iran could still reach a settlement. Read more.\n\nPalo Alto Networks CEO Nikesh Arora addressed the recent downdraft in software stocks, telling analysts in an earnings call that artificial intelligence won't replace cybersecurity \"anytime soon.\"\n\n\"I'm still confused why the market is treating AI as a threat to at least cybersecurity,\" he said Tuesday. \"I can't speak for all of software, but one thing we're definitely seeing is that customers have figured out that they need to drive more consistency in their security stack to be able to respond faster using AI.\"\n\nShares sank 8% Wednesday following the cybersecurity company's fiscal second-quarter results, which topped Wall Street estimates. However, third-quarter earnings guidance fell short of expectations. Read more.\n\nThe three major averages began Wednesday's session in the green.\n\nThe Dow Jones Industrial Average rose 47 points, or 0.1%. The S&P 500 climbed 0.2%, along with the Nasdaq Composite.\n\nMadison Square Garden Sports jumped 9% premarket Wednesday to what would be a new all-time high after setting plans to spin off its New York Knicks team in the NBA into one publicly-traded, independent company, and the New York Rangers, one of the National Hockey League's \"Original Six\" franchises, into another.\n\nMSGS began trading in the first half of 2020 after the Knicks and Rangers were separated from Madison Square Garden Entertainment.\n\n\"We are exploring the opportunity to further create value for our shareholders by separating our two professional sports franchises into distinct companies,\" said Jim Dolan, chief executive officer at MSGS. \"This proposed transaction would provide each company with enhanced strategic flexibility, its own defined business focus and clear characteristics for investors.\"\n\nThe Dolan family controls both Madison Square Garden Entertainment and Madison Square Garden Sports through the use of supervoting Class B shares, each of which holds 10 votes.\n\nCheck out the companies making headlines before the bell:\n\nEconomic data on housing activity and orders for long-lasting goods on Wednesday came in better than expected.\n\nHousing starts totaled just over 1.4 million for December, better than the Dow Jones consensus estimate for 1.31 million, the Census Bureau reported. Building permits came in at 1.45 million, topping the forecast for 1.4 million.\n\nIn a separate report, the bureau said durable goods orders fell 1.4%, also for December. That was better than the outlook for a 2% decline. When excluding transportation, orders rose 0.9%.\n\nMizuho believes that Palantir's recent pullback makes no sense given the accelerating adoption of its artificial intelligence platforms.\n\nThe bank upgraded the software analytics company, which creates tools for businesses and government agencies, to outperform from neutral. Analyst Gregg Moskowitz's $195 price target implies that shares could rally 47% from here.\n\nShares of Palantir are up 7% over the past 12 months, but have plunged 25% this year.\n\nCNBC Pro subscribers can read more here.\n\nNew York-listed shares of British semiconductor firm Arm ticked 1.4% higher in premarket trading on Wednesday, after documents showed Nvidia sold its stake in the company it once wanted to buy.\n\nAt the end of the third quarter, Nvidia held 1.1 million shares of Arm with a value of $155.8 million. The chip giant's filing to the SEC on Tuesday showed it had offloaded the stock.\n\nNvidia had held shares in Arm since 2023, but wound down the size of its stake toward the end of 2024, according to past documents filed with the SEC. Read more.\n\nMeta will use millions of Nvidia chips in its artificial intelligence data centers, including Nvidia's new standalone CPUs and next-generation Vera Rubin systems, in a sweeping new deal announced Tuesday.\n\nMeta CEO Mark Zuckerberg said in a statement that the expanded partnership continues his company's push \"to deliver personal superintelligence to everyone in the world,\" a vision he announced in July. Read more.\n\nAmazon shares rose more than 1.6% after regulatory filings showed Bill Ackman's Pershing Square grew its stake in the e-commerce giant by 65% during the fourth quarter. That makes Amazon the fund's third-largest holding. The move comes after the stock snapped a nine-day losing streak.\n\nMicron also gained more than 1% after David Tepper's Appaloosa Management increased its holdings in the chipmaker.\n\nAmazon gained 1.2% on Tuesday, ending the stock's nine-day consecutive stretch of losses.\n\nThe stock shed roughly 18% of its value between Feb. 2 and Friday, marking the worst losing streak since 2006 and slashing more than $450 billion in market valuation as investors question the merits of its artificial intelligence spending plans. The selling frenzy around Amazon is tied to the company's fourth-quarter earnings report released earlier this month.\n\nAmazon said it expects to spend $200 billion in capital expenditures this year, a nearly 60% increase from last year and more than $50 billion above Wall Street's forecast.\n\nShares of the company are down nearly 12.9% year to date.\n\nCheck out the companies making headlines in after-hours trading.\n\nFutures tied to the S&P 500 and Nasdaq-100 futures each opened slightly below the flatline, losing nearly 0.1%. Futures tied to the Dow Jones Industrial Average dipped 18 points, or less than 0.1%."
    },
    {
        "title": "S&P, Dow Jones futures rise as tech leads ahead of Fed minutes",
        "url": "https://invezz.com/news/2026/02/18/sp-dow-jones-futures-rise-as-tech-leads-ahead-of-fed-minutes/",
        "source": "Invezz",
        "date": "2026-02-18T12:11:00+00:00",
        "content": "US stock index futures moved higher on Wednesday, supported by gains in major technology shares as investors awaited the release of minutes from the Federal Reserve’s latest policy meeting for signals on the interest-rate outlook.\n\nFutures tied to the Dow Jones Industrial Average rose 216 points, or 0.44%.\n\nS&P 500 futures climbed 0.49%, while Nasdaq 100 futures advanced 0.57%.\n\nLarge-cap technology stocks led premarket advances, helping steady sentiment after a volatile period fueled by uncertainty surrounding artificial intelligence spending and its impact on corporate earnings.\n\nNvidia shares rose 1.8% in premarket after the company announced a multi-year agreement to supply Meta Platforms with millions of its current and next-generation AI chips.\n\nAmazon gained more than 1.57% after regulatory filings showed Bill Ackman’s Pershing Square increased its stake in the company by 65% during the fourth quarter, making it the fund’s third-largest holding.\n\nThe move followed Amazon snapping a nine-day losing streak.\n\nMicron Technology also rose more than 1.1% after David Tepper’s Appaloosa Management expanded its position in the chipmaker.\n\nOther megacap companies advanced as well, with Meta Platforms and Microsoft each adding about 0.7% in premarket trading.\n\nDespite Wednesday’s rebound, markets have been unsettled in recent weeks.\n\nConcerns that rapidly improving artificial intelligence tools could disrupt industries from software to trucking have weighed on equities, while investors have sought clearer evidence that heavy AI spending will translate into revenue growth.\n\nWall Street ended the previous session with only modest gains after sharp intraday swings.\n\nThe S&P 500 closed 0.1% higher after falling as much as 0.9% earlier in the day, while the Dow and Nasdaq also reversed early losses.\n\nThe software sector remained under pressure amid fears of AI disruption.\n\nInvestors are closely watching the minutes from the Federal Reserve’s January meeting, when policymakers held interest rates steady.\n\nThe document is expected to provide insight into how long the central bank may keep borrowing costs unchanged.\n\nMarkets are also preparing for the personal consumption expenditures price index due Friday.\n\nThe PCE, the Fed’s preferred inflation gauge, is expected to provide further clarity on inflation and the path of monetary policy.\n\nAccording to CME’s FedWatch Tool, traders see roughly a 63% chance of a 25-basis-point rate cut at the Fed’s June meeting.\n\nIndividual stock moves also shaped trading.\n\nPalo Alto Networks fell 6.7% after trimming its annual profit forecast, citing rising costs tied to artificial intelligence investments.\n\nCadence Design Systems climbed 5.6% after beating fourth-quarter revenue estimates.\n\nMeanwhile, Western Digital announced plans to raise $3.17 billion by selling part of its stake in its former unit Sandisk through a secondary share sale, sending Sandisk shares down 2.5%.\n\nAs earnings season continues, investors remain cautious while awaiting clearer signals on inflation, interest rates, and whether AI investment can justify elevated valuations in technology stocks.\n\nFailed to load articles. Please try again."
    },
    {
        "title": "Big Short Steve Eisman Favors Schwab, Cites Robinhood's Lack Of 'Margin For Error' Amid Bitcoin-Led Crypto Slide",
        "url": "https://finance.yahoo.com/news/big-short-steve-eisman-favors-183110473.html",
        "source": "Yahoo Finance",
        "date": "2026-02-18T18:49:00+00:00",
        "content": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\n\nFamed ‘Big Short’ investor Steve Eisman has weighed in on the struggles facing fintech and crypto-exposed platforms, explicitly favoring Charles Schwab Corp. (NYSE:SCHW) over Robinhood Markets Inc. (NASDAQ:HOOD).\n\nEisman highlighted Robinhood’s lofty valuation and its significant exposure to the volatile cryptocurrency market, warning that the company has “no margin for error” given its current trajectory.\n\nSpeaking in his weekly market commentary, Eisman underscored the renewed “decline” in crypto prices as a major factor hurting platforms like Robinhood and Coinbase Global Inc. (NASDAQ:COIN).\n\nSecurity and regulation matter in crypto — explore Kraken Pro's compliance-first trading platform.\n\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\n\nHe noted that a “not insignificant portion” of Robinhood’s customers invest in crypto, and this slump is directly impacting its performance. The company recently missed on earnings, revenue, and net new assets – all critical metrics.\n\nEisman bluntly stated, “I doubt Robinhood will go up until at least crypto stabilizes.”\n\nA key point of contention for Eisman is Robinhood’s valuation compared to its established competitors.\n\nHe pointed out that Robinhood trades at a 2026 Price-to-Earnings (PE) multiple “over 30 times,” while its largest competitor, Charles Schwab, commands a significantly lower 17 times PE. As per Benzinga, the forward PE for HOOD stood at 29.85, as compared to SCHW‘s 16.31 ratio.\n\nThis stark disparity means Robinhood operates with little room for missteps. “With such a disparity in multiples,” Eisman warned, “there is no margin for error.”\n\nTrending: You Saved for Retirement — But Do You Know What You'll Keep After Taxes?\n\nThe sentiment extended to Coinbase, another major player heavily tied to crypto performance. Eisman noted that Coinbase’s revenue was down 22%, and it too missed earnings per share.\n\nHe drew a direct parallel, asserting that “as long as crypto prices keep going down, so will the stock price of Coinbase,” which has already seen a significant year-to-date decline.\n\nEisman’s commentary suggests a cautious outlook for companies whose fortunes are closely linked to retail speculation and the highly cyclical crypto market.\n\nWhile retail investors continue to “buy every dip” in the broader market, Eisman implies that this strategy may not hold for assets facing structural headwinds and competitive pressures, particularly when valuations offer little cushion against adverse developments.\n\nSee Also: Own the Characters, Not Just the Content: Inside a Fast-Growing Pre-IPO IP Company\n\nBitcoin (CRYPTO: BTC) was down 3.14% over the last 24 hours at $68,607.43 per coin, which was 45.65% lower than its record high of $126,198.07 per coin on Oct. 7, 2025.\n\nShares of HOOD, on the other hand, have fallen by 34.06% year-to-date, down 33.95% over the last six months, but up 25.69% over the year. Similarly, COIN was 30.53% lower YTD, 48.77% in sox-months, and 37.91% over the year.\n\nRead Next: Put professional stock research to work in a single ETF — explore Motley Fool Asset Management's factor-based funds.\n\nBuilding a resilient portfolio means thinking beyond a single asset or market trend. Economic cycles shift, sectors rise and fall, and no one investment performs well in every environment. That's why many investors look to diversify with platforms that provide access to real estate, fixed-income opportunities, professional financial guidance, precious metals, and even self-directed retirement accounts. By spreading exposure across multiple asset classes, it becomes easier to manage risk, capture steady returns, and create long-term wealth that isn't tied to the fortunes of just one company or industry.\n\nRad AI's award-winning artificial intelligence technology helps transform data chaos into actionable insights, enabling the creation of high-performing content with measurable ROI. Their Regulation A+ offering allows investors to participate at $0.85 per share with a minimum investment of $1,000, providing an opportunity to diversify portfolios into early-stage AI innovation. For investors seeking exposure to the rapidly growing AI and tech sector, Rad AI offers a chance to get in on the ground floor of a data-driven growth story.\n\nBacked by Jeff Bezos, Arrived Homes makes real estate investing accessible with a low barrier to entry. Investors can buy fractional shares of single-family rentals and vacation homes starting with as little as $100. This allows everyday investors to diversify into real estate, collect rental income, and build long-term wealth without needing to manage properties directly.\n\nLightstone DIRECT gives accredited investors direct access to institutional-grade real estate, going beyond typical crowdfunding platforms. By cutting out middlemen, it aligns investor and manager interests while providing exposure to a $12B+ portfolio spanning multifamily, industrial, hospitality, retail, office, and life science properties. This approach allows investors to diversify their portfolios across multiple property types and markets, gaining professional-grade real estate exposure without the fees or misalignment common on other platforms.\n\nMasterworks enables investors to diversify into blue-chip art, an alternative asset class with historically low correlation to stocks and bonds. Through fractional ownership of museum-quality works by artists like Banksy, Basquiat, and Picasso, investors gain access without the high costs or complexities of owning art outright. With hundreds of offerings and strong historical exits on select works, Masterworks adds a scarce, globally traded asset to portfolios seeking long-term diversification.\n\nBAM Capital offers accredited investors a way to diversify beyond public markets through institutional-grade multifamily real estate. With over $1.85 billion in completed transactions and guidance from Senior Economic Advisor Tony Landa, the firm targets income and long-term growth as supply tightens and renter demand remains strong—especially in Midwest markets. Its income-focused and growth-oriented funds provide exposure to real assets designed to be less tied to stock market volatility.\n\nAs digital assets become a larger part of diversified portfolios, traders increasingly look for platforms that offer transparency, efficiency, and control. Kraken Pro is an advanced trading interface from Kraken, one of the world's leading cryptocurrency exchanges, designed for users who want more sophisticated tools without added complexity. With low, volume-based fees, a streamlined interface for managing spot, margin, and futures trading, and a strong focus on security and regulatory compliance, Kraken Pro provides a way to gain diversified crypto exposure through a clear, professional-grade trading experience.\n\nREX Shares designs specialized ETFs for investors who want more precision than traditional broad-market funds can offer. Its lineup spans options-based income strategies, leveraged and inverse exposures, spot-linked crypto ETFs, and thematic funds tied to structural trends. By targeting specific income objectives, volatility profiles, or market themes, these ETFs can be used alongside core holdings to introduce differentiated return drivers and reduce reliance on a single market outcome, while maintaining the liquidity and transparency of the ETF structure.\n\nMotley Fool Asset Management brings its long-standing \"Foolish\" investing philosophy into a lineup of passive ETFs designed around clear, rules-based investment styles. Built using decades of proprietary research from The Motley Fool, LLC, these factor-based ETFs focus on growth, value, and momentum strategies, selecting U.S. companies based on quality, risk, and long-term potential. For investors who want professionally vetted stock exposure without the demands of active trading, Motley Fool Asset Management offers a straightforward way to access expert-driven strategies through the simplicity and liquidity of an ETF.\n\nElf Labs is an IP-focused entertainment company built on a strategy that has powered giants like Disney and Marvel: ownership of globally recognized character IP. After more than a decade of rights acquisition, the company controls 500+ protected trademarks and copyrights tied to iconic characters including Cinderella, Snow White, Rapunzel, Sleeping Beauty, and Peter Pan. This foundation has generated over $15 million in royalties, expanded licensing into 30+ countries, and supported development of 100+ product lines. With its Nasdaq ticker ($ELFS) reserved and valuation growth exceeding 1,600% in under two years, Elf Labs is now scaling distribution through patented production systems, global licensing, and streaming and mobile initiatives—offering investors exposure to a private entertainment company with a clear public-market trajectory.\n\nFinance Advisors helps Americans approach retirement with greater clarity by connecting them to vetted, fiduciary financial advisors who specialize in tax-aware retirement planning. Rather than focusing on products or investment performance alone, the platform emphasizes strategies that account for after-tax income, withdrawal sequencing, and long-term tax efficiency—factors that can materially impact retirement outcomes. Free to use, Finance Advisors gives individuals with meaningful savings access to a level of planning sophistication historically reserved for high-net-worth households, helping reduce hidden tax risk and improve long-term financial confidence.\n\nValley Center Wellness is setting a new benchmark in luxury behavioral health with its flagship facility in Corona, California. Designed as a private, resort-style wellness retreat on a 4.2-acre estate, the center combines discretion, comfort, and comprehensive care, offering patients private chefs, daily massages, acupuncturist sessions, and access to a pool, spa, gym, and basketball court. Focused on high-profile and affluent clients, Valley Wellness provides fully customized treatment plans outside the constraints of insurance, emphasizing long-term recovery, holistic wellness, and life-after-addiction strategies. Through its three-stage care model—including residential, outpatient, and transitional housing—patients experience continuity of care that supports lasting change. For investors, Valley Wellness has launched an equity crowdfunding opportunity, offering a way to participate in a fast-growing $42 billion behavioral health sector while gaining exposure to both high-end real estate and a premium healthcare business.\n\nImmersed is a private, pre-IPO technology company operating at the intersection of AI, spatial computing, and remote work. Best known for building the most widely used productivity app on the Meta Quest platform, Immersed enables professionals and teams to work full-time in shared virtual environments across macOS, Windows, and Linux. The company is expanding beyond software with its own productivity-focused XR headset and AI tools, supported by partnerships with major technology firms including Meta, Samsung, and Qualcomm. Immersed is currently allowing retail investors to participate in its pre-IPO round, subject to eligibility and offering terms.\n\nThis article Big Short Steve Eisman Favors Schwab, Cites Robinhood&#39;s Lack Of &#39;Margin For Error&#39; Amid Bitcoin-Led Crypto Slide originally appeared on Benzinga.com\n\n© 2026 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "title": "Is Nvidia stock a buy ahead of next week's earnings?",
        "url": "https://finbold.com/is-nvidia-stock-a-buy-ahead-of-next-weeks-earnings/",
        "source": "Finbold",
        "date": "2026-02-18T12:41:00+00:00",
        "content": "As Nvidia (NASDAQ: NVDA) remains a dominant force in the artificial intelligence sector, investor attention is on the company’s upcoming earnings set for release after the market close on February 25.\n\nBy press time, NVDA shares were valued at $188, up just 1% on a year-to-date basis.\n\nAnalysts anticipate strong results for the quarter ending January 25, 2026, with consensus estimates calling for adjusted earnings of approximately $1.52 per share and revenue around $65.6 billion.\n\nThese figures would represent a year-over-year growth of roughly 71%, continuing Nvidia’s pattern of outperforming expectations in recent periods. The prior quarter delivered adjusted earnings of $1.30 per share and revenue of $57 billion, surpassing forecasts.\n\nA key focus for the upcoming report will be progress on the Blackwell architecture, which CEO Jensen Huang has characterized as experiencing exceptional demand.\n\nProduction ramps and supply fulfillment for hyperscalers and enterprise clients are expected to drive significant contributions.\n\nRecent announcements, including major multi-year GPU supply agreements with partners like Meta (NASDAQ: META) for Blackwell and the forthcoming Rubin platforms, highlight sustained momentum in AI infrastructure investments across global markets.\n\nMeanwhile, Wall Street analysts remain overwhelmingly bullish on Nvidia with the chipmaker earning a ‘Strong Buy’ consensus based on 39 recent ratings over at TipRanks.\n\nThe global online gambling business is huge. Estimates placed the 2025 market at being worth around $78 billion a year, … Continue reading\n\nAccording to the latest 12-month forecast data, 37 analysts rate the stock a ‘Buy’, one recommends ‘Hold’, and one suggests ‘Sell’. The average price target stands at $260.38, implying a potential upside of 40.77%.\n\nThe highest price target among analysts is $352, while the lowest estimate is $200, indicating a wide but generally optimistic outlook.\n\nThe projected upside points to confidence in Nvidia’s growth, driven by demand for artificial intelligence chips and data center solutions. If results meet or exceed expectations, bullish targets could fuel further stock momentum.\n\nHowever, the wide gap between high and low forecasts signals potential volatility tied to earnings performance and broader market conditions.\n\nMeanwhile, elevated expectations mean that even strong results may not prevent swings if forward guidance disappoints, particularly regarding competition from custom chips, a possible slowdown in AI spending, or supply-chain constraints.\n\nSome views suggest the stock could face pressure after February 25 if the report fails to surpass the high bar set by prior beats.\n\nFeatured image via Shutterstock\n\nBest Crypto Exchange for Intermediate Traders and Investors\n\nInvest in cryptocurrencies and 3,000+ other assets including stocks and precious metals.\n\n0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees.\n\nCopy top-performing traders in real time, automatically.\n\neToro USA is registered with FINRA for securities trading.\n\nApply now to join Finbold as a crypto/finance news writer!\n\nBy subscribing you agree with Finbold\n                    T&C’s\n                    & Privacy Policy\n\nWe use cutting-edge AI models to forecast future prices for stocks and crypto.\n\nFinbold is a news and information website. This Site may contain sponsored content, advertisements, and third-party materials, for which Finbold expressly disclaims any liability.\n\nRISK WARNING: Cryptocurrencies are high-risk investments and you should not expect to be protected if something goes wrong. Don’t invest unless you’re prepared to lose all the money you invest. (Click\n                    here to learn more about cryptocurrency risks.)\n\nBy accessing this Site, you acknowledge that you understand these risks and that Finbold bears no responsibility for any losses, damages, or consequences resulting from your use of the Site or reliance on its content.\n                Click here to learn more."
    },
    {
        "title": "Stocks Hold Gains After Fed Minutes as Bonds Fall: Markets Wrap",
        "url": "https://www.swissinfo.ch/eng/stocks-hold-gains-after-fed-minutes-as-bonds-fall:-markets-wrap/90959042",
        "source": "SWI swissinfo.ch",
        "date": "2026-02-18T17:25:00+00:00",
        "content": "(Bloomberg) — A rebound in stocks gained traction amid easing jitters around artificial-intelligence disruption while a slew of data showed the US economy is holding up. Treasuries fell for a second straight day. Oil jumped.\n\nAbout 320 shares in the S&P 500 rose. That’s even as minutes of the last Federal Reserve meeting showed “several” officials suggested the central bank may need to raise rates if inflation stays above their goal. After a rout fueled by AI concerns, investors are seeking signs of a bottom. A gauge of chipmakers climbed 1% and an ETF tracking software firms jumped 1.3%.\n\nWhile AI fears have pummeled share prices of companies across several industries in recent weeks, several stock pickers have been looking at buying opportunities as they survey the wreckage.\n\nThe software stock selloff is likely “overdone” as that was a largely knee-jerk reaction, with investors trying to figure out the winners and losers from AI, according to Paul Stanley at Granite Bay Wealth Management.\n\n“While AI is very promising, investors should not assume that all companies will win on the AI front,” he said.\n\nRetail traders spent a record amount snapping up software shares on Citadel Securities’ platform, which began tracking the data in 2017. “The magnitude, persistence, and breadth of buying activity have materially exceeded prior peaks,” said Scott Rubner, the firm’s head of equity and equity derivatives strategy.\n\nEquities also gained as data showed US industrial production climbed in January by the most in nearly a year. Orders for business equipment rose in December by more than projected while housing starts hit a five-month high.\n\nMeantime, minutes of the Federal Open Market Committee’s Jan. 27-28 meeting revealed that a “vast majority of participants judged that downside risks to employment had moderated in recent months while the risk of more persistent inflation remained.”\n\n“From our perspective, the minutes support our view that rate cuts are off the table for the foreseeable future,” said Charlie Ripley at Allianz Investment Management.\n\nThe S&P 500 rose to around 6,880. The yield on 10-year Treasuries climbed two basis points to 4.08%. A $16 billion sale of 20-year bonds drew lackluster demand. The dollar gained 0.5%.\n\nOil rallied as traders weighed whether talks between the US and Iran will be enough to avert conflict, following a report that American military intervention could come sooner than expected. Gold hovered near $5,000.\n\nDespite Wednesday’s equity gains, the S&P 500 has been struggling to breach the 7,000 level since it first made its push toward that level back in October.\n\n“US stock indices have regained their upside momentum,” said David Morrison at Trade Nation. “But will this prove strong enough to keep buyers engaged, and protracted enough to drive the S&P 500 above key resistance at 7,000?”\n\nBank of America Corp. clients dumped US equities last week, with single-stock outflows reaching $8.3 billion — the third highest since records began in 2008. There were outflows in nine of the 11 sectors, led by financials and consumer staples. Industrials, tech and consumer discretionary also saw large outflows.\n\nBig tech carried the market over the past three years, and sustained broadening in the market’s sector participation is extremely important for the overall health of the bull market, noted Stanley at Granite Bay Wealth Management.\n\n“We view the stock market as currently being in a ‘shaken, not stirred’ state,” said Craig Johnson at Piper Sandler. “Investors need to embrace the rotation as this year shapes up to be more of a ‘stock picker’s market’.”\n\nDespite the recent breakdown in the “Magnificent Seven” megacaps and software makers, there hasn’t been much evidence of the broader market rolling over, according to Mark Newton at Fundstrat Global Advisors.\n\n“Moreover, sentiment has turned more negative in the last week, given the volatility in equities,” he said. “However, I feel that the resilience of equity indices themselves is truly what to highlight as being a relative positive in 2026.”\n\nAs market structure continues to be dominated by Commodity Trading Advisors, fund flows, and an increasing share of retail investors, Chris Senyek at Wolfe Research says volatility is likely to continue in the near-term, especially given the heightened sensitivity of stocks to AI disruption and other headline risk.\n\n“One of the most frequently asked questions we’ve received recently from investors has been: What changes the market’s view on AI disruption?,” he said. “With hyperscaler capital expenditures growing at a breakneck pace, we see bottlenecks in data center buildout likely emerging over the coming quarters.”\n\nWhether these bottlenecks are related to power generation, material costs, or regulatory hurdles, a cut/delay in spending would likely serve as a positive catalyst to areas of the market that have seen downward pressure due to AI concerns, namely software stocks, he said.\n\n“Investors should review current exposures to US technology and communication services and consider hedging or diversifying exposures that are above benchmark levels,” said Ulrike Hoffmann-Burchardi at UBS Global Wealth Management.\n\nIn such a case, she says investors should consider diversifying toward preferred areas of the market where we see superior risk-reward, including industrials, banks, health care, utilities, and consumer discretionary.\n\nMeantime, the highly-anticipated IPO boom may take a little longer to materialize as the market for new issuances limped into a seasonal quiet period.\n\nPostponed listings from broker Clear Street Group Inc. and Blackstone Inc.-backed Liftoff Mobile Inc. and broader stock market volatility left a sour taste in growth investors’ mouths as the window for initial public offerings before annual audits came to an end last week. The jolt of delayed deals paired with choppy performances across the class of 2026 kept a lid on what’s been the busiest start to a year since the go-go days of 2021.\n\nAlso capturing Wall Street’s attention is the upcoming options expiry later this week.\n\nThe US listed-options market is set for $3 trillion of contracts by notional value to roll off on Friday, the largest ever for an expiration date in February, according to data from Citigroup Inc.\n\nMark Zuckerberg testified that it’s “very difficult” to enforce Instagram’s age limits as he sought to defend the platform during a landmark trial over social media addiction. Tesla Inc. will be allowed to continue selling electric vehicles in California uninterrupted after the company revised what the state had called misleading marketing of driver-assistance technology. Alphabet Inc.’s Google and Apple Inc. are adding music-focused generative artificial intelligence features to their core consumer apps, underscoring how advanced AI tools are moving into mainstream use. Alphabet’s Google introduced its latest entry-level Pixel smartphone, hoping that new AI software capabilities, minor hardware refinements and an unchanged $499 price can make up for an otherwise iterative update. Berkshire Hathaway Inc. slashed its holding in Amazon.com Inc. by more than 75% in the fourth quarter, while also building a stake in the New York Times Co. — Warren Buffett’s last new bet as chief executive officer. Cybersecurity company Palo Alto Networks Inc. tumbled after releasing a forecast for adjusted earnings that was weaker than anticipated. EBay Inc. reported quarterly sales and profit that exceeded estimates, indicating that a focus on luxury items and refurbished goods is helping the company stand out in an increasingly cluttered e-commerce market. DoorDash Inc. issued an earnings outlook that missed Wall Street’s expectations, with the delivery company warning that winter storms in the US and investments into growth areas will weigh on profits in the near term. Carvana Co. posted strong profit growth in the fourth quarter that still missed Wall Street’s estimates due to higher-than-expected operating costs. Booking Holdings Inc. reported better-than-expected first-quarter gross bookings, indicating continued strength across the travel industry. Figma Inc. gave an annual revenue outlook that topped estimates, potentially easing broad Wall Street anxiety that the creative software company’s business is threatened by the emergence of rival artificial intelligence products. Powerlaw Corp., a fund that owns stakes in Anduril Industries Inc., SpaceX, OpenAI and Anthropic PBC, is filing to sell shares in New York, giving retail investors a shot at profiting from some of the biggest private companies in artificial intelligence, defense and space. The US Food and Drug Administration will review a Moderna Inc. flu shot made with mRNA technology, reversing a previous decision that shocked Wall Street and spurred a public spat between the company and its regulator. Kraft Heinz Co. announced it’s replacing its North American president this month as its new chief executive officer embarks on a plan to bolster growth at the struggling food company, rather than continue with a planned split. Madison Square Garden Sports Corp.’s board of directors approved a plan to explore spinning off the NBA’s New York Knicks and NHL’s New York Rangers, a move that would make it easier to attract investors to the teams. Bank of America Corp. is broadening the scope of its rewards program to encourage customers to do more business with the company, part of an effort to reach lofty financial targets it promised investors last year. US banks including Huntington Bancshares Inc., First Horizon Corp. and M&T Bank Corp. are working to build a tokenized deposit network as financial firms fight to stay relevant amid the rise of digital assets. Uber Technologies Inc. is planning to spend more than $100 million to build fast-charging, autonomous-vehicle charging stations in the US, the latest move to establish itself as a critical player in the robotaxi industry. Wingstop Inc. reported better-than-expected results, easing fears of a marked slowdown at the chicken chain. A ruling requiring Kalshi to shut down its sports prediction contract offerings in Massachusetts won’t take effect until after an appeals court considers the company’s challenge to the ban. What Bloomberg strategists say…\n\n“The Magnificent Seven’s influence goes to show how hard it will be for the market to advance without megacap tech. While information technology’s weight in the S&P 500 has edged lower in recent months, it remains the largest sector by far, with a wide gap over the rest.”\n\n— Tatiana Darie, Macro Strategist, Markets Live. For the full analysis, click here.\n\nSome of the main moves in markets:\n\nThe S&P 500 rose 0.6% as of 4 p.m. New York time The Nasdaq 100 rose 0.8% The Dow Jones Industrial Average rose 0.3% The MSCI World Index rose 0.7% Philadelphia Stock Exchange Semiconductor Index rose 1% IShares Expanded Tech-Software Sector ETF rose 1.3% Bloomberg Magnificent 7 Total Return Index rose 0.7% The Russell 2000 Index rose 0.5% Currencies\n\nThe Bloomberg Dollar Spot Index rose 0.5% The euro fell 0.6% to $1.1784 The British pound fell 0.5% to $1.3501 The Japanese yen fell 1% to 154.80 per dollar Cryptocurrencies\n\nBitcoin fell 2.3% to $66,103.01 Ether fell 3.1% to $1,937.02 Bonds\n\nThe yield on 10-year Treasuries advanced two basis points to 4.08% Germany’s 10-year yield was little changed at 2.74% Britain’s 10-year yield was little changed at 4.37% The yield on 2-year Treasuries advanced three basis points to 3.46% The yield on 30-year Treasuries advanced two basis points to 4.71% Commodities\n\nWest Texas Intermediate crude rose 4.9% to $65.39 a barrel Spot gold rose 2.2% to $4,985.63 an ounce ©2026 Bloomberg L.P.\n\nSWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR\n\nSWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR"
    }
]