[
    {
        "title": "DELL's Low P/S Valuation: An Opportunity or Risk Ahead for the Stock?",
        "url": "https://www.sharewise.com/us/news_articles/DELLs_Low_PS_Valuation_An_Opportunity_or_Risk_Ahead_for_the_Stock_Zacks_20260211_1947",
        "source": "sharewise",
        "date": "2026-02-11T20:42:00+00:00",
        "content": "Dell Technologies’ DELL shares are trading at an attractive valuation, as suggested by a Value Score of A. In terms of the 12-month price/sales (P/S), the company is currently trading at 0.67X, significantly lower than the Zacks Computer – Micro Computers industry average of 7.91X and the broader Zacks Computer and Technology sector’s 6.54X.Dell’s valuation continues to trade at a discount relative to ecosystem partners like NVIDIA NVDA, Advanced Micro Devices AMD and Meta Platforms META. At present, NVIDIA, Advanced Micro Devices and Meta Platforms trade at forward 12-month P/S ratios of 14.58X, 7.43X and 6.74X, respectively.\n\nImage Source: Zacks Investment Research\n\nWhile Dell's discounted valuation may initially indicate an attractive entry point for investors, a low multiple alone does not guarantee upside. In many cases, compressed valuations reflect market concerns around growth durability, margin pressures or competitive positioning. As a result, Dell’s apparent cheapness could be masking underlying operational and demand-related risks. Let’s take a closer look.\n\nDell’s consumer PC segment is showing persistent softness compared with its more resilient commercial segment, highlighting structural headwinds. Consumer revenues declined year over year in the fiscal third quarter, contrasting with stable commercial growth. Management has flagged the consumer and education markets as intensely competitive, creating pricing pressure and limiting margin expansion. Because this segment is highly volume- and price-sensitive, incremental demand improvements have not translated into meaningful profitability gains, keeping earnings leverage muted.Although the overall Client Solutions Group revenues posted modest growth in the fiscal third quarter, contraction in consumer sales weighed on segment performance and operating margins. Profitability remains constrained as the product mix leans toward lower-margin consumer PCs. At the same time, Dell’s broader PC refresh momentum is being driven largely by commercial demand, highlighting persistent softness in the consumer segment. This imbalance limits the segment's continuity and reduces the company's ability to generate meaningful earnings leverage.\n\nDell’s AI server business is expanding rapidly, yet profitability remains structurally constrained by intense competitive pressures. Even as shipment volumes scale, AI server operating margins are projected to remain in the mid-single-digit range in the fourth quarter of fiscal 2026, underscoring limited pricing power. Large enterprise, sovereign and Neocloud deployments remain highly competitive, forcing disciplined pricing strategies to secure volume without eroding profitability. This signals that growth in AI infrastructure does not automatically translate into high-margin expansion.Dell is contending with rivals such as Hewlett-Packard, Lenovo and Super Micro Computer, which are rapidly advancing GPU-dense AI server platforms for high-performance and data center workloads. Their comparatively high-performance offerings intensify price competition and narrow differentiation, limiting Dell’s ability to scale profitability and keeping margin expansion a key investor concern.\n\nThe Zacks Consensus Estimate for Dell’s fourth-quarter fiscal 2026 earnings is currently pegged at $3.54 per share, down by a couple of cents over the past 30 days. This indicates year-over-year growth of 32.09%.DELL has shown a mixed earnings surprise record, missing the Zacks Consensus Estimate in one of the trailing four quarters while exceeding it in the other three, with an average surprise of 0.23%.\n\nImage Source: Zacks Investment Research\n\nDell has delivered an 11.6% return in the trailing 12 months, lagging the Zacks sector’s 23.7% growth and the industry’s 15.3% rise. Key ecosystem partners delivered stronger momentum over the same period, with NVIDIA and Advanced Micro Devices advancing 43.7% and 91.1%, respectively, while Meta Platforms declined 7.6%, highlighting mixed performance trends across the broader AI and infrastructure landscape.The underperformance can be attributed to elevated memory component pricing, weakness in Dell’s core PC operations and mounting cost pressures, which have collectively weighed on margins.\n\nImage Source: Zacks Investment Research\n\nDell’s low valuation masks meaningful operational pressures that continue to cloud its near-term outlook. Weak consumer PC demand, margin-limited AI server expansion and competitive pricing dynamics restrict earnings leverage, while mixed estimate revisions signal uncertainty around growth durability. Ongoing cost pressures and recent stock underperformance further highlight execution risks. Together, these factors suggest that the apparent valuation discount is more reflective of structural headwinds than hidden upside. Until Dell demonstrates stronger margin resilience and more balanced demand trends, the stock’s risk-reward profile remains unattractive — reinforcing that this Zacks Rank #4 (Sell) company is not a preferred pick right now.You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nOur experts have revealed their Top 5 recommendations with money-doubling potential – and Director of Research Sheraz Mian believes one is superior to the others. Of course, all our picks aren’t winners but this one could far surpass earlier recommendations like Hims & Hers Health, which shot up +209%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThis article originally published on Zacks Investment Research (zacks.com).\n\nThis page uses Cookies. For proper functioning of the page Cookies are needed. You agree to using Cookies by clicking \"OK\". \nMore infos can be found in our Privacy declaration.\n\nIf you disagree this service is only available in very limited ways."
    },
    {
        "title": "Live Nasdaq Composite: Stocks March Higher on Near Goldilocks Scenario",
        "url": "https://247wallst.com/investing/2026/02/11/live-nasdaq-composite-stocks-march-higher-on-near-goldilocks-scenario/",
        "source": "24/7 Wall St.",
        "date": "2026-02-11T21:18:00+00:00",
        "content": "130,000 jobs were added last month while unemployment fell to 4.3%.\n\nShopify exceeded earnings estimates on both revenue and profit.\n\nRosenblatt set a $185 price target on Datadog reflecting 43.4% upside potential.\n\nHedge fund manager Bill Ackman has made some changes to his portfolio. According to SEC filings, Ackman’s Pershing Square has added positions in Amazon (Nasdaq: AMZN), Hertz (NYSE: HTZ) and Meta Platforms (Nasdaq: META) while selling shares of Chipotle (NYSE: CMG) and Nike (NYSE: NKE).\n\nThe markets have surrendered earlier gains after coming out of the gate like gangbusters, with the Nasdaq Composite now lower by 0.15%. The Nasdaq is being dragged lower by Big Tech stocks including Microsoft  (Nasdaq: MSFT), down 2.2%, Alphabet (Nasdaq: GOOGL), down 2%, and Netflix (Nasdaq: NFLX), down 2.5% in today’s sudden sell-off.\n\nGoldman Sachs analysts are bullish on Kingsoft Cloud (Nasdaq: KC), upgrading the stock to “buy” from “neutral” on its AI positioning. The stock is soaring by 9.8% today.\n\nThis article will be updated throughout the day, so check back often for more daily updates.\n\nThe markets are seeing green across the board amid a near Goldilocks scenario in the economy. The latest jobs report reveals that conditions are neither too not nor too cold, with 130,000 jobs added last month, surpassing economist’s most bullish of estimates, while the unemployment rate edged lower to a surprising 4.3% from 4.4% month-over-month. What it means for the Fed and interest rates will depend largely on the latest inflation data, with the CPI due out at the end of the week. The Polymarket online betting platform places higher bets for a rate cut in July over June.\n\nAll three of the major stock market averages are advancing, including a 0.58% jump in the tech-heavy Nasdaq Composite. Leading the charge are Nvidia (Nasdaq: NVDA | NVDA Price Prediction), Tesla (Nasdaq: TSLA) and Micron (Nasdaq: MU), the latter of which is benefiting from bullish comments out of Wall Street analysts. Laggards today are Microsoft (Nasdaq: MSFT) and Amazon (Nasdaq; AMZN), each of which is down about 1%.\n\nHere’s a look at where things stand as of morning trading:\n\nDow Jones Industrial Average: 50,424.86 Up 253.36 (+0.50%)\nNasdaq Composite: 23,240.97 Up 138.50 (+0.58%)\nS&P 500: 6,983.66 Up 41.85 (+0.58%)\n\nShopify (Nasdaq: SHOP) stock is soaring on the heels of its earnings print. The cloud-based e-commerce platform surpassed estimates on both the top and bottom lines, signaling a resilient consumer and optimistic outlook for 2026.\n\nDatadog (Nasdaq: DDOG) also reported quarterly earnings, and the stock is climbing tktk% higher today. The company offered a bullish outlook on robust AI demand. Rosenblatt analysts reemphasized their “buy” rating on DDOG stock with a $185 price target attached, reflecting upside potential of 43.4%.\n\nBernstein analysts have reemphasized their “outperform” rating on Netflix (Nasdaq: NFLX) stock despite being challenged by Paramount and WBD, suggesting that Netflix currently holds the leverage. The stock is down 1.2% today.\n\nSending You to Google News in 3\n\nLive Updates Microsoft Boss on AI Chip Jan 26, 2026 at 12:18 PM EST Microsoft CEO Satya Nadella has posted…\n\nLive Updates Bullish on Meta Dec 4, 2025 at 11:33 AM EST Expanding on the Meta theme, Mizuho analysts reemphasized…\n\nLive Updates NOW Stock Plummets Jan 29, 2026 at 12:18 PM EST ServiceNow (NYSE: NOW) stock is sinking by 11.2%…\n\nLive Updates Amazon Capex Preview Feb 5, 2026 at 12:26 PM EST One stock with the potential to shift market…\n\nLive Updates APP Stock in Spotlight Jan 14, 2026 at 12:09 PM EST AppLovin (Nasdaq: APP) is shaving 9.5% off…\n\nLive Updates Intel Rises Jan 9, 2026 at 11:24 AM EST President Trump has continued his fascination with legacy chipmaker…\n\nLive Updates Markets Extend Gains May 2, 2025 at 3:44 PM EDT | Gerelyn Terzo Today’s tech-fueled rally has gained…\n\nLive Updates Netflix Falls Dec 3, 2025 at 12:29 PM EST Stocks have made their way into positive territory, with…\n\nLive Updates MSFT Dividend Jun 13, 2025 at 12:30 PM EDT | Gerelyn Terzo Microsoft (Nasdaq: MSFT | MSFT Price…"
    },
    {
        "title": "ASX to edge up, $A above US71¢, AMP, ASX set to report",
        "url": "https://www.afr.com/markets/equity-markets/asx-to-edge-up-a-above-us71-amp-asx-set-to-report-20260212-p5o1k9",
        "source": "Australian Financial Review",
        "date": "2026-02-11T20:36:00+00:00",
        "content": "ASX lifts profit to $263m, but costs jump 20pc\n\nPro Medicus posts 231pc profit jump on North American growth\n\nNBN Co books $335m half-year loss\n\nCiti says ANZ profit beat expectations by 8pc\n\nDrinker shift to cans helps stabilise Orora\n\nThe Australian sharemarket is set to open modestly higher, inching the S&P/ASX 200 Index towards a record high. Stocks fluctuated in New York after the January US jobs report came in stronger-than-expected, bolstering the case for a longer pause in interest rate cuts.\n\nASX 200 futures were pointing up 4 points, or 0.04 per cent to 8962 after reversing earlier losses. The S&P 500 edged up 0.1 per cent while the Dow and the Nasdaq dipped.\n\nThe key Non-farm payrolls report showed the US economy added 130,000 jobs last month, and the unemployment rate dipped 4.3 per cent. That prompted traders to largely price out the chance of an imminent US rate cut.\n\n“The broad-based strength in the January jobs report vindicates our view that the Fed won’t cut under [chairman Jerome] Powell,” Bank of America said in a note. Powell’s term ends in May.\n\n“As of this writing, markets are pricing less than 5 basis points of cuts over the next two meetings (under Powell) and around 50 basis points by year-end.”\n\nUS software stocks were hit by another wave of selling with Atlassian down more than 6 per cent, taking its five-session loss to more than 15 per cent. And bitcoin fell, briefly falling back below $US67,000, and dragging shares in Coinbase and Robinhood sharply lower.\n\nFor Australia, the focus is on the earnings season. Cost-cutting at ANZ has helped lift its profits over the latest quarter, with the bank reporting a cash profit of $1.94 billion, up 17 per cent on average of the two previous quarters.\n\nAMP has reported an 11.3 per cent fall in full-year net profit to $133 million, with the company citing the settlement of legal matters and simplification of the business.\n\nAnd IAG has reported a 54 per cent slump in half-year profit to $505 million. The insurer said the result included a one-off RACQI impact of $174 million from severe weather immediately following the acquisition.\n\nOrigin Energy’s first half net profit, meanwhile, has almost halved to $557 million after earnings dropped in the gas business.\n\nASX 200 futures are pointing up 4 points or 0.04 per cent to 8962.All US prices near 3.15pm New York time.\n\nAMP (AMP) | ASX Limited (ASX) | Breville (BRG) | Charter Hall Long WALE REIT (CLW) | Insurance Australia Group (IAG) | Pro Medicus (PME) | South32 (S32) | Temple & Webster (TPW) | Paladin Energy (PDN) | Origin Energy (ORG) | Orora (ORA) | Northern Star Resources (NST)\n\nWhat we learnt on Wednesday: This is the big question hanging over CSL now | Profit season is back and so are the wild share price swings. CSL plunged (again), CBA soared (again), AGL jumped, and James Hardie staged a fightback.\n\nAt 12.45pm in Perth on Thursday, RBA assistant governor Sarah Hunter’s speaks Thursday on full employment and the labour market at a CEDA [Committee for Economic Development of Australia] event.\n\n‘It’s on’: Taylor to challenge Ley but timing uncertain | Angus Taylor has declared he will challenge Opposition Leader Sussan Ley for her job, saying she has lost his support and the Liberal Party is in its worst ever position.\n\nThe ASX’s new trading rules turned a CSL bombshell into a bloodbath | The biotech giant has been listed for three decades. But the announcement of its chief executive’s exit misfired so badly, investors sat up and took notice.\n\nGet ready for wild markets as earnings season kicks off with a bang | Veteran investors say volatility in equity markets is driven by high valuations and liquidity amplifying the market’s every move.\n\nJennifer Hewett: CBA surfs credit wave to smash share price doubts | Matt Comyn is confident that the bank is on the right technology track in a competitive environment and an uncertain world."
    },
    {
        "title": "Dow Jones Today | US Stock Market Highlights: Dow Jones is little changed as investor enthusiasm for better-than-expected jobs data wanes",
        "url": "https://www.cnbctv18.com/market/us-stock-market-live-updates-dow-jones-nasdaq-snp500-nasdaq-dollar-us-jobs-report-today-liveblog-ws-l-19847413.htm",
        "source": "CNBCTV18",
        "date": "2026-02-11T18:28:00+00:00",
        "content": "Dow Jones Today | US Stock Market Highlights:  The Dow Jones Industrial Average slipped on Wednesday (February 11) after the better-than-expected delayed January jobs report failed to spark a sustainable advance. The blue-chip index traded down 109 points, or 0.2%, as did the Nasdaq Composite. The S&P 500 hovered around the flatline.\n\nThe Bureau of Labour Statistics’ January nonfarm payrolls report — which had been delayed due to a partial government shutdown that ended on February 3 — showed job growth of 130,000 last month. Economists polled by Dow Jones had called for a gain of 55,000. The latest figure also marked a sizable increase from December, which was downwardly revised to 48,000. The unemployment rate also landed at 4.3%, a bit below the Dow Jones forecast for 4.4%.\n\nFollow along for LIVE updates:\n\nWe will now wrap up the blog. Good night, folks!\n\nThe sterling bond market continued to show its depth after the bumper Alphabet Inc sale, with three UK firms raising new debt on Wednesday.\n\nMarks & Spencer Plc sold £300 million ($411 million) in its first deal since a cyberattack hit the retailer last year. Gatwick Airport Ltd priced new notes through a financing entity, and Anglian Water Group Ltd issued a £350m senior secured bond, according to people familiar with the matter who asked not to be identified.\n\nBlackstone Inc. sold a nearly $1 billion bundle of private credit loans at one of the tightest levels this year, signalling strong investor demand despite broader concerns about the direct lending industry.\n\nThe spreads on the highest-rated bonds in the investment vehicle, known as a collateralised loan obligation, were priced on Tuesday at 137 basis points over a floating-rate benchmark.\n\nOn average, AAA tranches for private credit CLOs have printed at 140 basis points over the benchmark this year, according to data from Bank of America Corp., tighter than 153 basis points in 2025 and 180 basis points in 2024.\n\nGas-fired power plants, once unloved bets, are now a hot trade for private equity.\n\nEnergy Capital Partners is among investors profiting by flipping natural gas plants to electricity producers, which are scrambling to meet demand for power driven by artificial intelligence. The firm paid $2.3 billion last year to buy gas and coal generation assets from a Blackstone Inc. and ArcLight Capital Partners joint venture, according to people familiar with the matter.\n\nIn January, roughly five months after completing the deal, ECP agreed to sell the three gas plants it had just acquired to Talen Energy Corp. for $3.45 billion.\n\nBarclays has downgraded Norwegian Cruise Line to equal weight from overweight, citing growing concerns over execution and near-term pricing trends in key markets. Analyst Brandt Montour said the cruise operator is likely to face weaker first-quarter yields, with the firm’s Caribbean pricing checks continuing to trend lower for the remainder of the year. He added that Norwegian’s ongoing de-premiumization” strategy and a more challenging guidance outlook relative to peers have increased uncertainty around earnings momentum. “Our confidence has waned over NCLH’s execution in the Caribbean, and we are incrementally wary over the amount of time and investment it may take to rebuild that business and achieve consistent growth,” Montour wrote in a note on Wednesday. The downgrade also reflects valuation dynamics, with the stock up roughly 24% over the past three months and trading near Barclays’ price target, leaving the risk-reward profile more balanced at current levels.\n\nTotalEnergies SE trimmed its share buybacks to the lower end of its guidance range, aiming to keep debt in check as it adjusts to lower oil prices.\n\nThe company plans to repurchase $750 million of stock in the first quarter, compared with $1.5 billion in the final three months of 2025, it said in an earnings statement on Wednesday. For the year, its buyback target was kept at a range of $3 billion to $6 billion.\n\nEmployment at US factories increased for the first time since late 2024, a nascent sign that American manufacturing may be starting to emerge from years of malaise.\n\nManufacturers’ payrolls unexpectedly rose by 5,000 in January, fueled entirely by a pickup in employment at producers of durable goods and equipment, Bureau of Labour Statistics data showed Wednesday. When combined with a solid advance in the construction industry, the gain helped drive up total payrolls among goods producers by 36,000 — the most since mid-2023.\n\nHasbro Inc. Chief Executive Officer Chris Cocks said he’ll be focusing even more on video games and the collector card game Magic: The Gathering to reduce the company’s exposure to tariffs associated with traditional toys.\n\nHasbro is developing about 10 video games, Cocks told Bloomberg TV on Wednesday. Going forward, up to 80% of Hasbro’s business and 95% of its investment will be focused on the “collector/gamified” business.\n\nInstagram boss Adam Mosseri is set to take the stand at a landmark trial over social media addiction and face a plaintiff attorney’s “very blunt questions” about how his platform balances safety and engagement.\n\nMosseri will be the first company executive to testify during the Los Angeles trial, which started Monday and centers on a 20-year-old woman blaming Meta Platforms Inc.’s Instagram and Google’s YouTube for her years of mental health struggles.\n\nLawyers are expected to question Mosseri on Wednesday on internal company communications in which an employee says he “freaked out” when confronted with concerns about how Instagram affects the brains of young users, among other topics.\n\nBank of America has reaffirmed its bullish stance on Spotify after the audio streaming giant delivered what the bank described as “solid” fourth-quarter earnings, easing investor concerns around growth and artificial intelligence. The brokerage maintained its buy rating on the stock but trimmed its price target to $750 from $900, implying about 57% upside from Tuesday’s closing levels. While Spotify’s results and forward guidance came in strong, rising debate around AI-generated music continues to shape sentiment around the sector. Addressing those concerns, Spotify Co-CEO Gustav Söderström said artificial intelligence could benefit the broader music ecosystem, with the company outlining plans to deepen AI-led personalisation across the platform. Bank of America analyst Jessica Reif Ehrlich noted that the combination of resilient earnings and clearer AI strategy has likely triggered a relief rally, with shares rising roughly 2% following the update.\n\nBerkshire Hathaway has voiced support for Kraft Heinz’s decision to halt work on a previously planned corporate separation, signalling alignment with the food giant’s new leadership strategy. In a statement to CNBC, Berkshire Hathaway CEO Greg Abel said the conglomerate supports CEO Steve Cahillane and the board’s move to put the split on hold, adding that the pause would allow management to focus on strengthening competitiveness and improving customer delivery. Kraft Heinz said Wednesday it would suspend the separation plan first announced in September, with Cahillane noting that many of the company’s operational challenges are fixable and within our control. The shift marks a strategic reset as the company looks to stabilise performance after years of uneven growth. Berkshire Hathaway has deep ties to Kraft Heinz, having partnered in the $46-billion merger that created the packaged-food heavyweight a decade ago. Despite its scale, the company has struggled to sustain momentum, with shares trading roughly 27% below recent highs. Warren Buffett had previously expressed disappointment with the proposed breakup, and Berkshire Hathaway has already begun formally unwinding part of its roughly 28% stake in the business.\n\nThe US government issued a general license to allow oilfield-service companies to work in Venezuela as the Trump administration eases sanctions and pushes to rebuild the nation’s crude infrastructure.\n\nThe license issued by the Treasury Department allows US firms to explore, develop and produce oil and natural gas in Venezuela under certain limited conditions, according to a statement Tuesday.\n\nThe move is the latest in a series of steps Washington has taken to entice US companies to revive output from Venezuela’s vast crude reserves after last month’s capture of strongman Nicolás Maduro.\n\nThe US Federal Aviation Administration reopened airspace around El Paso, Texas, a sudden reversal after announcing a 10-day closure that grounded flights in the city on the US-Mexico border.\n\nTrump administration officials cited unmanned aircraft activity from Mexican drug cartels for the shutdown. US Transportation Secretary Sean Duffy said on Wednesday that the Defense Department and FAA “acted swiftly” to address “a cartel drone incursion.”\n\n“The threat has been neutralised, and there is no danger to commercial travel in the region. The restrictions have been lifted and normal flights are resuming,” Duffy posted on social media.\n\nCloudflare Inc. reported quarterly results that showed continued demand for its security and performance services, as enterprises prioritised network resilience and application protection.\n\nRevenue for the fourth quarter rose to $614.5 million, representing a 34% year-over-year increase, while adjusted earnings were 28 cents a share, the company said in a statement. Analysts, on average, expected revenue of roughly $591.4 million and adjusted earnings of 27 cents a share, according to data compiled by Bloomberg.\n\nUS President Donald Trump is privately musing about exiting the North American trade pact, people familiar with the matter said, injecting further uncertainty about the deal’s future into pivotal renegotiations involving the US, Canada and Mexico.\n\nThe president has asked aides why he shouldn’t withdraw from the agreement, which he signed during his first term, though he has stopped short of flatly signalling that he will do so, according to the people who spoke on condition of anonymity to describe internal discussions.\n\nBitcoin’s correlation with stocks continued to diverge, with the original cryptocurrency declining while US equities rallied after a stronger-than-anticipated US jobs report, suggesting investor confidence has yet to recover from this year’s crash in digital asset prices.\n\nThe largest cryptocurrency dropped as much as 3.3% to $66,354 in early New York trading on Wednesday. Ether, the second-biggest coin, fell 3.8% to an intraday low of $1,931.\n\n“Bitcoin has fallen below $67,000, recording its third daily bearish candle,” Alex Kuptsikevich, chief market analyst at FxPro Group, said in a note. “Of the more than 20% rebound from Friday’s lows, only slightly more than half remains.”\n\nKraft Heinz Co. halted plans to split in two, a surprising reversal weeks after bringing in a new chief executive officer with experience breaking up a food company. Steve Cahillane, who took over as CEO on January 1, said he made the decision to temporarily halt the split to concentrate on bolstering profitability.\n\n“What I’ve since learned is how much opportunity there is to fix the business in the short term, and to turn the business around in a more positive trajectory,” Cahillane said in a call with analysts. “And because resources are finite, I came to the conclusion that this was the best outcome for us.”\n\nTreasuries slumped after stronger-than-expected US employment data prompted traders to pare their expectations for Federal Reserve interest-rate cuts this year.\n\nThe move pushed yields across maturities higher on Wednesday, with the two-year — which is most sensitive to the central bank’s policy changes — jumping as much as nine basis points to 3.55%. Traders priced in the Fed’s next rate cut in July, from June previously.\n\nA much stronger-than-anticipated US jobs report lifted stocks on speculation that economic resilience will keep powering corporate profits. Treasuries fell as traders trimmed bets on Federal Reserve rate cuts this year.\n\nThe equity advance pushed the S&P 500 to its all-time highs, with the gauge rising 0.7%. The yield on 10-year Treasuries climbed four basis points to 4.18%. Money markets priced in the Fed’s next rate cut in July, from June previously. The dollar was little changed.\n\nA stronger-than-expected US jobs report boosted equity markets in early trading and lifting the dollar. However, less investors are now betting on fed rate cuts.\n\nThe Dow rose 207 points (0.4%), with the S&P 500 up 0.6% and the Nasdaq Composite climbing 0.8%.\n\nIt’s shaping up to be a good day for investors in US equity markets.\n\nEquity futures climbed on Wednesday, February 11, in reaction to the delayed January jobs report. S&P 500 futures gained 0.4%, Nasdaq 100 futures rose 0.5%, and Dow Jones Industrial Average futures advanced 204 points, or 0.4%.\n\nThe Bureau of Labor Statistics reported that US nonfarm payrolls increased by 130,000 in January, well above the 55,000 jobs forecasted by economists surveyed by Dow Jones. The unemployment rate came in at 4.3%.\n\nThe stronger-than-expected jobs data helped offset market concerns from Tuesday, over stalled December consumer spending.\n\nDow futures have risen by 200 points as January jobs increased 130,000, beating most street estimates including the Dow Jones consensus that forecast an increase of just 55,000.\n\nThere have been 14 instances since 1948 till today when annual payroll growth slowed to about 0.37% or lower during an economic expansion. In 11 of those cases, the S&P 500 rose, averaging roughly 13% on an annualised basis, Bloomberg reported citing economist Jim Paulsen’s newsletter\n\nHe has explained that weaker employment data often signals that the Federal Reserve may support the economy by lowering interest rates.\n\n“Once policy juice arrives, whether or not the economy eventually suffers a recession, the stock market begins looking toward a renewed economic recovery and investors started bidding stock prices higher,” he wrote.\n\nSo while a slower jobs report may sound negative, historical patterns suggest investors could view it as an opportunity for stocks.\n\nKevin Hassett, director of the National Economic Council, told CNBC that several factors are likely keeping payroll growth modest for now.\n\nHe pointed to the administration’s efforts to curb illegal immigration and rising productivity from artificial intelligence as key reasons businesses may need to hire less.\n\n“I think that you should expect slightly smaller job numbers that are consistent with high GDP growth right now. … One shouldn’t panic if you see a sequence of numbers that are lower than you’re used to,” Hassett said Monday. “Because, again, population growth is going down and productivity growth is skyrocketing. It’s an unusual set of circumstances.”\n\nHassett added that in this environment, it’s possible for “job creation [to] lag, productivity skyrockets, profits skyrocket, GDP skyrockets”.\n\nJust an hour to go before the Bureau of Labor Statistics releases the US jobs report. Take a look at projections from major banks and financial institutions.\n\nMoody’s Analytics’s chief economist Mark Zandi said he does not expect any growth on employment trends in the US for the month of January.  “I think zero would be the forecast,” he said, warning of further layoffs in the job market.\n\n“The consensus is probably around 50,000. Anything around zero just shows you how fragile things are, just very weak. This is all happening with no layoffs, but layoffs are going to pick up. I think we could get job losses here pretty soon,” Zandi added.\n\nThe Federal Reserve’s benchmark interest rate currently stands at 3.5% to 3.75% after policymakers kept rates unchanged in their January 2026 meeting.\n\nThe pause comes after three consecutive rate cuts last year that lowered borrowing costs to their lowest level since 2022.\n\nValues of gold, silver, and platinum are rising as the US dollar nears two-week low on Wednesday, February 11.\n\nSpot gold rose 1% to $5,074.39 per ounce while spot silver was up 5.4% at $85.02 per ounce. Spot platinum too rose 4.3% to $2,176.95 per ounce.\n\n“We’ve seen a bit of a weaker U.S. dollar during the past trading days, which has helped gold and is likely lifting the price today,” Julius Baer, analyst, Carsten Menke told Reuters\n\nModerna Inc.’s shares fell after US regulators refused to review its novel mRNA flu vaccine, dealing a major blow to the company as it seeks more products beyond its Covid shot.\n\nThe US Food and Drug Administration refused to start a review of the company’s application, which was submitted in December, saying its studies didn’t compare the experimental shot to the “best-available standard of care,” Moderna said in a statement Tuesday.\n\nKrishna Guha, head of economics and central bank strategy at Evercore ISI, said it has been difficult to gauge where labor market data will land, citing distortions from adjustments following the government shutdown and broader economic uncertainty.\n\nGuha told CNBC that the relationship between economic growth and employment appears weaker at the moment.\n\n“There seems to be a weaker relationship right now between growth and employment…part of that is the uncertainty and part of that, we think, may also be some secular AI-related effects on the labor market,” he said."
    },
    {
        "title": "Unity Software Inc. (U) Q4 2025 Earnings Call Transcript",
        "url": "https://seekingalpha.com/article/4868835-unity-software-inc-u-q4-2025-earnings-call-transcript",
        "source": "Seeking Alpha",
        "date": "2026-02-11T17:34:00+00:00",
        "content": "Unity Software Inc. (U) Q4 2025 Earnings Call February 11, 2026 8:30 AM EST\n\nAlex Giaimo - Head of Investor RelationsMatthew Bromberg - CEO, President & DirectorJarrod Yahes - CFO & Senior VP\n\nMatthew Cost - Morgan Stanley, Research DivisionAlec Brondolo - Wells Fargo Securities, LLC, Research DivisionBrent Thill - Jefferies LLC, Research DivisionVasily Karasyov - Cannonball Research, LLCEric Sheridan - Goldman Sachs Group, Inc., Research DivisionWilliam Lampen - BTIG, LLC, Research DivisionAndrew Boone - Citizens JMP Securities, LLC, Research DivisionDylan Becker - William Blair & Company L.L.C., Research DivisionMartin Yang - Oppenheimer & Co. Inc., Research Division\n\nLadies and gentlemen, thank you for joining us, and welcome to the Unity Technologies Q4 Earnings Call. [Operator Instructions] I will now hand the conference over to Alex Giaimo, Head of Investor Relations. Alex, please go ahead.\n\nAlex GiaimoHead of Investor Relations\n\nThank you. Good morning, everyone. Welcome to Unity's Fourth Quarter 2025 Earnings Call. Today, I'm joined by our CEO, Matt Bromberg; and our CFO, Jarrod Yahes.\n\nBefore we begin, I want to note that today's discussion contains forward-looking statements, including statements about goals, business outlook, industry trends and expectations for future financial performance, all of which are subject to risks, uncertainties and assumptions.\n\nYou can find more information about these risks and uncertainties in the Risk Factors section of our filings at sec.gov. Actual results may differ, and we take no obligation to revise or update any forward-looking statements.\n\nFinally, during today's meeting, we will discuss non-GAAP financial measures. These non-GAAP financial measures are in addition to and not a substitute for or superior to measures of financial performance prepared in accordance with GAAP.\n\nA full reconciliation of GAAP to non-GAAP is available in our press release and on the"
    }
]