[
    {
        "title": "MNTN Had A Big First Year As A Public Company. What's Next?",
        "url": "https://www.adexchanger.com/tv/mntn-had-a-big-first-year-as-a-public-company-whats-next/",
        "source": "AdExchanger",
        "date": "2026-02-12T16:43:00+00:00",
        "content": "If you tuned into MNTN’s three quarterly earnings calls since going public in May, you’ve heard CEO and President Mark Douglas deliver the same elevator pitch three times – that the company is bringing performance-driven CTV advertising to small and midsize businesses.\n\nAnd that’s a message Douglas plans to keep repeating, he told AdExchanger on Wednesday, the morning after MNTN’s fourth quarter earnings call.\n\n“For any newly public company, just retelling the story is an important part of opening our earnings calls,” Douglas said. “The investor community has a lot of things they’re looking at, and it’s easy for them to forget some of the details.”\n\nWhat investors are unlikely to miss, however, is MNTN’s recent performance, which appears to back up that story.\n\nOn Tuesday, MNTN reported that its fourth-quarter revenue grew 36% year over year to just over $87 million when adjusted for the Q2 divestiture of Maximum Effort, the digital marketing agency founded by Ryan Reynolds that MTN had acquired in 2021 to bolster its CTV advertising business.\n\nFull-year revenue also grew 36% YOY, from $209.3 million in 2024 to $284.7 million last year.\n\nSince reporting, MNTN’s stock price has skyrocketed, from $8.10 when the market closed on Tuesday to $10.90 on Thursday morning.\n\nDespite this growth, MNTN’s outlook for 2026 is fairly conservative, particularly for Q1. The company expects between $71.3 and $73.3 million in revenue for the first quarter, which only represents a YOY growth rate of roughly 22%.\n\nThe last time MNTN’s revenue grew less than 30% was in Q1 of 2024, back before the company actually went public. During that quarter, revenue only increased 17% on a year-over-year basis. (Still excluding the Maximum Effort divestiture, of course.)\n\nGet our editors’ roundup delivered to your inbox every weekday.\n\nQ1 tends to be slower for performance advertising companies across the board, Douglas said, and MNTN is no exception. The bulk of its client base consists of ecommerce and travel businesses, many of which generate up to 40% of their annual revenue during the fourth quarter, which includes the holidays, and treat Q1 as a time to reset.\n\nAnd although 2026 is a major election year, politics is another area where MNTN is keeping its expectations in check.\n\nUnlike other advertising platforms, MNTN isn’t anticipating a bump in midterm political spending, according to Douglas, because politics is all about brand-building, awareness and “blasting messages very broadly,” and MNTN focuses on performance-driven outcomes.\n\nIn contrast with other DSPs that emphasize low-cost reach, he said, MNTN prioritizes “pinpointing particular consumers” for its SMB clients. With that in mind, MNTN is developing its own AI-powered planning tools, which will use predictive algorithms to determine the best media placements and spend levels in real time.\n\nAnd MNTN also has big plans for QuickFrame AI, the AI video generation tool it built using technology acquired in 2022. MNTN beta launched the tool right before its Q3 earnings call in November.\n\nDouglas told investors this week that adoption is already strong, with around 5,000 users and growing. But it’s still too soon to determine how well AI-generated CTV commercials perform compared to more traditional ones, he told AdExchanger.\n\nAnecdotally, MNTN is seeing strong social engagement with its own AI-generated content experiments. The company is even hiring content creators and videographers to produce videos, with the goal of eventually posting new ones on a weekly basis.\n\nLast week, for example, MNTN posted a QuickFrame-generated video to Instagram that features a “Heated Rivalry”-inspired hockey player decked out in MNTN branding (and, it should be noted, two different jersey numbers, a continuity error that would be less likely to occur during an actual film shoot).\n\nAccording to Douglas, that post, which only cost roughly $500 to produce, racked up around 190,000 views and more than 2,200 likes, making it the company’s best-performing video not featuring Ryan Reynolds.\n\nOf course, AI ads can also draw negative comments from users – one person, for example, posted a “Your AI slop bores me” meme below MNTN’s hockey video on Instagram – which raises the question: Should small businesses that use AI for their CTV ads be worried about the potential for backlash?\n\nAlthough Douglas said he believes AI videos should be properly labeled as such, “so there’s never confusion,” he also feels that the fervor will die down once AI becomes less of a novelty.\n\n“Often when there’s a new medium or new way of crafting any form of art, the medium becomes the point rather than the art,” said Douglas. “When we’re making AI the point, that backlash is actually valid, but I think it’ll find its home.”\n\nCriteo has an optimistic pitch for future growth, but Wall Street doesn’t see the money yet from LLMs, commerce agents and social shopping.\n\nWhat people need is an independent agent that peers across retailer and is entirely focused on ecommerce services. At least that’s the conclusion driving Wizard Commerce, a personal shopping agent that emerged from beta on Wednesday.\n\nThe OAAA’s new content taxonomy introduces new subcategories that OOH media owners can use to classify their inventory in OpenRTB bid requests.\n\nAgentic AI is gaining popularity as a tactic for media buyers and sellers striving to simplify workflows, including in streaming TV advertising. Ad measurement firm iSpot introduced SAGE, an agentic AI platform with a “ChatGPT-like interface” that media buyers can use to generate campaign planning ideas.\n\nPutting aside Bad Bunny’s halftime show, AI companies stole the spotlight on Super Bowl Sunday, from Anthropic and OpenAI to Salesforce and Meta.\n\nFor Manscaped and Ro, the Big Game is about more than just flash and exposure. It’s about shifting how audiences perceive their brands.\n\nThe OAAA’s new content taxonomy introduces new subcategories that OOH media owners can use to classify their inventory in OpenRTB bid requests.\n\nThe IAB’s new framework aims to standardize when AI in ads should be disclosed, but a lot is still left up to interpretation.\n\nEvertune’s new feature allows advertisers to run programmatic ad campaigns directly on the sites and pages most often cited by AI chatbots.\n\nCriteo has an optimistic pitch for future growth, but Wall Street doesn’t see the money yet from LLMs, commerce agents and social shopping.\n\nAgentic AI is gaining popularity as a tactic for media buyers and sellers striving to simplify workflows, including in streaming TV advertising. Ad measurement firm iSpot introduced SAGE, an agentic AI platform with a “ChatGPT-like interface” that media buyers can use to generate campaign planning ideas."
    },
    {
        "title": "Tripadvisor, Inc. (TRIP) Q4 2025 Earnings Call Transcript",
        "url": "https://seekingalpha.com/article/4869481-tripadvisor-inc-trip-q4-2025-earnings-call-transcript",
        "source": "Seeking Alpha",
        "date": "2026-02-12T20:44:00+00:00",
        "content": "Tripadvisor, Inc. (TRIP) Q4 2025 Earnings Call February 12, 2026 8:30 AM EST\n\nAngela White - Vice President of Investor RelationsMatthew Goldberg - President, CEO & DirectorMike Noonan - Chief Financial Officer\n\nEric Sheridan - Goldman Sachs Group, Inc., Research DivisionNaved Khan - B. Riley Securities, Inc., Research DivisionNafeesa Gupta - BofA Securities, Research DivisionStephen Ju - UBS Investment Bank, Research DivisionLloyd Walmsley - Mizuho Americas LLCJed Kelly - Oppenheimer & Co. Inc., Research DivisionWyatt Swanson - D.A. Davidson & Co., Research Division\n\nHello, and thank you for standing by. Welcome to Tripadvisor Fourth Quarter 2025 Conference Call. [Operator Instructions]\n\nI would now like to hand the conference over to Angela White, Vice President of Investor Relations. You may begin.\n\nAngela WhiteVice President of Investor Relations\n\nThank you, Towanda. Good morning, everyone, and welcome to Tripadvisor's Fourth Quarter and Full Year 2025 Financial Results Call.\n\nJoining me today are Matt Goldberg, President and CEO; and Mike Noonan, CFO.\n\nEarlier this morning, we filed and made available our earnings release. In that release, you'll find reconciliations of non-GAAP financial measures to the most comparable GAAP financial measure discussed on this call.\n\nBefore we begin, I'd like to remind you that this call may contain estimates and other forward-looking statements that represent management's views as of today, February 12, 2026. Tripadvisor disclaims any obligation to update these statements to reflect future events or circumstances. Please refer to our earnings release as well as our filings with the SEC for information concerning factors that could cause actual results to differ materially from these forward-looking statements.\n\nWith that, I'll turn the call over to Matt.\n\nMatthew GoldbergPresident, CEO & Director\n\nThanks, Angela, and good morning, everyone. We're pleased with our 2025 results, which reflected continued momentum in our"
    },
    {
        "title": "Fractal Analytics IPO Day 3 Highlights: Issue booked 2.66x as QIBs step in — GMP turns negative",
        "url": "https://www.livemint.com/market/ipo/fractal-analytics-ipo-gmp-remains-flat-last-day-to-apply-for-fractal-analytics-ipo-check-review-11-february-2026-11770782214072.html",
        "source": "Mint",
        "date": "2026-02-12T00:08:00+00:00",
        "content": "Fractal Analytics IPO Day 3 Highlights: The initial public offering (IPO) of AI solutions provider Fractal Analytics has opened for the final day of bidding on Wednesday, February 11. The offer has so far seen a tepid response from investors. As of the second day of bidding, Fractal Analytics IPO was booked 20%.\n\nFractal Analytics’  ₹2,834-crore IPO has a price band of  ₹857 to  ₹900 per share, valuing the company at approximately  ₹15,500 crore.\n\nThe company has reduced the size of its IPO from the initially proposed  ₹4,900 crore. The revised issue consists of a fresh equity issue of up to  ₹1,023.5 crore and an offer for sale (OFS) worth  ₹1,810.4 crore, bringing the total issue size to  ₹2,833.9 crore.\n\nShareholders participating in the OFS include Quinag Bidco Ltd, TPG Fett Holdings Pte Ltd, Satya Kumari Remala Rao, Venkateswara Remala, and GLM Family Trust.\n\nProceeds from the fresh issue will be deployed to invest in its subsidiary, Fractal USA, for debt repayment, purchase of laptops, establishment of new offices in India, research and development initiatives, expansion of sales and marketing efforts under Fractal Alpha, funding acquisitions and strategic initiatives, as well as for general corporate purposes.\n\nFractal Analytics IPO grey market premium (GMP) has slumped to  ₹7 today. This means that shares of Fractal Analytics IPO are trading at  ₹907 as against the offer price of  ₹900.\n\nAt the current levels, Fractal Analytics IPO listing pop could be less than 1% only.\n\nThe company is scheduled to list on the stock exchanges on February 16.\n\nFounded in 2000, Fractal Analytics provides end-to-end AI solutions and data-driven insights to large global enterprises across various industries and business functions.\n\nThe company specialises in sectors such as consumer packaged goods and retail, technology, media and telecom, healthcare and life sciences, and banking, financial services and insurance.\n\nAs of March 31, 2025, Fractal’s client roster included global giants such as Microsoft, Apple, Nvidia, Alphabet, Amazon, Meta and Tesla.\n\nWatch this space for LIVE updates on Fractal Analytics IPO Day 3\n\nAs of September 2025, Fractal’s top ten clients had an average relationship tenure of over eight years, with marquee clients including Citibank, Costco, Franklin Templeton, Mars, Mondelez, Nationwide, Nestlé, and Philips.\n\nFractal Analytics IPO is -  ₹2. This means that shares of Fractal Analytics are trading  ₹2 below the IPO price of  ₹900.\n\nThe company operates through two business segments: Fractal.ai, which delivers AI services and products primarily through its proprietary agentic AI platform, Cogentiq, and Fractal Alpha, which houses independent AI ventures targeting core clients, adjacent markets, and new geographies.\n\nFractal Analytics IPO's NII segment was also fully subscribed as of 4 pm on the final day of bidding. QIB was the most booked segment at 4x bids.\n\nFractal Analytics has a strong presence across its four focus industries and serves large global clients, with the top 10 clients averaging over eight years of engagement. At the upper price band of  ₹900, the issue is valued at 78.9x FY25 P/E (post-issue), there are no listed companies in India or globally for comparison for similar business model , with positive sector outlook with moderate growth—18% revenue CAGR during FY23–25 and 20% YoY growth in 1HFY26.\n\nAttrition remains elevated at 16.3% in FY25 and 15.7% in 1HFY26. also Fractal is India’s first pure-play AI company to list, positioned as a Decision Intelligence player combining AI services with incubated SaaS products (Fractal Alpha ).\n\nWe assign a Subscribe rating for Long Term high-risk growth focused investor. ( 3–5 year horizon)\n\nFractal’s portfolio includes proprietary platforms and models such as Cogentiq (an agentic AI orchestration platform), Vaidya (a multimodal medical foundation model ecosystem), Kalaido.ai (a diffusion‑based generative image model), Pioneer (a multi‑agent system for software development and autonomous data science), and the Fathom family of reasoning and deep‑research models, alongside investments in ecosystem assets such as Qure.ai (AI for radiology) and Analytics Vidhya.\n\nThe global data, analytics and AI industry is undergoing a structural shift toward an AI-native, GenAI-led enterprise stack, with core AI services and platforms emerging as the fastest-growing layers of digital transformation spend.\n\nWithin this rapidly evolving landscape, Fractal Analytics is strategically positioned as a mission-critical, end-to-end enterprise AI partner, combining consulting, services, platforms and product businesses to help large global clients operationalize AI at scale across functions and industries.\n\nIt operates in a long-duration, secular growth market, with its total serviceable addressable market across AI services, platforms and software expected to expand from about US$85 billion in FY25 to around US$171 billion by FY30P, implying a robust mid-teens CAGR in line with, or above, broader DAAI growth.\n\nThis expansion is driven by accelerating GenAI adoption, rising demand for domain-specific AI, and the shift from pilot projects to scaled, production-grade AI and agentic systems embedded in core workflows, providing strong multi-year revenue visibility.\n\nFractal’s offerings are deeply integrated into client decision journeys and technology stacks, supported by high net revenue retention, long-standing relationships with marquee “must win” clients, and an increasing mix of recurring and product-linked revenues, resulting in high switching costs and improving earnings quality.\n\nWe recommend subscribing to the issue with a long-term investment horizon, as sustained execution on its IP- and platform-led strategy, deepening penetration within must-win clients, and powerful GenAI-led industry tailwinds could translate into meaningful value creation over time.\n\nWhile the emergence of Artificial General Intelligence (AGI) poses a long-term disruptive risk to traditional AI business models, Fractal’s dominant position in the analytics niche suggest a strong competitive strength and deep-rooted client trust. As the company continues to capitalize on the global demand for enterprise-grade AI, its ability to maintain high margins and operational leverage, we recommend a ‘SUBSCRIBE’ rating for long-term investors, said Lakshmishree Investment.\n\nFractal, in its RHP, said that it has experience in serving several large enterprises, including the majority of the “magnificent seven” companies (Alphabet, Amazon, Apple, Meta, Microsoft, Nvidia, and Tesla).\n\nFractal Analytics IPO was subscribed 1.45 times as of 1.15 pm, thanks to massive QIB demand. Other segments, however, remained undersubscribed.\n\nQIB quota was booked 2.27 times, QIB segment received 46% bids and the retail portion garnered 78% subscription.\n\nFractal Analytics operates in a niche segment of Data Analytics leveraging AI developed through in-house R&D and resources as well as on external models. It has a healthy presence across its 4 focus industries with top MNCs as its clients and an average tenure of 8+ years across the top 10 clients.\n\nAt the upper price band of  ₹900, the issue is valued at FY25 P/E multiple of 78.9x based on post-issue capital. This looks elevated given the relatively modest revenue growth (18% revenue CAGR between FY23-25 and 20% YoY growth in 1HFY26). Attrition rate for the company continues to be elevated (16.3% in FY25/15.7% in 1HFY26). Risks such as insourcing by clients especially with the advent of AI tools could lead to loss of clients and impact the company’s business model.\n\nConsidering the elevated valuation, we assign a NEUTRAL rating to the issue and would like to track the performance of the company for a few quarters post listing.\n\nThe company works with marquee clients such as Citibank, Costco, Franklin Templeton, Mars, Mondelez, Nationwide, Nestle, Phillips, etc., ensuring participation across its focus industries of CPGR, TMT, HLS, and BFSI. As of Sep’25, the company served 122 Must Win Clients (MWCs)and served its top 10 clients by revenue in 1HFY26 for an average of more than eight years.\n\nFractal Analytics IPO was subscribed 54% so far as QIB investors ramped up buying, with their quota booked 55%.\n\nFractal Analytics IPO subscribed 28% as of 12 pm. The QIB segment was booked 8% and the NII portion was subscribed 38%. The retail portion garnered 73% bids and the employee segment 27%.\n\nAs of 1HFY26/FY25, the company’s top 10 clients contributed 54.2%/53.8% to the total revenue from the Fractal.ai business segment. Thus, failure to maintain and expand relationships with its existing client base or add new clients, may impact the company’s business and financial performance.\n\nThe issue is priced at a P/BV of 7.76 based on its NAV of Rs. 116 as of September 30, 2025 and asking price is at a P/E of ~109.12x if we attribute FY26 annualized earnings. There are no listed peers to compare with as per the RHP. The issue is very aggressively priced.\n\nFractal Analytics offers investors an opportunity to contribute in a rapidly growing sector of DAAI services and generative AI that serves high-end consumer brands in India and globally but, Looking at all the factors, risks, opportunities and Elevated valuation, Investors with High-risk appetite can apply for Long term horizon.\n\nFractal Analytics IPO is a book build issue of  ₹2,833.9 crore, consisting of a fresh issue of 1.1 crore shares, aggregating to  ₹1,023.5 crore and an offer for sale of 2 crore shares aggregating to  ₹1,810.4 crore. The company plans to use the fresh funds raised for the following:\n\n1. Investment in Fractal USA for Debt Repayment –  ₹264.9 crore\n\n2. Purchase of Laptops –  ₹57.1 crore\n\n3. Setting-up New Office Premises in India –  ₹1,211 crore\n\n4. Investment in R&D and Sales & Marketing under Fractal Alpha –  ₹355.1 crore\n\n5. Inorganic Growth and General Corporate Purposes\n\nFractal Analytics IPO subscribed 22% as of 10.30 am. The QIB segment was booked 2% and the NII portion was subscribed 31%. The retail portion garnered 67% bids and the employee segment 23%.\n\nFractal is India’s first pure-play AI company to list, positioned as a Decision Intelligence player combining AI services with incubated SaaS products (Fractal Alpha). The company has seen a sharp turnaround, moving from a  ₹55 crore loss in FY24 to a  ₹221 crore profit in FY25 on the back of 26% revenue growth.\n\nAt the upper band of  ₹900, valuations look expensive at ~79x (post) FY25 P/E, but this reflects a scarcity premium for a listed AI platform. Best suited for high-risk, growth-focused investors with a 3–5 year view looking to ride the global GenAI cycle.\n\nFractal has built a diversified revenue profile. In FY25, revenue from the Fractal.ai segment stood at  ₹2,703.7 Cr, with CPGR contributing  ₹1,061.5 Cr, TMT  ₹808.7 Cr, HLS  ₹374.5 Cr, BFSI  ₹298.0 Cr, and other industries  ₹161.0 Cr.\n\nRevenue from operations grew from  ₹1,985.4 Cr in FY23 to  ₹2,196.3 Cr in FY24, and further to  ₹2,765.4 Cr in FY25, reflecting a 25.9% YoY growth. For the six months ended September 30, 2025, revenue stood at  ₹1,559.0 Cr, up 19.9% YoY.\n\nProfitability improved materially in FY25. EBITDA increased to  ₹398.0 Cr, with an EBITDA margin of 14.4%, compared to  ₹97.2 Cr and 4.4% in FY24. Adjusted EBITDA stood at  ₹482.1 Cr, with an adjusted EBITDA margin of 17.4%.\n\nProfit after tax (PAT) for FY25 was  ₹220.6 Cr, compared to a loss of  ₹54.7 Cr in FY24, with a PAT margin of 8.0%, while adjusted PAT stood at  ₹347.8 Cr, translating into an adjusted PAT margin of 12.6%.\n\nFractal Analytics IPO opened for the final day of bidding today at 10 am. Investors can place their bids till 5 pm today. Issue was booked 20% as of the second day.\n\nInvestors can apply for the IPO in multiples of 16 shares, requring a minimum investment of  ₹14,400.\n\nFractal Analytics IPO grey market premium (GMP) has slumped to  ₹7 today. This means that shares of Fractal Analytics IPO are trading at  ₹907 as against the offer price of  ₹900.\n\nAt the current levels, Fractal Analytics IPO listing pop could be less than 1% only.\n\nThe company is scheduled to list on the stock exchanges on February 16.\n\nFractal Analytics IPO received bids for 36,40,320 shares against 1,85,79,360 shares on offer, according to NSE data, resulting in 20% bids.\n\nThe category for retail individual investors (RIIs) fetched 60 per cent subscription, while the quota for non-institutional investors subscribed 27 per cent. The portion for qualified institutional buyers (QIBs) received a 2 per cent subscription.\n\nCatch all the Business News ,  Market News , Breaking News Events and Latest News  Updates on Live Mint. Download The Mint News App  to get Daily Market Updates."
    },
    {
        "title": "11 Best AI Penny Stocks to Buy Right Now",
        "url": "https://www.insidermonkey.com/blog/11-best-ai-penny-stocks-to-buy-right-now-1693928/",
        "source": "Insider Monkey",
        "date": "2026-02-12T08:37:00+00:00",
        "content": "In this article, we explore the 11 Best AI Penny Stocks to Buy Right Now.\n\nFunds Society, a media platform and meeting point for wealth and asset management professionals, published a report on February 10, 2026, in which it noted that major cloud providers and OpenAI have earmarked more than $1.6 trillion for artificial-intelligence infrastructure between 2025 and 2028. The report, dubbed “AI in 2026”, added that the investments are already improving digital advertising, e-commerce, and cloud services.\n\nInterestingly, Funds Society is not alone in pointing out this huge build-out scale. On February 3, Gartner stated that it expects worldwide IT spending in 2026 to increase by 10.8%, touching $6.15 trillion. Of particular interest is what John-David Lovelock, Distinguished VP Analyst at Gartner, said. He stated that a huge chunk of the IT spending will be AI-adjacent. That is, a lot of the money will be spent on a sector that links to AI in one way or another. For example, Gartner anticipates server spending to grow 36.9% year over year, and total data center spending to increase 31.7% past $650 billion.\n\nDespite these humongous spending figures, the Wall Street Journal noted in a February 9 report that “investors aren’t exactly thrilled.” Of all the big spenders, the Journal noted, only Meta’s stock rose after its Q4 FY2025 earnings release. Others saw their shares’ value plunge as deep as 14%. According to the Journal, investors are worried about the overall outlook for AI, punishing the tech giants for it.\n\nThis explains why some think that those who are willing to look beyond the mega caps may find opportunities. These opportunities may lie in smaller AI-focused companies, some of them with early-stage innovations that could offer the next breakout stock. This article will highlight some of the AI penny stocks that warrant investor attention.\n\nTo create this list, we analyzed financial media reports and online rankings, and used stock screeners to identify artificial-intelligence companies. We then filtered for stocks trading at or below $5 as of February 11, 2026. We then shortlisted the 11 best names by looking at their upside potential and selected the stocks with the highest upside. We also considered institutional conviction based on hedge fund holdings as of Q3 2025. The stocks are ranked from the lowest to the highest upside potential.\n\nNote: The stock’s price and upside potential data are as of February 11, 2026.\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 427.7% since May 2014, beating its benchmark by 264 percentage points (see more details here).\n\nNumber of Hedge Fund Holders: 11\n\nVeritone, Inc. (NASDAQ:VERI) is one of the best AI penny stocks to buy right now. On February 11, Veritone, Inc. (NASDAQ:VERI) announced its aiWARE platform and Data Refinery will support the AI agent economy by processing unstructured audio and video data, enforcing governance, and creating AI-ready assets.\n\naiWARE orchestrates multiple AI engines with policy-based controls and audit logs, while Data Refinery enriches raw content with rights and provenance information. Used in regulated environments, including work with the Air Force Office of Special Investigations, Veritone’s tools serve industries such as media, entertainment, public sector, and talent acquisition.\n\nOn January 29, Veritone, Inc. announced that its Veritone Data Refinery (VDR) processed 22.2 trillion tokens during the second half of 2025. This performance points to a more than 3.5x increase in volume compared with the first half of the year, the company said. The VDR platform that helps customers convert unstructured data into AI-ready assets.\n\nAccording to Veritone, the milestone is evidence of a high adoption rate of VDR. These organizations use the platform to index and format large datasets such as text, media, and logs into tokens that can be used to train and refine AI models. Veritone said the growth in data processing volume signals increasing demand for premium, licensed data from sectors including media, entertainment, and production. In these spaces, the company stated, high-quality and proprietary data is becoming more valuable for AI training.\n\nThe company noted the broader market opportunity for data monetization. It cited research that expects the AI training dataset market to expand from about $7.48 billion in 2026 to over $52 billion within the next decade. The research stated that the growth will be driven by enterprise needs for licensed and ethical data sources.\n\nSeparately, on January 14, Veritone said its platform is positioned to support the Department of War’s newly released AI-First, modular, open-architecture strategy. The department issued the strategy in a January 9 memo for senior Pentagon leadership.\n\nIn the memo, the Department of War called for accelerating the adoption of artificial intelligence across operations. It emphasized “AI-First” processes, modular systems, and open architectures that enable interoperability, rapid experimentation, and component replacement without vendor lock-in.\n\nIn this regard, Veritone stated that the design principles of its aiWARE platform align to this strategy. This enables organizations to orchestrate disparate AI models, data sources, and workflows.\n\nVeritone, Inc. (NASDAQ:VERI) is an enterprise artificial intelligence company best known for its aiWARE operating system. The platform orchestrates AI models to process and analyze unstructured data. Its AI solutions are applied across industries including media and entertainment, government, legal, and compliance.\n\nNumber of Hedge Fund Holders: 1\n\nZenaTech, Inc. (NASDAQ:ZENA) is one of the best AI penny stocks to buy right now. On February 10, ZenaTech, Inc. (NASDAQ:ZENA) said it has integrated drone technology into its land surveying services. This integration, said ZenaTech, specifically targets national homebuilders, and that it leverages the company’s Drone as a Service (DaaS) platform to dramatically accelerate permit-ready survey delivery.\n\nAccording to ZenaTech, the initiative addresses the issue of survey turnaround times, which has been a critical bottleneck in residential construction for quite some time. Typical survey turnaround times take up to 10 days, the company said. However, with the new initiative, ZenaTech aims to deliver completed permit-ready survey data in three days or less.\n\nZenaTech will enable this expansion through Cardinal Civil Resources, a land surveying firm acquired in 2025. The DaaS builder service offerings cover several surveying tasks, including topography, plot plans, boundary validation, zoning compliance, and jurisdiction-specific formatting.\n\nMeanwhile, on February 3, ZenaTech said it had signed an offer to acquire a Virginia-based land surveying company. The company has an established customer base in the Washington, D.C. metro area.\n\nZenaTech stated that the acquisition, when completed, will strengthen its DaaS footprint in the Washington, D.C. metro region. As a result, the company plans to expand opportunities to offer its DaaS solutions to federal, state and municipal government agencies.\n\nZenaTech, Inc. (NASDAQ:ZENA) is a Canada-based technology company specializing in artificial intelligence-powered drones, enterprise SaaS platforms, and quantum computing solutions. Its AI-driven drone technology underpins its DaaS model, which supports applications in defense, land surveying, and public safety.\n\nHeadlineNYSE:INUVNYSE:NOTENASDAQ:BZAINASDAQ:KSCPNASDAQ:ZENANASDAQ:VERINASDAQ:RZLVNASDAQ:LTRNNASDAQ:CXAINASDAQ:HIVEDaily NewsletterInuvo Inc. (NYSE:INUV)CXApp Inc. (NASDAQ:CXAI)Veritone Inc (NASDAQ:VERI)ZenaTech Inc. (NASDAQ:ZENA)Rezolve AI PLC (NASDAQ:RZLV)Knightscope Inc. (NASDAQ:KSCP)Lantern Pharma Inc. (NASDAQ:LTRN)Blaize Holdings Inc. (NASDAQ:BZAI)FiscalNote Holdings Inc. (NYSE:NOTE)11 Best AI Penny Stocks to Buy Right NowHIVE Digital Technologies Ltd. (NASDAQ:HIVE)13 Best Affordable Tech Stocks to Buy Right Now10 Best Affordable Long Term Stocks to Buy According to Hedge FundsShow more...Show less"
    }
]