[
    {
        "title": "S&P and Dow Jones futures dip as Walmart earnings loom",
        "url": "https://invezz.com/news/2026/02/19/sp-and-dow-jones-futures-dip-as-walmart-earnings-loom/",
        "source": "Invezz",
        "date": "2026-02-19T12:38:00+00:00",
        "content": "US stock futures edged lower on Thursday as investors assessed recent market gains, geopolitical tensions, and the Federal Reserve’s policy outlook while awaiting quarterly results from retail bellwether Walmart.\n\nFutures tied to the Dow Jones Industrial Average fell about 0.31%, or 156 points.\n\nS&P 500 futures slipped 0.26%, and Nasdaq 100 futures declined 0.37%, pausing a three-day winning streak in the broader market.\n\nThe pullback followed a positive session on Wednesday, when the S&P 500 rose nearly 0.6%, the Nasdaq Composite gained 0.8%, and the Dow Jones Industrial Average added roughly 129 points.\n\nStrength in technology, financial, and energy stocks helped lift equities, with Nvidia advancing 1.6% and Amazon climbing 1.8%.\n\nMarkets have recently been driven by movements in mega-cap technology companies, which recovered after earlier volatility tied to artificial intelligence spending and valuations.\n\nOther major stocks, including Apple and Meta Platforms, were lower in premarket trading following the prior day’s gains.\n\nEarlier in the month, AI-linked companies and software firms faced pressure amid concerns that heavy investment in artificial intelligence was not yet translating into significant revenue or profit growth, and that improved AI tools could disrupt multiple industries.\n\nInvestors are closely watching Walmart’s fourth-quarter earnings, scheduled before the opening bell.\n\nThe retailer’s results are widely viewed as an indicator of US consumer health and spending trends.\n\nWalmart shares have climbed more than 13% in 2026 and recently joined the $1 trillion market-capitalization club, making the stock’s reaction potentially influential for broader markets.\n\nOther corporate news included gains in select companies.\n\nDoorDash jumped 10.74% after forecasting first-quarter marketplace gross order value above estimates, while eBay rose 10.06% after projecting higher revenue and announcing the acquisition of fashion marketplace Depop from Etsy.\n\nEtsy shares advanced 19.2%. Carvana, however, dropped 16.5% after missing fourth-quarter profit expectations due to higher costs.\n\nEconomic indicators will also be in focus.\n\nTraders will monitor weekly jobless claims and pending home sales data on Thursday, ahead of Friday’s personal consumption expenditures price index, the Federal Reserve’s preferred inflation gauge.\n\nMinutes from the Federal Reserve’s January policy meeting showed officials were divided on the future path of interest rates.\n\nPolicymakers were largely in agreement to hold rates steady, though several indicated openness to rate hikes if inflation remains elevated, while others would support cuts if inflation declines.\n\nGeopolitical developments also influenced sentiment.\n\nOil prices climbed more than 4% after US Vice President JD Vance said Iran had not addressed core American demands in nuclear negotiations and warned that President Donald Trump retains the option to use military force if diplomatic efforts fail.\n\nRising crude prices lifted shares of energy companies, including Exxon Mobil, Chevron, and Occidental Petroleum.\n\nTogether, earnings expectations, monetary policy uncertainty, and geopolitical tensions left investors cautious, with markets awaiting clearer signals on the economic outlook.\n\nFailed to load articles. Please try again."
    },
    {
        "title": "Samsung shares hit record on HBM4 pricing power and AI demand",
        "url": "https://invezz.com/news/2026/02/19/samsung-shares-hit-record-on-hbm4-pricing-power-and-ai-demand/",
        "source": "Invezz",
        "date": "2026-02-19T05:43:00+00:00",
        "content": "Samsung Electronics shares climbed to a record high on Thursday after reports that the company is negotiating significantly higher prices for its next-generation artificial intelligence memory chips, reinforcing investor optimism about the durability of AI-driven semiconductor demand.\n\nThe stock rose as much as 5.4% to 190,900 won ($132.34) on the Korea Exchange, surpassing the 190,000 level for the first time as trading resumed after a three-day holiday.\n\nIt later traded 3.9% higher at 188,300 won, outperforming the benchmark Kospi’s 2.5% gain.\n\nAccording to local newspaper Chosun Ilbo, Samsung is looking to price its latest high-bandwidth memory chip, HBM4, at around $700 per unit, up to 30% higher than the previous generation.\n\nThe rally also tracked gains in US technology stocks overnight.\n\nNvidia shares advanced after Meta Platforms agreed to deploy “millions” of its AI processors over the coming years, while Apple is accelerating development of three new wearable devices tied to AI-powered hardware.\n\nThe reported pricing move highlights renewed confidence in the profitability of AI memory products. Analysts say the industry continues to benefit from tight supply conditions and strong demand from data center operators.\n\nSamsung’s HBM4 price would imply operating profit margins of roughly 50% to 60%, according to Bloomberg Intelligence analyst Masahiro Wakasugi.\n\nA shortage of advanced memory chips has been supporting both Samsung and rival SK Hynix, helping South Korea’s Kospi index rise 31% this year and making it the world’s best-performing stock market.\n\nSK Hynix had previously priced HBM4 chips supplied to Nvidia in the mid-$500 range and may move closer to Samsung’s higher pricing, the newspaper reported.\n\nSamsung has been attempting to reclaim leadership in high-bandwidth memory after initially trailing domestic rival SK Hynix and US-based Micron Technology in the early stages of the AI boom.\n\nLast week, the company announced it had begun mass production and commercial shipments of HBM4 chips used in AI processors.\n\nThe new chip operates at 11.7 gigabits per second compared with 9.6 Gbps for the earlier HBM3E model, with potential speeds rising to 13 Gbps.\n\nNomura analysts C.W. Chung and Eon Hwang said in a WSJ report that Samsung is likely to benefit from higher average selling prices and greater shipments following the early release.\n\nThe analysts estimate the company could command a 30%–40% premium for HBM4 over HBM3E.\n\nThey also raised their target price for Samsung shares by 32% to 290,000 won while maintaining a buy rating.\n\nThe strengthening outlook for memory demand is expected to support the company’s semiconductor business.\n\nNomura now forecasts operating profit of 44 trillion won for the January-March quarter, up from an earlier estimate of 33 trillion won.\n\nIf Samsung supplies more HBM chips to Nvidia, pricing differences with SK Hynix may narrow in 2026 because those chips command higher prices than products sold to other customers, Wakasugi said.\n\nFailed to load articles. Please try again."
    },
    {
        "title": "Dow Jones Futures Decline: Apple, Google, Amazon, Meta & NVIDIA Face the Heat",
        "url": "https://www.analyticsinsight.net/stocks/dow-jones-futures-decline-apple-google-amazon-meta-nvidia-face-the-heat",
        "source": "Analytics Insight",
        "date": "2026-02-19T19:02:00+00:00",
        "content": "Dow Jones futures slipped as investors reacted to mixed momentum in tech stocks and uncertain signals on rates.\n\nApple, Google, Amazon, and Meta remain strong in revenue growth but face pressure from high valuations.\n\nAI spending continues to drive long-term optimism, yet short-term volatility remains elevated.\n\nDow Jones futures moved lower in premarket trading after a strong run in large technology stocks. Recent datasets show that trading is slightly below earlier highs, reflecting a cautious mood among investors. After weeks of gains powered by artificial intelligence excitement, traders are now slowing down and locking in profits.\n\nTreasury yields have also shifted in recent sessions. Comments from the Federal Reserve’s latest meeting minutes showed that policymakers are divided on when to cut interest rates. That uncertainty is creating pressure on high-growth companies, especially big technology names whose valuations are sensitive to expectations about interest rates.\n\nThe decline in futures signals that the market is digesting both company news and broader economic signals at the same time.\n\nApple Inc. reported record quarterly revenue. The company reached all-time highs in iPhone sales and saw strong growth in its services business during the first quarter. Even with these strong results, the stock price has fluctuated.\n\nInvestors are watching demand for new products and growth in services. Some believe the stock price is already very high. When a stock is expensive, even good news may not push it much higher.\n\nThis shows that the market is very sensitive right now, especially for large companies that have a big impact on major indexes.\n\nAlphabet Inc., the parent company of Google, has seen its stock move unevenly. Investors are focused on growth in artificial intelligence and on advertising revenue. AI spending is strong, but worries about high costs and rising competition are making investors wary.\n\nAmazon.com, Inc. is getting similar attention. Its cloud business plays a big role in the AI boom. However, investors are watching profit margins and spending closely.\n\nLarge investments in data centers and infrastructure may reduce short-term profits, even if long-term growth stays solid.\n\nBoth companies are leaders in their fields, but their stock prices are now reacting more to the overall economy than to single company updates.\n\nAlso Read - NVIDIA or Palantir: Which AI Stock Has More Upside in 2026?\n\nMeta Platforms, Inc. and NVIDIA Corporation are at the heart of the AI expansion. A major multi-year deal between the two companies to deploy advanced GPUs and networking equipment has highlighted rising demand for AI infrastructure.\n\nThis agreement shows that companies are still investing heavily in artificial intelligence. However, market reaction has not been one-directional. Chip stocks often rise on AI-spending news, but they also fall quickly when investors rotate into other sectors, such as energy or financials.\n\nNVIDIA remains one of the biggest beneficiaries of AI demand, yet its high valuation makes it sensitive to even small shifts in sentiment. When expectations are extremely high, small disappointments can cause noticeable swings.\n\nThe Dow Jones and other major indexes are heavily influenced by a small group of large technology companies. When these stocks move together, they can push futures sharply in one direction.\n\nRecent trading data shows that market breadth has narrowed, meaning fewer stocks are driving overall gains. This concentration increases the chance of short-term volatility. If investors reduce exposure to mega-cap technology, indexes can fall quickly even if other sectors remain stable.\n\nAlso Read - Top Meme Stocks to Watch and Buy Right Now\n\nUpcoming earnings and new economic data will help decide where the market goes next. Investors are closely watching the company's spending plans, especially for AI data centers and cloud systems.\n\nInterest rates are still uncertain. If the Federal Reserve delays rate cuts, growth stocks could come under more pressure.\n\nRight now, Dow Jones futures show caution. Big technology companies are still reporting strong revenue, but high stock prices and policy uncertainty are causing market swings. More spikes and dips are expected to occur in the coming weeks.\n\nWhy did Dow Jones futures decline?\n\nFutures moved lower due to profit-taking in major technology stocks and uncertainty around Federal Reserve interest rate decisions.\n\nAre Apple and Google still performing well financially?\n\nYes, both companies continue to report solid revenue figures, but stock prices are reacting to broader market conditions.\n\nHow is Amazon affected by current trends?\n\nAmazon’s cloud and AI investments remain strong, but rising costs and capital spending are being closely monitored.\n\nWhat role does Meta play in the AI rally?\n\nMeta is investing heavily in AI infrastructure, which supports long-term growth but also increases near-term spending.\n\nIs the market outlook negative?\n\nNot necessarily. The decline reflects caution and short-term adjustments rather than a major shift in long-term growth expectations.\n\nJoin our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance on cryptocurrencies and stocks. Also note that the cryptocurrencies mentioned/listed on the website could potentially be risky, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. This article is provided for informational purposes and does not constitute investment advice. You are responsible for conducting your own research (DYOR) before making any investments. Read more about the financial risks involved here."
    },
    {
        "title": "World shares are mixed, while US futures advance following a Wall St rally led by Nvidia",
        "url": "https://www.baltimoresun.com/2026/02/19/financial-markets-2/",
        "source": "The Baltimore Sun",
        "date": "2026-02-19T19:56:00+00:00",
        "content": "By STAN CHOE, AP Business Writer\n\nNEW YORK (AP) — U.S. stocks fell Thursday, while oil prices rose with worries about a potential conflict between the United States and Iran.\n\nThe S&P 500 slipped 0.3% for its first loss in four days. The Dow Jones Industrial Average dropped 267 points, or 0.5%, and the Nasdaq composite slipped 0.3%.\n\nBooking Holdings dropped 6.1% for one of the market’s sharper losses, even though the company behind the Booking.com, Priceline and OpenTable brands reported a profit for the latest quarter that edged past analysts’ expectations.\n\nIts stock has been under pressure because of worries that competitors powered by artificial-intelligence technology could upend its industry and take away customers. Booking’s stock has lost roughly a quarter of its value so far this year already.\n\nSuch worries have been rolling through Wall Street, hitting industries as far flung as software and legal services and trucking logistics. Investors have been punishing stocks of companies seen as under threat by AI so suddenly and aggressively that analysts have likened it to a “shoot first-ask questions later” mentality.\n\nThe doubts are hurting not just companies seen as potential victims of AI but also the private-credit companies that have lent them money. Blue Owl Capital fell 5.9% to bring its loss for the year so far to 22.5%, for example. Apollo Global Management dropped 5.2%, and Ares Management sank 3.1%.\n\nCarvana sank 7.9% even though the retailer reported a stronger profit for the latest quarter than analysts expected. Investors may have been paying more attention to how much profit the auto retailer made per vehicle sold, which was lower than expected.\n\nWalmart, meanwhile, pushed and pulled on the market after jumping to an early gain of 2.7% and then flipping to a loss. The retail giant delivered stronger results for the latest quarter than analysts expected, but it gave a profit forecast for the upcoming year that fell short of estimates. It finished the day with a loss of 1.4%.\n\nHelping to limit the market’s losses was Deere, which jumped 11.6% after the machinery maker reported a higher profit than analysts expected. CEO John May said it’s seeing a continued recovery in demand from construction and smaller agricultural customers, though its global, large agricultural customers are still feeling pressure.\n\nSome of the bigger gains in the S&P 500 came from stocks of oil companies, which climbed with the price of crude. A barrel of benchmark U.S. crude rose 1.9% to $66.43, while Brent added 1.9% to $71.66 per barrel.\n\nOil prices rose with worries about a possible military confrontation between the United States and Iran. President Donald Trump has been raising the pressure on Iran, which is home to some of the world’s largest oil reserves, because of its disputed nuclear program. If a conflict were to break out, it could constrict the global flow of oil.\n\nOccidental Petroleum jumped 9.4% after it also reported a stronger profit for the latest quarter than analysts expected.\n\nAll told, the S&P 500 fell 19.42 points to 6,861.89. The Dow Jones Industrial Average dropped 267.50 to 49,395.16, and the Nasdaq composite lost 70.91 to 22,682.73.\n\nIn the bond market, Treasury yields held relatively steady after a report said the number of U.S. workers applying for unemployment benefits eased last week. That could be a signal that the pace of layoffs is slowing.\n\nA solid job market, in turn, could keep the Federal Reserve on hold for longer before it resumes its cuts to interest rates. Fed officials said at their last meeting that they want to see inflation fall further before they would support cutting rates further this year.\n\nIf oil prices keep rising, that would push upward on inflation.\n\nThe yield on the 10-year Treasury slipped to 4.07% from 4.09% late Wednesday.\n\nOther U.S. economic reports said that growth for manufacturing in the mid-Atlantic region is accelerating, but potential homebuyers across the country didn’t sign as many contracts in January to purchase. The U.S. trade deficit also widened in December by more than economists expected.\n\nIn stock markets abroad, indexes fell in Europe following better performances in Asia.\n\nSouth Korea’s Kospi jumped 3.1% as trading resumed following a Lunar New Year holiday. Markets in Hong Kong and Shanghai remained closed.\n\nAP Business Writers Matt Ott and Elaine Kurtenbach contributed."
    },
    {
        "title": "Dow Jones futures gain due to rebound in technology shares",
        "url": "https://www.fxstreet.com/news/dow-jones-futures-gain-due-to-rebound-in-technology-shares-202602190839",
        "source": "FXStreet",
        "date": "2026-02-19T08:39:00+00:00",
        "content": "Dow Jones futures edge higher 0.06% to around 49,750 during European hours on Thursday. S&P 500 and Nasdaq 100 futures gain 0.22% and 0.34%, respectively, trading near 6,910 and 25,000 at the time of writing.\n\nUS index futures move higher following Wall Street's gains in the previous session, supported by a rebound in technology shares. On Wednesday’s regular US session, the Dow Jones rose 0.26%, the S&P 500 gained 0.56%, and the Nasdaq 100 climbed 0.78%.\n\nNvidia advanced 1.6% after Meta Platforms announced plans to deploy millions of its chips in a new data center. Micron Technology jumped 5.3%, while Amazon rose 1.8%. Energy and financial stocks were also among the top sector performers. Traders are now turning their attention to earnings from Walmart for further insight into consumer spending trends and the broader economic outlook.\n\nUS stocks gained ground as market sentiment improved after the January Federal Open Market Committee (FOMC) Meeting Minutes indicated nearly all policymakers backed holding rates steady, with few favored a cut, and officials signaled openness to easing if inflation cools as expected.\n\nMarkets modestly pared Fed rate cut bets but still expect two 25 basis points reductions later in the year. The CME FedWatch tool suggests that the Fed will leave interest rates unchanged in the current range of 3.50%-3.75% in the March and April policy meetings.\n\n(This story was corrected on February 19 at 11:46 GMT to say that Meta Platforms announced plans to deploy millions of Nvidia chips in a new data center, not its own chips.)\n\nThe Dow Jones Industrial Average, one of the oldest stock market indices in the world, is compiled of the 30 most traded stocks in the US. The index is price-weighted rather than weighted by capitalization. It is calculated by summing the prices of the constituent stocks and dividing them by a factor, currently 0.152. The index was founded by Charles Dow, who also founded the Wall Street Journal. In later years it has been criticized for not being broadly representative enough because it only tracks 30 conglomerates, unlike broader indices such as the S&P 500.\n\nMany different factors drive the Dow Jones Industrial Average (DJIA). The aggregate performance of the component companies revealed in quarterly company earnings reports is the main one. US and global macroeconomic data also contributes as it impacts on investor sentiment. The level of interest rates, set by the Federal Reserve (Fed), also influences the DJIA as it affects the cost of credit, on which many corporations are heavily reliant. Therefore, inflation can be a major driver as well as other metrics which impact the Fed decisions.\n\nDow Theory is a method for identifying the primary trend of the stock market developed by Charles Dow. A key step is to compare the direction of the Dow Jones Industrial Average (DJIA) and the Dow Jones Transportation Average (DJTA) and only follow trends where both are moving in the same direction. Volume is a confirmatory criteria. The theory uses elements of peak and trough analysis. Dow’s theory posits three trend phases: accumulation, when smart money starts buying or selling; public participation, when the wider public joins in; and distribution, when the smart money exits.\n\nThere are a number of ways to trade the DJIA. One is to use ETFs which allow investors to trade the DJIA as a single security, rather than having to buy shares in all 30 constituent companies. A leading example is the SPDR Dow Jones Industrial Average ETF (DIA). DJIA futures contracts enable traders to speculate on the future value of the index and Options provide the right, but not the obligation, to buy or sell the index at a predetermined price in the future. Mutual funds enable investors to buy a share of a diversified portfolio of DJIA stocks thus providing exposure to the overall index.\n\nAkhtar Faruqui is a Forex Analyst based in New Delhi, India. With a keen eye for market trends and a passion for dissecting complex financial dynamics, he is dedicated to delivering accurate and insightful Forex news and analysis.\n\nEUR/USD is still trading on the defensive in the latter part of Thursday’s session, while the US Dollar maintains its bid bias as investors now gear up for Friday’s key release of the PCE data, advanced Q4 GDP prints and flash PMIs.\n\nGBP/USD is sliding in tandem with its risk-sensitive peers, drifting back towards the 1.3430 area, its lowest levels in the month. The move reflects a firmer Greenback, supported by another round of solid US data and a somewhat divided FOMC Minutes.\n\nGold is giving away part of its earlier gains on Thursday, receding to the sub-$5,000 region per troy ounce. The precious metal is finding support from renewed geopolitical tensions in the Middle East and declining US Treasury yields across the curve in a context of further advance in the Greenback.\n\nRipple’s (XRP) outlook remains weak, as headwinds spark declines toward the $1.40 psychological support at the time of writing on Thursday.\n\nIt was green across the board for US Stock market indexes at the close on Wednesday, with most S&P 500 names ending higher, adding 38 points (0.6%) to 6,881 overall. At the GICS sector level, energy led gains, followed by technology and consumer discretionary, while utilities and real estate posted the largest losses.\n\nInjective price rallies over 13% on Thursday after the network confirmed the approval of its IIP-619 proposal. The green light for the mainnet upgrade has boosted traders’ sentiment, as the upgrade aims to scale Injective’s real-time Ethereum Virtual Machine architecture and enhance its capabilities to support next-generation payments."
    }
]