[
    {
        "title": "Perdoceo Education Q4 Earnings Call Highlights",
        "url": "https://finance.yahoo.com/news/perdoceo-education-q4-earnings-call-040840782.html?fr=sycsrp_catchall",
        "source": "Yahoo Finance",
        "date": "2026-02-20T04:39:00+00:00",
        "content": "Perdoceo ended 2025 with strong financials: Q4 revenue rose 20% to $211.6M and full‑year revenue increased 24.2% to $846.1M, while adjusted EPS rose to $2.61 and adjusted operating income reached $237.6M.\n\nOperational momentum was driven by high retention and demand—total student enrollments rose 7.3% year‑over‑year, CTU posted its ninth consecutive quarter of growth, and the University of St. Augustine acquisition aided program expansion.\n\nThe company returned $157.6M to shareholders in 2025 (including $120.8M in buybacks), approved a new $100M repurchase authorization, and provided 2026 guidance of $250–263M in adjusted operating income and $2.97–3.12 in adjusted EPS.\n\nInterested in Perdoceo Education Corporation? Here are five stocks we like better.\n\nPerdoceo Education (NASDAQ:PRDO) said it finished 2025 “on a strong note,” with management pointing to revenue, operating income, and total student enrollment growth that came in ahead of internal expectations. On the company’s fourth-quarter and full-year 2025 earnings call, executives highlighted continued gains in student retention, increased investments in marketing and admissions, and contributions from the University of St. Augustine for Health Sciences acquisition completed in December 2024.\n\nFor the fourth quarter, Perdoceo reported net income of $35.3 million, or $0.54 per diluted share. Adjusted earnings per diluted share increased 20% to $0.59, up from $0.49 in the prior-year quarter, excluding certain non-cash items, management said. Adjusted operating income for the quarter was $51.6 million, compared with $42.7 million a year earlier.\n\n→ Corning’s Surprise AI Boom: Is It Already Too Late to Buy?\n\nRevenue in the quarter rose 20% to $211.6 million from $176.4 million in the prior-year period. Chief Financial Officer Ashish Ghia said the results reflected continued high levels of student retention and engagement, along with accelerated marketing and admissions efforts at Colorado Technical University (CTU) and the American InterContinental University System (AIU System) during the second half of the year.\n\nManagement also noted ongoing investments in technology, including exploring the use of artificial intelligence as a tool to enhance academic outcomes. At the University of St. Augustine for Health Sciences, Ghia said the institution has continued to expand program offerings by introducing new modalities at current campus locations to provide prospective students with additional flexibility.\n\n→ Medtronic’s “Textbook” Reversal: How High Can It Really Go in 2026?\n\nFor full-year 2025, Perdoceo reported net income of $159.9 million, or $2.42 per diluted share, compared with $147.6 million, or $2.19 per diluted share, in the prior year. Adjusted earnings per diluted share increased 15.5% to $2.61 from $2.26. Operating income increased 12.5% to $196.0 million, while adjusted operating income rose 25.8% to $237.6 million, reflecting the St. Augustine acquisition, organic growth, and “operational efficiencies” at CTU and AIU System, the company said.\n\nRevenue increased 24.2% to $846.1 million, a gain of $164.8 million. Ghia said results included selective investments in marketing, admissions, and personnel, partially offset by lower bad debt expense. Bad debt expense was 3.5% of revenue, down $4.2 million year over year.\n\n→ 3 Discount Retail Stocks to Watch as Earnings Put Valuations to the Test\n\nOn the call, Chief Executive Officer Todd Nelson said Perdoceo’s academic institutions graduated approximately 15,000 students in 2025 and that the company expects to graduate even more students in 2026 as retention remains near multi-year highs.\n\nTotal student enrollments at Dec. 31 increased 7.3% from the prior year-end, driven by growth across the company’s academic institutions, according to management. Nelson attributed CTU’s enrollment momentum to continued progress in the corporate student program and strong prospective student interest. He said this marked the ninth consecutive quarter of enrollment growth for CTU.\n\nAIU System: Total enrollments increased 11.2%, supported in part by an academic session that started in December, according to Ghia.\n\nCTU: Total enrollments grew 6.6% to a record 30,000 at year-end, supported by retention and engagement, corporate student program expansion, and sustained interest from prospective students.\n\nUniversity of St. Augustine: The institution ended the fall term with approximately 3,900 students; Nelson said spring term enrollments were trending in line with expectations.\n\nGhia also cautioned that quarterly enrollment comparability at AIU System is affected by the number of enrollment days and the academic session calendar.\n\nFor CTU, full-year revenue was $461.6 million, up 4.1%, while operating income increased 3.4% to $180.6 million. Ghia said a “significant portion” of the revenue increase was reinvested in faculty, course development, and student support services, along with higher admissions and marketing spend to support future enrollment growth.\n\nIn the fourth quarter, CTU revenue rose 2.5% to $114.0 million, while operating income declined by $2.8 million, which management attributed in part to the increased investments and non-recurring compensation-related personnel items during the quarter.\n\nAIU System posted full-year revenue of $226.0 million and operating income of $36.0 million, up 9.8%. For the quarter, revenue was $53.8 million and operating income increased 3.4% to $4.0 million. Ghia said AIU System’s quarterly expenses also included non-recurring compensation-related personnel investments.\n\nAt the University of St. Augustine for Health Sciences, Perdoceo reported full-year revenue of $157.6 million. Excluding depreciation and amortization, adjusted operating income was $33.5 million. Ghia said spring term 2026 was “off to a strong start,” and the company expects new enrollment growth for summer and fall terms based on current prospective student interest.\n\nCorporate and other operating losses were $23.8 million for the year, improving from $30.5 million in the prior year, which Ghia attributed primarily to lower acquisition-related expenses.\n\nPerdoceo emphasized a “balanced” capital allocation approach. During 2025, the company repurchased 4.1 million shares for $120.8 million and paid $36.9 million in dividends, returning $157.6 million to shareholders in total. In the fourth quarter alone, it repurchased 1.8 million shares for $54.1 million, bringing the average repurchase price for the year to $29.17 per share. Management said the board approved a new share repurchase authorization of up to $100 million.\n\nThe board also declared a quarterly dividend of $0.15 per share, payable March 13, 2026, to shareholders of record as of March 2, 2026.\n\nOn taxes, Ghia said the company recorded a fourth-quarter income tax provision of $12.7 million, resulting in a full-year effective tax rate of 26.3%. Perdoceo expects a 2026 effective tax rate between 23.5% and 24.5%, which management said includes an estimated benefit related to stock-based compensation and the release of previously recorded tax reserves for uncertain tax positions. The company paid $49.3 million in federal, state, and foreign income taxes in 2025.\n\nNet cash provided by operations was $225.2 million in 2025, up from $161.6 million in the prior year, which management attributed primarily to improvement in adjusted operating income. Perdoceo ended the year with $643.5 million in cash, cash equivalents, restricted cash, and available-for-sale short-term investments, up about $51.9 million from the prior year-end. Capital expenditures were $8.6 million in 2025, and the company expects 2026 capital expenditures to be approximately 1.5% of revenue.\n\nLooking to 2026, Perdoceo guided for adjusted operating income of $250 million to $263 million, compared with $237.6 million in 2025. Adjusted earnings per diluted share are expected to range from $2.97 to $3.12, versus $2.61 in 2025, representing a 16% increase at the midpoint, according to management.\n\nFor the first quarter of 2026, the company expects adjusted operating income of $68 million to $70 million, compared with $63.5 million in the prior-year quarter, and adjusted earnings per diluted share of $0.83 to $0.85, versus $0.70 in the first quarter of 2025.\n\nGhia said the outlook assumes continued high student retention and engagement, increasing prospective student interest, and ongoing investments in technology, data analytics, real estate, academics, and student support processes. The company also plans to continue expanding corporate student program teams at CTU and AIU System.\n\nOn closing remarks, Nelson said he was “very pleased” with 2025 operating and financial performance and said the company’s capital position supports its goal of “sustainable and responsible growth.”\n\nPerdoceo Education Corporation (NASDAQ: PRDO) is a for-profit postsecondary education provider offering certificate, associate, bachelor's and master's degree programs. The company operates primarily through two brand platforms—Colorado Technical University and American InterContinental University—delivering career-focused education both on campus and online. These programs span fields such as business, information technology, healthcare and criminal justice, targeting working adults seeking to advance or pivot their careers.\n\nWith headquarters in Schaumburg, Illinois, Perdoceo serves students across the United States and internationally through its online offerings.\n\nThe article \"Perdoceo Education Q4 Earnings Call Highlights\" was originally published by MarketBeat."
    },
    {
        "title": "Military Platforms Market worth $76.25 billion by 2032 - Exclusive Report by MarketsandMarkets™",
        "url": "https://finance.yahoo.com/news/military-platforms-market-worth-76-151500670.html",
        "source": "Yahoo Finance",
        "date": "2026-02-20T15:29:00+00:00",
        "content": "DELRAY BEACH, Fla., Feb. 20, 2026 /PRNewswire/ -- According to MarketsandMarkets™, the military platforms market is projected to grow from USD 38.75 billion in 2025 to around USD 76.25 billion by 2032, registering a CAGR of about 10.2% during the forecast period.\n\nBrowse 430 market data Tables and 108 Figures spread through 470 Pages and in-depth TOC on \"Military Platforms Market - Global Forecast to 2032\"\n\nMilitary Platforms Market Size & Forecast:\n\nMarket Size Available for Years: 2025–2032\n\n2025 Market Size: USD 38.75 billion\n\n2032 Projected Market Size: USD 76.25 billion\n\nMilitary Platforms Market Trends & Insights:\n\nThe military platforms market is evolving steadily as defense forces prioritize modernization, operational readiness, and multi-domain capability enhancement across air, land, and naval assets. Manufacturers are increasingly focused on improving platform survivability, mission endurance, payload capacity, and interoperability through advances in propulsion systems, materials engineering, digital avionics, and integrated combat systems.\n\nBy Type, the military vessels segment is projected to grow at the highest CAGR of 13.2% during the forecast period, driven by fleet renewal and capability upgrades.\n\nBy Customer, the air force segment is projected to grow at the highest CAGR of 0.9% in terms of active fleet during the forecast period, driven by increasing operational deployment and modernization.\n\nBy Technology, the legacy segment is expected to account for the largest market share, by technology, having an estimated 94.50% of the market share in 2025. Growth is spurred on by ongoing fleet replacement cycles and mid-life upgrade programs.\n\nBy Region, Latin America is projected to be the fastest-growing regional market for military platforms during the forecast period, driven by rising internal security challenges, increased border surveillance requirements, gradual defense budget expansion in countries such as Brazil and Mexico, and a growing preference for cost-effective aircraft, vehicles, and naval platforms suited for domestic security and patrol missions.\n\nDownload PDF Brochure: https://www.marketsandmarkets.com/pdfdownloadNew.asp?id=109616288\n\nMarket growth is driven by sustained defense modernization programs, replacement of aging land, naval, and air platforms, and rising investment in technologically advanced military systems. The increasing emphasis on platform survivability, interoperability, and multi-mission capability is driving higher procurement values across major defense markets.\n\nThe global military platforms market continues to gain momentum, driven by the large installed base of military vehicles, vessels, and aircraft that require upgrades, replacements, and capability enhancements. Military vehicles account for the largest share of the market, supported by ongoing demand for armored supply trucks, mine-resistant ambush-protected vehicles, and armored personnel carriers used in logistics, mobility, and force protection roles. Spending in this segment is largely driven by sustainment and modernization rather than rapid fleet expansion.\n\nMilitary aircraft represent the fastest-growing platform in value terms, supported by continued investment in combat aircraft, helicopters, and special-purpose aircraft. Growth is driven by the need for improved air mobility, situational awareness, and mission flexibility across surveillance, transport, and multi-role operations. Military vessels contribute a smaller but steadily growing share of the market, with investments focused on patrol vessels, frigates, and other surface platforms aimed at strengthening maritime security and naval presence.\n\nRegionally, North America remains the largest market by value, driven by high platform complexity and sustained modernization spending. Europe follows with steady growth supported by replacement-led procurement and multinational defense programs. Asia Pacific continues to expand through sustained investments across land, air, and naval platforms, led by China and supported by modernization initiatives in other regional markets. Latin America is expected to record the fastest growth during the forecast period, driven by modernization from a low base, while Africa remains a comparatively small market with limited procurement activity focused mainly on sustainment.\n\nBy type, military vessels are projected to grow at the highest rate during the forecast period.\n\nMilitary patrol vessels are expected to register the fastest growth, driven by the rising emphasis on maritime security, coastal surveillance, and protection of exclusive economic zones. Navies are increasingly prioritizing offshore patrol vessels, fast patrol craft, and coastal security platforms to address asymmetric threats, maritime border enforcement, piracy, smuggling, and grey-zone operations.\n\nCompared to larger surface combatants, patrol vessels offer shorter construction timelines, lower acquisition and operating costs, and higher operational availability, making them attractive for rapid fleet expansion. Emerging naval forces, in particular, are accelerating investments in patrol vessels to strengthen maritime presence without the financial and logistical burden of high-end warships. This combination of operational relevance, affordability, and scalability underpins the strong growth outlook for patrol vessels.\n\nBy technology, legacy platforms are expected to account for the largest market share during the forecast period.\n\nLegacy military platforms are projected to maintain the largest share of the market, supported by their widespread deployment, operational maturity, and well-established industrial ecosystems. Defense forces continue to rely heavily on legacy aircraft, vehicles, and vessels due to their proven performance, predictable lifecycle costs, and compatibility with existing infrastructure and doctrine. Spending in this segment is largely directed toward incremental modernization, including avionics upgrades, propulsion improvements, structural reinforcements, and enhanced mission systems, rather than radical redesigns. Legacy platforms also benefit from robust global supply chains and long-term sustainment frameworks, reducing technical risk and ensuring high availability. While next-generation and advanced platforms are gaining strategic attention, Legacy systems remain central to maintaining readiness and force continuity, securing their dominant position within the overall military platforms market.\n\nInquiry Before Buying: https://www.marketsandmarkets.com/Enquiry_Before_BuyingNew.asp?id=109616288\n\nLatin America is projected to grow at the highest rate during the forecast period.\n\nLatin America is expected to register the fastest growth in the military platforms industry between 2025 and 2032, driven by rising defense investments from a relatively low base and an increasing focus on fleet replacement and modernization. Growth in the region is supported by selective procurement of military vehicles, aircraft, and naval platforms aimed at improving operational readiness and extending the service life of existing assets. While overall platform volumes remain limited compared to larger defense markets, higher spending intensity and modernization-led procurement are driving strong value growth across the region, cross-sector operational adoption, and strong government emphasis on unmanned capability development.\n\nSome of the major market players in military platforms companies include BAE Systems (UK), Lockheed Martin Corporation (US), Huntington Ingalls Industries (US), Boeing (US), and Rheinmetall AG (Germany).\n\nGet 10% Free Customization on this Report: https://www.marketsandmarkets.com/requestCustomizationNew.asp?id=109616288\n\nBrowse Adjacent Market: Aerospace and Defence Market Research Reports &Consulting\n\nSee More Latest Aerospace and Defence Reports:\n\nSatellites Market by Mass (1-1200 kg, 1201-2000 kg, >2000 kg), Application (Communication, Earth Observation, Navigation), Subsystem (Satellite Bus, Solar Panels, Payloads, Satellite Antenna), Frequency, Propulsion, and Region -Global Forecast to 2031\n\neVTOL Aircraft Market by Lift Technology (Lift+Cruise, Multirotor, Vectored Thrust), Range (<200, >200 km), MTOW (100-1000, 1001-2000, >2000 Kg), Propulsion (Fully Electric, Hybrid Electric), System, Application, and Region - Global Forecast to 2035\n\nMarketsandMarkets™ has been recognized as one of America's Best Management Consulting Firms by Forbes, as per their recent report.\n\nMarketsandMarkets™ is a blue ocean alternative in growth consulting and program management, leveraging a man-machine offering to drive supernormal growth for progressive organizations in the B2B space. With the widest lens on emerging technologies, we are proficient in co-creating supernormal growth for clients across the globe.\n\nToday, 80% of Fortune 2000 companies rely on MarketsandMarkets, and 90 of the top 100 companies in each sector trust us to accelerate their revenue growth. With a global clientele of over 13,000 organizations, we help businesses thrive in a disruptive ecosystem.\n\nThe B2B economy is witnessing the emergence of $25 trillion in new revenue streams that are replacing existing ones within this decade. We work with clients on growth programs, helping them monetize this $25 trillion opportunity through our service lines – TAM Expansion, Go-to-Market (GTM) Strategy to Execution, Market Share Gain, Account Enablement, and Thought Leadership Marketing.\n\nBuilt on the 'GIVE Growth' principle, we collaborate with several Forbes Global 2000 B2B companies to keep them future-ready. Our insights and strategies are powered by industry experts, cutting-edge AI, and our Market Intelligence Cloud, KnowledgeStore™, which integrates research and provides ecosystem-wide visibility into revenue shifts.\n\nMarketsandMarkets™ SalesPlay is an AI-driven Revenue Intelligence Co-Pilot designed to help revenue teams prioritize the right accounts, identify critical changes early, and surface opportunities ahead of demand, so pipeline builds naturally and deals close with greater consistency.\n\nTo find out more, visit www.MarketsandMarkets™.com or follow us on Twitter, LinkedIn and Facebook.\n\nContact: Mr. Rohan SalgarkarMarketsandMarkets™ INC. 1615 South Congress Ave.Suite 103, Delray Beach, FL 33445USA: +1-888-600-6441Email: sales@marketsandmarkets.comVisit Our Web Site: https://www.marketsandmarkets.com/Research Insight: https://www.marketsandmarkets.com/ResearchInsight/military-platforms-companies.aspContent Source: https://www.marketsandmarkets.com/PressReleases/military-platforms.asp\n\nLogo: https://mma.prnewswire.com/media/1868219/MarketsandMarkets_Logo.jpg\n\nView original content:https://www.prnewswire.com/news-releases/military-platforms-market-worth-76-25-billion-by-2032---exclusive-report-by-marketsandmarkets-302693466.html"
    },
    {
        "title": "Amazon Just Shared Great News for This AI Chipmaker (Hint: Not Nvidia)",
        "url": "https://www.aol.com/articles/amazon-just-shared-great-news-215000494.html",
        "source": "AOL",
        "date": "2026-02-20T04:50:00+00:00",
        "content": "Amazon's planning a big step up in capital expenditures for 2026.\n\nIt's showing very strong momentum in one particular area of Amazon Web Services.\n\nThis chipmaker could benefit despite reports that it lost some work with Amazon recently.\n\n10 stocks we like better than Marvell Technology ›\n\nAmazon (NASDAQ: AMZN) surprised investors when it shared its artificial intelligence (AI) spending plans for 2026. The tech giant is budgeting $200 billion for capital expenditures this year, nearly a $70 billion increase from 2025.\n\nA large portion of Amazon's new data center capacity coming online over the next couple of years will include Nvidia (NASDAQ: NVDA) GPUs. But a growing portion of Amazon's spending appears to be going toward another group of chipmakers, including one that investors can buy right now at a great price.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nCEO Andy Jassy told Amazon investors that Amazon's custom chip business within Amazon Web Services is now at a run rate of over $10 billion. What's more, it's still growing at a triple-digit percentage rate year over year.\n\nAmazon's custom chip business includes its Graviton CPU and custom AI accelerator chips for training and inference, Trainium and Inferentia. Jassy was particularly happy with the demand for its Trainium chips. He said the Trainium2 chip experienced its fastest-ever ramp-up in demand. The company announced Trainium3 in December, and Jassy said he expects the chip supply to be fully committed by mid-2026. It's also seeing strong interest in the upcoming Trainium4.\n\nIt's worth noting Amazon isn't the only company seeing strong demand for its custom AI chips. Alphabet has reported increased demand for its Tensor Processing Units. Anthropic reportedly ordered over $20 billion worth of the chips for deployment in its own data centers. Microsoft (NASDAQ: MSFT) and Meta Platforms are also moving a larger percentage of workloads to their custom silicon solutions. Meta is using its own chips for AI inference and for training its core ranking and recommendation algorithms. Microsoft is using its Maia 200 chip for inference with Copilot, among various other applications.\n\nWhile Nvidia remains a key supplier to all of the above companies, demand for custom silicon is clearly growing, and it may be growing the most at the largest cloud computing platform in the world, Amazon Web Services. That means Nvidia's biggest growth days may be behind it, while other chipmakers behind these custom silicon solutions could see considerable top-line and earnings growth still to come.\n\nAmazon partnered with Marvell Technology (NASDAQ: MRVL) to design its Trainium chips. The two solidified their partnership in late 2024, signing a five-year agreement for Marvell to supply chips from across its portfolio to AWS data centers.\n\nDespite the strong demand for Amazon's Trainium chips, though, Marvell's stock has struggled to find traction with investors. That's due to various reports indicating Marvell's position with Amazon, as well as its other big custom silicon customer, Microsoft, may be diminishing.\n\nAmazon is reportedly using AIChip for Trainium3 and Trainium4 chip designs. Marvell's earlier design accounts for only a small part of the chip's overall interface. As a result, licensing revenue from Amazon's new chip sales could fall relative to Trainium2.\n\nBut investors may have forgotten about Marvell's five-year agreement with Amazon. Marvell makes more than custom AI accelerators. In fact, its networking chips are a bigger business right now. Amazon will likely continue using Marvell for interconnect and other data center needs, such as switching and storage, which can easily be adapted from one Trainium chip design to the next generation. Its recent acquisition of Celestial AI should support its position in AI-focused interconnect chips.\n\nMarvell shares also took a hit from fears that it would lose its Microsoft design. But that doesn't seem to be the case for the time being. Management is forecasting a big step-up in fiscal 2028 custom AI accelerator revenue, in line with the expected ramp-up in Microsoft's Maia 300 chip it's designing.\n\nCEO Matt Murphy addressed the concerns in December, noting nothing has changed in the company's outlook since Amazon announced Trainium3 and reports about AIChip and Microsoft surfaced.\n\nAs such, Marvell looks like one of the best opportunities to capitalize on the rising demand for custom silicon solutions in hyperscale data centers. With shares trading for just 22.6 times forward earnings estimates as of this writing, the stock looks like an excellent opportunity for investors.\n\nBefore you buy stock in Marvell Technology, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Marvell Technology wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $420,595!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,152,356!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 899% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 19, 2026.\n\nAdam Levy has positions in Alphabet, Amazon, Meta Platforms, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Marvell Technology, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has a disclosure policy."
    },
    {
        "title": "Hamilton (HG) Q4 2025 Earnings Call Transcript",
        "url": "https://finance.yahoo.com/news/hamilton-hg-q4-2025-earnings-154202516.html",
        "source": "Yahoo Finance",
        "date": "2026-02-20T15:55:00+00:00",
        "content": "Friday, Feb. 20, 2026 at 9 a.m. ET\n\nChief Executive Officer — Pina Albo\n\nChief Financial Officer — Craig William Howie\n\nPina Albo: I want to take a moment to reflect on how far we have come at Hamilton Insurance Group, Ltd. We have been a public company since November 2023 and since then, we have delivered consistently strong results. Results that allowed tangible book value per share to grow 67% since the IPO. That is a remarkable achievement by anyone's measure. With that intro, and before I share more details on our quarterly results, there are three key drivers I would like to point to that underpin the sustainability of our performance. First, the Hamilton team. Namely our strong operational and underwriting culture.\n\nOur underwriters are technical and experienced in cycle management, leaning in and leaning out when and where rates, terms, and conditions are attractive, and when and where this is not the case. This approach has allowed us to post another year of record performance in 2025, so kudos to you, Team Hamilton. Second, our success is rooted in relationships, namely those we have built with clients and brokers across our hybrid platform. For reinsurance, our key client strategy, which involves supporting targeted partners across multiple lines, has created broad and resilient trading relationships allowing us to secure the signings we target even in competitive environments.\n\nAcross our insurance platforms, our specialized product offering and technical expertise serve as strong differentiators, positioning us well with our producers. And last but not least, our strong capital position. Our balance sheet remains robust with low debt leverage, prudent reserves, and strong financial strength ratings, all of which support our business and our performance. Now let me move on to our results. In 2025, Hamilton Insurance Group, Ltd. delivered record net income of $577,000,000, or return on average equity of 22%. We grew gross premiums written 21% to a record $2,900,000,000. We reported a combined ratio of 92.9% and grew tangible book value per share by 25%.\n\nAgain, these results reflect not only our skilled risk selection, commitment to cycle management, and strong broker and client relationships, but also the overall strength and stability of the organization we have built. After several hard market years, we now find ourselves in a transitioning market, but importantly, one that still provides ample pockets of attractive opportunities for underwriters like ours who are technical, astute, and nimble. A perfect segue to our fourth quarter highlights. We continue to deliver excellent top line growth this quarter with gross premiums written increasing 23%. In so doing, we focused on business where pricing and terms remained compelling and backed away from business which did not meet our return hurdles.\n\nThe fact that we are nimble and diversified across insurance, reinsurance, and multiple lines of business allows us to do that. Let me break down how this approach showed up across our three underwriting platforms. Starting with Bermuda, our Bermuda segment grew 27% this quarter, driven by casualty reinsurance, which is predominantly written on a quota share basis. This business continues to enjoy healthy underlying rate increases, which in turn flow through to us. Our growth this quarter came from a combination of new business written earlier in the year earning in, largely general liability and professional lines, and expanded participations on renewal business with our targeted key clients.\n\nAs a reminder, unlike many of our peers, our growth in casualty was recent, started from a small base, and occurred during a period when underlying rates have been improving considerably. Turning to the property book we write in Bermuda, and evidencing the flip side of cycle management, we continued to reduce our participations on large property D&F insurance accounts where competition was strong and consequently pricing did not meet our required thresholds. Moving to International, which houses Hamilton Global Specialty and Hamilton Select, gross premiums written grew 20% in the quarter. Starting with Hamilton Global Specialty, gross premiums written were up 21% driven by specialty and casualty classes in lines where we leaned into attractive opportunities.\n\nFor example, we grew mergers and acquisitions and marine lines, with a particular boost from the recent launch of our new marine cargo offering. On the other hand, and similar to what we did in Bermuda, we pared back our writings of large property D&F insurance accounts which did not meet our return expectations. And finally, Hamilton Select. Our U.S. E&S platform, which focused solely on casualty classes in 2025, grew 19% in the quarter. Growth was driven by excess casualty, products and contractors, and small business, where we were able to secure attractive pricing, terms, and conditions, but we wrote less professional liability business as we were not satisfied with the pricing environment.\n\nNow that is cycle management in action. Let me now turn to the January 1 renewal season. Overall, we entered the renewal period from a position of strength. Our capital is robust, our underwriting discipline unwavering, and our relationships with clients and brokers strong. Consequently, this was a constructive renewal for us, one where we were able to deploy capital while protecting margins. Starting with property cat. The renewal season was defined by abundant capacity and strong competition, particularly on the higher layers. As you will have heard from my peers, pricing for global property catastrophe business declined at 1/1, but discipline prevailed to keep terms, conditions, and attachment points largely consistent with post-reset levels.\n\nWe focused our capital deployment on well-performing property accounts where risk-adjusted pricing remained attractive. We also leveraged cost-effective retrocession—we benefited from double-digit rate reductions—to maintain adequate margins even as headline rates declined. Turning to casualty. Competition on casualty reinsurance was more measured. Going into 1/1, strong underlying insurance rate increases that flow through to the proportional business we support continue apace, and ceding commissions were generally flat. In fact, given the attractiveness of underlying rates, some cedents chose to retain more of their own business, but we still managed to grow our modest shares on core key clients, a factor that contributed to our growth.\n\nAs I have said in prior calls, our focus in the casualty area continues to be on those clients who retain a large percentage of their business, provide us good data, and continue to invest in their in-house claims handling. In specialty reinsurance, conditions remained favorable for buyers with increased reinsurer appetite and limited growth opportunities overall, though the picture varied meaningfully by class. Our key client cross-class engagement shone through here, providing some increased signings and new business opportunities, including in our relatively new credit, bond, and political risk offering.\n\nOverall for 1/1, the good news for us was that we were able to secure our targeted signings in a competitive market where even our clients looking to retain more of their own business net. As I look further into 2026, we expect the market to remain competitive but that pricing across the lines of business that we target to remain largely risk adequate. Consequently, while we are confident in our ability to continue to find attractive opportunities, I expect our growth going forward to be more measured than it was in the past. In other words, in areas where the market gets too competitive, we will not chase top line at the expense of the bottom line.\n\nThis disciplined approach will ensure we deliver sustainable results. And with that, I will turn the call over to Craig for some more depth into our financials for the quarter and 2025. Thank you, Pina, and hello, everyone.\n\nCraig William Howie: In 2025, Hamilton Insurance Group, Ltd. had a very strong year of financial results, with record net income of $577,000,000, 44% above the $400,000,000 of net income in 2024. We had a return on average equity of 22% compared to 18% in the prior year, and we grew book value per share by 24% over the prior year to a record $28.50. For the fourth quarter of 2025, Hamilton reported net income of $172,000,000, equal to $1.69 per diluted share, producing an annualized return on average equity of 25%. We had operating income of $168,000,000, equal to $1.65 per diluted share, producing an annualized operating return on average equity of 25%.\n\nThese results include strong underwriting income, solid investment returns, as well as a tax benefit from the reversal of valuation allowances against some of our deferred tax assets and the Bermuda substance-based tax credit. Without these two tax items, the annualized operating return on average equity would still have been a healthy 18%. I will discuss this more in detail shortly. These quarterly results compare favorably to 2024 fourth quarter net income of $34,000,000, or $0.32 per diluted share, an annualized return on average equity of 6%, operating income of $87,000,000, or $0.82 per diluted share, and an annualized operating return on average equity of 15%.\n\nBefore I move on to our underwriting results, I want to talk through the two tax items: one, the Bermuda substance-based tax credit, and two, the tax benefit in our income tax line. The Bermuda Tax Credit Act became effective on December 11. Under this framework, we qualify for the new substance-based tax credit, which is designed to reward insurers that demonstrate meaningful local economic activity in Bermuda. As a reminder, this credit enhances the competitive advantage for Hamilton Insurance Group, Ltd. since we are exempt from the Bermuda 15% global minimum tax until the year 2030. The credit was driven by both jobs-based and expense-based components and is applied against the Bermuda group’s tax liability.\n\nThe program includes a transition schedule allowing recognition of 50% of the credit in 2025, 75% in 2026, and the full 100% benefit for fiscal years beginning in 2027. In 2025, we accrued the full credit in the fourth quarter when the Bermuda tax law was passed. Going forward, we will accrue the credit over a 12-month period, reporting it quarterly, based on qualifying payroll and eligible expenses. In our financial statements, the credit flows through as a contra expense to the other underwriting expense and corporate expense line items. For 2025, we recorded a Bermuda substance-based tax credit of $20,700,000.\n\nIn the Bermuda segment, this was a $17,300,000 offset to the other underwriting expenses, and in corporate expenses, a $3,400,000 offset. For 2026, all things staying about the same, we would expect the Bermuda credit of about $27,000,000 based on a 75% phase-in for the year. We will also no longer have a value appreciation pool expense in 2026, since the VAP program ended in 2025. Turning to the tax benefit on our income tax line, we recorded a net tax benefit of $28,000,000 arising from the net release of valuation allowances against deferred tax assets in the United Kingdom and the United States, jurisdictions which had previously accumulated deferred tax assets due to tax net operating loss carryforwards.\n\nThis tax benefit came through the income tax line on our income statement. Moving on to underwriting results. For the full year 2025, Hamilton Insurance Group, Ltd. continued to grow its top line at an impressive double-digit rate. Our gross premiums written increased to a record $2,900,000,000, compared to $2,400,000,000 this time last year, an increase of 21%. Each of our platforms, Hamilton Global Specialty, Hamilton Select, and Hamilton Re, expanded where there were attractive opportunities and pulled back from underperforming lines to maintain margins and drive profitability. In terms of underwriting performance, our 2025 year-end combined ratio was 92.9%. Now for some more detail on our quarterly underwriting figures.\n\nHamilton had underwriting income of $76,000,000 for the fourth quarter, compared to underwriting income of $22,000,000 in the fourth quarter last year. The group combined ratio was 87% compared to 95.4% in 2024. In the fourth quarter, our loss ratio improved to 54.6%, down 5.5 points from 60.1% in the prior period. The improvement was driven by meaningfully lower net catastrophe losses, which were 9.0 points better than 2024. This was partially offset by higher attritional losses of 56.5% compared to 51.2% in the prior period. The increase in attritional was driven by more large losses compared to the same period in 2024 and the change in business mix, including increased casualty reinsurance business.\n\nFor the full year 2025, the attritional loss ratio was 54.4% compared to 53.1% in 2024, for the same reasons. In the fourth quarter of 2025, we had favorable prior-year attritional development of 3.1 points, driven by property and specialty classes. This compares to 1.3 points of favorable development in the fourth quarter last year. The expense ratio decreased 2.9 points to 32.4%, compared to 35.3% in the fourth quarter last year. The decrease was mainly driven by the Bermuda substance-based tax credit and third-party fee income which offsets other underwriting expenses. Before I turn to segment results, I wanted to provide guidance on some items for 2026.\n\nBeginning in 2026, we are increasing our catastrophe and headline loss threshold from the current $5,000,000 to $10,000,000. Given the size of Hamilton Insurance Group, Ltd. now, this revised threshold is at a level that is commensurate, focusing on events that are truly headline losses. This means the attritional loss ratio will now include all losses of less than $10,000,000. We would expect the attritional loss ratio to run at about 55% in 2026. On expenses, we expect our other underwriting expense ratio to continue to decrease incrementally in 2026. Our corporate expenses to run between $45,000,000 and $50,000,000 for the year. Next, I will go through the fourth quarter results by segment.\n\nLet us start with the International segment, which includes our specialty insurance businesses, Hamilton Global Specialty and Hamilton Select. In the fourth quarter, International had underwriting income of $12,000,000 and a combined ratio of 96%, compared to underwriting income of $9,000,000 and a combined ratio of 96.3% in the fourth quarter last year. The decrease in the combined ratio was primarily related to the loss ratio decreasing 1.7 points, partially offset by the expense ratio. The current-year attritional loss ratio was 5.5 points higher than the prior period due to large loss activity in the quarter, while the prior period had no large loss activity. The prior-year attritional loss ratio was a favorable 2.3 points.\n\nThis was driven by favorable development in our property and specialty classes. The expense ratio increased 1.4 points to 42% compared to 40.6% in the fourth quarter last year. The increase was primarily driven by the acquisition cost ratio due to less ceding commissions and more profit commissions, and a decrease in third-party management fee income. Other underwriting expenses were down 2.3 points. Moving to some full-year figures, in 2025, International grew to $1,500,000,000, up from $1,300,000,000, an increase of 16%. This was driven by growth across all classes: property, specialty, and casualty. The 2025 year-end combined ratio was 95% compared to 95.6% for 2024.\n\nThe full-year 2025 current-year attritional loss ratio was 54% compared to 53.5% in 2024 due to a change in business mix. Given the revised threshold for catastrophe and headline large losses, we would expect our International segment to have an attritional loss ratio of around 54.5% in 2026. I will now turn to the Bermuda segment which houses Hamilton Re and Hamilton Re U.S., the entities that predominantly write reinsurance business. In the fourth quarter, Bermuda had underwriting income of $63,000,000 and a combined ratio of 76.4%, compared to underwriting income of $13,000,000 and a combined ratio of 94.3% in the fourth quarter last year.\n\nThe decrease in the combined ratio was primarily related to lower catastrophe losses and lower expenses in the quarter, partially offset by an increase in the current-year attritional loss ratio. The Bermuda current-year attritional loss ratio increased 5.0 points to 56.7% in the fourth quarter, compared to 51.7% in the fourth quarter last year. This was primarily driven by more large losses in the quarter compared to the same period in 2024, and a change in business mix, including an increase in the casualty reinsurance business. The Bermuda prior-year attritional loss ratio was a favorable 4.1 points. This was primarily driven by favorable development in our property class.\n\nThe Bermuda expense ratio decreased by 8.3 points to 21.2% compared to 29.5% in 2024, driven by a decrease in the other underwriting expense ratio primarily due to the Bermuda substance-based tax credit of $17,000,000 and increased third-party performance-based fee income, partially offset by the acquisition cost ratio due to a change in business mix. Moving to some full-year figures, in 2025, Bermuda grew to $1,400,000,000, up from $1,100,000,000, an increase of 26%. The increase was primarily driven by new and existing business in casualty and specialty reinsurance classes. The 2025 year-end combined ratio was 90.9% compared to 87% in 2024. The full-year 2025 current-year attritional loss ratio was 54.6% compared to 52.7%.\n\nThe increase was due to more large losses and business mix shifting toward casualty reinsurance which carries a higher attritional loss ratio. Given the business mix shift and the revised threshold for catastrophe and headline losses, we would expect an attritional loss ratio of about 56% for our Bermuda segment in 2026. Now turning to investment income. Total net investment income for the fourth quarter of 2025 was $98,000,000 compared to investment income of $36,000,000 in 2024. The fixed income portfolio, short-term investments, and cash produced a gain of $42,000,000 in the quarter, compared to a loss of $31,000,000 in 2024.\n\nAs a reminder, this includes the realized and unrealized gains and losses that Hamilton Insurance Group, Ltd. reports through net income as part of our trading investment portfolio. The fixed income portfolio had a return of 1.2% or $38,000,000 and a new money yield of 4.2% on the fixed income investments purchased this quarter. The duration of the portfolio remains at 3.4 years. The average yield to maturity on this portfolio was 4.1% compared to 4.7% at year-end 2024. The average credit quality of the portfolio remains strong at AA3. The Two Sigma Hamilton Fund produced a $56,000,000 net return for the fourth quarter of 2025, equal to 2.6%.\n\nFor the full year of 2025, the fund had a net return of 16% or $310,000,000. The Two Sigma Hamilton Fund made up about 37% of our total investments including cash at 12/31/2025, compared to 39% at 12/31/2024. Now turning to capital management. As you may have noted in our fourth quarter earnings release, we announced that Hamilton Insurance Group, Ltd.’s Board of Directors has declared a special dividend of $2 per common share, which will result in an aggregate payment of approximately $206,000,000. The decision to pay a special dividend was based on the company's record earnings in 2025 and our excellent capital position. This dividend represents an effective way of returning excess capital to our shareholders.\n\nFor the full year 2025, we also repurchased $93,000,000 worth of shares at an average price of $22.13 per share. Even with this special dividend, we are able to continue repurchasing shares under our current share repurchase authorization, which remains in effect with an unutilized limit of $178,000,000. Both the special dividend and the share repurchases reflect our ongoing commitment for active and effective capital management. Next, I have some comments on our strong balance sheet at year-end 2025. Total assets were $9,600,000,000 at December 31, 2025, up 23% from $7,800,000,000 at year-end 2024. Total investments and cash were $5,900,000,000 at December 31, an increase of 24% from $4,800,000,000 at year-end 2024.\n\nShareholders' equity for the group was $2,800,000,000 at year-end 2025, which was a 21% increase from year-end 2024. Our book value per share was $28.50 at December 31, up 24% from year-end 2024. Thank you. And with that, we will open up the call for your questions.\n\nOperator: We will now begin the question and answer session. If you would like to ask a question, please press 1 on your telephone keypad. To withdraw your question, press 1 again. Please pick up your handset when asking a question. If you are muted locally, please remember to unmute your device. We ask that you limit yourself to one question plus one follow-up, and then rejoin the queue for any further questions. Our first question comes from the line of Hristian Getsov with Wells Fargo. Your line is open.\n\nHristian Getsov: Good morning, and congrats on the strong quarter. My first question is on the underlying loss ratio guide for 2026. The 55% for the full year. If you did not change the cat definition threshold, what would that look like versus the 54.4% we saw in 2025? And given the definitional change, is there a new cat load Hamilton Insurance Group, Ltd. will manage to for each of the segments? Thank you.\n\nCraig William Howie: Hi, Hristian. First of all, thanks for the question. So first of all, we did guide to the 55%. Part of that increase over the full year 2025, which was 54.4%, the majority of that increase is the change in the threshold that we have. The business mix for 2026 will remain about the same, so we would expect the attritional to have remained about the same, but that is the change in our threshold from the $5,000,000 to the $10,000,000 threshold that is taking that loss pick up to the 55% guidance.\n\nAs far as catastrophe losses, our catastrophe losses will come down slightly, but they will still be in the range of about 6% to 7% for our catastrophe losses for the year.\n\nHristian Getsov: Got it. All that makes sense. And then could you just give a little bit more color on deciding to deploy a special dividend? I would think given where your shares are at currently, I mean, the gap that has closed versus book value, but still close to or a little bit below. I guess, why not buy back more of your shares? So this is just a more effective way to get rid of that excess capital since it could be an ROE drag? Or how should we think about that? And should we expect maybe a more modest level of buyback in 2026 just given the deployment of the special?\n\nCraig William Howie: Good question. What I would say to you is we have the flexibility to do both of these things. And after a record year of earnings, we decided to return a portion of our capital. A special dividend is an active and an effective way of returning that capital quickly to our shareholders. But we will also be able to continue buying back shares. As you know, we bought back $93,000,000 worth of shares in 2025, and we still have the ability to buy back under our authorization. We still have $178,000,000 to be able to do that. We have a really strong track record of being good stewards of capital.\n\nAnd when we see and have strong business opportunities to deploy that capital there, we are going to do that. As you know, for example, we have been able to do that by growing our premiums at double-digit levels every year since 2017. But otherwise, we are going to return some of this excess capital to our shareholders and that is what we are doing here with the special dividend as well as the share buybacks. We have the ability to do both.\n\nHristian Getsov: Got it. Thank you. And if I could sneak in one more on the E&S platform. The growth is moderating a little bit, but in part, that is likely due to a higher base you are growing off. But are you seeing any signs of increased competition on the casualty side from MGAs, fronting companies, or other admitted carriers? We have heard a lot of competition on the property side, but I am not sure if you are seeing that on the casualty side as well. Thank you.\n\nPina Albo: I will take that, Hristian. Thanks for the question. Firstly, I think it is important to note the growth that we saw on Hamilton Select this quarter has been completely in line and year to date is completely in line with what our expectations were. We continue to see robust pricing, particularly in the areas where we grew more this year. That was, once I mentioned, the excess casualty, products and contractors, and small business. In terms of increased competition, where we are seeing that is on the professional lines side, and that is where we wrote less of this business this quarter.\n\nOverall, I think I take a step back and look at Select, again, completely in line with plans. It is an incredibly important growth engine for us, given the strength of the team that we have assembled there and the relationships they have. You will notice some recent hires recently that we announced that we will be launching in the property space, and that will concentrate on the smaller to mid-sized property business where we are not seeing the robust competition that we have seen in large accounts space where we have shed business. I hope that answers your question.\n\nHristian Getsov: Yep. Thank you.\n\nOperator: Your next question comes from the line of Thomas Patrick McJoynt-Griffith with KBW. Your line is open. Please go ahead.\n\nThomas Patrick McJoynt-Griffith: Hey. Good morning, guys. Thanks for taking the questions. What is the optimal premium leverage that you would like to manage to? And is that changing as the portfolio mix leans heavier toward casualty growth after a period when property growth was stronger?\n\nCraig William Howie: Hi, Tommy. It is Craig. You know, our premium leverage has not really changed very much. We have been retaining about 80% of the business on a net basis. But over time, you know, your point is valid. As we go into a transitioning type market, one of the things that we do not want to do is just blindly edge up on the premium leverage for that purpose. You may recall in 2024, we essentially retained more of our business because we had primary proceeds from the IPO that we wanted to put to work.\n\nAnd in 2025, we actually were able to buy a little bit more reinsurance coverage for the overall book because the quality of business that we had been putting on the books gave us the ability to get lower rates for those reinsurance purchases. So we have been able to do that over time; we have been able to retain, and that retention rate has stayed right around 80%.\n\nThomas Patrick McJoynt-Griffith: Okay. Got it. And then maybe a question on the data center opportunity. You know, a lot of carriers have been asked about it, and it is going to be a great need for capital over the coming years. I guess the question is, do you guys have sort of the expertise to play in that niche? Are there little pockets of opportunities there, or is it a great, large opportunity? What are you guys doing on the data center side?\n\nPina Albo: I will take that one. We are certainly seeing some more of that business and we see it as an opportunity, and we are taking up some of these opportunities. For example, writing some physical damage-only covers where it only covers contents and does not cover business interruption. I think that although this is an opportunity and we will lean in with our expertise that we have in-house, we are also a little bit cautious here on, you know, accumulation, particularly on the large data centers. So we are monitoring that very closely when we look at our writings. And, also, the whole business interruption area.\n\nAgain, the physical damage cover that we are now offering on the insurance side does not include business interruption. So we are looking at this as an opportunity, but also looking at it very cautiously, with those factors in mind.\n\nOperator: Our next question comes from the line of Daniel Cohen with BMO Capital Markets. Your line is now open. Please go ahead.\n\nDaniel Cohen: Hey, good morning. Thanks for taking my first one, maybe just on reserves. If you could just add a little more color on the years and the classes that the property and specialty favorability came from this quarter. And then maybe just anything on how casualty reserves moved this quarter and if there has been any change in loss trend there? Thanks.\n\nCraig William Howie: Yes. Hi, Daniel. So first of all, overall, our reserves were favorable for the quarter. None of that came from casualty. So overall, casualty was flat for the quarter with no movement. So this was another year of favorable reserve development for Hamilton Insurance Group, Ltd., something that we have been able to achieve each and every year since the inception of the company. But to your point, yes, the favorable development this quarter came from property and specialty, mostly from the property side.\n\nWhat we typically do on the property side is take a look at those reserves that have been in place or have matured over a period of time for over two years, and we take a look at that. And some of those we were able to release in the fourth quarter and throughout the year as well. We actually have a reserve review done by an outside actuary twice a year on our book of business.\n\nAnd we consequently take a look at their guidance that they see when they are looking at the industry levels as well as other clients—so other peers of ours—and it gives us an indication of where we stand against what an outside actuary would look at, and we would remain above the midpoint of their estimate consistently year after year.\n\nDaniel Cohen: Right. Thanks. And then, Pina, on the casualty reinsurance side, you just mentioned preferring clients with good data, in-house claims handling. I was just wondering, could you add more color on maybe what differentiates those clients versus maybe some others in the marketplace? And whether or not Hamilton Insurance Group, Ltd. is embedding their own conservative margin on top of where their cedents are picking? Thanks.\n\nPina Albo: Yes. I will take that question. So just maybe a little bit of a background. Again, we started from a very low base when it came to casualty business. And in the context of our AM Best first positive outlook and then our upgrade, we had targeted in advance the clients that we wished to support on the casualty side. And these are clients that we knew well already from property and specialty placements that we enjoy with them. And those clients there provide us robust data so we can see what they are doing in terms of limits management, pricing versus what they are seeing in trends.\n\nWe look at it with respect to what we are seeing and what we anticipate trending to be. So that already is one tick. Then we look at how robustly they handle their claims in-house and how quickly they resolve these claims. So all in all, those are the kinds of clients we target when we look at our reinsurance support, and because we are able to support them broadly across classes, that makes these relationships very resilient.\n\nDaniel Cohen: Thanks. And then, also, I think if I could sneak one more just on the corporate expense line. Craig, I think you said there is going to be no more value appreciation pool expenses there. So outside of that tailwind from the Bermuda tax credit, should we expect this line to continue to tick down? Or how should we think about that?\n\nCraig William Howie: Yeah, Dan. Certainly, that is exactly what you would expect. Certainly, the value appreciation pool expired, and the second tranche of that pool vested in November 2025. So the VAP is no longer there. And the guidance that I have given in the prepared remarks is that you can expect corporate expenses to be in the range of $45 to $50 million.\n\nOperator: Your next question comes from the line of Matthew Heimerman with Citi. Your line is now open. Please go ahead. Your next question comes from the line of Justin Lee with Barclays. Your line is now open. Please go ahead.\n\nJustin Lee: Hi, everyone. Thanks for taking the question. The first one I had was just on the Two Sigma Hamilton Fund. I believe in previous quarters, you guys gave sort of the year-to-date, month-to-date returns. And maybe I might have missed it, but I was just wondering if you guys can provide what returns were as of January.\n\nCraig William Howie: Yeah. Hi, Justin. This is Craig. You know, with respect to us having earlier reporting than we have had in the past, it is not as meaningful now for us to provide that type of guidance anymore. So going forward, we are going to report these results on a quarterly basis with no lag, just like we do with the rest of our portfolio. What I will tell you is that Two Sigma has historically outperformed in a volatile market. And as you know, we have been very fortunate to have the partnership that we have with Two Sigma.\n\nWe have had a 13% average annualized return every year since the inception of the fund in 2014, and the fund has never had a calendar year loss. So again, going forward, we will report this on a quarterly basis with the same as the rest of our call.\n\nJustin Lee: Got it. Thank you. And second one, more high level. Appreciate your comments around scaling back on the large property side and focusing on areas that are, you know, still getting relatively better pricing versus loss cost. And on the other hand, I am sort of seeing data points that suggest that maybe on the primary side, the pressures on property may be permeating onto the general liability and other lines of casualty side on the pricing front. I was wondering if you can kind of help me square those two dynamics, and how you guys are sort of thinking about growth?\n\nUnderstand it is going to be more measured, as you said, but just a little bit more color there would be helpful. Thank you.\n\nPina Albo: Sure. I will take that, and thank you for the question. Firstly, on the property side, you are right. Where we are seeing the most pricing pressure is on those large insurance accounts, those large scheduled accounts, and that is where you have seen us pare back our writings consistent with our disciplined approach to underwriting. On the middle market and the smaller property accounts, we are not seeing that level of pricing pressure, so we are still seeing some attractive opportunities there, and that is where we are seeing some growth. And that is where our new underwriting offering in Hamilton Select will lean into. So that is on property.\n\nOn the casualty side, we are still seeing some health increases on the insurance side of the equation. And that is actually supported by the fact that a lot of our cedents, and I mentioned that in my prepared remarks, seeing these robust pricing increases are keeping more of their business net. They are also confident that pricing is keeping pace with the trend that we are seeing out there. So we do not see any signs of that casualty pricing abating. And as long as it is in that area where it is keeping pace with trend, or we feel it is, we will continue to look at that business.\n\nOperator: Our next question comes from the line of David Sedor with Citizens. Your line is now open. Please go ahead.\n\nDavid Sedor: Hi. Thank you, and good morning. On the special dividend, what will be the source of funds there? Is that cash already on hand or from the Two Sigma fund or fixed income portfolio or maybe a mix of those?\n\nCraig William Howie: Hi, David. This is Craig. Yes. It is from available cash on hand as well as the fixed income portfolio.\n\nDavid Sedor: Thank you. And then are you able to provide any color on the elevated large losses in both segments from the quarter?\n\nCraig William Howie: Sure. I can do that. So essentially, what happened this quarter in 2025 is we had more large losses in this quarter than we did in 2024. The largest loss that we had this quarter was a satellite loss. It impacted both segments for us in our specialty classes of business. And this is exactly the reason why we changed the threshold in our catastrophe and large headline loss, to the capture of these truly headline losses. We wanted to make sure that we gave guidance on what that impact would be going forward. That is why we gave the guidance going forward for the attritional loss ratio.\n\nBut essentially, of these types of losses that come through, it was impacting our attritional loss ratio up and down just based on some of these large losses, and we wanted to make sure that we are taking that into account.\n\nOperator: If you would like to ask a question, please press 1 on your telephone keypad. To withdraw your question, press 1 again. Please pick up your handset when asking a question. If you are muted locally, please remember to unmute your device. Our next question comes from the line of Matthew Heimerman with Citi. Your line is now open. Please go ahead.\n\nMatthew Heimerman: Hi. Good morning, everybody. Apologies for earlier. I guess first question would be, with respect to the Bermuda tax credit and the significant savings, or offsets to expenses you are getting there, I am curious if there are any thoughts around potentially reinvesting some of that incremental savings on a go-forward basis either for new priorities or accelerating existing investments that might already be on your roadmap?\n\nCraig William Howie: Yeah. Thanks, Matt. You know, the credit is really designed to reward insurers that demonstrate meaningful local economic activity in Bermuda. This credit really keeps Bermuda as an attractive place to do business. And there are two components that we are able to take advantage of under this credit, which are jobs-based and expense-based components. We are going to continue to invest in our projects, our operations, and our technology to operate at scale in Bermuda. And for a company the size of Hamilton Insurance Group, Ltd., we have a large footprint, a significant presence in Bermuda with over 100 people in our office there, and we also hold all of our board meetings in Bermuda.\n\nSo while we are not specifically designating these funds to a particular purpose, they will serve to reduce our overall operating expenses. And, again, this shows up as a contra expense in our other underwriting expenses in the Bermuda segment as well as in our corporate expenses.\n\nPina Albo: And, Matt, maybe I will just add on to that. I think if you look at our history, we have a very strong track record of investing in our underwriting capabilities and in adding new lines of business, whether it is on the reinsurance side over the years, most recently in our credit and bond offering, but also prior to that by adding per risk and proportional, and also on the insurance side by adding attractive lines of business, be that in our Hamilton Global Specialty platform or also in Hamilton Select. So I think you will see that continue in our future.\n\nMatthew Heimerman: Thanks for that. I guess the other question would be, just can you remind us the guiding principles that you have with respect to technology and underwriting to help us better frame as you invest in new technologies and implement AI, more use cases just how to frame that?\n\nPina Albo: Sure. I will take that. And, Craig, if you want to add anything, be my guest. But I think you start with the fact that we have, and we are very proud of the fact that we have, very robust underwriting tools and underwriting frameworks that are regularly calibrated for what we are seeing in the market. And we calibrate them because we meet very regularly as a team, both on the platform side, but at the executive level and then across the group, to share insights, monitor pricing expectations, and all of that gets retooled into our underwriting tools. If I segue from there to how we are embracing AI, I say that we are embracing AI.\n\nI think I have mentioned on a prior couple of prior calls that we are already deploying AI in several use cases across our platform, both on the underwriting and the claims side. The use cases are predominantly for efficiency purposes, and what that means is it allows us to extract data, populate our underwriting workbenches, summarize some very complex reports, and what that does is it allows us to get to more business more quickly. In Hamilton Select, you will have heard, in addition to this populating of workbenches, we are looking to roll out in the course of 2026 a smart queuing feature which will allow us to triage the risk better.\n\nThat means not only just getting more hits at bat, but getting more swings at balls we know we are going to hit. So that is how we look at AI. I think the other thing you should know in this context is our guiding principle here is to ensure at the same time as we are embracing AI that we have a robust control framework in place to avoid any unintended consequences of this new technology.\n\nMatthew Heimerman: Thanks for that. One of the things—just one quick follow-up. One of the things I am struggling with is one of the benefits clearly is efficiency, and you mentioned that. And, obviously, that can take the form of doing more with the same or doing the same with less, and many permutations. So I am curious when you think about the efficiency savings, like, how concentrated they are to Bermuda relative to the rest of your platform? And I am kind of asking that in the context of just talking about the tax credits, which are supposed to spur investment there. And this obviously allows you to do.\n\nJust curious if those are in contrast with the others specifically, but more broadly, as we think about how you staff and how you invest, how that might look differently around your platform.\n\nPina Albo: Yeah. We have not yet come up with a number in terms of savings we are going to achieve in dollar terms from this technology, but we are seeing benefits of the technology across all three platforms. In Bermuda, we have been deploying AI technology for a couple of years now, and we are also using it increasingly, again, across our Hamilton Select and Hamilton Global Specialty platforms for our insurance business. Over time, we will continue to see the benefit of this technology, but it is across all three of our platforms.\n\nMatthew Heimerman: Thank you for that.\n\nOperator: Thank you. That will conclude our question-and-answer session for today. I will now turn the call back over to Pina Albo.\n\nPina Albo: Thank you. I want to just take a minute to thank everybody here for joining our call today and engaging with us as you have. We are once again incredibly proud of the results we achieved this year, and we look forward to speaking to you in the very near future.\n\nOperator: This concludes today's call. Thank you for attending. You may now disconnect.\n\nBefore you buy stock in Hamilton Insurance Group, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Hamilton Insurance Group wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $415,256!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,151,865!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 892% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 20, 2026.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.\n\nHamilton (HG) Q4 2025 Earnings Call Transcript was originally published by The Motley Fool"
    }
]