[
    {
        "title": "Diamond Hill Capital boosts Meta Platforms stake by 20,305 shares",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/META-Q/pressreleases/99210/diamond-hill-capital-boosts-meta-platforms-stake-by-20-305-shares/",
        "source": "The Globe and Mail",
        "date": "2026-02-09T09:01:00+00:00",
        "content": "Diamond Hill Capital Management Inc, managed by Ric Dillon, recently executed a significant transaction involving Meta Platforms, Inc. ((META)). The hedge fund increased its position by 20,305 shares.\n\nRecent Updates on Meta Platforms, Inc. stock\n\nOver the past month, Meta Platforms’ stock has generally trended higher despite some short-term volatility, with recent snapshots showing moves ranging from a modest decline (~1% over the month in some periods) to strong gains (up about 12% over the past week and 11.8% over the past month in the latest data), and 12‑month performance improving from roughly flat to mid‑single‑digit gains. Throughout these swings, Wall Street sentiment remains decisively bullish: the analyst consensus is a StrongBuy, with average 12‑month price targets clustered around $825–$860 and several top-ranked analysts setting targets between $850 and $910, implying sizable upside from recent prices in the mid‑$600s to mid‑$700s. The key driver of this optimism is Meta’s “unquestionably strong” recent quarter, highlighted by about $59.9 billion in Q4 revenue (roughly 23% year‑over‑year growth) and GAAP EPS of $8.88, both ahead of expectations, plus a first‑quarter revenue outlook that implies accelerating growth. Analysts attribute the performance to accelerating ad revenue, improved pricing and impressions, and surging engagement—especially in Reels—powered by Meta’s heavy investment in AI for content ranking, recommendation, and ad tools. While 2026 capex and operating expenses are guided well above prior Street forecasts, analysts largely view these AI and infrastructure outlays as de‑risked by the stronger revenue trajectory and improved monetization, not as a drag. Complementing this, Meta has announced long‑term nuclear power partnerships with Vistra, TerraPower, and Oklo to secure up to 6.6 GW of energy capacity by 2035, a move seen as strategically important for ensuring sufficient, cost‑predictable power to support its data centers and AI superclusters over the next decade. Overall, recent commentary frames Meta’s large AI and energy investments as building a durable competitive moat and supporting faster revenue and EPS growth, reinforcing the bullish outlook despite elevated spending and near-term share price volatility.\n\nAccording to Spark, TipRanks’ AI Analyst, META is a Outperform.\n\nThe score is driven primarily by very strong profitability and cash generation, tempered by rising leverage and signs of moderating growth. Technicals remain supportive but look overbought, while valuation is somewhat expensive with a very low dividend yield. Earnings call takeaways were positive on ad and AI momentum, but the large planned 2026 expense/capex ramp and ongoing Reality Labs losses add execution risk.\n\nTo see Spark’s full report on META stock, click here.\n\nMore about Meta Platforms, Inc.\n\nAverage Trading Volume: 17,410,455\n\nDisclaimer & DisclosureReport an Issue\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Google and Meta Just Rewrote Broadcom's AI Story—While Shares Drop",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/META-Q/pressreleases/107637/google-and-meta-just-rewrote-broadcoms-ai-story-while-shares-drop/",
        "source": "The Globe and Mail",
        "date": "2026-02-09T15:08:00+00:00",
        "content": "Early in 2026, shares of semiconductor giantBroadcom (NASDAQ: AVGO) are continuing on their negative trajectory that characterized the end of 2025. As of the Feb. 5 close, AVGO stock has fallen 10% on the year. Overall, shares are now down 23% since the company last reported earnings on Dec. 11, 2025. However, the outlooks provided by key U.S. hyperscalers make this drop in shares look like an opportunity.\n\nWith hyperscaler capital expenditure (CapEx) guidance coming in much higher than anticipated, Broadcom’s future looks bright amid the sell-off.\n\nHyperscaler CapEx is a key indicator of Broadcom’s future, providing an approximation of the company’s opportunity to generate artificial intelligence semiconductor revenue. Take the firm that is well-known to be Broadcom’s largest chip partner, Google parent company Alphabet (NASDAQ: GOOG). Alphabet reported earnings on Feb. 4, and provided its 2026 CapEx guidance. In the year, it expects to spend between $175 billion and $185 billion on CapEx. At the midpoint, this would mark an approximately 97% increase versus the firm’s 2025 CapEx of $91.4 billion. This is important for multiple reasons.\n\nFirst off, CapEx guidance massively exceeded expectations near $120 billion, which implied spending growth of just 31%. Given that expectations for Broadcom’s revenue growth are substantially anchored to Google’s CapEx, higher-than-expected spending should also push Broadcom's revenue estimates up.\n\nAdditionally, in 2025, Google’s CapEx rose by 74% from $52.5 billion in 2024. By indicating a 97% increase in 2026, the company is clearly showing that its AI spending growth is accelerating. This is great news for Broadcom, one of the market’s top beneficiaries of Google’s AI spending.\n\nNotably, Broadcom shares rose by approximately 1% on Feb. 5, one day after Google’s earnings release, as investors took notice of this relationship. Still, this gain is a drop in the bucket compared to the steep downward decline in AVGO shares over recent months.\n\nCapEx guidance provided by Meta Platforms (NASDAQ: META) adds further weight to the bullish case around Broadcom. Although their relationship has not been officially confirmed, it is widely believed that Meta also has a large partnership with Broadcom. This comes through Broadcom’s co-development of the company’s Meta Training and Inference Accelerator (MTIA).\n\nIn its latest earnings, Meta said it expects to spend between $115 billion and $135 billion on CapEx in 2026. This solidly exceeded expectations of around $110 billion. At the midpoint, Meta’s guidance implies CapEx growth of 73%. This would be a deceleration from 84% growth in 2025, but not a massive one. This growth rate is still very high, providing support for Broadcom’s outlook. Furthermore, it’s possible that Broadcom could receive a greater share of Meta’s spending in 2025 than it has in the past.\n\nIn Q1 2026, Meta said it will “extend our MTIA program to support our core ranking and recommendation training workloads in addition to the inference workloads it currently runs.\" Thus, the firm plans to start using MTIA for model training going forward, not just inference.\n\nFor Broadcom, this is a clear positive sign, implying that Meta will increase its demand for MTIA as it extends the chip’s use-cases. The statement also signals that MTIA is becoming a more strategically important asset to Meta. This is a strong, long-term indicator for Broadcom, increasing the likelihood that Meta will continue to co-develop chips with the firm for years to come. For reference, Google is currently deploying the seventh generation of its Broadcom co-developed tensor processing units (TPUs). Meanwhile, Meta has only deployed the second generation of MTIA.\n\nOverall, these developments provide significant support to the bullish case on Broadcom shares. This news comes at a time when Broadcom shares are trading at a forward price to earnings (P/E) ratio near 30x.\n\nThis is around 19% below the stock’s average forward P/E during the past 52 weeks. Furthermore, the consensus price target on Broadcom is near $437, implying around 41% upside potential. Considering all this, Broadcom shares look like an enticing proposition at current levels.\n\nBefore you make your next trade, you'll want to hear this.\n\nMarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis.\n\nOur team has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and none of the big name stocks were on the list.\n\nThey believe these five stocks are the five best companies for investors to buy now...\n\nThe article \"Google and Meta Just Rewrote Broadcom’s AI Story—While Shares Drop\" first appeared on MarketBeat.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Leadership Shake-Up Clouds Outlook for The Trade Desk Ahead of Earnings",
        "url": "https://www.aktiencheck.de/news/Artikel-Leadership_Shake_Up_Clouds_Outlook_for_The_Trade_Desk_Ahead_of_Earnings-19454551",
        "source": "aktiencheck.de",
        "date": "2026-02-09T23:27:00+00:00",
        "content": "A sudden change in a company's chief financial officer rarely inspires investor confidence. This is the current reality for The Trade Desk, the digital advertising platform, which now faces heightened scrutiny as it approaches its next earnings report. The company's financial results, scheduled for release on February 25, 2026, will be closely examined for signs that its operational performance remains on track despite the recent executive turmoil.\n\nSudden Departure Raises Red Flags\n\nOn January 26, The Trade Desk announced that CFO Alexander Kayyal was departing the company after a mere five months in the role. Effective retroactively to January 24, Tahnil Davis has stepped in as the interim finance chief. Davis, who previously served as Chief Accounting Officer, brings over a decade of experience with the firm to the position.\n\nFinancial markets are particularly sensitive to leadership changes in the CFO office, often viewing them as a potential source of instability for financial planning, reporting, and execution. This sentiment was swiftly reflected in analyst actions. Rosenblatt Securities reduced its price target on the stock from $64 to $53, while maintaining a \"Buy\" rating. Similarly, Truist Securities cut its target from $85 to $60, explicitly citing increased uncertainty stemming from the CFO transition.\n\nConfirmed Guidance Meets Sector Headwinds\n\nDespite the executive shuffle, management reaffirmed its financial guidance for the fourth quarter of 2025 in the same announcement. The company continues to anticipate:\n*   Revenue of at least $840 million\n*   Adjusted EBITDA of approximately $375 million\n\nThe full Q4 and fiscal year 2025 results are due after the U.S. market closes on Wednesday, February 25, 2026, followed by a conference call at 2:00 p.m. Pacific Time.\n\nThe broader industry context adds another layer of challenge. The digital advertising sector has recently faced significant pressure. Analysis from Zacks notes that competitors including Amazon, PubMatic, and Magnite have also posted losses, some in the double digits, over the same period.\n\nCompetition is intensifying, especially in the connected TV (CTV) advertising market—a key growth area for The Trade Desk. Amazon is reportedly expanding its demand-side platform, increasing competitive pressure. Furthermore, so-called \"walled gardens\" like Meta, Apple, and Google continue to leverage their owned inventory and first-party data, creating a structural advantage that makes the landscape more demanding for independent platforms.\n\nProduct Performance and Stock Pressure\n\nOn the product front, The Trade Desk highlights its AI-powered platform, \"Kokai.\" According to company statements cited by Zacks, 85% of its clients now use Kokai as their standard. The platform is also claimed to deliver, on average, a 26% improvement in cost-per-acquisition and a 94% better click-through rate compared to its predecessor, \"Solimar.\"\n\nNevertheless, the equity market appears nervous. The stock has declined by 27.42% over the past 30 days and is trading near its 52-week low, with a recent closing price of $27.07. This performance underscores how uncertainty surrounding leadership and near-term execution can weigh heavily on valuation.\n\nThe upcoming earnings report will therefore be pivotal. The focus will shift from headlines to hard data: if the financials confirm the previously stated guidance and management provides convincing explanations regarding the CFO transition during the conference call, investor attention may gradually return to the company's underlying operational progress.\n\nFresh The Trade Desk information released. What's the impact for investors? Our latest independent report examines recent figures and market trends.\n\nFresh Leadership Shake information released. What's the impact for investors? Our latest independent report examines recent figures and market trends.\n\nCopyright 1998 - 2026 aktiencheck.de,\n\t\t\timplementiert durch ARIVA.DE AG"
    },
    {
        "title": "Market Outlook: Investors question AI payoffs as gold hits US$5,000",
        "url": "https://www.bnnbloomberg.ca/investing/market-outlook/2026/02/09/market-outlook-investors-question-ai-payoffs-as-gold-hits-us5000/",
        "source": "BNN Bloomberg",
        "date": "2026-02-09T21:41:00+00:00",
        "content": "Published: February 09, 2026 at 4:29PM EST\n\nGold moved back above US$5,000 an ounce as investors reassessed risk across asset classes, with growing unease over massive AI-related capital spending weighing on technology stocks. Rising volatility and questions around returns on investment are driving renewed interest in defensive assets.\n\nBNN Bloomberg spoke with Rebecca Teltscher, portfolio manager at Newhaven Asset Management, about mounting investor concerns over AI capital expenditures, shifting expectations for the tech sector and why gold is benefiting from the rotation.\n\nRead the full transcript below:\n\nANDREW: We did see gold move back above US$5,000 an ounce, with dip-buyers returning to a choppy market. Let’s get more on the latest performance for bullion from Rebecca Teltscher, portfolio manager at Newhaven Asset Management. Rebecca, great to see you. Thanks for joining us.\n\nANDREW: The proverbial roller-coaster ride for gold. A lot of money has gone into the metal, and perhaps buyers are a bit scarcer now.\n\nREBECCA: Yeah, you know, it’s so funny. I was on vacation last week in Mexico and had very spotty internet, so I wasn’t as up to date with the markets. And wow, what a week to miss. What we saw in commodity prices, whether it was gold or silver, and in the broader markets — there was a lot of volatility, particularly in the metals, and that translated to the TSX.\n\nNow we’re seeing a bit of a reversal, with gold moving back above US$5,000 after dipping below that level last week. At the end of the day, gold is a neutral asset. What we’re seeing is investors pulling money away from risky assets — whether that’s the tech sector, which we saw last week, Bitcoin, which is down about 20 per cent year to date, or even the U.S. dollar and Treasuries — and searching for a safe haven. Right now, gold is one of the few areas providing that.\n\nANDREW: Gold has become highly volatile itself, though. I guess there’s no true safe haven in investing. Maybe government bonds come close.\n\nREBECCA: Government bonds used to be a safe haven. But as we’re seeing government shutdowns and debt levels climb to record highs, with U.S. deficits not coming down, that perception has changed. Last year, the spread between corporate bonds narrowed — not because corporate bonds were trading at a discount, but because government bond yields were rising as investors worried the U.S. might struggle to pay back its debt.\n\nSo as you say, there really is no risk-free asset anymore. With interest rates coming down, that’s creating more opportunity for assets like gold.\n\nANDREW: On tech stocks, I’m looking at a list of big U.S. names hitting 52-week lows this morning. Adobe, Salesforce and ServiceNow — classic software names — all under pressure in early trading.\n\nREBECCA: Software has its own issues, with concerns that AI could take over parts of their businesses. But even among the large hyperscalers — the so-called Magnificent Seven — those stocks have really outperformed over the past two years since the introduction of ChatGPT.\n\nAI is a new technology, and it was very exciting. I do think AI is here to stay — I’m not questioning that. But the question now is how that translates into revenue. What we saw last week with earnings is Amazon planning roughly US$200 billion in capital expenditures in 2026, Google around US$175 billion and Meta about US$115 billion.\n\nThese companies were once asset-light and are now becoming very asset-heavy. We don’t invest in that sector because valuations are too high, there’s no dividend yield to support share prices and the risk is elevated. If I were an investor in those stocks, I would absolutely be concerned about how much money is being spent without clear indications of how it translates into revenue or income growth.\n\nANDREW: You’ve described this as a race to the bottom. It’s almost a mirror image of a race to the top — spending more and more. Amazon spending US$200 billion suggests they believe profits will follow. But who pays for that? Consumers?\n\nREBECCA: That’s why we’re seeing Amazon’s stock under pressure. Investors aren’t necessarily buying into that story yet. Google is a bit different — they’re spending almost as much but haven’t seen the same share price weakness, perhaps because investors see more revenue translation from that capex.\n\nIn 2023 and 2024, any company investing in AI received a very high trading multiple. Now, when you’re priced to perfection, you need to deliver perfection. If investors start questioning where all this capex is going, you’re going to see weakness.\n\nI think in 2026, investors are paying closer attention. They’re scrutinizing where capital is going and whether it actually translates into growth.\n\nANDREW: I’m not sure if you saw this, but Anthropic says it won’t include ads in AI-generated answers. Sam Altman has pushed back on that, which raises questions about monetization.\n\nREBECCA: That brings up another point. There are many AI tools right now, but in five to 10 years, how many do we actually need? Twenty years ago, did we really need multiple search engines? Probably not. One dominant player was enough.\n\nWith AI, do we really need Google, OpenAI, Anthropic and others all doing the same thing? If consolidation happens, a lot of this capital spending could ultimately be wasted.\n\nANDREW: Specialists may always exist, but everyday users probably don’t need multiple AI platforms.\n\nREBECCA: Exactly. AI is a powerful tool and it’s here to stay, but for our investors it’s still too early. There’s a huge amount of capital going into the sector with questionable results so far. Maybe it becomes attractive later, but right now, with high multiples, no dividend growth and elevated risk, it’s not a sector we’re willing to invest in.\n\nANDREW: Rebecca, thanks very much for your time.\n\nThis BNN Bloomberg summary and transcript of the Feb. 9, 2026 interview with Rebecca Teltscher are published with the assistance of AI. Original research, interview questions and added context was created by BNN Bloomberg journalists. An editor also reviewed this material before it was published to ensure its accuracy and adherence with BNN Bloomberg editorial policies and standards."
    },
    {
        "title": "ChatGPT Thinks GLD Will Trade At This Price By March 20, And You Can Trade With Leverage After One Evaluation",
        "url": "https://finance.yahoo.com/news/chatgpt-thinks-gld-trade-price-160113992.html",
        "source": "Yahoo Finance",
        "date": "2026-02-09T16:36:00+00:00",
        "content": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\n\nGold has entered a highly volatile phase, with sharp swings creating opportunity for traders but uncertainty for long-term investors.\n\nChatGPT's model projects moderate upside for GLD into March 20, suggesting short-term stabilization after recent whipsaw moves.\n\nActive traders can use Apex Trader Funding to access leveraged gold futures after a single evaluation, while long-term investors can build GLD exposure through SoFi with fractional shares and up to $1,000 in free stock.\n\nGold has been one of the most volatile major assets of the past year.\n\nAfter surging to record highs on central bank buying, prices reversed sharply as rate expectations shifted, then rebounded again on renewed geopolitical risk. In just the past few months, gold has swung through multiple double-digit percentage moves, frustrating long-term holders and rewarding short-term traders who caught the turns.\n\nThat volatility has been reflected directly in the SPDR Gold Shares ETF (NYSE:GLD), which has whipsawed between sharp rallies and deep pullbacks as investors struggle to price where inflation, rates, and global risk ultimately settle.\n\nFor traders, that environment creates opportunity. For investors, it creates uncertainty.\n\nIf you're trying to time entries and exits, you're thinking about where gold is headed next.\n\nTo explore that, we ran GLD through an AI price‑prediction agent powered by OpenAI's GPT and outlined ways to position around that forecast, either through leveraged futures via Apex Trader Funding or through traditional investing platforms like SoFi for those who prefer a simpler route.\n\nThe AI agent was fed recent price action, momentum indicators, volatility data, and macro inputs to generate a short-term outlook through March 20.\n\nAt the time of the run, GLD was trading at $456.16.\n\nThrough March 20, the model produced the following baseline forecast:\n\nAverage predicted price: $512.75\n\nHere are two ways of trading that outcome. SoFi let users start investing with as little as $5 in fractional shares, and you can receive up to $1,000 in free stock by opening a new account. Set up takes minutes, and you can be investing in the upside of GLD alongside Wall Street's biggest banks.\n\nHowever, if you want to trade with more action, leverage could be the way to go, and you don't have to commit large amounts of your own money.\n\nSince that type of exposure comes after passing a single evaluation, active traders have been turning to futures prop firm Apex Trader Funding, where trading gold is accessed through exchange-listed contracts like GC (standard gold futures).\n\nApex Trader Funding operates on a funded-account model. You complete a one-step evaluation in a simulated environment. If you meet the profit target and follow the drawdown rules, you receive a real funded Performance Account.\n\n100% of the first $25,000 in profits\n\nOver the past 90 days, Apex has paid out more than $72.2 million to traders.\n\nThe appeal is access leverage without risking tens of thousands of personal dollars.\n\nHere is how our AI forecast could translate into actual trading.\n\nAssume you pass a $50,000 Apex evaluation and receive a funded account.\n\nSay you focus on Micro Gold (MGC) futures.\n\nEach MGC contract represents 10 ounces of gold.\n\nEvery $1 move in gold equals about $10 per contract.\n\nIf gold rises $25 during a swing (which is common in this market) one contract produces:\n\nIf you capture three similar moves over several weeks:\n\nYou just made $3,750 in total trading profits from those three moves. That is enough to meet or exceed typical profit targets on many Apex accounts.\n\nOn a $150,000 account, a disciplined trader might run 10–15 micro contracts, turning the same price movement into several thousand dollars per trade.\n\nYou can trade with Apex for up to 23 hours a day, with no restrictions on trading during holidays or major news events, as long as the market is open. Find the plan that fits your style and complete a simple one‑step evaluation to get started with a funded account.\n\nThe model is not predicting a new gold supercycle. Instead, it is offering a short-term read on how GLD may trade as markets digest interest rate expectations, and ongoing geopolitical risk.\n\nIn this run, the outlook leans modestly positive into March, suggesting stabilization with potential upside. That creates opportunity, but only for traders and investors who can execute around short-term swings.\n\nThis article ChatGPT Thinks GLD Will Trade At This Price By March 20, And You Can Trade With Leverage After One Evaluation originally appeared on Benzinga.com\n\n© 2026 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
]