[
    {
        "title": "Big Tech Will Spend $700 Billion on Artificial Intelligence in 2026. Here's My Top Stock to Buy to Take Advantage.",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/META-Q/pressreleases/238861/big-tech-will-spend-700-billion-on-artificial-intelligence-in-2026-here-s-my-top-stock-to-buy-to-take-advantage/",
        "source": "The Globe and Mail",
        "date": "2026-02-16T06:40:00+00:00",
        "content": "Amazon, Alphabet, Microsoft, Meta, and Oracle will spend over $700 billion on data centers this year.\n\nThis company can expect a huge increase in revenue regardless of how big tech allocates its budget.\n\nThe stock trades for a great value relative to the growth opportunity ahead of it.\n\nWall Street expected there to be a significant step-up in spending by the biggest hyperscalers this year. Computing needs for large language model training and inference are only growing larger as models expand and usage increases. But few analysts predicted the five biggest spenders budgeting over $700 billion in 2026.\n\nAmazon(NASDAQ: AMZN), Alphabet(NASDAQ: GOOG)(NASDAQ: GOOGL), Microsoft(NASDAQ: MSFT), and Oracle(NYSE: ORCL) are all facing growing backlogs of compute demand for their cloud services. Meta Platforms(NASDAQ: META) sees enormous potential in developing its own leading AI capabilities, and it's investing as much as it can to get there. While several companies could be big beneficiaries of big tech's massive budgets, there's one stock that looks particularly appealing right now.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nBefore diving into the biggest beneficiaries of big tech's spending, it's worth exploring how much each company is planning to spend this year and what exactly they're spending it on.\n\nThe table below breaks down each of the five hyperscalers' capital expenditure budgets and the year-over-year growth.\n\nData source: Visible Alpha via The Wall Street Journal. YOY = year over year.\n\nEach company has various other capital expenditure needs, but the vast majority of the spending is going toward building and outfitting new artificial intelligence (AI) data centers. Amazon may be the only company with significant amounts that aren't going toward that endeavor, as it also operates massive logistics networks across the U.S. and Europe. Even so, it's significantly shifted its focus toward the artificial intelligence opportunity.\n\nOf course, there's a lot that goes into a data center: building materials, construction, and all the equipment that goes into them, including server racks, cooling, networking equipment and cables, and the AI accelerator chips and server CPUs themselves.\n\nMicrosoft CFO Amy Hood provided some insights into exactly how much goes toward the latter versus everything else during the company's second-quarter earnings call. \"Roughly two-thirds of our capex was on short-lived assets, primarily GPUs and CPUs,\" she told analysts. It's a good bet the other hyperscalers are seeing a similar split in their expenditures. Some might spend more or less, depending on exactly which types of chips they outfit their data centers with.\n\nThat means these five companies are set to spend over $450 billion on GPUs, CPUs, and other AI accelerator chips in 2026. That's excellent news for chipmakers, and one company in particular.\n\nWhile hyperscalers will work with GPU makers like Nvidia or custom AI accelerator designers like Broadcom to outfit large swaths of their data centers, the better opportunity for investors may be the company supplying those chipmakers. Taiwan Semiconductor Manufacturing(NYSE: TSM) is the company behind the most cutting-edge chip designs. And while management already expected companies to spend a lot of money on TSMC's advanced chip manufacturing this year, it could outperform those lofty expectations based on the updated guidance from the big tech companies.\n\nTSMC is the largest contract semiconductor manufacturer in the world. That lead is supported by its advanced technological capabilities to print and package chips with ever-smaller transistor sizes. With more revenue than its competitors, it can invest more in the R&D needed to maintain its technology lead.\n\nManagement provided optimistic guidance for 2026 when it reported its full-year 2025 earnings last month. It said first-quarter revenue should come in around 38% higher (in U.S. dollars) with gross margin expanding to 64% at the midpoint of its guidance (up from 62.3% in the fourth quarter). It's already ahead of that pace based on its reported January revenue.\n\nLong-term, management increased its annualized revenue growth outlook for the five-year period from 2024 through 2029 to 25% from the 20% per year outlook it provided a year ago. That's supported by spending on AI accelerator chips rising at a mid-50% rate.\n\nBut based on big tech's spending plans, that growth could be even faster, or at least front-loaded. The demand should give it even more pricing power, enabling it to deliver a stronger gross margin and substantial profit growth over the next few years.\n\nTo be sure, the positive trends favoring TSMC aren't lost on the rest of the market. The stock is now trading at an all-time high. But it still looks like a great value at 26 times forward earnings expectations (and those earnings expectations may still be too low). TSMC offers great value and a secular way to invest in the growing demand for AI chips amid massive tech companies spending hundreds of billions on data centers this year.\n\nBefore you buy stock in Taiwan Semiconductor Manufacturing, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $414,554!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,120,663!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 884% — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 16, 2026.\n\nAdam Levy has positions in Alphabet, Amazon, Meta Platforms, Microsoft, and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, Microsoft, Nvidia, Oracle, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Motorola Solutions Stock: Is Wall Street Bullish or Bearish?",
        "url": "https://finance.yahoo.com/news/motorola-solutions-stock-wall-street-091715041.html",
        "source": "Yahoo Finance",
        "date": "2026-02-16T13:19:00+00:00",
        "content": "The Chicago, Illinois-based Motorola Solutions, Inc. (MSI) delivers mission-critical communications, advanced video security, and command center technologies. With a market cap of around $76.9 billion, it builds two-way radios, network infrastructure, video surveillance systems, analytics engines, software platforms, and recurring support services.\n\nOver the past 52 weeks, MSI stock has edged down marginally, while the S&P 500 Index ($SPX) gained 11.8%, creating a visible performance gap. However, year-to-date (YTD), MSI stock has rebounded sharply, jumping 20.5% as the broader index slipped marginally.\n\nAI Disruption Fear, FOMS and Other Key Things to Watch this Week\n\nMarkets Don’t Bottom On Fear. They Bottom When Forced Sellers Are Done\n\nWarren Buffett Says Only Buy Stocks You’re Comfortable Holding For Ten Years, Otherwise Don’t Bother Even ‘Owning it for Ten Minutes’\n\nOur exclusive Barchart Brief newsletter is your FREE midday guide to what's moving stocks, sectors, and investor sentiment - delivered right when you need the info most. Subscribe today!\n\nWhen compared with its sector benchmark, the State Street SPDR S&P Telecom ETF (XTL) has gained 56.8% over the past 52 weeks and 14.8% in 2026, thereby surpassing Motorola’s performance.\n\nOn Feb. 12, just a day after the company released its Q4 fiscal 2025 results, MSI stock jumped 7.7%, owing to better-than-expected top and bottom-line figures. Revenue increased 12.3% year over year to $3.38 billion, surpassing analyst expectations of $3.34 billion. Adjusted EPS climbed 13.6% to $4.59 from the prior-year figure, beating the $4.35 Street estimate.\n\nManagement credited the performance to strong demand across both the Products and Systems Integration segment and the Software and Services segment.\n\nLooking ahead, they have anchored their outlook in a healthy backlog, accelerating cloud adoption within Command Center software, and the rollout of new artificial intelligence (AI) Assist Suites for public safety agencies. For fiscal year 2026, they expect revenue of approximately $12.7 billion and non-GAAP EPS between $16.70 and $16.85.\n\nOn the other hand, analysts forecast fiscal 2026 diluted EPS of $14.76, reflecting an 8.1% year-over-year growth for the year ending in December. The projection carries added credibility because Motorola has exceeded EPS estimates in each of the four trailing quarters.\n\nWall Street currently assigns MSI stock an overall rating of “Strong Buy.” Among 12 analysts, eight have issued a “Strong Buy,” one recommends “Moderate Buy,” while three maintain a “Hold.”\n\nNotably, current analyst sentiment has strengthened from three months ago, when only six analysts held a “Strong Buy” view.\n\nThe improving outlook gained further reinforcement on Feb. 12, when JPMorgan analyst Joseph Cardoso reiterated an “Overweight” rating on MSI stock and lifted the price target from $515 to $520.\n\nViewed collectively, these targets offer a concise snapshot of Street expectations. The mean price target of $499.56 suggests potential upside of 8.2%. Meanwhile, the Street-high target of $525 signals a gain of 13.7% from current levels.\n\nOn the date of publication, Aanchal Sugandh did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com"
    },
    {
        "title": "Walmart Earnings Preview: Can WMT Reach A New All-Time High? (Part Two)",
        "url": "https://finance.yahoo.com/news/walmart-earnings-preview-wmt-reach-093357996.html",
        "source": "Yahoo Finance",
        "date": "2026-02-16T15:31:00+00:00",
        "content": "In Part One, we explored how artificial intelligence has become a structural driver of Walmart‘s transformation from traditional retailer to technology-powered enterprise. However, AI alone doesn’t tell the complete story of Walmart’s remarkable ascent to a $1 trillion valuation.\n\nAs the company prepares to report earnings on February 19, 2026, investors will be scrutinizing several additional factors that have fueled its growth: the migration of affluent consumers to discount retail, explosive e-commerce expansion, a rapidly growing advertising business, and the company’s ability to consistently exceed its own ambitious forecasts.\n\nOne of Walmart’s most significant competitive advantages has emerged from an unexpected source: the shifting shopping habits of affluent consumers. The stereotype of Walmart as exclusively serving lower-income households has been upended by data showing a dramatic influx of high-earning shoppers over the past several years.\n\nAccording to research from GlobalData Retail, nearly 28% of high-income consumers shopped at discount chains like Walmart in 2025, up from approximately 20% just four years earlier in 2021. More striking still, Walmart specifically has captured an increasing share of six-figure earners: more than 17% of Americans earning $100,000 or more annually now shop at the retail giant, compared to less than 15% in 2021.\n\nNew Chief Financial Officer John David Rainey explained to CNBC last quarter that, while Walmart has gained market share across all income levels, the gains are “more pronounced in the upper-income segment.”\n\nNeil Saunders of GlobalData points out that the pandemic and the subsequent inflationary surge beginning in 2021 have acted as major catalysts. Wealthier shoppers are now flocking to discount stores at a much faster rate than in previous years. Saunders notes that a similar pattern emerged following the 2008 financial crisis, suggesting that economic uncertainty prompts even wealthy consumers to reassess their spending habits.\n\nAs the “inflation safety net” for wealthy shoppers has eroded—and as prices climb for groceries, housing, healthcare, and other essentials—even those with higher incomes are feeling the squeeze on their disposable income. So even high-income households are seeking opportunities to stretch their dollars further. Walmart’s value proposition—combining low prices with convenience and an increasingly sophisticated shopping experience—has proven “irresistible”.\n\nWalmart hasn’t simply benefited from external economic trends—it has actively courted these new customers through strategic investments. The company has wooed inflation-weary shoppers by significantly expanding its online product assortment with premium brands, remodeling thousands of stores to create more appealing shopping environments, and offering faster e-commerce delivery options.\n\nThese improvements have resonated particularly strongly with higher-income consumers who value convenience and quality alongside low prices. The result is that affluent shoppers are not only visiting Walmart more frequently but are also purchasing higher-margin items such as apparel, home goods, and premium grocery products—categories where Walmart has historically struggled to compete with specialized retailers.\n\nThe influx of higher-income customers creates a multiplier effect across Walmart’s business model. These shoppers are driving significant e-commerce growth as they embrace online ordering and rapid delivery options. They are more likely to subscribe to Walmart+ (the subscription-based membership program that creates recurring revenue streams, increases customer loyalty and competes with Amazon Prime). And they provide an attractive audience for Walmart Connect, the company’s advertising business, as brands pay premium rates to reach affluent consumers.\n\nWhile AI capabilities provide the operational foundation for Walmart’s transformation, the company’s digital channels—e-commerce and advertising—represent the most visible and financially significant manifestations of that transformation.\n\nIn May 2025, Walmart achieved a milestone: its first profitable quarter for e-commerce operations. This accomplishment represents the culmination of years of strategic investment and operational refinement, transforming what was once viewed as a necessary but costly defensive measure against Amazon into a genuine growth engine.\n\nThe most recent quarter demonstrated the power of this transformation: global e-commerce sales surged 27%, with gains across all business segments. U.S. e-commerce sales jumped 28%, fueled by growth in store-based order fulfillment and the expanding third-party marketplace. International e-commerce sales jumped 26%, while Sam’s Club e-commerce in the United States rose 22%.\n\nA critical element of Walmart’s e-commerce success has been its ability to deliver on the promise of speed—a capability that leverages its vast network of physical stores as fulfillment centers. The retailer now offers sub-three-hour delivery to roughly 95% of American households from its store locations. The service has proven wildly popular, with nearly one-third of online orders now being expedited for arrival within one to three hours.\n\nAccording to CFO Rainey, revenue related to these faster deliveries has increased 70% year over year—a growth rate that underscores how speed has become a key competitive differentiator.\n\nWalmart monetizes this speed advantage through multiple channels. Some expedited orders carry additional fees, generating direct revenue, while others are included as benefits of Walmart+.\n\nIn just five years, Walmart has grown its online marketplace to more than 500 million items. This vast inventory creates multiple advantages: it attracts more customers searching for specialty or niche products, generates commission revenue from third-party sellers, and provides Walmart with valuable data about emerging product categories and consumer preferences.\n\nAs Walmart’s digital traffic has increased and its marketplace has expanded, advertising has emerged as one of the company’s most significant growth opportunities. Advertising businesses are particularly attractive because they generate high margins with relatively low capital requirements, directly boosting profitability.\n\nIn the most recent quarter, Walmart’s global advertising business increased by a remarkable 53%. The company has built what is now a $4 billion advertising business—a revenue stream that barely existed five years ago and that continues to gain momentum.\n\nWalmart’s confidence in its momentum is evident in its guidance revisions. The company has raised its full-year fiscal 2026 forecast twice in recent months—a move that signals management’s conviction that the business is performing better than even their own projections anticipated.\n\nAfter its online business surged by double digits again in August 2025, Walmart increased its full-year sales forecast from 3–4% to 3.75–4.75%. Just months later, the company raised its outlook again, now projecting sales growth of 4.8–5.1%. The company also raised its adjusted earnings per share guidance twice, landing at $2.58 to $2.63.\n\nThese upward revisions matter for investors.\n\nFirst, they demonstrate that Walmart is experiencing accelerating momentum rather than simply maintaining steady growth. Second, they reflect management’s confidence that recent investments in technology, supply chain capabilities, and customer experience are generating returns that exceed the costs. Third, they set a high bar for the February 19th earnings report and investors will be watching closely to see if the company can deliver on these ambitious targets.\n\nWalmart’s strong operational performance has translated directly into impressive stock market returns. So far in 2026, Walmart shares are already up approximately 20%—outpacing the S&P 500’s roughly 12% gain over the same period. The longer-term picture is even more striking: over the past five years, Walmart shares have surged approximately 178%, dramatically outperforming the S&P 500’s 74% gain over the same timeframe.\n\nThis outperformance reflects a fundamental rerating of the stock. Investors who once viewed Walmart primarily as a mature, slow-growth retailer now increasingly see it as a technology-enabled growth company with multiple expansion opportunities. The company’s transition to the Nasdaq in December 2025—leaving the New York Stock Exchange after more than five decades—was designed to reinforce this perception shift.\n\nAs Walmart will release its earnings report on February 19, 2026, investors wonder whether the stock can continue its upward trajectory and reach new highs. The answer is probably yes—but only if the company delivers results that exceed its already elevated guidance and provides forward-looking commentary that reinforces confidence in sustained growth.\n\nThe company has built significant momentum across multiple dimensions: AI-driven operational excellence, explosive e-commerce and advertising growth, successful capture of higher-income consumers, and a consistent track record of beating expectations. This momentum has already driven the stock to impressive gains.\n\nHowever, success has also raised expectations. The market has largely embraced Walmart’s transformation narrative and has revalued the stock accordingly. For shares to reach new highs, the company will need to demonstrate not just that it can meet its twice-raised guidance, but that the growth trajectory remains intact and may even accelerate further.\n\nAlso, not everything is entirely positive heading into the earnings report. The company faces questions about quality control on its third-party marketplace following a lawsuit filed by Estée Lauder alleging that Walmart’s platform hosts counterfeit beauty products. The lawsuit accuses Walmart of trademark infringement and inadequate oversight of sellers.\n\nWhile this issue is unlikely to significantly impact near-term financial results, it raises broader questions about Walmart’s ability to maintain brand quality and consumer trust as it rapidly expands its marketplace. During the earnings call, investors should listen carefully for management’s response to these concerns and any plans to enhance marketplace oversight.\n\nNo longer a simple brick-and-mortar discounter, Walmart has pivoted into a technology-heavy omnichannel platform, leveraging diverse, fast-growing revenue streams to drive its next phase of growth. But can this transformation continue to drive its stock appreciation at the same pace? Or has the market already priced in much of the upside?\n\nInvestors will be focusing on hard numbers on e-commerce profitability expansion, concrete examples of AI-driven margin improvements, data on the sustainability of high-income shopper gains, and guidance that suggests the company sees continued momentum ahead.\n\nSources: Walmart, Investopedia, The Wall Street Journal, CNBC, CBS News, Reuters\n\nThe information provided does not constitute investment research. The material has not been prepared in accordance with the legal requirements designed to promote the independence of investment research and as such is to be considered to be a marketing communication.\n\nAll information has been prepared by ActivTrades (“AT”). The information does not contain a record of AT’s prices, or an offer of or solicitation for a transaction in any financial instrument. No representation or warranty is given as to the accuracy or completeness of this information.\n\nAny material provided does not have regard to the specific investment objective and financial situation of any person who may receive it. Past performance is not a reliable indicator of future performance. AT provides an execution-only service. Consequently, any person acting on the information provided does so at their own risk. Forecasts are not guarantees. Rates may change. Political risk is unpredictable. Central bank actions may vary. Platforms’ tools do not guarantee success.\n\nThis article was originally posted on FX Empire\n\nCactus Seeing Green Shoots Since October\n\nPound Mostly Steady After Weaker GDP\n\nInflows Push Chip Supplier Rambus to New Heights\n\nSix Bullish Inflows in 30 Days Boost Kirby\n\nCorning Having Its AI Moment, Drawing Inflows"
    },
    {
        "title": "Meta Shifts Strategy: Horizon Workrooms Shuttered as Focus Turns to AI and Mobile",
        "url": "https://www.aktiencheck.de/news/Artikel-Meta_Shifts_Strategy_Horizon_Workrooms_Shuttered_as_Focus_Turns_to_AI_and_Mobile-19476145",
        "source": "aktiencheck.de",
        "date": "2026-02-16T13:54:00+00:00",
        "content": "Meta Platforms is closing a significant chapter in its metaverse ambitions. The company confirmed the permanent shutdown of its virtual reality collaboration platform, Horizon Workrooms, on Monday, February 16, 2026. All associated user data is being deleted. This move forms a key part of a sweeping reorganization within its Reality Labs division, signaling a clear strategic pivot away from niche VR applications toward other priorities.\n\nStrong Financials Provide Foundation for Change\n\nDespite the strategic shift, Meta's core business performance remains robust. The company's fourth-quarter results, released prior to the announcement, provided a solid backdrop. Earnings per share came in at $8.88, significantly surpassing analyst forecasts of $8.16. Revenue saw substantial growth, climbing 23.8% year-over-year to $59.89 billion. Shareholders will receive a quarterly dividend of $0.525 per share.\n\nKey Financials & Dates:\n*   Q4 EPS: $8.88 (Estimate: $8.16)\n*   Q4 Revenue: $59.89 billion\n*   Quarterly Dividend: $0.525 per share\n*   Workrooms Shutdown: February 16, 2026\n*   Enterprise Sales Halt: February 20, 2026\n\nA Broader Restructuring Takes Shape\n\nThe discontinuation of Workrooms is not an isolated event. It coincides with a radical overhaul of the Reality Labs unit. Meta has already reduced its workforce in this division by approximately 10% and closed several extended reality (XR) gaming studios. Furthermore, the company will cease sales of its Meta Horizon Managed Services and commercial Quest headsets to business clients on February 20, just four days after the Workrooms closure. Existing enterprise customers will continue to receive support until January 2030 but are being directed toward third-party solutions like Microsoft Teams Immersive and Zoom Workplace.\n\nThis series of decisions effectively halts Meta's hardware offensive in the business-to-business segment. The company's future focus will center on mobile metaverse experiences and smart glasses, marking a departure from its original vision of immersive virtual office environments.\n\nInvestor Scrutiny Amidst Massive AI Capex Wave\n\nThe strategic repositioning occurs against a backdrop of intense investor focus on capital expenditure. Recent reports indicate that Meta, along with peers Amazon, Microsoft, and Alphabet, is projected to collectively invest over $600 billion in capital expenditures during 2026. The vast majority of this spending is earmarked for artificial intelligence data center infrastructure. This scale of investment has contributed to market volatility, with recent tech sector sell-offs erasing more than $1 trillion in market capitalization. Shareholders are increasingly questioning the timeline for a return on these enormous outlays.\n\nUndeterred, Meta continues its expansion. In a notable development, the company is partnering with Sify Technologies to construct a new 500-megawatt AI data center in Visakhapatnam, India. This project is separate from a concurrent 1-gigawatt initiative by Google in partnership with Adani in the same region.\n\nAnalyst Outlook: Efficiency and Long-Term AI Bet\n\nMarket analysts maintain a generally optimistic stance on Meta's trajectory. Firms including Truist Securities and UBS have reaffirmed their \"Buy\" ratings, with price targets ranging from $830 to $875 per share. They cite the ongoing efficiency of Meta's advertising business and its suite of AI-powered tools as primary strengths. The view is that the Reality Labs restructuring could bolster medium-term profitability, while the aggressive push into artificial intelligence is positioned to drive long-term growth—provided these substantial investments eventually yield returns.\n\nFresh Meta information released. What's the impact for investors? Our latest independent report examines recent figures and market trends.\n\nFresh Meta Shifts Strategy information released. What's the impact for investors? Our latest independent report examines recent figures and market trends.\n\nCopyright 1998 - 2026 aktiencheck.de,\n\t\t\timplementiert durch ARIVA.DE AG"
    }
]