[
    {
        "title": "CTO Realty Growth, Inc.: CTO Realty Growth Reports Fourth Quarter and Year End 2025 Operating Results",
        "url": "https://www.finanznachrichten.de/nachrichten-2026-02/67749310-cto-realty-growth-inc-cto-realty-growth-reports-fourth-quarter-and-year-end-2025-operating-results-399.htm",
        "source": "FinanzNachrichten.de",
        "date": "2026-02-20T09:50:00+00:00",
        "content": "- Closed $165.9 million of investments at a weighted average initial cash yield of 9.0% in 2025 -- Signed comparable retail leases for a record 24% increase in cash base rent in 2025 - - Current signed-not-open pipeline of $6.1 million and record high leased occupancy of 95.9% - - Provides 2026 Outlook -\n\nWINTER PARK, Fla., Feb. 19, 2026 (GLOBE NEWSWIRE) -- CTO Realty Growth, Inc. (NYSE: CTO) (the \"Company\" or \"CTO\"), an owner and operator of shopping centers located primarily in higher-growth markets, today announced its operating and financial results for the quarter and year ended December 31, 2025. Net Income attributable to common stockholders of $0.82 per diluted share for the fourth quarter, and $0.08 per diluted share for the full year.\n\nFourth Quarter and Full Year 2025 Highlights\n\n\"We continued our momentum in 2025, ending the year with a signed-not-open pipeline of $6.1 million, representing 5.8% of in-place ABR and positioning the Company for growth in 2026 and 2027,\" stated John P. Albright, President and Chief Executive Officer of CTO Realty Growth. \"Further, we completed over 670,000 square feet of leasing in 2025, a record for the Company, which helped drive leased occupancy to an all-time high of 95.9% at year-end.\"\n\nRefer to \"Non-GAAP Financials Measures\" for definitions and additional detail. Reconciliations of non-GAAP measures to the most directly comparable GAAP measure are provided in the tables accompanying this press release.\n\nInvestment and Disposition Activity\n\nOur balance sheet highlights as of December 31, 2025, included:\n\nThe Company's outlook for 2026 is based on current plans and assumptions and subject to risks and uncertainties more fully described in this press release and the Company's reports filed with the U.S. Securities and Exchange Commission.\n\nBelow is a summary of the Company's 2026 outlook, assumptions used in forecasting, and a reconciliation of the outlook range of the Company's estimated Net Loss Attributable to the Company per Common Share - Diluted to the Company's estimated Core FFO Attributable to Common Stockholders per Common Share - Diluted and AFFO Attributable to Common Stockholders per Common Share - Diluted.\n\n(1) Attributable to Common Stockholders\n\nThe Company's 2026 outlook includes but is not limited to the following assumptions:\n\nEarnings Conference Call & Webcast\n\nThe Company will host a conference call to present its operating results for the fourth quarter and full year ended December 31, 2025, on Friday, February 20, 2026 at 9:00 AM ET.\n\nA live webcast of the call will be available on the Investor Relations page of the Company's website at www.ctoreit.com or at the link provided in the event details below. To access the call by phone, please go to the registration link provided in the event details below and you will be provided with dial-in details.\n\nWe encourage participants to register and dial into the conference call at least fifteen minutes ahead of the scheduled start time. A replay of the earnings call will be archived and available online through the Investor Relations section of the Company's website at www.ctoreit.com\n\nCTO Realty Growth, Inc. is a publicly traded real estate investment trust that owns and operates a portfolio of high-quality shopping centers, located primarily in higher growth markets in the United States. CTO also externally manages and owns a meaningful interest in Alpine Income Property Trust, Inc. (NYSE: PINE), a publicly traded net lease REIT.\n\nWe encourage you to review our most recent investor presentation and supplemental financial information, which is available on our website at www.ctoreit.com\n\nCertain statements contained in this press release (other than statements of historical fact) are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements can typically be identified by words such as \"outlook,\" \"believe,\" \"estimate,\" \"expect,\" \"intend,\" \"anticipate,\" \"will,\" \"could,\" \"may,\" \"should,\" \"plan,\" \"potential,\" \"predict,\" \"forecast,\" \"project,\" and similar expressions, as well as variations or negatives of these words.\n\nAlthough forward-looking statements are made based upon management's present expectations and beliefs concerning future developments and their potential effect upon the Company, a number of factors could cause the Company's actual results to differ materially from those set forth in the forward-looking statements. Such factors may include, but are not limited to: the Company's ability to remain qualified as a REIT; the Company's exposure to U.S. federal and state income tax law changes, including changes to the REIT requirements; general adverse economic and real estate conditions; macroeconomic and geopolitical factors, including but not limited to inflationary pressures, interest rate volatility, distress in the banking sector, global supply chain disruptions, and ongoing geopolitical war; credit risk associated with the Company investing in commercial loans and similarly structured investments; the ultimate geographic spread, severity and duration of pandemics such as the COVID-19 Pandemic and its variants, actions that may be taken by governmental authorities to contain or address the impact of such pandemics, and the potential negative impacts of such pandemics on the global economy and the Company's financial condition and results of operations; the inability of major tenants or borrowers to continue paying their rent or obligations due to bankruptcy, insolvency or a general downturn in their business; the loss or failure, or decline in the business or assets of PINE; the completion of 1031 exchange transactions; the availability of investment properties that meet the Company's investment goals and criteria; the uncertainties associated with obtaining required governmental permits and satisfying other closing conditions for planned acquisitions and sales; and the uncertainties and risk factors discussed in the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2025 and other risks and uncertainties discussed from time to time in the Company's filings with the U.S. Securities and Exchange Commission.\n\nThere can be no assurance that future developments will be in accordance with management's expectations or that the effect of future developments on the Company will be those anticipated by management. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. The Company undertakes no obligation to update the information contained in this press release to reflect subsequently occurring events or circumstances.\n\nOur reported results are presented in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"). We also disclose Funds From Operations (\"FFO\"), Core Funds From Operations (\"Core FFO\"), Adjusted Funds From Operations (\"AFFO\"), Pro Forma Earnings Before Interest, Taxes, Depreciation and Amortization (\"Pro Forma Adjusted EBITDA\"), and Same-Property Net Operating Income (\"Same-Property NOI\"), each of which are non-GAAP financial measures. We believe these non-GAAP financial measures are useful to investors because they are widely accepted industry measures used by analysts and investors to compare the operating performance of REITs.\n\nFFO, Core FFO, AFFO, Pro Forma Adjusted EBITDA, and Same-Property NOI do not represent cash generated from operating activities and are not necessarily indicative of cash available to fund cash requirements; accordingly, they should not be considered alternatives to net income as a performance measure or cash flows from operating activities as reported on our statement of cash flows as a liquidity measure and should be considered in addition to, and not in lieu of, GAAP financial measures.\n\nWe compute FFO in accordance with the definition adopted by the Board of Governors of the National Association of Real Estate Investment Trusts, or NAREIT.\n\nNAREIT defines FFO as GAAP net income or loss adjusted to exclude real estate related depreciation and amortization, as well as extraordinary items (as defined by GAAP) such as net gain or loss from sales of depreciable real estate assets, impairment write-downs associated with depreciable real estate assets and impairments associated with the implementation of current expected credit losses on commercial loans and investments at the time of origination, including the pro rata share of such adjustments of unconsolidated subsidiaries. The Company also excludes the gains or losses from sales of assets incidental to the primary business of the REIT which specifically include the sales of mitigation credits, subsurface sales, investment securities, and land sales, in addition to the mark-to-market of the Company's investment securities and interest related to the 2025 Notes, if the effect is dilutive. To derive Core FFO, we modify the NAREIT computation of FFO to include other adjustments to GAAP net income related to gains and losses recognized on the extinguishment of debt, amortization of above- and below-market lease related intangibles, and other unforecastable market- or transaction-driven non-cash items, as well as adding back the interest related to the 2025 Notes, if the effect is dilutive. To derive AFFO, we further modify the NAREIT computation of FFO and Core FFO to include other adjustments to GAAP net income related to non-cash revenues and expenses such as straight-line rental revenue, non-cash compensation, and other non-cash amortization. Such items may cause short-term fluctuations in net income but have no impact on operating cash flows or long-term operating performance. We use AFFO as one measure of our performance when we formulate corporate goals.\n\nTo derive Pro Forma Adjusted EBITDA, GAAP net income or loss attributable to the Company is adjusted to exclude real estate related depreciation and amortization, as well as extraordinary items (as defined by GAAP) such as net gain or loss from sales of depreciable real estate assets, impairment write-downs associated with depreciable real estate assets, impairments associated with the implementation of current expected credit losses on commercial loans and investments at the time of origination, including the pro rata share of such adjustments of unconsolidated subsidiaries, non-cash revenues and expenses such as straight-line rental revenue, amortization of deferred financing costs, gains and losses recognized on the extinguishment of debt, above- and below-market lease related intangibles, non-cash compensation, other non-recurring items such as termination fees, forfeitures of tenant security deposits, and other non-recurring items, and other non-cash income or expense. The Company also excludes the gains or losses from sales of assets incidental to the primary business of the REIT which specifically include the sales of mitigation credits, subsurface sales, investment securities, and land sales, in addition to the mark-to-market of the Company's investment securities. Cash interest expense is also excluded from Pro Forma Adjusted EBITDA, and GAAP net income or loss is adjusted for the annualized impact of acquisitions, dispositions and other similar activities.\n\nTo derive Same-Property NOI, GAAP net income or loss attributable to the Company is adjusted to exclude real estate related depreciation and amortization, as well as extraordinary items (as defined by GAAP) such as net gain or loss from sales of depreciable real estate assets, impairment write-downs associated with depreciable real estate assets, impairments associated with the implementation of current expected credit losses on commercial loans and investments at the time of origination, including the pro rata share of such adjustments of unconsolidated subsidiaries, non-cash revenues and expenses such as straight-line rental revenue, amortization of deferred financing costs, gains and losses recognized on the extinguishment of debt, above- and below-market lease related intangibles, non-cash compensation, other non-recurring items such as termination fees, forfeitures of tenant security deposits, and other non-recurring items, and other non-cash income or expense. Interest expense, general and administrative expenses, investment and other income or loss, income tax benefit or expense, real estate operations revenues and direct cost of revenues, management fee income, and interest income from commercial loans and investments are also excluded from Same-Property NOI. GAAP net income or loss is further adjusted to remove the impact of properties that were not owned for the full current and prior year reporting periods presented. Cash rental income received under the leases pertaining to the Company's assets that are presented as commercial loans and investments in accordance with GAAP is also used in lieu of the interest income equivalent.\n\nFFO is used by management, investors and analysts to facilitate meaningful comparisons of operating performance between periods and among our peers primarily because it excludes the effect of real estate depreciation and amortization and net gains or losses on sales, which are based on historical costs and implicitly assume that the value of real estate diminishes predictably over time, rather than fluctuating based on existing market conditions. We believe that Core FFO and AFFO are additional useful supplemental measures for investors to consider because they will help them to better assess our operating performance without the distortions created by other non-cash revenues or expenses. We also believe that Pro Forma Adjusted EBITDA is an additional useful supplemental measure for investors to consider as it allows for a better assessment of our operating performance without the distortions created by other non-cash revenues, expenses or certain effects of the Company's capital structure on our operating performance. We use Same-Property NOI to compare the operating performance of our assets between periods. It is an accepted and important measurement used by management, investors and analysts because it includes all property-level revenues from the Company's properties, less operating and maintenance expenses, real estate taxes and other property-specific expenses (\"Net Operating Income\" or \"NOI\") of properties that have been owned and stabilized for the entire current and prior year reporting periods. Same-Property NOI attempts to eliminate differences due to the acquisition or disposition of properties during the particular period presented, and therefore provides a more comparable and consistent performance measure for the comparison of the Company's properties. FFO, Core FFO, AFFO, Pro Forma Adjusted EBITDA, and Same-Property NOI may not be comparable to similarly titled measures employed by other companies."
    },
    {
        "title": "Down 15%, Should You Buy the Dip on Microsoft?",
        "url": "https://www.fool.com/investing/2026/02/19/down-15-should-you-buy-the-dip-on-microsoft/",
        "source": "The Motley Fool",
        "date": "2026-02-20T12:47:00+00:00",
        "content": "It remains one of the safer bets you can make in the tech world.\n\nAfter finishing 2025 up over 15%, Microsoft (MSFT 0.31%) has been off to a rough start in 2026. Through Feb. 16, its stock is down 15% year to date, including a 10% single-day drop on Jan. 28 after its latest earnings report.\n\nThere are two ways to look at Microsoft's struggles in early 2026. The first one is through a pessimistic lens and wonder if this is a sign of distress. The second is a more positive view, where you now see a Microsoft stock that's trading at a \"discount.\" For most investors, the latter is the better approach.\n\nWhen Microsoft reported its latest earnings, it beat analysts' revenue and earnings per share estimates. However, the \"issue\" revolves around how much the company intends to spend on artificial intelligence (AI) and data center infrastructure without any short-term return on investment.\n\nThis spending will inevitably cut into Microsoft's free cash flow and short-term profitability, which isn't necessarily music to investors' ears. Add in an expected slowdown in Azure's (its cloud platform) growth and the amount of future revenue it has tied to OpenAI, and it was the perfect storm for investors to panic a bit and jump ship.\n\nAt the end of the day, there's no tech company as diversified and ingrained into the business world as Microsoft. If you remove it from the equation, the global corporate world as we know it would suffer greatly. That doesn't make it struggle-proof, but it does make it virtually indispensable.\n\nMicrosoft's core businesses are still flourishing. In the latest quarter, its Productivity and Business Processes revenue was up 16%, Intelligent Cloud revenue was up 29%, and overall revenue was up 17% ($81.3 billion total).\n\nIt would be one thing if Microsoft's business were struggling and that was leading to the current sell-off. However, that's far from the case. This seems to be a case of investors having ultra-high expectations and overreacting to short-term uncertainty.\n\nMSFT Revenue (Quarterly) data by YCharts\n\nNobody can predict how Microsoft's stock will perform, so don't buy the dip just because you don't think it will get any lower. You should do it because you're getting a blue chip stock cheaper than it was before.\n\nGiven the poor performance of the \"Magnificent Seven\" stocks and uncertainty about a potential AI bubble, I would dollar-cost average and slowly but surely increase my stake in Microsoft. It's still a great long-term option and one of the safest bets in the tech world.\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."
    }
]