[
    {
        "title": "Prediction: Microsoft Stock Could Rise 65% in 2026",
        "url": "https://www.fool.com/investing/2026/02/11/prediction-microsoft-stock-could-rise-65-in-2026/",
        "source": "The Motley Fool",
        "date": "2026-02-12T00:08:00+00:00",
        "content": "Microsoft is spending billions on AI while investors panic. Here's why this could be the setup for a powerful long-term rebound.\n\nMicrosoft (MSFT 0.64%) is facing investor skepticism as AI spending surges, but cloud demand, backlog growth, and Azure's scale suggest long-term upside may be building beneath the surface.\n\nStock prices used were the market prices of Feb. 5, 2026. The video was published on Feb. 11, 2026.\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."
    },
    {
        "title": "Westpac profit hits $1.9b, Nick Scali profit soars",
        "url": "https://www.afr.com/markets/equity-markets/asx-to-fall-us-tech-tumbles-anew-precious-metals-sink-20260213-p5o1y9",
        "source": "Australian Financial Review",
        "date": "2026-02-12T22:37:00+00:00",
        "content": "Virgin Australia names new Velocity boss\n\nNib to sell World Nomads to SiriusPoint\n\nNick Scali’s profit surges 36pc to $41m\n\nCoast Entertainment lifts earnings, theme park ticket sales\n\nWesfarmers, Microsoft flag multi-year partnership to accelerate AI\n\nRamsay Health Care cleared to acquire National Capital Hospital\n\nAustralian shares are set to drop in line with losses in New York after a renewed wave of selling hit commodities and technology. Apple slumped 5 per cent, pacing all seven of the megacap techs lower.\n\nASX futures were pointing down 78 points or 0.9 per cent to 8895 at 8am AEDT. The S&P 500 closed 1.6 per cent lower.\n\nOil briefly slid 3 per cent. Gold fell more than 3 per cent to trade below $US5000 an ounce, and silver shed more than 10 per cent. The US 10-year yield dropped 7 basis points to 4.10 per cent.\n\nCisco fell 12 per cent, its worst decline in more than two years, after giving a weaker-than-expected forecast for profitability, a sign that higher memory-chip prices are taking a toll, Bloomberg reported.\n\nThe broader slump in tech also reflected renewed scepticism about artificial intelligence’s payoff and its wider impact.\n\nASX 200 futures are pointing down 78 points or 0.9 per cent to 8895.All US prices near 4.30pm New York time:\n\nResults expected on Friday: BWP Trust (BWP) | Cochlear (COH) | GQG Partners (GQG) | Nick Scali (NCK) | Westpac (WBC).\n\nWhat we learnt on Thursday: AMP and Temple & Webster create wrong kind of history | The two companies and market darling Pro Medicus reset expectations for what it is like to get hammered on results day.\n\nThe US is scheduled to release January CPI data at 12.30am on Saturday (AEDT).\n\nRBA board appointee argued for higher interest rates | Bruce Preston, one of the nation’s top academic monetary policy economists, has been added by Jim Chalmers to the central bank’s cash rate-setting panel.\n\nAustralia’s once mighty growth funds watch returns disappear | Top investors including Hyperion, GCQ and Aoris are nursing heavy losses as the violent sell-off in software stocks erodes years of market-leading performance.\n\nChanticleer: Frank Calabria’s billion-dollar baby meets the AI buzzsaw | Last year’s good idea can be today’s bad one – that’s life in capital markets."
    }
]