[
    {
        "title": "S&P Global (SPGI) Reports Earnings Tomorrow: What To Expect",
        "url": "https://finance.yahoo.com/news/p-global-spgi-reports-earnings-030330644.html",
        "source": "Yahoo Finance",
        "date": "2026-02-09T03:20:00+00:00",
        "content": "Financial intelligence company S&P Global (NYSE:SPGI) will be reporting results this Tuesday before the bell. Here’s what to expect.\n\nS&P Global beat analysts’ revenue expectations by 1.3% last quarter, reporting revenues of $3.89 billion, up 8.8% year on year. It was a strong quarter for the company, with and .\n\nIs S&P Global a buy or sell going into earnings? Read our full analysis here, it’s free for active Edge members.\n\nThis quarter, analysts are expecting S&P Global’s revenue to grow 8.7% year on year to $3.90 billion, slowing from the 14% increase it recorded in the same quarter last year. Adjusted earnings are expected to come in at $4.33 per share.\n\nAnalysts covering the company have generally reconfirmed their estimates over the last 30 days, suggesting they anticipate the business to stay the course heading into earnings. S&P Global has a history of exceeding Wall Street’s expectations, beating revenue estimates every single time over the past two years by 2.2% on average.\n\nLooking at S&P Global’s peers in the financial exchanges & data segment, some have already reported their Q4 results, giving us a hint as to what we can expect. Nasdaq delivered year-on-year revenue growth of 13.4%, beating analysts’ expectations by 1.4%, and Intercontinental Exchange reported revenues up 7.8%, topping estimates by 1.2%. Nasdaq traded down 1.8% following the results while Intercontinental Exchange was up 2.5%.\n\nRead our full analysis of Nasdaq’s results here and Intercontinental Exchange’s results here.\n\nThe outlook for 2025 remains clouded by potential trade policy changes and corporate tax discussions, which could impact business confidence and growth. While some of the financial exchanges & data stocks have shown solid performance in this choppy environment, the group has generally underperformed, with share prices down 3.7% on average over the last month. S&P Global is down 19.2% during the same time and is heading into earnings with an average analyst price target of $622.74 (compared to the current share price of $439.67).\n\nHere at StockStory, we certainly understand the potential of thematic investing. Diverse winners from Microsoft (MSFT) to Alphabet (GOOG), Coca-Cola (KO) to Monster Beverage (MNST) could all have been identified as promising growth stories with a megatrend driving the growth. So, in that spirit, we’ve identified a relatively under-the-radar profitable growth stock benefiting from the rise of AI, available to you FREE via this link."
    },
    {
        "title": "Zacks Investment Ideas feature highlights: Microsoft, Alphabet and Amazon",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/GOOGL/pressreleases/103418/zacks-investment-ideas-feature-highlights-microsoft-alphabet-and-amazon/",
        "source": "The Globe and Mail",
        "date": "2026-02-09T12:27:00+00:00",
        "content": "Chicago, IL – February 9, 2026 – Today, Zacks Investment Ideas feature highlights Microsoft MSFT, Alphabet GOOGL and Amazon AMZN.\n\nAlphabet & Microsoft: Billion-Dollar AI Bettors\n\nThe 2025 Q4 earnings season continues to move at a rapid pace, with a fair chunk of S&P 500 companies already delivering their results. Among the bunch have been most of the Mag 7 members, including Microsoft and Alphabet, both of which are deeply involved in the broader AI frenzy.\n\nBoth stocks have seen weak reactions post-earnings so far, though the reaction to MSFT has been considerably more negative. Extremely high capital expenditures (CapEx) have been a major driver of sentiment, with both investing heavily in their futures.\n\nMicrosoft posted a double-beat relative to our consensus expectations, continuing its established history of exceeding expectations. Adjusted EPS of $4.14 grew by 24% year-over-year, whereas sales of $81.3 billion grew 17% from the year-ago period.\n\nBut while the growth is impressive, investors have expressed concerns about CapEx for cloud and AI offerings and, importantly, a slowdown in Azure growth. For years, investors have placed a strong emphasis on accelerating cloud revenue, which has often dictated post-earnings reactions across the space, including with Amazon’s AWS.\n\nCapEx for the period totaled $37.5 billion, of which $29.9 billion was for property and equipment, such as GPUs and CPUs to support Azure demand. Its broader Intelligent Cloud segment, which includes Azure, saw sales grow 28% year-over-year to $32.9 billion, though the segment’s gross margin took a hit due to continued AI investments.\n\nNonetheless, the valuation picture for the tech giant currently remains constructive, with the current 23.4X forward 12-month earnings multiple well beneath the 30.6X five-year median, also reflecting just a 3% premium relative to the S&P 500. The median premium over the last five years sits at 45%.\n\nIn addition, the EPS outlook for its current fiscal year remains notably bullish, having risen 15% over the past year and also seeing a big post-earnings revision. The negativity in shares feels a bit overdone given the favorable earnings estimate revisions trend and sound valuation picture, but the stock nonetheless remains highly sensitive to broader AI trends.\n\nIt’s also worth noting that MSFT shares have lagged the S&P 500 by a notable margin across a five-year timeframe, up 62% against the S&P 500’s 82% gain.\n\nSimilar to its peer MSFT, Alphabet posted a double-beat relative to our consensus expectations, with adjusted EPS of $2.82 shooting 31% higher year-over-year alongside a 18% sales increase.\n\nImportantly, Google Cloud results were notably strong, with revenues increasing by a mighty 48% to $17.7 billion. Growth was driven by increased adoption of Google Cloud Platform (GCP) across enterprise AI infrastructure and enterprise AI Solutions, helping the company clear a critical hurdle from a sentiment standpoint.\n\nSundar Pichai, on the results –\n\n‘We’re seeing our AI investments and infrastructure drive revenue and growth across the board. To meet customer demand and capitalize on the growing opportunities we have ahead of us, our 2026 CapEx investments are anticipated to be in the range of $175 to $185 billion.’\n\nThe CapEx guide obviously reflects a massive bet on its future, with the $180 billion midpoint surprising the market in a big way. Below is a chart illustrating Alphabet’s CapEx on a quarterly basis.\n\nSimilar to MSFT, the earnings estimate revisions trend for its current fiscal year is one of bullishness, with the current $11.06 Zacks Consensus EPS estimate moving 8.2% higher over the past year.\n\nThe reactions to Alphabetand Microsoft quarterly releases have been adverse, though MSFT has faced much more pressure. Both companies are laying out huge capital to build out during the broader AI frenzy, with the trend seemingly not slowing anytime soon.\n\nThe rough price action MSFT has faced seems a bit overdone, with the stock now widely underperforming relative to the S&P 500 across many timeframes, including the last five years. Valuation multiples have come down to more tolerable levels, while Alphabet remains a bit rich relative to the general market.\n\nImportantly, both companies are seeing rising earnings estimate revisions for their current fiscal years, a bullish signal.\n\nFree: Instant Access to Zacks' Market-Crushing Strategies\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\n\nToday you can tap into those powerful strategies – and the high-potential stocks they uncover – free. No strings attached.\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nThis under-the-radar company specializes in semiconductor products that titans like NVIDIA don't build. It's uniquely positioned to take advantage of the next growth stage of this market. And it's just beginning to enter the spotlight, which is exactly where you want to be.\n\nWith strong earnings growth and an expanding customer base, it's positioned to feed the rampant demand for Artificial Intelligence, Machine Learning, and Internet of Things. Global semiconductor manufacturing is projected to explode from $452 billion in 2021 to $971 billion by 2028.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThis article originally published on Zacks Investment Research (zacks.com).\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Earnings To Watch: Hasbro (HAS) Reports Q4 Results Tomorrow",
        "url": "https://uk.finance.yahoo.com/news/earnings-watch-hasbro-reports-q4-030157420.html",
        "source": "Yahoo Finance UK",
        "date": "2026-02-09T03:00:00+00:00",
        "content": "Your privacy is important to us\n\nYahoo is part of the Yahoo family of brandsThe sites and apps that we own and operate, including Yahoo and Engadget, and our digital advertising service, Yahoo Advertising.Yahoo family of brands.\n\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\n\nIf you would like to customise your choices, click 'Manage privacy settings'.\n\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy and Cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
    },
    {
        "title": "Amazon, Alphabet and Nvidia are part of Zacks Earnings Preview",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/AMZN/pressreleases/102993/amazon-alphabet-and-nvidia-are-part-of-zacks-earnings-preview/",
        "source": "The Globe and Mail",
        "date": "2026-02-09T12:21:00+00:00",
        "content": "Chicago, IL – February 9, 2026 – Zacks.com releases the list of companies likely to issue earnings surprises. This week’s list includes Amazon AMZN, Alphabet GOOGL and Nvidia NVDA.\n\nBreaking Down Mag 7 Earnings: Good or Bad?\n\nAmazon missed EPS estimates in its December-quarter report, but the business is otherwise literally firing on all cylinders.\n\nThe market’s negative reaction to the Amazon report wasn’t due to the EPS miss, but rather to management’s eye-popping capital spending budget for 2026, which coincided with renewed worries about the broader AI space and growing fears that this new technology could seriously erode the earnings power of legacy technology businesses like software.\n\nThe market’s reaction to Amazon is broadly in the same category as Alphabet's after its quarterly release, with the severity of Amazon’s ‘punishment’ reflecting investors’ shock at learning of management’s AI plans. Amazon plans to spend $200 billion in capital expenditures in 2026, up from $132 billion in 2025 and $83 billion in 2024. Amazon’s operating cash flows modestly exceeded its $132 billion capex outlays in 2025, but the company’s 2026 capex budget will most likely exceed its operating cash flows.\n\nBefore we learnt of these lofty spending plans, many in the market expected 2026 to be the capex peak for Amazon (Alphabet and others). But management’s commentary about the mission-critical nature of these outlays likely means that it may be premature to declare peak capex. Amazon shares are now down -8.8% over the past year, lagging the broader market’s +15.8% gain and Alphabet’s impressive +74.1% rise.\n\nAmazon is doing great in its core businesses, with its cloud unit enjoying accelerating growth and coming out with the best growth in three years. Revenues in Amazon Web Services (AWS) increased +24% in 2025 Q4, which compares to year-over-year growth rates of +20% in Q3, +19% in Q2, and +17% in Q1. Backlog for the business increased +40% from the same period last year to $244 billion, with management describing a robust demand environment.\n\nWhile Amazon remains the cloud leader, the Alphabet report showed accelerating momentum at the search giant’s Google Cloud business. Revenues for Google Cloud increased +48% from the same period last year in 2025 Q4, which compares to growth rates of +35%, +32%, and +28% in Q3, Q2, and Q1, respectively. The strong cloud gains at Amazon and Alphabet put the spotlight on Microsoft’s lack of momentum in this key business area.\n\nAt this stage in the Q4 reporting cycle, Nvidia is the only Mag 7 member that has yet to report December-quarter results. Nvidia is scheduled to report Q4 results on February 25th, with EPS and revenues for the period expected to be up +70.8% and +66.7% from the same period last year, respectively.\n\nCombining the actual results for the 6 Magnificent 7 members that have reported already with estimates for Nvidia, total Q4 earnings for the group are expected to be up +24.2% from the same period last year on +18.9% higher revenues, which would follow the group’s +28.3% earnings growth on +18.1% revenue growth in 2025 Q3.\n\nPlease note that the Mag 7 group is on track to bring in 26.6% of all S&P 500 earnings in 2026 and account for 33.5% of the index’s market capitalization.\n\nThe Mag 7 group has been enjoying a steadily improving earnings outlook, with analysts raising their estimates. We saw that trend in play ahead of the start of the Q3 earnings season, and something similar is in place for the 2025 Q4 period as well.\n\nThrough Friday, February 6th, we have seen Q4 results from 293 S&P 500 members or 58.6% of the index’s total membership. Total earnings for these companies are up +14.1% from the same period last year on +9.2% higher revenues, with 77.5% beating EPS estimates and 72% beating revenue estimates.\n\nWe have more than 500 companies on deck to report results this week, including 77 index members. The week’s lineup includes a blend of Tech operators like Spotify, Lyft, and Cisco, and traditional bellwethers like DuPont, Ford, Coca-Cola, BP, and others.\n\n2026 Q1 estimates have increased modestly for 5 of the 16 Zacks sectors since the start of January, including Tech, Industrials, Retail, Utilities, and Business Services. On the negative side, Q1 estimates have come down for 10 of the 16 Zacks sectors, with the biggest declines at the Energy, Medical, and Consumer Discretionary sectors.\n\nFor a detailed look at the overall earnings picture, including expectations for the coming periods, please check out our weekly Earnings Trends report >>>> Earnings Outlook Improves: A Closer Look\n\nFree: Instant Access to Zacks' Market-Crushing Strategies\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\n\nToday you can tap into those powerful strategies – and the high-potential stocks they uncover – free. No strings attached.\n\nJoin us on Facebook:  https://www.facebook.com/ZacksInvestmentResearch/\n\nZacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.\n\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nThis under-the-radar company specializes in semiconductor products that titans like NVIDIA don't build. It's uniquely positioned to take advantage of the next growth stage of this market. And it's just beginning to enter the spotlight, which is exactly where you want to be.\n\nWith strong earnings growth and an expanding customer base, it's positioned to feed the rampant demand for Artificial Intelligence, Machine Learning, and Internet of Things. Global semiconductor manufacturing is projected to explode from $452 billion in 2021 to $971 billion by 2028.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThis article originally published on Zacks Investment Research (zacks.com).\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Chegg (CHGG) Q4 2025 Earnings Call Transcript",
        "url": "https://www.fool.com/earnings/call-transcripts/2026/02/09/chegg-chgg-q4-2025-earnings-call-transcript/",
        "source": "The Motley Fool",
        "date": "2026-02-09T22:05:00+00:00",
        "content": "Monday, February 9, 2026 at 4:30 p.m. ET\n\nNeed a quote from a Motley Fool analyst? Email [email protected]\n\nChegg (CHGG 5.11%) completed a strategic shift centered on Chegg Skilling, reporting $18 million in skilling segment revenue and outlining plans for double-digit growth and an adjusted EBITDA margin target of at least 20% in coming years. Management emphasized a lean operating model with non-GAAP expense reductions, disciplined capital allocation—including a $9 million convertible note repurchase—and ongoing restructuring costs predominantly front-loaded in 2026. The academic services segment, now managed primarily for free cash flow, continues to serve over a million students but faces persistent traffic headwinds from changes in search interfaces. Newly announced partnerships and significant leadership additions are intended to expand curriculum and B2B reach, particularly in high-demand AI and technical skills content distribution channels.\n\nTracey Ford: Thank you for joining Chegg's Fourth Quarter 2025 Conference Call. On today's call are Daniel Rosensweig, President and CEO, and David Longo, Chief Financial Officer. A copy of our earnings press release along with our investor presentation is available on our Investor Relations website, investor.chegg.com. A replay of this call will also be available on our website. We routinely post information on our website and intend to make important announcements on our media center website at chegg.com/mediacenter. We encourage you to make use of these resources. Before we begin, I would like to point out that during the course of this call, we will make forward-looking statements regarding future events including the future financial and operating performance of the company.\n\nThese forward-looking statements are subject to material risks and uncertainties that could cause actual results to differ materially from those in the forward-looking statements. We caution you to consider the important factors that could cause actual results to differ materially from those in the forward-looking statements. In particular, we refer you to the cautionary language included in today's earnings release and the risk factors described in Chegg's annual report on Form 10-Ks for the year ended 12/31/2024, filed with the Securities and Exchange Commission as well as our other filings with the SEC. Any forward-looking statements that we make today are based on assumptions that we believe to be reasonable as of this date.\n\nWe undertake no obligation to update these statements as a result of new information or future events. During this call, we will present both GAAP and non-GAAP financial measures. Our GAAP results and GAAP to non-GAAP reconciliations can be found in our earnings press release on the investor slide deck found on our IR website investor.chegg.com. We also recommend you review the investor datasheet, which is also posted on our IR website. Now I will turn the call over to Daniel Rosensweig.\n\nDaniel Rosensweig: Thank you, Tracey, and thank you, everyone, for joining Chegg's Fourth Quarter 2025 Earnings Call. This is a period of reinvention at Chegg. We are rebuilding the company focused on the $40 billion skilling market which we believe will be a double-digit revenue growth business for Chegg with strong margins and cash flow in the years ahead. To achieve this, we have reorganized Chegg around two focused business units, Chegg Skilling which is now our growth engine, and our legacy academic learning services, which we are managing to generate free cash flow. Together, this structure gives us the financial flexibility to invest and grow opportunities within skilling while creating long-term shareholder value.\n\nWe are excited about our future and feel confident that this new structure sets us up for success. We are already seeing positive early signs. In Q4, Chegg Skilling delivered $18 million in revenue, positioning us for double-digit growth for 2026. Our legacy business, Chegg Study, continues to serve more than a million students. And with our new streamlined org structure, is providing meaningful cash flow to fund value creation. As we have expressed, changes in search interfaces continue to impact our traffic. Yet despite these changes, the quality and the accuracy of our services continues to drive high retention rates.\n\nWe are now focused on optimizing pricing and packaging and testing multiple strategies to extend our operational runway and drive more free cash flow. We have a clear objective to use that cash to fund new growth opportunities and increase the value for our shareholders. Given the global demand for workforce scaling has already reached $40 billion, we feel it's a huge opportunity for Chegg, and we are well positioned to serve this market. Particularly in AI, language, technical fluency, and durable skills. Our brand is trusted by learners worldwide, and our skills courses are grounded in learning science and data-driven instructional design.\n\nOur platform tracks learner progress in real-time delivering predictive nudges and timely interventions that improve engagement, retention, and completion rates. This combination of brand credibility, evidence-based course design, and intelligent learner support consistently leads our channel partners to report stronger outcomes versus our competitors. To capture the growth opportunity we see ahead, we are expanding our course catalog with high-demand technical AI language and professional skills. While simultaneously broadening our global footprint across B2B distribution channels. As part of this strategy, we're excited to announce new partnerships with DHL GI Group, and Wolfe University. Wolfe specifically expands how we can serve learners as they provide accredited degree pathways that allow for acquired skills to count towards recognized credentials.\n\nWe've also extended a few key contracts from companies like L'Oreal and PPG. Our goal is to further extend our reach into global enterprise institutional, and academic markets. Looking ahead to 2026, we plan to onboard additional employer and institutional partners both directly and through leading marketplaces. We continue to expand the depth and breadth of our curriculum. To support this opportunity, I'm thrilled to announce that Karine Alouch is joining our team to run our European language learning and skills operation. Karim brings deep experience in building and scaling enterprise businesses across Microsoft, NetApp, Global English, and most recently, at Coursera, where she led the transformation of their enterprise business.\n\nWe are thrilled to have her leadership and expertise as we scale our skilling business around the world. We have made significant progress in the reinvention of Chegg. Our goal is to continue to grow our skilling business by double digits annually and over the next couple of years to achieve an adjusted EBITDA margin of at least 20%. To achieve that, our 2026 priorities are straightforward. Accelerate the growth of our skilling business, by expanding our offerings and network partners domestically and through Europe, increase free cash flow to invest in the future growth of Skilling, and strengthen our balance sheet by ending the year with zero debt and meaningful cash balance.\n\nWe are encouraged by the results we are seeing in the skills business and are excited about the path ahead. We successfully transformed our business from a print textbook rental business to an online learning company, and now we are transitioning from a D2C business to a B2B skills learning platform. We are excited about the work we have done so far, and we look forward to updating you next quarter. And with that, I'll turn it over to David Longo.\n\nDavid Longo: Thank you, Daniel, and good afternoon. Today, I will be presenting our financial performance for 2025 along with the company's outlook for 2026. We are introducing our new revenue breakout to provide transparency into our Chegg skilling business. Historical revenue breakout for the past few years can be found on our datasheet on our investor relations website. We delivered a good fourth quarter. We exceeded our revenue expectations and surpassed the high end of our adjusted EBITDA guidance by $2 million reflecting the initial positive impact of our new focus and turnaround efforts. Our strategic shift into the large skilling market positions us for the next phase of long-term sustainable growth with strong margins.\n\nDuring the quarter, we also took steps to enhance our capital structure repurchasing $9 million of our 2026 convertible notes at a discount. In the fourth quarter, we delivered $18 million in skilling revenue with double-digit growth underscoring the significant market opportunity and the momentum we are seeing. Academic services revenue was $55 million as we continued to operate the business with a focus on cash generation. As Daniel mentioned earlier, we are testing different pricing and packaging strategies to extend its operational runway. Moving on to expenses. Non-GAAP operating expenses were $44.8 million in the quarter, a reduction of $39.8 million or 47% year over year.\n\nAs we maintain fiscal discipline and continue to benefit from the successful execution of our restructuring activities. Our fourth quarter adjusted EBITDA was $13 million representing a margin of 18%. Our adoption of AI along with our new business structure has enabled us to significantly lower expenses while preserving our ability to grow. We overhauled our cost structure to improve efficiency and create capacity for reinvestment in Chegg Skilling. We are on track to reduce total non-GAAP expenses to less than $250 million in 2026 a 53% decline from 2024. Our strategic investment in AI has allowed us to significantly reduce CapEx without compromising quality. Q4 CapEx was $6 million down 51% year over year.\n\nFor 2026, we are targeting a further 60% reduction in CapEx. With approximately 90% dedicated to our growing skilling business. Free cash flow in the fourth quarter was negative $15 million which was primarily impacted by $12 million in employee severance payments related to our restructuring activities. In 2026, we expect $18 million in severance-related cash expenditures related to our last two restructuring with approximately 80% occurring in the first quarter. Despite these items, we expect to generate meaningful free cash flow in 2026. Looking at the balance sheet, we concluded the quarter with cash and investments of $85 million and a net cash balance of $31 million.\n\nBefore I move to guidance, I'd like to quickly address the delisting notice we received from the NYSE. The notice has no immediate impact on our listing status. And we have ample time and multiple avenues available to regain compliance. Including a potential reverse stock split. Our primary focus is on strengthening the fundamentals of the business. We believe that executing on our priorities will be the most effective path to restoring compliance and delivering long-term shareholder value. Looking ahead at Q1 guidance, we expect $17.5 million to $18 million of revenue from our Chegg skilling business.\n\nWe expect double-digit growth for the year and anticipate stronger performance in the second half than in the first driven by continued investment in the business and the addition of new distribution partners. Total revenue between $60 and $62 million gross margin to be in the range of 57% to 58% and adjusted EBITDA between $11 million and $12 million. In 2026, our capital allocation strategy is focused on optimizing free cash flow, strengthening our cash position, and eliminating our debt to create a more flexible and resilient balance sheet. We will also evaluate opportunities to deploy capital through a disciplined approach that supports sustainable growth and generates long-term shareholder value.\n\nIn closing, we have taken deliberate actions to strengthen the company for long-term success. We are leaner, more efficient, and poised for double-digit revenue growth in our Chegg's skilling business and meaningful free cash flow in 2026. We believe we are turning the corner and are on a clear path toward future growth, profitability, and increased shareholder value. With that, I will turn the call over to the operator for your questions.\n\nOperator: Thank you. We will now be conducting a question and answer session. A confirmation tone will indicate your line is in the question queue. You may press 2 to remove yourself from the queue. For participants using speaker equipment, it may be necessary to pick up the handset before pressing the star keys. One moment, please, while we poll for questions. Our first question comes from the line of Bryan Smilek with JPMorgan. Please proceed with your question.\n\nBryan Smilek: Great. Thanks for taking the questions, and good to see the skill in progress Daniel, can you just help us understand the key drivers of the skilling growth and focus between VUSU and other skilling credentialing areas? And then secondarily, more on the core business as well. Can you just elaborate on what you're seeing in the early price test and plan mix across the legacy business? Thanks.\n\nDaniel Rosensweig: Yeah. Great questions. I just want to reverse the way we think about it, which is the core business now is skilling. So the historic business is the academic services business. Let me start with that one, and then I'll talk about the key KPIs that we look at with skilling. So we're probably about 40% through the quarter on the learning business. And it's pretty much where we talk it would be with the exception of the retention continues to be a little bit stronger than we thought. And that's very good for free cash flow generation.\n\nSo what we know is when Google doesn't block our traffic or when the traffic gets through, that we continue to convert well and retention continues to actually achieve the highest levels that I've seen, not since I've been back, but even before that. So that gives us a runway to be able to reinvent that product, which we have several ideas and we're sort of excited about them of where Chegg Study can go in the future. But in the interim, the price testing the key for us is all they do a month in, which is retention. And so far, they're performing actually quite well.\n\nSo you know, it's too early to declare, you know, one way or the other, but we're very pleased with the fact that retention continues to be so high. On the skilling business, so we used to be a B2C business. On whether it was Busu or whether it was on Chegg Skills. Both those businesses over the last twenty-four months have been converted into B2B businesses. Skills is exclusively B2B. And by the end of this year, Busuu will be more B2B than B2C.\n\nAnd so the key metrics that we're looking at are some of the things that we began to talk about, which is how do we expand the number of distribution partners that we have, and we announced one, and we expect to announce more over the course of the year, which we're excited about. And then second is how do we continue to expand the curriculum we have to sell more into the businesses or the channels that we already have. And so we'll just be focused on number of channels and expanding curriculum. And over time, we'll talk about sort of the average volume of a transaction. It's too early to do that.\n\nBut at the moment, it's more channels of distribution and more curriculum to be able to sell into the existing and to the new channels. And both of those things are up to a slightly faster start than I would have expected, you know, only nine weeks back on the job. So I'm actually excited about it.\n\nBryan Smilek: Great. Thanks, Daniel.\n\nOperator: Thank you. Our next question comes from the line of Ryan MacDonald with Needham and Company. Please proceed with your question.\n\nRyan MacDonald: Hi. Thanks for taking my questions. Daniel, maybe to ask you about the state of the skilling market. Obviously, a lot of change that's about to happen with the Coursera Udemy merger, obviously, two of the biggest players in the space. And so as I think about Chegg skilling and sort of how you gain share within the marketplace in B2B, you know, you talk about expanding the number of distribution partners, expanding the curriculum you have.\n\nWhat opportunities do you think present themselves from this impending merger of areas where you can look to either take mindshare from a distribution partner or expand content by bringing on maybe new content creators as this transition occurs over the next year or so?\n\nDaniel Rosensweig: Thanks. Yeah. It's a very interesting question, and that merger is sort of fascinating. In terms of how the two companies are performing. But the significant difference is they are marketplaces. For other people's content mostly and one has a B2B they both have a version of B2B and B2C. And so rather than looking at how do we how do we take share, can actually think the other way, which is can we work with them? Because our content continues to outperform the places we put it. And the definition of outperform for us is not just conversion, but completion. And renewal with those companies that are inside those channels.\n\nAnd we are and we mentioned it in the prepared remarks that we continue to hear from the partners that we have that we continue to outperform the other partners in the channel. And it's because we have a basis for actually teaching. That we've been able to apply over into this world. So we don't see Coursera and Udemy as competitors. We actually see them as potential partners to work with going forward.\n\nAnd our view is if we continue you know, if you look at how value gets created, we think it's now the person that's creating the content and can actually serve the student, educate the student, and that those businesses are gonna be more higher margin businesses. So than just the channels and distribution. So we see ourselves looking to we don't have to take share from them. We could take share potentially by working with them by also providing our content through their channels and other channels. So it's different than what we would've looked at before.\n\nRyan MacDonald: Really helpful clarification there, Daniel. I appreciate the color on that. Maybe as a follow-up. Obviously, we're starting to see a lot of the, let's call it, AI strategies at the board level start to be implemented within enterprise organizations broadly. Are you seeing that now translate into greater usage or consumption of AI learning content on your platform through your partnerships that you have?\n\nDaniel Rosensweig: Absolutely. Yes. So when we first started this several years ago, I mean, we went from zero to the size that we plan to be this year in just three and a half years. So we're seeing actually real good growth. And this will be the first time that we've expanded beyond our partnership with Gil to add new partners. So we're you know, we see double-digit growth ahead for the next several years because we're really just at the beginning of this thing. But when you ask what the demand is for, the original deals that we did were for frontline workers, who needed just basic technology skills.\n\nNow the demand is shifting rapidly towards how do we make sure that every single employee, not just frontline workers, but workers across the board, actually begin to understand how to utilize AI. So, you know, a different way to think about it is rather than say what should I build, everybody needs to learn the tools that I can use to build. And that's the role that we're playing, and we think that's a very big growth market which is why we're sort of accelerating the kinds of classes that we're teaching. And, honestly, the relationship that we now announced with Wolfe is also a very big opportunity going forward. It's very early to be able to size it.\n\nBut this is the first time Chegg is gonna be offering courses through a partner where our courses can count towards a degree. And so you can imagine the demand from students about wanting to have courses that they can take that also contribute to their college degree where they can put on their resumes that they actually understand how to use the tools around AI. And so these are all really fun and interesting and high growth areas for us.\n\nRyan MacDonald: Awesome. Thanks for taking my questions.\n\nDaniel Rosensweig: Thanks for asking them, and thanks for covering us. Appreciate it. A lot of small companies don't get that kind of coverage, so we're grateful.\n\nOperator: Thank you. And we have reached the end of the question and answer session. And this also concludes today's conference call. We do thank you for your participation. And you may now disconnect your lines at this time. Thank you.\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."
    }
]