[
    {
        "title": "Stock market today: Dow, S&P 500, Nasdaq end higher in volatile trading day as Apple jumps",
        "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-end-higher-in-volatile-trading-day-as-apple-jumps-210119999.html",
        "source": "Yahoo Finance",
        "date": "2026-02-17T21:12:00+00:00",
        "content": "US stocks edged higher Tuesday in volatile trading as Wall Street continued assessing the AI jitters that have hammered markets in recent weeks.\n\nThe tech-heavy Nasdaq Composite (^IXIC) flipped into the green to end 0.1% higher, recovering from steep losses early in the session. The S&P 500 (^GSPC) rose just above the flatline. The Dow Jones Industrial Average (^DJI) was little changed.\n\nApple (AAPL) shares gained more than 3% over optimism that the iPhone maker is ramping up development of wearable devices with AI capabilities.\n\nAfter a break for Presidents Day, AI concerns continued to simmer. Investors are on the lookout for the next potential victim after fresh worries about AI's ability to upend industries hit stocks in sectors from wealth management to transportation to logistics. The Dow and S&P 500 have fallen in four of the past five weeks amid that pressure.\n\nThis week, earnings season enters its final stretch. The week's highlight is Walmart's (WMT) quarterly report on Thursday, the first since the retail giant joined the trillion-dollar market cap club.\n\nElsewhere in corporates, Paramount Skydance (PSKY) stock rose over 5% on Tuesday following the news that Warner Bros. Discovery (WBD) has given the studio one week to come back with a better offer. Warner Bros. rejected the latest bid from the Hollywood studio.\n\nStocks went from negative to positive territory on Tuesday with the three major averages closing just above the flatline.\n\nThe tech-heavy Nasdaq Composite (^IXIC) rose 0.1%, while the S&P 500 (^GSPC) rose 0.1%. The blue-chip-heavy Dow Jones Industrial Average (^DJI) closed slightly higher.\n\nApple (AAPL) shares gained more than 3% after a Bloomberg report indicated the tech giant is ramping up development of three wearable devices with AI capabilities, including glasses, a pendant, and AirPods.\n\nFinancial (XLF) stocks gained while some software players continued their decline over fears that AI will disrupt the industry.\n\nGE Aerospace (GE) is dragging aerospace & defense higher today, up over 3% heading into the close.\n\nOther winners include Raytheon (RTX), Honeywell (HON), Parker-Hannifin (PH), and Wabtec (WAB).\n\nStill, it’s not a sea of green for a group that’s been a bastion of strength since the post–\"Liberation Day\" lows last April. General Dynamics (GD), Lockheed Martin (LMT), and Teledyne (TDY) are slightly in the red.\n\nGE’s the standout story either way. After spinning off GE Vernova (GEV), the stock has pushed back above its old 2000 peak — a long way from the two lost decades in between. It’s up more than 10x from the 2020 lows and back within spitting distance of the Jan. 6 all-time high.\n\nThe Dow Jones Transportation Index (^DJT) rallied Tuesday into key technical resistance above 19,500. That’s the 61.8% Fibonacci retracement from the Feb. 6 all-time closing high to the Feb. 12 closing low — and it’s the line in the sand for bears to defend.\n\nTransportation and logistics stocks like RXO Inc. (RXO) and C.H. Robinson Worldwide (CHRW) were among last week’s biggest losers, as the “AI scare trade” morphed from a software-only problem into a sledgehammer that hit anything tied to efficiency, labor, and fee pressure — including asset managers and insurance brokers. Now they’re bouncing hard, with RXO at the top of the transport tape.\n\nAirlines weren’t in the AI crosshairs, but they still got swept up in the industry sell-off. The spark was a paper from microcap Algorythm Holdings (RIME) on using AI in transportation logistics, which set off nerves in an index that had already notched 10 record closes in 2026.\n\nToday, Southwest (LUV) is leading the airlines bounce — up near 7% — with United (UAL), American (AAL), and Alaska (ALK) in tow, each up more than 3%.\n\nMeanwhile, RIME is down 17% after opening at a one-year high.\n\nFor the Dow Transports: holding above 19,500, bulls take control. Rejected, 19,000 is the downside target.\n\nApple (AAPL) shares gained more than 3% on Tuesday after a Bloomberg report indicated the tech giant is ramping up development of three new wearable devices with AI capabilities, including glasses, a pendant, and AirPods.\n\nThe devices are all built around Apple’s Siri digital assistant, according to the report.\n\nThe iPhone maker is competing with Meta (META), which is developing smart glasses, and OpenAI, which is exploring wearable devices.\n\nApple shares also gained following a bullish note from Wedbush Securities analyst Dan Ives, who brushed off a recent decline in Apple shares amid a broader tech sell-off.\n\n\"This recent worry and sell-off in Apple Inc.’s shares is unwarranted, as the focus is on Apple getting its AI strategy right and releasing its advanced AI features by the summer timeframe, which still appears to be on track,\" wrote Ives.\n\nWedbush maintained an Outperform rating and a $350 price target.\n\nGold (GC=F) retreated more than 2% on Tuesday, but the recent volatility may be temporary as Wall Street analysts see a bullish outlook for the precious metal in 202\n\nGold futures hovered around $4,900 as Asian markets closed for the Chinese New Year. Meanwhile, Iran and the US reached a “general agreement” on a possible nuclear deal, easing tensions in the Middle East.\n\n\"Despite short-term softness, the structural drivers supporting gold remain firmly in place,\" Ole Hansen, head of commodity strategy at Saxo Bank, wrote in a newsletter.\n\nThe strategist highlighted central bank buying, geopolitical fragmentation, and portfolio diversification as key factors driving gold’s safe-haven appeal amid concerns over currency debasement.\n\nPalantir (PLTR) has moved its headquarters to Miami from Denver, joining a growing list of firms through the financial and tech sectors to decamp for the growing \"Wall Street South.\"\n\nThe company announced the move in an X post on Tuesday. Shares picked up roughly 0.5% in midday trading.\n\nIn moving its headquarters to Miami, Palantir follows a large list of companies looking to Florida for lower taxes and a lighter business regulation scheme. Among those are Citadel, one of the largest hedge funds in the world, led by Ken Griffin, and Related Companies, the real estate investment firm led by Stephen Ross.\n\nGriffin and Ross, both billionaires, recently launched a $10 million campaign aimed at convincing more corporate leaders to relocate their firms to Miami. Peter Thiel, the chairman of Palantir, also recently opened an office for his private investment firm in Miami, according to Bloomberg.\n\nAfter Ford's first release of electric vehicles, the automaker faced demand below expectations — and a massive bill of roughly $19.5 billion in write-offs. With its latest EV plan, the company is pivoting to a \"universal electric vehicle (UEV) platform\" designed to lower manufacturing costs.\n\nShares in renewable power provider Ormat Technologies (ORA) surged Tuesday morning, gaining more than 5% on the announcement of a deal that will see Ormat provide geothermal energy for Google (GOOG) data center projects.\n\nUnder the terms of the deal, Ormat will develop several geothermal power projects throughout Nevada that the company said provide Google with around 150 megawatts of power for the Big Tech hyperscaler's data center projects in the region.\n\nThe sites are expected to come online between 2028 and 2030, Ormat said in its press release announcing the deal. The Purchase Power Agreement underpinning the project is subject to approval from the Public Utilities Commission of Nevada (PUCN), expected in the second half 20206, Ormat said.\n\n“AI is fundamentally increasing electricity demand across the technology sector, and geothermal power is uniquely positioned to deliver the reliable, carbon-free power required to support that growth,” Doron Blachar, Chief Executive Officer of Ormat Technologies, said in the press release.\n\nOil prices fell Tuesday after Iran announced it had reached a \"general agreement\" with the US on a potential nuclear deal that would lift some sanctions on the Iranian regime.\n\nFutures on Brent crude (BZ=F), the international pricing benchmark, fell by 0.6% to trade below $67.50. Those on the US pricing benchmark West Texas Intermediate (WTI) crude (CL=F), lost 0.9% to change hands around $62.25.\n\nIn comments to state TV, Iranian foreign minister Abbas Araghchi said, “We were able to reach a general agreement on a set of guiding principles, based on which we will proceed from now on and move toward drafting a potential agreement.\"\n\nIran's leadership has spent the past month in talks with US Special Envoy Steve Witkoff. The news is seen as lowering the risk of a military conflict between the two countries, which would apply an immediate risk premium to oil prices.\n\nIran largely controls the Strait of Hormuz, a key shipping chokepoint that sees roughly 20 million barrels of oil traverse its waters every day. Any moves to restrict access to the strait, or attacks against infrastructure in the region, would push oil prices much higher as buyers priced in longer and slower shipping routes and a drop-off in Middle Eastern supply.\n\nEarlier on Tuesday, Iranian leadership said Tehran would partially close the strait for several hours due to military drills, according to Bloomberg. The move comes as the US has steadily built up its naval armament in the region, sending a second aircraft carrier to the region late last week. The US Maritime Authority advised ship captains in early February to avoid Iran's territorial waters if possible, for fear of potential interference or forcible boardings.\n\nYet despite seeming progress toward a deal the X account for the Ayatollah Ali Khamenei, Iran's supreme leader, posted several comments disparaging US involvement in Iran's energy industry.\n\n\"The Americans say, ‘Let's negotiate over your nuclear energy, and the result of the negotiation is supposed to be that you do not have this energy!'\" the X account posted early Tuesday morning.\n\n\"If that’s the case, there is no room for negotiation; but if negotiations are truly to take place, determining the outcome of the negotiations in advance is a wrong and foolish act.\"\n\nCorporate profits are rising while labor income keeps falling, a sign that so-called \"K-shaped\" movements in the economy are continuing, analysts for Bank of America wrote on Tuesday.\n\nSince the COVID-19 pandemic, the analysts wrote, an increasing amount of economic data has pointed toward an uptick in productivity. However, the economic gains from that productivity seem to be aggregating in corporate profits, while wages steadily fall.\n\nThis split between profits and income is consistent and being reinforced by the rally in financial as well as real assets, which are more concentrated among higher- and middle-income households,\" the analysts wrote. The dichotomy in the data also \"begs the question of whether these are real improvements in labor productivity.\n\n\"It remains to be seen whether wages and salaries recoup some of their lost ground relative to corporate profits,\" the analysts wrote. \"But for now, higher profits relative to wages are yet another driver of a K-shaped economy, as higher-income consumers tend to be more exposed.\"\n\nUS stocks opened Tuesday's session split, as the tech sector continued its downturn in a sign that investor concerns about AI disruption aren't yet settling.\n\nThe tech-heavy Nasdaq Composite (^IXIC) led losses, shedding roughly 0.5%, while the S&P 500 (^GSPC) lost a thinner 0.2%. Meanwhile, the blue-chip-heavy Dow Jones Industrial Average (^DJI), which is less exposed to the tech sector, rose roughly 0.3% before paring gains.\n\nFourth-quarter results from Walmart (WMT), a recent member of the the trillion-dollar market cap club, on Thursday will highlight the week's earnings calendar. Constellation Energy (CEG), Energy Transfer (ET), Medtronic (MDT), and Palo Alto Networks (PANW) will also report this week, all on Tuesday.\n\nThe Personal Consumption Expenditures index and an advance read on fourth-quarter GDP, both on Friday, will dominate investor attention on the economic calendar. Investors will also get meetings from the Federal Reserve's January meeting on Wednesday.\n\nShares in consumer food giant General Mills (GIS) fell by more than 3.3% in premarket trading after the company lowered its 2026 sales outlook. \"Weak consumer sentiment, heightened uncertainty, and significant volatility have weighed on category growth and impacted consumer purchase patterns\" contributed to the dour outlook, the company said.\n\nGeneral Mills is now projecting organic net sales of -1.5% to -2%, down from a previous range of -1% to 1%. Adjusted operating profit and adjusted diluted earnings per share are now expected at a range of -16% to -20%, down from a previously stated range of -10% to -15%.\n\n\"While the company is making meaningful progress in strengthening its remarkability to position the business for long-term sustainable growth, this progress has come amid a more challenging backdrop,\" General Mills said in its statement.\n\nWhile General Mills has managed to return roughly 4% since the beginning of the year, the company's shares are down more than 18% over the past year. Meanwhile, an index tracking the consumer staples sector (XLP) has returned 15% year to date and roughly 10% since the same time last year.\n\nParamount Skydance (PSKY) stock is moving higher after Warner Bros. (WBD) agreed to reopen acquisition discussions.\n\nThe move comes after Paramount proposed a new all-cash offer last week of $30 per share to acquire the entire company. That offer came with a $ 0.25-per-share \"ticking fee\" — under which Warner Bros.' shareholders would receive $0.25 per share each quarter until the transaction is not closed beyond the end of this year.\n\nParamount also floated an informal acquisition proposal for $31 a share, WBD said.\n\nThe new window for discussions will last seven days, ending on Feb. 23, 2026, \"to seek clarity for Warner Bros. stockholders and provide Paramount the ability to make its best and final offer.\"\n\nIn the release, Warner Bros. Chair Samuel A. Di Piazza said the board of directors said it still suggests the Netflix offer, worth some $82.7 billion, which does not include the entire business.\n\n\"The Netflix merger is in the best interests of WBD shareholders due to the tremendous value it provides\" with a \"clear path to achieve regulatory approval,\" he said in the release.\n\nParamount's current offer of $30 per share values the whole company at $108.4 billion.\n\nNetflix’s co-CEO Ted Sarandos testified before the Senate Judiciary Subcommittee last week, negating claims that it would lead to a monopoly, or higher prices for consumers.\n\nYahoo Finance's Jake Conley lays out the key events ahead for investors in a holiday-shortened week.\n\nRead more here on what to look out for.\n\nDTE Energy (DTE) stock rose as much as 10% before paring gains. The energy company is due to release its earnings before the bell today, and the stock has risen 13% over the past year.\n\nNorwegian Cruise Line (NCLH) stock rose 7% during premarket trading on Tuesday after activist investor Elliott built a stake in the company.\n\nStrategy (MSTR) stock fell 3% before the bell today. The company, which is one of the largest corporate holders of bitcoin, has been struggling recently due to the sell-off with the world's largest cryptocurrency.\n\nA growing number on Wall Street are assessing the recent AI sell-offs. And despite many fearing the bubble has burst, for stock pickers, now might be the time for them to get greedy.\n\nGermany's Hapag-Lloyd (HLAG.DE, HPGLY) is buying ZIM Integrated Shipping Services in a deal worth $4.2 billion, bringing together two of the world's biggest shipping lines.\n\nShares of Israel-based ZIM rocketed over 35% higher in premarket trading, after the two companies confirmed the takeover on Monday.\n\nThe Wall Street Journal reports:\n\nNothing like a BofA fund manager survey drop the day after a market holiday.\n\nLots of great nuggets in the one out this morning, but the chart below stood out to me. So many on the Street I talk with expect a very robust economy this spring, in part because of expectations for a strong tax refund season.\n\nGoes a long way in explaining the hot small-caps trade.\n\nMasimo (MASI) stock surged over 30% in premarket following a report that Danaher (DHR) is closing in on a deal to buy the medical technology company.\n\nThe deal moves come two years after activist investor Politan succeeded in pushing through a change in Masimo's board.\n\nIt would be the biggest acquisition by Danaher in over half a decade, the Financial Times reported. Shares of the US life sciences manufacturer fell over 5% before the bell.\n\nRead more here (premium subscribers)\n\nNorwegian Cruise Line (NCLH) stock rose 6% before the bell on Tuesday following a report from The Wall Street Journal that activist investor Elliott has built a 10% stake in the company and plans to push for changes.\n\nElliott has become one of the cruise line's top investors and is keen to fix the company's underperformance. Elliott has so far built stakes in Southwest Airlines (LUV), as well as oil refiner Phillips 66 (PSX) and Toyota Industries (TYIDY). According to The Wall Street Journal, Elliott has over $79 billion in assets under management and is concerned about Norwegian Cruise Line's financial performance."
    },
    {
        "title": "Negotiations continue for Netflix",
        "url": "https://www.morningstar.com.au/stocks/netflix-earnings-head-shoulders-above-its-peers",
        "source": "Morningstar Australia",
        "date": "2026-02-17T21:45:00+00:00",
        "content": "We maintain our fair value as talks continue with Paramount,\n\nWith Netflix’s (NAS: NFLX) approval, Warner Bros. Discovery has re-engaged in negotiations with Paramount in pursuit of the best deal for shareholders. Talks will remain open through Feb. 23, and Paramount has said that it is willing to improve upon its offer to buy all of Warner for $30 per share in cash.\n\nWhy it matters: Warner maintains that Netflix’s offer—$27.75 per share in cash for Warner’s streaming and studios businesses only—is superior but is finally entertaining the possibility that Paramount can offer a better deal, following numerous amendments to address Warner’s initial concerns.\n\nThe bottom line: We maintain our stance that Warner is likely to be acquired, potentially at a value worth more than $30 per share, and that neither Netflix nor Paramount has a greater than 50% chance of acquiring it.\n\nBetween the lines: According to Warner, Paramount said it will offer $31 per share in what will still not be a “best and final” offer. Warner still cites other factors that Paramount must address, but at some price, we expect those factors to become secondary to a chance for clearly higher remuneration.\n\nNetflix is the leading streaming television platform globally and enjoys the economic benefits of market-leading scale. We expect this position will persist.\n\nNetflix has had a different strategy than its peers. It has avoided the temptation to bid for a regular slate of major live sports programming, which has been wise, considering our view that it would’ve had to overpay to attract major sports leagues. It has also chosen to grow organically from the ground up, building its business with no head start in terms of content ownership or foothold in the traditional media business. These decisions now give Netflix the advantage of not having to manage a declining legacy business, and it isn’t burdened with expensive sports contracts or a subscriber base that is dependent on retaining sports rights.\n\nNetflix does face threats. Notably, it faces a much more robust streaming market than it did when it was establishing its dominance while charging relatively low prices. With many subscription streaming platforms offering popular content, we don’t believe consumers will have the financial willingness or ability to subscribe to all, meaning Netflix will need to continue offering a robust amount of attractive programming to maintain its position. This will require significant investment and careful consideration of pricing changes. Despite our view that Netflix will remain at the top, it will have to compete to a greater extent than it did historically.\n\nWe still expect an impressive growth trajectory. Assuming no huge misfires that result in a lack of attractive programming over an extended period, we expect Netflix’s subscriber base to be sticky, and we think the cash it generates will allow it the capacity to produce many new series and movies each year, giving ample opportunity for customers to find something they like. We see further penetration opportunity in international markets, and we believe the introduction of an ad-supported subscription in the US will provide opportunities to reach new subscribers and a substantial source of revenue.\n\nStar Rating: Our one- to five-star ratings are guideposts to a broad audience and individuals must consider their own specific investment goals, risk tolerance, and several other factors. A five-star rating means our analysts think the current market price likely represents an excessively pessimistic outlook and that beyond fair risk-adjusted returns are likely over a long timeframe. A one-star rating means our analysts think the market is pricing in an excessively optimistic outlook, limiting upside potential and leaving the investor exposed to capital loss.\n\nFair Value: Morningstar’s Fair Value estimate results from a detailed projection of a company’s future cash flows, resulting from our analysts’ independent primary research. Price To Fair Value measures the current market price against estimated Fair Value. If a company’s stock trades at $100 and our analysts believe it is worth $200, the price to fair value ratio would be 0.5. A Price to Fair Value over 1 suggests the share is overvalued.\n\nMoat Rating: An economic moat is a structural feature that allows a firm to sustain excess profits over a long period. Companies with a narrow moat are those we believe are more likely than not to sustain excess returns for at least a decade. For wide-moat companies, we have high confidence that excess returns will persist for 10 years and are likely to persist at least 20 years. To learn about finding different sources of moat, read this article by Mark LaMonica."
    },
    {
        "title": "S&P 500 closes little changed Tuesday as declines in software shares weigh on index: Live updates",
        "url": "https://www.cnbc.com/2026/02/16/stock-market-today-live-updates.html",
        "source": "CNBC",
        "date": "2026-02-17T19:22:00+00:00",
        "content": "The S&P 500 inched higher on Tuesday, but declines in software stocks kept the index's gains in check.\n\nThe broad market benchmark advanced 0.1% and closed at 6,843.22, while the Nasdaq Composite ticked up 0.14% to close at 22,578.38. The Dow Jones Industrial Average climbed 32.26 points, or 0.07%, and settled at 49,533.19.\n\nInvestors rotated out of beaten-down software names, which added to the losses they've seen this year, and into financial stocks such as Citigroup and JPMorgan. Shares of Citi jumped 2.6%, while shares of JPMorgan were up more than 1%.\n\nServiceNow, however, was more than 1% lower, with its drop in 2026 standing at about 31%. Autodesk and Palo Alto Networks were down more than 2%. The former has notched a roughly 24% decline this year, while the latter has fallen 11%. Salesforce and Oracle shares declined nearly 3% and almost 4%, and their year-to-date losses were at 30% and 21%, respectively. The iShares Expanded Tech-Software Sector ETF (IGV) slid more than 2%, putting its loss for the year at 23%.\n\nThe software sector has been getting hit on fears that artificial intelligence tools could replace industry-specific software providers.\n\n\"We just need time to see what earnings are going to look like from some of these companies,\" Leah Bennett, chief investment strategist at Concurrent Investment Advisors, said in an interview with CNBC. \"I think those that aren't able to compete and don't really have moats around their business, you're going to see a deterioration,\" she continued, adding that such a disruption will also lead the market to decipher winners in the space.\n\nAI disruption worries hit industries such as software, real estate, trucking and financial services last week, pushing the S&P 500 to its second consecutive losing week. Both the S&P 500 and blue-chip Dow lost more than 1% last week, while the technology-heavy Nasdaq lost more than 2%.\n\nThe Dow and S&P 500 both logged their fourth losing weeks of the last five. The Nasdaq recorded its fifth straight negative week, its longest losing streak since 2022.\n\n\"AI innovation and its disruption are calling into question terminal multiples in various corners of the market that is driving investors to focus on specific risks, rather than broader exposure changes,\" said Scott Chronert, Citi U.S. equity strategist. \"For now, the narrative is disconnected from good medium-term fundamental trends. The onus is on companies to convince markets of longer-run business moats, likely a Q1 reporting season theme, absent a renewed focus on a macro soft landing.\"\n\nThose concerns appeared to overshadow the latest consumer price index reading released Friday. The headline CPI data came in softer than economists polled by Dow Jones predicted for January. That followed a better-than-expected jobs report earlier in the week.\n\nInvestors will get more insight into the path of inflation this week, with the personal consumption expenditures price index report slated for Friday. Before then, they'll monitor Federal Reserve meeting minutes on Wednesday.\n\nThe New York Stock Exchange was closed on Monday in observance of Presidents' Day.\n\nThe S&P 500 has traded sideways since first topping 6,800 in October, with some parts of the market showing strength while others are showing severe weakness. Energy, materials, staples and industrials are rallying, while financials, discretionary and tech has slid.\n\nThat level of extreme dispersion usually results in broad weakness, as the stronger parts of the market catch down to the weaker ones, according to BTIG. However, the new leaders have yet to correct, the firm observed. Krinsky said semiconductors is a key sector to watch to see which way the market will go.\n\n\"For most participants this is not a new revelation, but does continue to highlight how much dispersion there is below the surface,\" Jonathan Krinsky wrote on Monday. \"The million-dollar question is which way does the bifurcation resolve?\"\n\nInvestors are loading up on stocks at a high enough level to trigger a contrarian sell signal, according to the latest Bank of America Fund Manager Survey.\n\nPortfolios are holding their biggest overweight position on stocks since December 2024 and their most underweight on bonds since September 2022, BofA investment strategist Michael Hartnett said. One caveat: Wall Street professionals are rotating out of U.S. offerings and into emerging markets and EU, though shying away from Japan.\n\nThe bullish move has triggered the BofA Bull & Bear Indicator, a measure of stock market sentiment that is now sending a \"sell\" signal with a reading of 8.2. On a global scale, Hartnett said bullishness was last this strong in June 2021. High levels of market optimism can mean stocks are overvalued and should be sold.\n\nHartnett recommends investors reduce risk in the first quarter and implement a number of pair trades that include going long bonds and short gold, long the U.S. dollar and short emerging markets and long tech stocks and short banks.\n\nIn other developments, Wall Street also has taken its most overweight commodities position since May 2022 and has edged up cash holdings to 3.4% of portfolios, just 0.2 percentage point off the record low. Investors are betting on a \"run it hot\" economy, with the most optimism on growth since February 2022, Hartnett said.\n\nGemini Space Station fell about 14% after clearing out part of its c-suite.\n\nThe crypto exchange let go of its chief operating officer, chief financial officer and chief legal officer, according to its disclosure filed Tuesday with the US Securities and Exchange Commission.\n\nThe elimination of the roles comes less than two weeks after Gemini said it would lay off 25% of its workforce.\n\nThe company first went public last September.\n\nInvestor Jenny Harrington believes that buying hard asset, low obsolescence dividend stocks could be a good hedge against growing artificial intelligence threats.\n\n\"They're stocks that, assuming humanity survives AI, we're going to be using these products throughout in the next 10, 15, 20 years,\" the CEO of Gilman Hill Asset Management said on CNBC's \"Halftime Report\" on Tuesday afternoon. \"Nothing too exciting, just slow and steady.\"\n\nTo that end, Harrington listed stocks such as Amcor, Kimberly-Clark, Bristol-Myers Squibb and Dominion Energy as ones that fit the bill. She added that these dividend names all have \"decent earnings growth ahead\" and yields of between 4% and 6%.\n\nEconomic data is pointing the way toward more interest rate cuts this year, according to Citigroup economists.\n\nEven with a stronger than expected employment report and core inflation still above target, \"details point to a clear path for further rate cuts,\" Citi economist Andrew Hollenhorst said in a note. Hollenhorst said that same sentiment is likely to be reflected in minutes from the Federal Reserve's January meeting that will be released Wednesday.\n\n\"Markets have appropriately recognized the residual seasonality in jobs data and cooling trend in inflation,\" he added. \"That means policy rates are likely to fall further this year. It also means pricing of Fed rate cuts is free to increase further as part of the general risk-off in markets.\"\n\nChicago Fed President Austan Goolsbee told CNBC on Tuesday that he expects additional rate cuts this year so long as the inflation data cooperates.\n\nGeneral Mills shares headed for their worst day in nearly six years on Tuesday after the Lucky Charms and Progresso parent lowered its 2026 outlook.\n\nGeneral Mills said organic net sales would slide between 1.5% and 2% after previously forecasting between a loss of 1% to a gain of 1%. The company said operating profit and adjusted earnings per share would plunge between 16% and 20% despite an earlier prediction of 10% to 15% down.\n\nShares dropped more than 7% in afternoon trading. If that holds through Tuesday's closing bell, it would mark the stock's biggest one-day retreat since a slide of more than 11% in March 2020.\n\nOn Tuesday, 37 stocks in the S&P 500 traded at new 52-week highs.\n\nTickers that hit this milestone included:\n\nThe nine stocks trading at new 52-week lows were:\n\n— Lisa Kailai Han, Christopher Hayes\n\nAmazon entered its 9th day of consecutive losses on Friday. If red by market close, the stock will tie for its longest losing streak ever. Amazon first saw 10 days of consecutive losses in 1997, nearly three decades ago. Its forward price-to-earnings ratio is also the lowest since 2008. So far, the stock has shed nearly $450 billion from its market valuation.\n\nThe streak began after Amazon revealed it plans to spend $200 billion in capital expenditures this year. The company plans to invest in AI by scaling its data centers and servers.\n\n\"Every single customer is seeing more and more demand for moving their workloads to the cloud, putting their data on AWS and then layering AI on top of that to get value for their business,\" AWS CEO Matt Garman said in an interview with CNBC.\n\nThe news comes after investors have expressed concerns about hyperscalers like Amazon overspending on AI. \"It's an indication of how bullish we are about the future and growth of AWS,\" Garman said of the investment.\n\nAmazon is down 12% year to date.\n\nRothschild & Co. Redburn upgraded Dollar Tree to buy on Tuesday, pointing to its attractive valuation, earnings growth and potential upside from the acceleration of its multi-price roll-out.\n\nSince it sold Family Dollar last July, Dollar Tree has refocused on its core operations for the first time in a decade, analyst Sam Hudson said in a note to clients.\n\n\"Following the Family Dollar divestment, we argue that Dollar Tree is a higher-quality, higher-return, more cash-generative opportunity than it has been for the past decade, warranting a higher valuation than recent history,\" he wrote.\n\nHudson's price target of $165 implies nearly 31% upside from Friday's close.\n\nFederal Reserve Governor Michael Barr said Tuesday he sees risks to both employment and inflation and sees keeping interest as they are the best policy for now.\n\nOn the labor market, Barr said he sees a \"tentative balance\" between both low hiring and low firing rates but says the picture is \"delicate\" and \"especially vulnerable to negative shocks.\" On inflation, he noted that the Fed's preferred gauge is still stuck around 3% with a \"significant\" risk that it sticks there, Barr said in a speech to the New York Association for Business Economics.\n\n\"Based on current conditions and the data in hand, it will likely be appropriate to hold rates steady for some time as we assess incoming data, the evolving outlook, and the balance of risks,\" Barr said.\n\nAs a governor, Barr is a permanent voting member of the rate-setting Federal Open Market Committee.\n\nJapanese equities just had one of their best 2-week relative returns compared to the rest of the world ever, according to Goldman Sachs. And the firm sees more strength ahead.\n\nGoldman moved its rating on the country's equities in a Monday note to overweight from neutral.\n\nIt comes after the Nikkei 225's nearly 5% jump last week after incumbent Prime Minister Sanae Takaichi's Liberal Democratic Party romped to victory in the country's national elections. Analyst Andrea Ferrario said in the note that the moves after the election are consistent with months-long developments in the market.\n\n\"Markets started pricing higher growth in Japan in September, and growth pricing increased further at the start of 2026, catching up with EM and outpacing both Europe and US,\" Ferrario wrote. \"Japan equities re-rated vs. the World and the long-end of the JGB yield curve flattened, driven by lower uncertainty and investors' increased confidence in the Government and the BOJ's ability to resolve the 'bad' fiscal tail.\"\n\nGoldman recommends owning defense companies, shipbuilding stocks and names with exposure to corporate governance reforms in Japan. The firm added that despite the expectation for room to expand, implied volatility in Japanese equities is elevated.\n\nTrivariate Research has adopted a more bearish stance on U.S. equities this year, citing an increased level of volatility in the market due to a higher number of companies potentially disrupted by artificial intelligence.\n\nThis list includes industries that caught some investors off guard, wrote Trivariate Research co-founder Adam Parker, such as those that could be disrupted by AI tools automating financial work flows and the introduction of AI freight tools.\n\n\"While several of these stocks bounced higher late last week, we remain concerned that these stocks are 'guilty until proven innocent,' meaning they are more likely to have multiple contraction than expansion for the foreseeable future. We think a useful exercise for investors is to imagine that they are the CEO of a company and focus on businesses that are making a high margin off of them,\" Parker wrote. \"This likely means certain data companies, and other expensive service companies are vulnerable.\"\n\nOutside of AI, other industries could also see higher volatility introduced by the Trump administration, such as companies affected by metals tariff rollbacks and credit card fee caps. As such, Parker sees a greater likelihood of multiple contraction this year.\n\n\"The bottom line is this: when there is uncertainty, we should pay a lower multiple for equities than when there is certainty. We reiterate the view laid out in our 2026 year-ahead outlook that the probability of multiple contraction for the U.S. equity market this year is greater than the probability of multiple expansion,\" he wrote. \"That makes us more bearish than consensus.\"\n\nChicago Federal Reserve President Austan Goolsbee told CNBC on Tuesday that further interest rate cuts are possible if inflation shows more progress lower.\n\nTaking a cautious view on last week's consumer price index report, which showed headline inflation down to 2.4%, Goolsbee said he remains wary that the easing in prices will continue and wants to see what the longer-term impact from tariffs will be.\n\n\"If this proves to be transitory, and we can show that we're on the path back to 2% inflation, I still think there's several more rate cuts that can happen in 2026,\" he said. \"But we've got to see it.\"\n\nGoolsbee does not vote this year on the rate-setting Federal Open Market Committee but will vote in 2027.\n\nThe S&P 500 began Tuesday's session in negative territory.\n\nThe broad-based index fell 0.2% shortly after the opening bell, while the Nasdaq Composite dropped 0.7%. The Dow Jones Industrial Average added 140 points, or 0.3%.\n\nCheck out the companies making headlines before the bell:\n\nThe CBOE Volatility Index, or VIX, was above the 20 level on Tuesday, hitting 22.50.\n\nThe index — otherwise known as Wall Street's \"fear gauge\" — was trading around 17 at the beginning of last week's trading period.\n\nSilver and gold fell in early premarket trading on Tuesday as investors awaited delayed economic data, with little geopolitical news during the holiday-shortened week.\n\nSpot silver was last seen down 2% to trade at around $74.85 per ounce, while silver futures fell 4% to trade at $74.7 dollars per ounce.\n\nHecla Mining, which owns one of the biggest silver mines in the world, Green Creek Mine in Alaska, was down 3% before the market opened. Meanwhile, Endeavour Silver shed 3.5%, First Majestic Silver was down nearly 4%, Coeur Mining lost nearly 3.4%, Teck Resources and Silvercorp Metals were roughly 3% lower, and Wheaton Precious Metals was down over 2%. Read more.\n\nJPMorgan sees shares of AeroVironment rising as demand for drones and space capabilities swell.\n\nThe bank initiated the aerospace and defense stock with an overweight rating. Analyst Seth Seifman's $320 price target implies that shares of AeroVironment could rally 31% from here.\n\n\"AeroVironment (also known as AV) looks well-positioned to deliver mid-teens growth thanks to its exposure to fast-growing areas within defense, both domestically and internationally, including drones, counter-drone systems, and space,\" Seifman wrote. \"AVAV is also one of the more experienced defense companies that could benefit from DoD efforts to expand the industrial base and adopt a more commercial approach.\"\n\nCNBC Pro subscribers can read more here.\n\nWarner Bros. Discovery on Tuesday said it will reopen deal talks with Paramount Skydance under a seven-day waiver from Netflix to explore \"deficiencies\" in Paramount's offer to buy the entirety of WBD.\n\nThe legacy media company has a pending transaction with Netflix for its streaming and studio businesses. Paramount launched a hostile tender offer straight to WBD shareholders at $30 per share after losing out to Netflix in a bidding war.\n\n\"Netflix has provided WBD a limited waiver under the terms of WBD's merger agreement with Netflix, permitting WBD to engage in discussions with Paramount Skydance (\"PSKY\") (NASDAQ: PSKY) for a seven-day period ending on February 23, 2026 to seek clarity for WBD stockholders and provide PSKY the ability to make its best and final offer,\" Warner Bros. Discovery said in a release. Read more.\n\nShares of health tech giant Masimo rallied more than 33% after The Wall Street Journal and Financial Times reported, citing sources, that the company was nearing a deal with Danaher to be acquired for $180 per share, or $10 billion, in cash.\n\nTech stocks began the week on the back foot, adding to their struggles from the past month.\n\nThe State Street Technology Select Sector SPDR ETF (XLK) dropped nearly 1% in the premarket, led by declines in Autodesk and Teledyne. Both stocks lost more than 3% each. Nvidia also pulled back around 1%.\n\nTech-related names such as Meta Platforms and Amazon declined 1.1% and 0.2%, respectively.\n\nStocks aren't coming into the holiday-shortened trading week with momentum.\n\nThe Dow and S&P 500 each finished last week down more than 1%. Each index notched its fourth losing week of the last five, while the S&P 500 also recorded two negative weeks in a row.\n\nThe Nasdaq Composite slid more than 2%. That marked the technology-heavy index's fifth straight losing down week, its first losing streak of that length since 2022.\n\n— Alex Harring, Christopher Hayes\n\nStock futures are little changed shortly after 6 p.m. ET.\n\nDow and S&P 500 futures rose 0.2% and 0.1%, respectively. Nasdaq 100 futures slipped 0.2%."
    },
    {
        "title": "The Netflix-Paramount-Warner Bros. Three-Way Drama Just Keeps Heating Up",
        "url": "https://www.investopedia.com/the-netflix-paramount-warner-bros-three-way-drama-just-keeps-heating-up-psky-wbd-nflx-11907742",
        "source": "Investopedia",
        "date": "2026-02-17T17:53:00+00:00",
        "content": "Michael Yanow / NurPhoto via Getty Images)\n\nA major media deal in the making has delivered another twist.\n\nWarner Bros. Discovery (WBD) on Tuesday restarted talks with Paramount Skydance (PSKY), giving the rival suitor seven days to produce a \"best and final offer\" good enough to make it walk away from its deal with Netflix (NFLX). Though Warner's board continues to recommend the latter merger, the move to renenage with Paramount shows that the high-stakes battle between media giants isn't over.\n\nThe latest wrinkle in the months-long jousting for the prize—premium media brands like HBO and DC Studios—follows on the heels of Paramount informally dangling its own offer, multiple bids aimed at assuaging Warner Bros.' concerns, and a hostile takeover attempt. Shares of Paramount are up more than 5% Tuesday morning, while Warner Bros. shares have risen 2% as broad market indexes inch lower. Netflix's stock is down more than 1%.\n\nConsumers watching to see if the Warner and Netflix make it down the aisle may wonder what's next for streaming costs after someone else acquires Warner Bros. Discovery—though even without a merger, the trend has been upward.\n\nParamount, led by Larry Ellison's son David, has formally offered $30 per share for Warner, but deal talks only reopened after a senior representative from Paramount recently informed a Warner Bros. board member that it agree to pay an additional dollar per share if the company's board would authorize a formal discussion; the person also said that that figure was not Paramount's \"best and final\" proposal, according to Warner Bros. filings.\n\nNow the ball is in Paramount's court. \"We are writing to inform you that Netflix has agreed to provide WBD a waiver of certain terms of the Netflix merger agreement to permit us, through February 23, to engage with PSKY to clarify your proposal, which we understand will include a WBD per share price higher than $31,\" Warner Bros. CEO David Zaslav said in a letter to Paramount included in Tuesday's filings.\n\nNetflix in December offered $27.75 per share in cash for Warner Bros.' TV and film assets excluding its traditional media TV networks, the latter of which Warner Bros. has plans to spin off into a separate entity. Paramount's last formal offer was $30 per share for the whole company, including CNN, and it agreed last week to pay Warner Bros. Discovery the $2.8 billion break-up fee the company would owe Netflix if their agreement was terminated, plus back debt costs, according to filings.\n\nParamount further agreed to also pay Netflix shareholders 25 cents a share, or roughly $650 million in cash, for every quarter that the deal didn't close starting next year, filings show. (One of its main arguments for why Paramount thinks its offer is superior is that it is more likely to get regulatory approval.)\n\nWarner Bros.' board said that Netflix offer remains \"in the best interest of WBD shareholders,\" according to the company. It on Tuesday filed and started mailing out proxy statements for a special meeting on March 20, when shareholders would affirm or deny the board-recommended match.\n\nSecurities and Exchange Commission. \"Schedule 14A.\"\n\nSecurities and Exchange Commission. \"Schedule TO/A.\"\n\nWarner Bros. Discovery Investor Relations. \"Netflix Merger & Response to Paramount Tender Offer.\""
    },
    {
        "title": "Dollar General downgraded, Dollar Tree upgraded: Wall Street's top analyst calls",
        "url": "https://finance.yahoo.com/news/dollar-general-downgraded-dollar-tree-144304960.html",
        "source": "Yahoo Finance",
        "date": "2026-02-17T14:56:00+00:00",
        "content": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly.Top 5 Upgrades:\n\nRothschild & Co Redburn upgraded Dollar Tree (DLTR) to Buy from Neutral with a price target of $165, up from $75. The firm views the company's 12% earnings growth outlook as attractive at the stock's current valuation, particularly with the potential upside presented by its multi-price rollout.\n\nTruist upgraded Shopify (SHOP) to Buy from Hold with a price target of $150, up from $110. Shopify is one of the few software companies to show strong accelerating growth recently, says the firm, which views the recent large drawdown in software valuations related to AI fears as having created an attractive buying opportunity for long-term investors in Shopify.\n\nRosenblatt upgraded Workday (WDAY) to Buy from Neutral with an $180 price target ahead of the Q4 report on February 24. The firm expects Workday to report inline results and believes it will reiterate or slightly increase expectations for fiscal 2027.\n\nMelius Research upgraded Chevron (CVX) to Buy from Hold with a price target of $205, up from $162. The company is well positioned as it increases shareholder returns and high-impact exploration, the firm tells investors in a research note.\n\nWells Fargo upgraded Accenture (ACN) to Overweight from Equal Weight with an unchanged price target of $275. The firm has increased confidence in the company's sales growth, which is accelerating in the second half of its fiscal year after it posted two consecutive quarters of improved bookings growth.\n\nRothschild & Co Redburn downgraded Dollar General (DG) to Sell from Neutral with a $111 price target. Rothschild believes a lower multiple than history could be warranted, given Dollar General's lower sales outlook, lower margin profile, and lower new store returns relative to its historical performance.\n\nRothschild & Co Redburn downgraded Warner Bros. Discovery (WBD) to Neutral from Buy with a price target of $31, up from $28. The firm believes Netflix (NFLX) is the most likely winner of Warner Bros. and that there will not be materially higher bids coming out of Paramount (PSKY).\n\nRoth Capital downgraded ConocoPhillips (COP) to Neutral from Buy with an unchanged price target of $112. The firm says the shares are trading at a higher valuation relative to peers, and cites valuation and \"toppy\" oil prices for the downgrade.\n\nRothschild & Co Redburn downgraded Icon (ICLR) to Neutral from Buy with a price target of $100, down from $226. The firm cites the company's announcement of an internal accounting investigation.\n\nCiti downgraded Bath & Body Works (BBWI) to Neutral from Buy with a price target of $25, up from $21. The firm expects the company to post a Q4 earnings beat on March 4 but says the core business \"remains weak.\"\n\nCraig-Hallum initiated coverage of BitGo (BTGO) with a Buy rating and $18 price target. The firm believes that BitGo has built a well-rounded technology platform that will support the move to digital assets and be a leader in the institutional facing market for years to come. Wedbush, Compass Point, Clear Street, Citi, Mizuho, Wells Fargo, Cantor Fitzgerald, Deutsche Bank, Rosenblatt, and Canaccord also started the stock with Buy-equivalent ratings.\n\nGoldman Sachs initiated coverage of EquipmentShare (EQPT) with a Buy rating and $51 price target. The firm says the company is well positioned in an \"attractive\" end market. Citizens, Baird, Wells Fargo, Melius Research, Oppenheimer, and Truist started the stock with Buy-equivalent ratings, while KeyBanc and Citi initiated the name with Neutral-equivalent ratings.\n\nBofA reinstated coverage of Verisk Analytics (VRSK) with a Neutral rating and $205 price target. The firm is \"generally constructive\" on the group and expects average revenue, EPS and free cash flow growth of 7%, 12%, and 11%, respectively, in 2026.\n\nJPMorgan initiated coverage of AeroVironment (AVAV) with an Overweight rating and $320 price target. The company is well positioned to post mid-teens growth given its exposure to \"fast-growing areas\" within defense, both domestically and internationally, including drones, counter-drone systems, and space, the firm tells investors in a research note.\n\nBaird initiated coverage of Tempus AI (TEM) with an Outperform rating and $59 price target. The firm believes the company has built an attractive therapy selection franchise and that the recent stock pullback creates a buying opportunity."
    }
]