[
    {
        "title": "Alphabet ramps up AI spending with up to $185bn capital plan",
        "url": "https://bmmagazine.co.uk/tech/alphabet-185bn-ai-spending-capex-arms-race/",
        "source": "Business Matters",
        "date": "2026-02-15T13:39:00+00:00",
        "content": "The capital expenditure target is well above analysts’ average forecast of about $115bn, according to LSEG data, and marks another escalation in spending among the world’s technology hyperscalers.\n\nThe announcement came alongside strong fourth-quarter results. Revenue rose 18 per cent year-on-year to $113.8bn, narrowly ahead of forecasts of $111.3bn. Net income climbed 30 per cent to $34.5bn, comfortably beating expectations of $31.9bn.\n\nDespite the earnings beat, Alphabet shares slipped 1.4 per cent in after-hours trading, reflecting investor unease over the scale of spending commitments.\n\nUnder chief executive Sundar Pichai, Alphabet has repositioned itself as a leading force in AI after earlier concerns that start-ups such as OpenAI might disrupt its core search business.\n\nGoogle’s Gemini model has become a central pillar of its strategy, with the Gemini AI assistant app exceeding 650 million monthly users in November. Its AI Overviews feature within search has reached more than 2 billion monthly users.\n\nThe company is also investing heavily in custom AI chips and data centre infrastructure, which investors hope will drive future growth.\n\nLast month, Google secured a high-profile partnership with Apple to power an upgraded version of Siri with Gemini models, opening access to Apple’s installed base of more than 2.5 billion devices.\n\nNikhil Lai, principal analyst at Forrester, said the results demonstrated resilience in Alphabet’s core advertising business. “Record ad revenue signals sustained momentum in search and solid performance from YouTube,” he said, noting that YouTube’s scale now exceeds that of Netflix.\n\nAlphabet’s shares have surged over the past year, rising more than 64 per cent and pushing its market capitalisation above $4tn — second only to Nvidia, valued at around $4.3tn.\n\nHowever, wider market sentiment towards AI stocks has turned more cautious. Last week, Microsoft reported slower cloud growth, prompting a sell-off amid concerns about the sustainability of heavy AI investment. While Meta reassured investors with upbeat revenue guidance, other names struggled.\n\nThe S&P 500 and Nasdaq both declined as investors reassessed lofty valuations. Shares in Advanced Micro Devices fell sharply after a weak revenue outlook, while Palantir also dropped on AI spending concerns.\n\nJed Ellerbroek, portfolio manager at Argent Capital, said the scale of AI infrastructure build-out was unprecedented. “The market is having a hard time knowing where to price these stocks and what the future looks like,” he said. “There’s growing scepticism about whether the rally has peaked.”\n\nFor Alphabet, the strategy is clear: double down on infrastructure to secure long-term AI leadership. Whether investors remain willing to fund that ambition at such scale will depend on how quickly those vast capital commitments translate into durable returns.\n\nAmy is a newly qualified journalist specialising in business journalism at Business Matters with responsibility for news content for what is now the UK’s largest print and online source of current business news."
    },
    {
        "title": "This Utilities Stock Is Up 23% Over the Past Year and One Fund Is Betting $49 Million on Sustained Growth",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/MSFT/pressreleases/227058/this-utilities-stock-is-up-23-over-the-past-year-and-one-fund-is-betting-49-million-on-sustained-growth/",
        "source": "The Globe and Mail",
        "date": "2026-02-14T22:50:00+00:00",
        "content": "Bragg Financial Advisors added 207,861 shares of UGI in the fourth quarter; the estimated transaction value was $7.36 million based on average prices.\n\nMeanwhile, the quarter-end position value rose by $12.40 million, reflecting both increased holdings and share price movement.\n\nPost-trade, the fund holds 1,316,362 shares valued at $49.27 million.\n\nBragg Financial Advisors disclosed a buy of 207,861 shares of UGI(NYSE:UGI) in its February 13, 2026, SEC filing, an estimated $7.36 million trade based on quarterly average pricing.\n\nAccording to a SEC filing dated February 13, 2026, Bragg Financial Advisors, Inc increased its stake in UGI(NYSE:UGI) by 207,861 shares last quarter. The estimated transaction value, based on the mean unadjusted close price over the quarter, was $7.36 million. The fund’s quarter-end exposure to UGI rose to 1,316,362 shares, with the position’s value up $12.40 million from the prior filing.\n\nUGI Corporation is a diversified energy distributor with a broad portfolio spanning propane, natural gas, and electricity. The company leverages an integrated infrastructure network to deliver energy products and services to customers across multiple markets. Its scale and multi-segment approach provide resilience and access to stable, regulated revenue streams.\n\nA diversified utility adding exposure to a portfolio heavy with mega cap tech changes the risk profile in subtle but important ways. UGI opened fiscal 2026 with $2.08 billion in quarterly revenue and 5% growth in total reportable segment EBIT to $441 million. Adjusted diluted EPS came in at $1.26. The Utilities segment delivered 12% operating income growth, helped by base rate increases in Pennsylvania and 16% growth in core market volumes during colder weather. Meanwhile, UGI International expanded operating income 20% despite lower LPG volumes, supported by disciplined margin management.Management is also reshaping the portfolio. Agreements to divest LPG businesses in several European countries are expected to generate roughly $215 million in cash, while Moody’s upgraded AmeriGas’ outlook to positive. Rate case filings requesting $99 million and $27 million in distribution increases underscore a focus on regulated earnings growth.At just over 1% of assets, this position sits well below Apple, Microsoft, and Alphabet, but it adds income stability and infrastructure exposure. And with shares up about 23% over the past year, along with a roughly 4% dividend, it makes sense why a fund would choose to double down on the holding.\n\nBefore you buy stock in UGI, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and UGI wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $414,554!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,120,663!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 884% — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 14, 2026.\n\nJonathan Ponciano has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Apple, and Microsoft. The Motley Fool has a disclosure policy.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Unicaja Banco Ups Guidance and Dividends After Earnings Beat",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/UNJCF/pressreleases/33322/unicaja-banco-ups-guidance-and-dividends-after-earnings-beat/",
        "source": "The Globe and Mail",
        "date": "2026-02-15T02:00:00+00:00",
        "content": "Unicaja Banco ((ES:UNI)) has held its Q4 earnings call. Read on for the main highlights of the call.\n\nUnicaja Banco Signals Confidence With Earnings Beat and Bigger Payouts\n\nUnicaja Banco’s latest earnings call painted a largely upbeat picture: the bank delivered a solid profit beat, stepped up shareholder remuneration, strengthened capital and liquidity, and showed early success in its new strategic plan. While management acknowledged tougher competition in mortgages and deposits, higher operating and restructuring costs, and a cautious stance on near-term margins, the tone was confident. Overall, strong earnings, improved credit quality, and upgraded medium-term targets clearly outweighed the pressures on costs and capital generation.\n\nUnicaja Banco reported 2025 net profit of €632 million, up 10% year-on-year and a sizeable 26% above its original guidance of €500 million. The performance underscores better-than-expected revenue generation and disciplined risk management, allowing the bank to materially outpace its own strategic-plan starting point. For investors, the beat signals that management has room to maneuver even in a relatively flat rate environment and positions the bank ahead of schedule on its multi-year profit roadmap.\n\nThe bank coupled its earnings strength with a more generous return to shareholders. The 2025 dividend has been raised to €443 million, or about €0.17 per share, a 29% increase versus the prior year. Unicaja also lifted its ordinary payout ratio from 60% to 70%, structurally locking in a higher distribution of profits. While this policy enhances yield and signals confidence in recurring earnings, it also means less profit is retained to build capital, slightly limiting balance-sheet flexibility for future growth or shocks.\n\nRegulatory capital remained a cornerstone of the story. The CET1 ratio rose to 16% at year-end 2025, up 90 basis points year-on-year. This improvement was driven primarily by strong earnings generation and lower regulatory deductions. The level sits comfortably above regulatory requirements, giving the bank a substantial buffer. Even as risk-weighted assets grow and payout rises, current capital levels provide a solid cushion against macro uncertainty and support continued lending expansion.\n\nReturn metrics also moved in the right direction. Reported return on tangible equity reached 10%, demonstrating a double-digit return profile even with excess capital on the balance sheet. Adjusting for that excess capital, ROTE climbed to 12%, a full 200 basis points above prior guidance. This strengthens the investment case, showing that Unicaja can generate attractive returns while still holding more capital than strictly required.\n\nAfter previous declines, 2025 marked a turning point in the loan book. Performing loans grew by roughly 1.9–2.0%, reversing prior contraction. New lending production surged around 40% to approximately €10 billion, with corporate formalized balances up 46% and new mortgage production rising 30%. This demonstrates that Unicaja is successfully reactivating commercial momentum, particularly in corporate lending, and starting to regain ground in retail credit despite competitive headwinds.\n\nBeyond loans, Unicaja is gaining traction in asset-gathering. Mutual fund balances grew around 23% (funds +22.6%), and total assets under management rose 14%. Net fund subscriptions increased from €1,767 million to about €2,800 million, giving the bank a 9% share of net subscriptions in the market. This shift toward off-balance-sheet products not only diversifies revenue but also generates more stable fee income, a key pillar in a less favorable rate backdrop.\n\nCredit risk metrics showed notable improvement. Nonperforming loans fell 20% year-on-year, pushing the NPL ratio down to 2.1%, better than the sector average of 2.8%. Total non-performing assets declined 25%, leaving the net NPA ratio at just 0.8%. Coverage levels also improved, with NPL coverage rising from 68% to 77%. Taken together, these indicators point to a cleaner balance sheet, lower risk, and more room to deploy provisions if the cycle turns.\n\nProvisioning needs eased materially in 2025. Total provisions dropped 25% to €239 million from €319 million, reflecting the healthier asset quality. The annual cost of risk was about 26 basis points, below initial guidance and in the low range for European banks. This benign risk environment has supported earnings and gives management additional confidence in maintaining profitability even as top-line growth normalizes.\n\nOn the revenue side, the bank delivered better-than-expected results. Net interest income reached €1,495 million, beating prior guidance of more than €1.4 billion. Fee income also improved, rising about 3% year-on-year, while value-added non-banking fees increased 12%. Products such as funds and insurance now make up 49% of total fees, underscoring a successful pivot toward more diversified, commission-based income streams that are less dependent on interest-rate cycles.\n\nUnicaja continues to operate with comfortable liquidity and resolution buffers. The liquidity coverage ratio (LCR) stands at around 300%, well above regulatory thresholds, and its MREL ratio is roughly 27%. These figures suggest the bank can comfortably absorb funding shocks and meet regulatory requirements, supporting its ability to continue lending and paying attractive dividends without jeopardizing balance-sheet resilience.\n\nManagement emphasized strong early traction in its strategic plan. Loan approvals rose 40%, and off-balance-sheet products now account for 27% of the total, close to the 30% target. Around 65% of planned talent hires have already been completed. The bank also set up an AI hub with about 50 professionals, reporting efficiency gains above 50% in certain use cases. These investments aim to accelerate digitalization, improve customer targeting, and reduce costs over time, underpinning future profitability.\n\nReflecting its outperformance, Unicaja revised its medium-term ambitions upward. The three-year accumulated net profit target was raised from €1.6 billion to €1.9 billion. The interest margin target is now set at more than €1.5 billion per year, and the cost-to-income ratio is expected to stay below 50%. These upgraded targets signal management’s confidence in sustaining double-digit returns and efficiency gains, even assuming a more conservative interest-rate scenario.\n\nDespite strong new mortgage production, the overall mortgage book was slightly negative for the year, down 0.2%. Management pointed to extremely tight pricing and intense competition as main constraints, limiting both growth and margins in mortgages. This suggests the bank is prioritizing profitability over pure volume, resisting aggressive pricing that could erode returns, even if it means slower balance-sheet growth in this segment.\n\nCost control remains a balancing act. Total operating expenses rose about 5–5.4% year-on-year, driven by strategic investments, digitalization, and new hires. Personnel costs alone increased around 4.2%, above sectoral agreement levels due to additional staffing and higher variable compensation. While these costs weigh on short-term efficiency, management frames them as necessary to support growth, technology transformation, and the rollout of its strategic plan.\n\nUnicaja continued its workforce renewal, booking a €27 million restructuring provision in 2025, down from €38 million in 2024. This contributed to a quarter-on-quarter spike in provisions but is part of a broader plan to optimize the cost base. Management signaled that restructuring charges will continue in 2026 but are expected to disappear beyond 2027. Investors should therefore expect some near-term earnings noise, with the payoff anticipated in structurally lower costs.\n\nManagement was candid about persistent pressure on deposits. Competition from specialized and digital banks is pushing up deposit pricing, particularly in term products. A shift in the mix toward demand deposits—now €55 billion, up 3%—has cushioned the impact on funding costs, but the bank sees competitive pressure as an ongoing risk. How successfully Unicaja defends its margin while retaining client balances will be a key variable for future earnings.\n\nWithin the year, CET1 showed some quarterly volatility. The ratio dipped earlier in the period due to dividend accrual and growth in risk-weighted assets, influenced by both an operational risk update and credit growth. While the year-end figure improved, management noted that RWA growth remains a headwind for capital ratios in the short term. As lending expands and regulatory models evolve, sustaining high CET1 levels will depend more on profit generation and disciplined capital allocation.\n\nThe combination of a 70% ordinary dividend and planned additional shareholder remuneration in 2026–27 implies an effective payout that management indicated could approach 100% over those years. This marks a decisive shift toward high distributions and makes Unicaja an income-focused equity story. The trade-off is lower internal capital generation compared with 2025, potentially limiting the bank’s ability to fund large-scale growth or acquisitions from retained earnings alone.\n\nDespite the strong 2025 performance, Unicaja is cautious on near-term net interest income. Using a conservative interest-rate curve, management expects NII in 2026 to be roughly flat versus 2025, with more meaningful margin upside likely only from 2027 onward. This reflects sensitivity to the timing and magnitude of rate moves and loan repricing. For investors, it signals that future earnings growth will increasingly depend on volume expansion and fees rather than further NII windfalls.\n\nManagement reiterated that no material M&A transactions were executed in 2025, despite a solid capital position. While future uses of excess capital will be reviewed, there are no immediate acquisition plans on the table. This restrained stance reduces integration risk and keeps the focus on organic growth and efficiency gains, even if it delays potential scale benefits from consolidation.\n\nFor 2026, Unicaja guides net interest income to remain broadly in line with 2025’s €1,495 million, in the context of a plan that targets more than €1.5 billion per year going forward. Fees are expected to rise at a low single-digit rate, while operating costs are projected to increase around 5%, with the cost-to-income ratio still below 50% (versus 45.5% in 2025). Business volumes should grow about 3%, and the cost of risk is expected to stay below 30 basis points, implying continued benign asset quality with NPL ratios and coverage remaining solid. The bank aims to keep CET1 above 14% and LCR around 300%, even as it raises shareholder remuneration structurally to a 70% ordinary payout and adds extra distributions so that cumulative payouts over the plan exceed 85%. Management also expects net income to surpass 2025’s €632 million, signaling confidence in further profit growth despite a cautious rate outlook.\n\nIn summary, Unicaja Banco’s earnings call showcased a bank delivering above-plan profitability, cleaner credit metrics, and higher shareholder returns, while still maintaining strong capital and liquidity. The main pressure points—rising costs, fierce competition for mortgages and deposits, and constrained capital retention—are acknowledged but appear manageable within current buffers and guidance. For investors, the story is one of solid execution, attractive income, and a credible strategic plan, balanced against a more mature phase of the interest-rate cycle and less room for capital-driven surprises.\n\nDisclaimer & DisclosureReport an Issue\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    }
]