[
    {
        "title": "Is a Stock Market Crash Brewing in 2026 Under President Donald Trump? The Data Doesn't Lie.",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/COMP-N/pressreleases/344114/is-a-stock-market-crash-brewing-in-2026-under-president-donald-trump-the-data-doesn-t-lie/",
        "source": "The Globe and Mail",
        "date": "2026-02-21T03:26:00+00:00",
        "content": "Statistically, stocks have soared under Donald Trump, with the Dow Jones Industrial Average, S&P 500, and Nasdaq Composite rising 57%, 70%, and 142%, respectively, during his first term.\n\nSeveral correlated events point to a potentially worrisome near-term outlook for stocks.\n\nHowever, patience has been handsomely rewarded on Wall Street over the last century.\n\nThe data doesn't lie: Wall Street has thrived with President Donald Trump in the White House.\n\nAlthough a rising stock market is relatively normal, regardless of the political party in power, aggregate stock returns under Trump have been above average. During his first non-consecutive term, the widely followed Dow Jones Industrial Average(DJINDICES: ^DJI), benchmark S&P 500(SNPINDEX: ^GSPC), and innovation-inspired Nasdaq Composite(NASDAQINDEX: ^IXIC) soared by 57%, 70%, and 142%, respectively.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nPresident Trump seated in the Oval Office. Images source: Official White House Photo.\n\nThese outsize returns have continued in President Trump's second term. Since his inauguration on Jan. 20, 2025, the Dow, S&P 500, and Nasdaq Composite have respectively rallied by 14%, 14%, and 15%.\n\nBut as Wall Street's major stock indexes have ascended to new heights, so have the potential headwinds threatening to pull the rug out from beneath this supercharged bull market. The question on most investors' minds is: Will a stock market crash take place in 2026 under Donald Trump? While no one can definitively answer this question, a few time-tested data points have clued investors in on what they can likely expect in the not-too-distant future.\n\nAlthough back-tested data sets and correlated events can't guarantee what's to come, they do help remove emotion from the equation, thereby allowing investors to view the stock market objectively. Two data-driven events, in particular, point to an increased likelihood that the Dow, S&P 500, and Nasdaq Composite will endure significant declines in 2026.\n\nTo begin with, the S&P 500's Shiller Price-to-Earnings (P/E) Ratio is nearing uncharted territory. The Shiller P/E, also referred to as the Cyclically Adjusted P/E Ratio, or CAPE Ratio, is based on average inflation-adjusted earnings over the prior 10 years. Incorporating a decade of earnings history into its calculation ensures that recessions and shock events can't render this valuation tool useless.\n\nS&P 500 Shiller PE Ratio hits 2nd highest level in history 🚨 The highest was the Dot Com Bubble 🤯 pic.twitter.com/Lx634H7xKa\n\nThough the Shiller P/E wasn't introduced until the late 1980s, it's been back-tested to January 1871. Over this 155-year period, the CAPE Ratio has averaged approximately 17.3. But for the last three months, it's vacillated between 39 and 41. The only time the Shiller P/E has been higher than it is now is in the lead-up to the bursting of the dot-com bubble.\n\nThe Shiller P/E isn't particularly helpful in identifying when corrections will begin. However, the five previous occurrences spanning 155 years in which it exceeded 30 during a continuous bull market were eventually followed by declines of 20% or greater in the Dow, S&P 500, and/or Nasdaq Composite. What the CAPE Ratio conclusively shows is that extended valuation premiums aren't tolerated over long periods on Wall Street. This is one of the stock market's red flags -- and the data doesn't lie.\n\nThe other potentially worrisome data-driven event is the upcoming midterm elections in November.\n\nPresident Trump began his second term with a unified government -- Republicans hold majorities in the House and Senate. However, the party of a sitting president frequently loses seats in one or both houses of Congress during midterm elections. With the GOP holding a slim majority in the House, it wouldn't take much of a shift in voting to create a split Congress. A divided Congress would likely eliminate the president's chance of signing any additional major legislation during his second term.\n\nGet ready to hear a lot about this, but midterm years tend to see their ultimate low later in the year and have some of the largest intra-year corrections.The good news? Since 1950, off those lows stocks have never been lower a year later and up more than 30% on average. pic.twitter.com/WuWr8vWCJN\n\nAccording to data collected by Carson Investment Research and published on X (formerly Twitter) by Chief Market Strategist Ryan Detrick, stock market corrections tend to be larger during midterm years than any other year of a president's term.\n\nSince 1950, the average peak-to-trough downturn during midterm years in the S&P 500 has been 17.5% (i.e., within striking distance of a bear market). What's more, the S&P 500 fell nearly 20% during midterms in President Trump's first term.\n\nThe data demonstrates that Wall Street dislikes pricey stock markets and fiscal uncertainty. While both of these time-tested data sets point to a heightened likelihood of a stock market correction or perhaps even a bear market in 2026, neither indicates that a stock market crash is imminent or even brewing. Since history tends to rhyme on Wall Street, investors should expect a pullback in stocks at some point, but shouldn't be overly concerned with rumblings of a stock market crash.\n\nWhile decades, if not more than a century, of data point to potential stock market weakness in 2026, history offers an entirely different outlook for investors focused on the horizon.\n\nOn the one hand, stock market corrections, bear markets, and those pesky elevator-down moves that pull on investors' heartstrings are normal and inevitable events. Since stock market downturns are often driven, in part, by emotion, there's nothing the federal government or Federal Reserve can do to avoid this part of the investing cycle.\n\nBut what history teaches is that stock market cycles aren't mirror images of each other. Despite corrections, bear markets, and crashes being inevitable and representing the price of admission to the world's greatest wealth creator, bull markets and periods of optimism last substantially longer.\n\nLess than two weeks ago, analysts at Bespoke Investment Group refreshed a data set that examined the length of every S&P 500 bull and bear market, dating back to the beginning of the Great Depression (September 1929).\n\nThe current bull market -- the \"AI Bull\" -- has eclipsed the 1,200-day mark. This is the 10th bull market to last 1,000+ days based on the 20% rally/decline threshold. Bear markets, on average, are much shorter, at just 286 days, with the longest being 630 days back in... pic.twitter.com/ds7lqWWHFh\n\nAmong the 27 bear markets that have occurred over the last 96 years, just a third have reached the one-year mark, with none surpassing 630 calendar days. Further, the average bear market has hit its trough after 286 calendar days, or approximately 9.5 months. In other words, when significant downturns do occur, they tend to resolve quickly -- especially during stock market crashes.\n\nIn comparison, 10 S&P 500 bull markets, including the current one, have lasted longer than 1,200 calendar days. The typical bull market climb has endured for 1,011 calendar days, which is roughly 3.5 times longer than the average bear market.\n\nEven without knowing when stock market corrections will begin or how steep the decline will be, nearly a century of data conclusively shows that maintaining optimism and being patient is the formula for growing your wealth on Wall Street.\n\nBefore you buy stock in S&P 500 Index, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and S&P 500 Index wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $415,256!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,151,865!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 892% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 21, 2026.\n\nSean Williams has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Should You Really Invest in the Stock Market Right Now? History Offers a Clear Answer.",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/NVDA/pressreleases/345031/should-you-really-invest-in-the-stock-market-right-now-history-offers-a-clear-answer/",
        "source": "The Globe and Mail",
        "date": "2026-02-21T06:20:00+00:00",
        "content": "Investors are growing concerned that a downturn could be looming.\n\nHistory shows, however, that there's no such thing as a bad time to invest.\n\nThe right strategy can help you build long-term wealth, no matter what the market does.\n\nAfter years of record-breaking growth, the S&P 500(SNPINDEX: ^GSPC) has been stagnant in recent weeks -- up by just 0.24% since the beginning of the year, as of this writing.\n\nMany investors are also divided on where stocks are headed. While around 35% feel optimistic about the next six months, according to the most recent weekly survey from the American Association of Individual Investors, 37% feel pessimistic about the future -- an increase from 29% in early February.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nSo is it really safe to invest right now? Or should you hold off on buying? History offers a crystal-clear answer.\n\nWith many stocks reaching record high after high, many investors worry that the only way to go is down. Historically, though, the market has proven that it always has room for more growth -- if you're willing to stay invested for the long haul.\n\nBy keeping a long-term outlook, it doesn't necessarily matter when you buy. Even if you invest at the seemingly worst moment, you can still build substantial wealth over time.\n\nFor instance, say that you had invested in an S&P 500 index fund or ETF in December 2007. The U.S. was just entering the Great Recession, which would last until mid-2009, and the S&P 500 wouldn't reach a new all-time high until 2013.\n\nIn other words, investing in late 2007 would mean buying at record-high prices immediately before one of the longest and most severe recessions in U.S. history. Those years between 2007 and 2013 would have been rough, but by today, the S&P 500 has earned total returns of more than 363%.\n\nNow, could you have earned more if you'd held off on investing until 2009, when stock prices were at rock bottom? Of course. But trying to time the market is a double-edged sword. Wait too long to invest, and you could miss out on much of the lucrative recovery period.\n\nIn most cases, it's safer to continue investing consistently, no matter what the market is doing. Even if you invest at a \"bad\" moment, you can still earn significant returns over time.\n\nThe overall market is incredibly likely to pull through economic rough patches, but not all individual stocks will be that lucky. Unstable companies are more likely to crash and burn, whether due to a weak business model, shaky finances, lack of a competitive advantage, or poor leadership decisions.\n\nCompanies with strong foundations, however, have a much better chance of surviving even prolonged bear markets or recessions. The more of these stocks you own, the more protected your portfolio will be against volatility.\n\nRight now is the perfect time to comb through your stocks and double-check that every one deserves its place in your portfolio. If you find any that are no longer strong investments, it could be wise to sell while prices are still high. And if you can swing it, investing more can set you up for significant long-term earnings.\n\nBefore you buy stock in S&P 500 Index, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and S&P 500 Index wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $415,256!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,151,865!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 892% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 21, 2026.\n\nKatie Brockman has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    }
]