[
    {
        "title": "These Experts Think Netflix Will Be Fine Even If It Doesn't Get to Buy Warner Bros.",
        "url": "https://www.investopedia.com/these-experts-think-netflix-will-be-fine-even-if-it-doesn-t-get-to-buy-warner-bros-nflx-wbd-psky-11910479",
        "source": "Investopedia",
        "date": "2026-02-20T17:50:00+00:00",
        "content": "Thomas Fuller / NurPhoto via Getty Images\n\nIf Netflix can't land WBD, it's NBD.\n\nThat notion—that streaming-video giant Netflix (NFLX) will be just fine if its planned multibillion-dollar merger with Warner Bros. Discovery (WBD) doesn't go through—is the opinion of analysts at Wedbush, who on Friday reiterated their bullish rating and $115 price target on Netflix shares. That target, which is nearly 50% above Netflix's current stock price, is around the Street average, according to Visible Alpha.\n\nWedbush's report landed at the close of a week in which the deal, announced in December, embarked down the latest leg of its winding road. Warner Bros. reopened talks with alternative (and at times hostile) suitor Paramount Skydance (PSKY), injecting fresh uncertainty, and the possibility of another round of competing bids, into the process.\n\nNetflix may need to pay more than it expected for Warner Bros. Discover after the latter company reopened talks with Paramount Skydance. But some analysts believe Netflix could just as well move on from the deal.\n\nMeanwhile, investors continue to grapple with the question of whether Netflix's bid would ultimately face insurmountable regulatory hurdles.\n\nBut even if it doesn't, Wedbush wrote, Netflix \"does not need this deal. ... Its business is entirely healthy on its own, with a burgeoning global advertising business.\"\n\nNetflix last month reported financial results that included nearly 18% year-over-year revenue growth in the fourth quarter, as well as widening operating margins. The company told investors to expect 15% sales growth in the current quarter.\n\nShares of Netflix, down more than 20% over the past 12 months, were recently up more than 1%. (Read Investopedia's full coverage of today's trading here.) Warner Bros. shares were edging higher Friday afternoon, while Paramount's were down about 1%.\n\nWedbush. \"Concerns Remain Over Deal Potential, But It's Not Needed.\"\n\nNetflix. \"Q4 25 Shareholder Letter.\""
    },
    {
        "title": "Brianne Gardner's Top Picks for Feb. 20, 2026",
        "url": "https://www.bnnbloomberg.ca/markets/2026/02/20/brianne-gardners-top-picks-for-feb-20-2026/",
        "source": "BNN Bloomberg",
        "date": "2026-02-20T19:14:00+00:00",
        "content": "Published: February 20, 2026 at 1:34PM EST\n\nBrianne Gardner, Senior Wealth Manager, Velocity Investment Partners, Raymond James\n\nFocus: Canadian & U.S. Large Caps\n\nTop Picks: ATS Corp, NRG Energy, Netflix\n\nU.S. markets may be pausing near recent highs, but the bigger picture is the shift from a liquidity-driven rally to a fundamentals-driven market. We’re entering a more selective phase, where returns are driven less by broad momentum and more by earnings quality, sector positioning, and policy clarity.\n\nThe economy remains resilient, jobless claims are contained, and business investment is steady. AI spending continues to support growth, but the biggest capex spenders are under the most scrutiny. Investors want clear proof that elevated spending is translating into stronger earnings and sustainable returns.\n\nWhat makes it feel volatile is the dispersion beneath the surface: nearly 25 per cent of the S&P 500 is already up or down more than 20 per cent. This isn’t a rising-tide market. Energy, infrastructure, and select industrials are gaining leadership, while parts of tech and consumer are being repriced.\n\nIn Canada, the dynamic is similar but with a commodity tilt. The Toronto Stock Exchange is benefiting from strength in energy and materials as oil firms and copper demand holds up. Inflation has cooled, giving the Bank of Canada flexibility, and trade data is stabilizing. Housing remains soft and trade negotiations add uncertainty, but resource exposure is acting as a buffer.\n\nOverall, this is a market of rotation, not recession. Leadership is shifting, but the macro foundation remains intact. Our outlook remains constructive but cautious. We favor high-quality earnings and selective growth, lean into commodity exposure in Canada, and add international diversification. We remain diversified and nimble as geopolitics, policy, and earnings shape leadership.\n\nATS remains one of the most compelling automation platforms in the market, benefiting directly from the structural shift toward reshoring, labour scarcity, and the modernization of global manufacturing. Companies across life sciences, EVs, food and beverage, and industrial technology continue to accelerate capital spending on automation to improve throughput, reliability, and cost efficiency. ATS is positioned at the high value end of this trend with highly engineered, customized systems that integrate robotics, vision, analytics, and precision motion. Its project pipeline remains healthy, margins are improving as scale grows, and management continues to execute well on acquisitions that expand both capabilities and recurring revenue streams. The recent price momentum reflects the business’s resilience in volatile periods. We see further upside as production shifts to North America and Europe, positioning ATS to benefit from multi-year secular tailwinds. ATS offers what megacap tech cannot: exposure to “real economy” modernization, strong execution, and an under owned industrial growth engine with more predictable earnings momentum.\n\nWe like it because it provides exposure to rising U.S. power demand, especially tied to data centers and AI. NRG is one of the largest competitive power producers in the U.S., supplying electricity to millions of homes and businesses while also owning its own generation fleet. With the LS Power acquisition, NRG becomes more generation-heavy, meaning it benefits more directly if power prices stay firm in tight supply markets. The last quarter was solid, with earnings coming in stronger than expected, showing the business is operating well in the current environment. A key growth driver is data centers. NRG now has about 445 megawatts of contracted capacity tied to that demand, linking it directly to the AI and cloud buildout. In our view, NRG is evolving from a traditional power retailer into a structural growth story tied to long-term electricity shortages and the digital economy and that’s why we like it.\n\nWe believe the timing is attractive for investors as Netflix continues to strengthen its competitive position. While the streaming landscape is competitive, Netflix remains the only platform with true global distribution, industry-leading engagement, consistent content performance, and sustainably positive free cash flow. The password-sharing crackdown improved monetization, and the ad-supported tier is gaining traction, with the ads business reaching roughly $1.5B in 2025 revenue. Subscriber trends remain solid, and expansion into live events, sports-adjacent programming, gaming initiatives, and local language hits deepens engagement and reduces churn. We think strategically the Warner deal makes sense. It gives Netflix a premium content library, established theatrical infrastructure, and global franchises like DC and Harry Potter that deepen its competitive moat. The renewed Paramount discussions add short-term headline risk around the Warner deal, but we view it as negotiation noise rather than a shift in the long-term thesis, with Netflix still in a strong position and able to match competing offers.\n\nBrookfield Infrastructure (BIP.UN TSX)"
    },
    {
        "title": "Here's Why I'm Not Buying Walmart Stock",
        "url": "https://www.aol.com/articles/heres-why-im-not-buying-012600395.html",
        "source": "AOL",
        "date": "2026-02-20T08:26:00+00:00",
        "content": "Walmart's latest results marked another strong quarter for e-commerce and advertising.\n\nThe company's guidance calls for continued steady growth in Walmart's overall business in fiscal 2027.\n\nAt today's price, the stock's valuation implies very little room for any slowdown or execution missteps.\n\n10 stocks we like better than Walmart ›\n\nWalmart (NASDAQ: WMT) just gave investors a fresh set of results and a new outlook, and the numbers were solid. Revenue rose 5.6% in its fiscal fourth quarter (the period ended on Jan. 31, 2026), and adjusted earnings per share came in at $0.74, up more than 12% year over year. Both figures came in ahead of analysts' consensus forecasts.\n\nBut I'm not buying the stock here.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nThe problem is not the quarter. It's the price investors are paying for it -- especially when you can buy a fast-growing retailer like Amazon (NASDAQ: AMZN) at a meaningfully lower valuation.\n\nTo Walmart's credit, its momentum is notable -- especially for a retailer of its size.\n\nIts global e-commerce sales rose 24% in the quarter. Even more, these e-commerce sales notably represented a meaningful 23% of total net sales.\n\nAdditionally, Walmart U.S. comparable sales, a metric that compares stores open at least a year and excludes fuel, increased 4.6%. Management said transactions grew 2.6% in Walmart U.S., suggesting customer traffic is still driving growth, not just higher prices.\n\nHigher-margin lines are showing up more clearly, too. The company said its global advertising business grew 37% in the quarter, including advertising revenue from its TV operating system platform VIZIO. And Walmart Connect -- the company's retail media business unit and advertising platform -- in the U.S. grew 41%. Finally, the company's membership fee revenue grew 15.1% globally.\n\nFurther, Walmart's profit picture in the quarter was better than the sales growth rate would suggest. Operating income rose 10.8%, and the company said operating income grew faster than sales due to higher gross margins, expense leverage, and improved e-commerce economics, helped by a better mix (a higher percentage of sales going to higher-margin products and services).\n\nThat's some impressive momentum. Walmart is steadily becoming more digital and more profitable.\n\nBut things become more concerning when you consider Walmart's outlook.\n\nManagement expects fiscal 2027 net sales to increase 3.5% to 4.5% on a constant-currency basis. As for profitability, the company forecast constant-currency-adjusted operating income to grow 6% to 8%. And for its full-year adjusted earnings per share, management guided for $2.75 to $2.85.\n\nAt Walmart's current stock price, the stock trades at about 45 times the midpoint of management's fiscal 2027 adjusted EPS guidance.\n\nAt this valuation, Walmart has to maintain strong comparable sales growth, keep expanding its margins, and continue growing higher-margin streams like advertising and membership with very few hiccups.\n\nWalmart did try to bolster the shareholder-return story. The company announced a new $30 billion share repurchase authorization and increased its annual dividend to $0.99 per share. Those are real positives. But they don't erase the valuation problem.\n\nAmazon's most recent quarter showed net sales growth of 14%, with AWS segment sales up 24%. CEO Andy Jassy said Amazon expects to invest about $200 billion in capital expenditures in 2026, including in AI and other long-term opportunities -- and he anticipates a \"strong long-term return\" on this capital.\n\nOf course, there are risks to big spending like this. But here's the kicker: Amazon's price-to-earnings ratio is just 28. Even more, Amazon isn't just a retail operation; it comes with a lucrative cloud computing business that grew sales 24% year over year in the company's most recent quarter.\n\nThe risk for Walmart investors is not that the business will suddenly break. It is that anything merely \"fine\" becomes a problem when the stock is priced for near-perfection. And the bigger reason I wouldn't buy Walmart stock today is even simpler: I'd rather buy Amazon.\n\nBefore you buy stock in Walmart, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Walmart wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $420,595!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,152,356!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 899% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 19, 2026.\n\nDaniel Sparks and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon and Walmart. The Motley Fool has a disclosure policy."
    },
    {
        "title": "Stock Market Today, Feb. 19: Walmart Falls After Cautious Profit Outlook Despite Strong E-Commerce Growth",
        "url": "https://www.aol.com/articles/stock-market-today-feb-19-220635557.html",
        "source": "AOL",
        "date": "2026-02-20T05:06:00+00:00",
        "content": "Walmart (NASDAQ:WMT), a global retail and e-commerce operator, closed Thursday at $124.87, down 1.38%. The stock moved as investors weighed a solid fiscal Q4 earnings beat and robust e-commerce growth against Walmart’s cautious profit outlook and commentary on a “somewhat unstable” consumer backdrop. Investors are also balancing how guidance shapes expectations for fiscal 2026.Trading volume reached 42.1 million shares, about 34% above its three-month average of 31.4 million shares. Walmart IPO'd in 1972 and has grown 581,123% since going public.\n\nThe S&P 500 (SNPINDEX:^GSPC) slipped 0.29% to 6,862, while the Nasdaq Composite (NASDAQINDEX:^IXIC) declined 0.31% to finish at 22,683. Among discount stores, Costco Wholesale (NASDAQ:COST) closed at $987.82 (-0.83%) and Target (NYSE:TGT) finished at $115.66 (+0.00%), underscoring mixed sentiment across large retail peers.\n\nWalmart had significant increases in e-commerce and online pickup and delivery orders, especially among consumers with higher incomes. But investors felt its cautious outlook may signal a tough road for the stock price going forward.\n\nIn Walmart’s first earnings report since John Furner took over as CEO on Feb. 1, the company reported holiday-quarter sales rose 5% on a constant-currency basis. Operating income grew nearly 11%, as e-commerce sales grew 25% globally and 27% in the U.S.\n\nThat beat estimates and showcased how returns from tech and AI investments are paying off. With shares recently up over 20% just this year and with cautious comments especially about low-income consumers, investors took some profits today.\n\nBefore you buy stock in Walmart, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Walmart wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $420,595!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,152,356!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 899% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 19, 2026.\n\nHoward Smith has positions in Target. The Motley Fool has positions in and recommends Costco Wholesale, Target, and Walmart. The Motley Fool has a disclosure policy."
    },
    {
        "title": "Here's How Adyen Beats the Market From Here",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/SPOT-N/pressreleases/324625/here-s-how-adyen-beats-the-market-from-here/",
        "source": "The Globe and Mail",
        "date": "2026-02-20T05:19:00+00:00",
        "content": "Adyen's stock has been crushed during the past five years, while its revenue has doubled.\n\nThe company continues to gain share in the payments market due to its product superiority.\n\nAdyen stock now trades at a reasonable valuation.\n\nAdyen(OTC: ADYEY) is down 66% from all-time highs set five years ago, when the pandemic was raging, but its business is significantly larger today. Revenue and net income have more than doubled for the payment processing company since then, while its share price has been more than cut in half. This type of scenario can be a great opportunity to buy on the dip.\n\nInvestors are nervous due to management's reduced outlook for fiscal year 2026 and a general valuation reset. Now, the stock appears undervalued for investors who have a time horizon longer than a year.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nHere's why Adyen stock can outperform the market from here.\n\nBy building strong systems for businesses to process payments worldwide that are superior to legacy options, Adyen has consistently gained market share during the past decade-plus. It continued to do that in the second half of 2025, with processed volume up 12% year over year, or 19% excluding the effects of an unprofitable customer.\n\nWith a set fee based on payment volumes, Adyen makes money the more payments it processes for customers like Uber and Spotify. Net revenue rose 21% from a year earlier in constant-currency terms last quarter, outpacing growth in payment volume due to the aforementioned unprofitable customer ending its contract.\n\nAs a frugal operator, Adyen has best-in-class margins, posting a pretax income margin of 54% in the second half of last year. Combined with strong revenue growth, this shows how Adyen's superior platform is helping win customers without major discounts or a marketing sales push. It lets its product speak for itself.\n\nAdyen keeps adding products to its lineup, including a nifty new tool called Dynamic Identification that uses its proprietary data to help customers better filter fraudulent buyers from legitimate ones. Merchants in a test saw a 6% rise in customer conversions when using Dynamic Identification, which is a hugely valuable improvement.\n\nIt is this tool and much more that drive customers to send more volume Adyen's way to process payments around the globe. Management anticipates revenue growth in 2026 of 20% to 22%, which is slightly below analyst expectations but still outpacing the overall payments market. Its margin as measured by earnings before interest, taxes, depreciation, and amortization is expected to tick above 55% by 2028.\n\nToday, the company's price-to-earnings (P/E) ratio is about 31, which is close to the S&P 500 index average. Through strong revenue growth and margin expansion, Adyen should be able to increase its earnings at a rapid rate for many years to come. Combined with a conservative balance sheet, the stock looks primed to outperform the market during the next five years.\n\nBefore you buy stock in Adyen, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Adyen wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $420,595!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,152,356!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 899% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 20, 2026.\n\nBrett Schafer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Adyen, Spotify Technology, and Uber Technologies. The Motley Fool has a disclosure policy.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    }
]