[
    {
        "title": "Global-E Online Stock Is Surging on Earnings and Guidance",
        "url": "https://www.aol.com/articles/global-e-online-stock-surging-172335295.html",
        "source": "AOL",
        "date": "2026-02-18T17:40:00+00:00",
        "content": "Global-E Online's fourth-quarter results beat Wall Street's expectations on strong demand.\n\nThe company's guidance for 2026 was very upbeat, reflecting management confidence in a strong sales pipeline.\n\n10 stocks we like better than Global-E Online ›\n\nShares of Israeli e-commerce platform provider Global-e Online (NASDAQ: GLBE) were sharply higher at midday on Wednesday, after the company reported better-than-expected fourth-quarter results.\n\nAs of noon ET, Global-E Online's shares were up about 11.9% from Tuesday's closing price.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nGlobal-E Online reported its fourth-quarter results before the U.S. markets opened on Wednesday. They were good, as both adjusted earnings per share and revenue handily beat Wall Street's estimates.\n\nRevenue of $336.7 million, up 28% from a year ago, drove adjusted earnings per share of 49 cents, up from 30 cents per share in the year-ago period. Gross merchandise value (GMV), a key operating metric for the company's management, was $2.36 billion, up 37.8% from the prior year. The company's fourth-quarter launches included a slew of big-name luxury and consumer brands.\n\nBut its 2026 guidance is probably what had investors most excited.\n\nGlobal-E Online sees strong demand continuing throughout the year. Its guidance calls for first-quarter revenue between $247 million and $254 million and full-year sales between $1.21 billion and $1.27 billion. Both ranges were higher than analysts had expected.\n\n\"We are excited about the opportunities and the pipeline that we see ahead of us, as is evident from our 2026 outlook,\" CEO Amir Schlachet said in a statement. It appears that investors were just as excited on Wednesday.\n\nBefore you buy stock in Global-E Online, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Global-E Online wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $415,256!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,133,904!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 889% — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 18, 2026.\n\nJohn Rosevear has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Global-E Online. The Motley Fool has a disclosure policy."
    },
    {
        "title": "This Cathie Wood Stock Is Already Up Nearly 30% This Year -- Is It a Buy?",
        "url": "https://www.aol.com/articles/cathie-wood-stock-already-nearly-201645169.html",
        "source": "AOL",
        "date": "2026-02-18T20:32:00+00:00",
        "content": "Cathie Wood's flagship Ark Innovation ETF is known for betting big on the disruptive companies of the future.\n\nIf you dig into the ETF's holdings, you may be surprised to find legacy agriculture giant Deere.\n\nShares of Deere are up 30% year to date.\n\n10 stocks we like better than Deere & Company ›\n\nCathie Wood's Ark Innovation ETF (NYSEMKT: ARKK) broadly invests in what the firm describes as \"disruptive innovation\" plays in industries like robotics and artificial intelligence (AI).\n\nAgricultural machinery specialist Deere (NYSE: DE) might seem out of place in that group, but there's a reason it accounts for 1.8% of that exchange-traded fund's holdings. Wood added it to the Ark portfolio in recognition of its autonomous tractors, advanced cameras that can distinguish weeds from crops, and cloud capabilities.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nThe benefits of marrying Deere's well-established legacy equipment business with disruptive technology have helped contribute to a bullish thesis that has driven its shares up by close to 30% to start the year.\n\nBut to determine whether Deere is still a buy after that rapid climb, we'll have to take a step back.\n\nThe S&P 500 is down slightly this year, which makes Deere's run-up look even more impressive. If you zoom out further, though, its outperformance is slimmer.\n\nOver the past five years, Deere's stock price has climbed by about 91%, while the S&P 500 is up 75%. And on a total return basis, factoring in dividends and dividend reinvestment, Deere has returned 106% while the broad index has returned 87% over that period.\n\nHere are a few other key points to consider before making a decision about investing in this stock.\n\nAgriculture is a cyclical business, with demand and investment rising and falling across the years and seasons. Valleys can also extend beyond a few quarters. In Deere's fiscal 2025 fourth-quarter earnings release, CEO John May said that \"we believe 2026 will mark the bottom of the large ag cycle,\" which remains marked by margin pressure and persistent challenges.\n\nThe company's financial outlook aligns with May's statement. Deere reported net income of $5 billion in its fiscal 2025 (which ended Nov. 2), but expects between $4 billion and $4.75 billion in fiscal 2026.\n\nThe recent upward stock swing may signal that investors are playing a bit of a timing game here, believing they're positioning themselves ahead of the bottom of the cycle.\n\nAnyone looking to invest based on recent stock price momentum or betting on Deere's income to pick up steam may fall into a trap.\n\nThe company's current forward price-to-earnings ratio of about 36 is rich compared to 2025, when it stayed within a range of 22 to 30. That goes back to that potential indication that some investors are trying to get into the stock ahead of a pending bottom to the agriculture cycle. More upside is priced in. The risk now is that this sets up heightened expectations and gives the company little room for error.\n\nFree-cash-flow yield is another useful valuation measure to consider here. It tells us the amount of free cash Deere earns as a percentage of its market cap. From October 2021 to October 2025, that yield averaged 2.9%, compared with its most recent reading, in October 2025, of about 2%.\n\nThat drop tells us investors are paying more for each dollar of cash the company generates.\n\nAnyone considering investing in Deere today should be aware that the stock price's recent climb is overshadowing some warning signs.\n\nManagement has already acknowledged that it will make less income this year than it did last year and that persistent challenges exist. The expectations already baked into the share price are high and will be difficult for the company to meet. We'll learn more about the state of Deere's business when it reports its fiscal 2026 first-quarter results on Thursday morning. But at these valuations, long-term and value investors may want to look for other opportunities.\n\nBefore you buy stock in Deere & Company, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Deere & Company wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $415,256!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,133,904!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 889% — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 18, 2026.\n\nJack Delaney has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Deere & Company. The Motley Fool has a disclosure policy."
    },
    {
        "title": "Is Micron a Trillion-Dollar Company in the Making?",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/MU/pressreleases/279065/is-micron-a-trillion-dollar-company-in-the-making/",
        "source": "The Globe and Mail",
        "date": "2026-02-18T07:19:00+00:00",
        "content": "Micron has seen demand for its chips spike amid the buildout of new data centers for AI training and inference.\n\nThe entire industry is cautiously building out more production capacity, and supply will remain tight until 2027.\n\nMicron's P/E ratio fluctuates widely based on where it is in the demand cycle.\n\nFew artificial intelligence (AI) stocks have seen more capital pile into them in such a short period than Micron Technology(NASDAQ: MU). The memory-chip maker has seen its stock soar 250% since the start of September, and now sports a market cap of over $460 billion.\n\nWith the stock already 44% higher through the first few weeks of 2026, investors may be wondering whether it's set to surpass $1 trillion in the near future. Another doubling will just about do it.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nStock prices are forward-looking. To determine whether Micron can reach a $1 trillion valuation, it's important to understand what's driving its price higher and whether those factors will sustain its growth well into the future.\n\nMicron has been one of the biggest beneficiaries of the growing demand for high bandwidth memory (HBM). These memory chips are packaged with graphics processing units (GPUs) and AI accelerators for AI training and inference. With the growing demand for compute from AI developers, hyperscalers have increased their chip budgets, which, in turn, has increased demand for Micron's HBM.\n\nThe entire industry now faces a shortage of DRAM memory chips. These not only compose the building blocks of the high-bandwidth memory chips Micron makes but are also key components in other computing hardware, including PCs and smartphones.\n\nAs a result of the shortage, Micron has seen the prices it can charge for its chips rise considerably. The company's average selling price for DRAM chips increased 20% sequentially in the first quarter and gross margin expanded to 57% from 46%. With the pricing tailwind, Micron's earnings per share grew 167% to $4.78 last quarter and operating cash flow ballooned to $8.4 billion.\n\nThe company's outlook suggests 2026 could be even better. Management guided gross margin to expand to 68% this quarter, and earnings per share will reach $8.42. Management also said the supply of memory chips will remain tight beyond the 2026 calendar year.\n\nThat news kicked off another run in Micron's stock price, and analysts increased their expectations for fiscal 2026 and 2027 earnings. Wall Street now sees Micron generating $33.73 per share for 2026 and $43.54 in 2027.\n\nMicron stock trades at about 12.2 times analysts' 2026 earnings expectations and 9.4 times 2027 earnings expectations. That might seem cheap, compared to other AI semiconductor stocks, but Micron's business isn't as differentiated as those of high-end chipmakers.\n\nMemory chips are practically a commodity, and Micron faces competition from Korean companies SK Hynix and Samsung. Rest assured, neither of them is sitting on the opportunity to ramp up DRAM chip production.\n\nWhile all three have remained cautious about how long demand will remain elevated, all three major DRAM chipmakers are investing in production capacity. Micron itself plans to spend $20 billion in capital expenditures for fiscal 2026.\n\nThis cycle has played out repeatedly in the industry, leading to peaks and valleys in Micron's earnings. The three chipmakers have to ramp up capacity to meet demand, but they're left with an oversupply when demand slows, leading to severe declines in earnings power. The cyclical nature of the industry is why Micron's earnings today aren't valued as highly as a company with more predictable and sustainable earnings power.\n\nNonetheless, Micron's current earnings multiple is much higher than it has been amid other peaks in its earnings cycles over the last 15 years or so. Micron's trailing price-to-earnings ratio (P/E) around the peak of prior earnings cycles has ranged from 3 to 6.\n\nMU Net Income (TTM) data by YCharts.\n\nAs mentioned, Micron stock currently trades at 9.4 times 2027 earnings. That means investors are currently expecting the pricing tailwinds supporting Micron's current earnings boost to continue well past fiscal 2027. While AI demand is a strong driving force, past demand cycles suggest that Micron's earnings won't continue to climb much higher beyond 2027.\n\nEven if this demand cycle extends to the end of the decade, the stock price is, at best, fairly valued. For it to reach a $1 trillion valuation, it would require overwhelming outperformance of management's guidance and analysts' expectations, fueled by an acceleration in demand from its hyperscaler end customers.\n\nBefore you buy stock in Micron Technology, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Micron Technology wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $414,554!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,120,663!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 884% — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 18, 2026.\n\nAdam Levy has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Micron Technology. The Motley Fool has a disclosure policy.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "Stock Market Today, Feb. 17: Vale Slips as Iron Ore and China Demand Weigh on Margins",
        "url": "https://finance.yahoo.com/news/stock-market-today-feb-17-234755913.html",
        "source": "Yahoo Finance",
        "date": "2026-02-18T00:13:00+00:00",
        "content": "Vale (NYSE:VALE), a global producer of iron ore, nickel, and other metals, closed Tuesday at $15.9, down 1.30%. The move likely reflects broader sentiment toward iron ore and metals, and investors are watching commodity prices and capital-return plans next.\n\nThe company’s trading volume reached 56.6 million shares, which is about 50% above compared with its three-month average of 37.7 million shares. Vale went public in 2002 and has grown 607% since going its IPO.\n\nThe S&P 500 (SNPINDEX: ^GSPC) inched up 0.10% to 6,843, while the Nasdaq Composite (NASDAQINDEX: ^IXIC) also gained 0.14% to finish at 22,578. Among metals and mining rivals, Rio Tinto Group (NYSE:RIO) closed at $96.88, down 1.21%, and BHP Group (NYSE:BHP) finished at $74.29, rising 1.24% as investors assessed iron ore demand.\n\nVale shares declined Tuesday as iron ore prices softened and investors adjusted demand expectations, despite modest gains in broader U.S. indexes. The decline was not driven by new company-specific developments but reflected broader commodity positioning rather than a change in Vale’s operating outlook. Vale’s fourth-quarter results showed increased iron ore, copper, and nickel volumes, with pro forma EBITDA rising 17% year-over-year to $4.8 billion. At the same time, discussions between Rio Tinto and BHP regarding a potential Pilbara iron ore collaboration highlight evolving supply dynamics that could affect global pricing, a key factor for Vale’s margins.\n\nVale continues to expand Brazilian iron ore capacity and advance copper growth plans to meet infrastructure and electrification demand. Investors will monitor iron ore price stability, Chinese steel demand trends, as well as updates on dividends or buybacks as indicators of earnings and cash return resilience through the cycle.\n\nBefore you buy stock in Vale, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Vale wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $414,554!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,120,663!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 884% — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 17, 2026.\n\nEric Trie has no position in any of the stocks mentioned. The Motley Fool recommends BHP Group. The Motley Fool has a disclosure policy.\n\nStock Market Today, Feb. 17: Vale Slips as Iron Ore and China Demand Weigh on Margins was originally published by The Motley Fool"
    },
    {
        "title": "eBay Inc. Reports Fourth Quarter and Full Year 2025 Results",
        "url": "https://uk.finance.yahoo.com/news/ebay-inc-reports-fourth-quarter-210500107.html",
        "source": "Yahoo Finance UK",
        "date": "2026-02-18T22:37:00+00:00",
        "content": "Your privacy is important to us\n\nYahoo is part of the Yahoo family of brandsThe sites and apps that we own and operate, including Yahoo and Engadget, and our digital advertising service, Yahoo Advertising.Yahoo family of brands.\n\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\n\nIf you would like to customise your choices, click 'Manage privacy settings'.\n\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy and Cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
    }
]