[
    {
        "title": "Earnings live: Vertiv stock soars on upbeat outlook, Lyft and Robinhood shares tumble, Mattel plunges",
        "url": "https://malaysia.news.yahoo.com/live/earnings-live-vertiv-stock-soars-on-upbeat-outlook-lyft-and-robinhood-shares-tumble-mattel-plunges-131159977.html",
        "source": "Yahoo Malaysia",
        "date": "2026-02-11T13:40:00+00:00",
        "content": "The fourth quarter earnings season is more than halfway over, and the S&P 500 is on track for solid earnings growth.\n\nAs of Feb. 6, 59% of S&P 500 (^GSPC) companies have reported fourth quarter results, according to FactSet data, and Wall Street analysts estimate a 13% increase in earnings per share for the fourth quarter. If that rate holds, it would represent the 10th consecutive quarter of annual earnings growth for the index and the fifth consecutive quarter of double-digit growth.\n\nHeading into the reporting period, analysts were expecting an 8.3% jump in earnings per share, down from the third quarter's 13.6% earnings growth rate. Wall Street has raised its earnings expectations in recent months, especially for tech companies, which have driven earnings growth in recent quarters.\n\nMassive Big Tech capital expenditures set the tone for the AI trade. Plus, the themes that drove the markets in 2025 — artificial intelligence, the Trump administration's tariff and economic policies, and a K-shaped consumer economy — continue to provide plenty for investors to parse.\n\nThis week, investors will digest results from Coca-Cola (KO), Spotify (SPOT), Robinhood (HOOD), Lyft (LYFT), Ford (F), Rivian (RIVN), Moderna (MRNA), Airbnb (ABNB), and Coinbase (COIN).\n\nEquinix (EQIX) stock jumped more than 9% in extended trading after the data center operator issued strong annual revenue guidance on the back of continued artificial intelligence demand.\n\nAs corporations race ​to integrate generative AI, the surge in demand for specialized data centers to power the technology has benefited Equinix.\n\nThe company expects revenue between $10.12 billion and $10.22 billion for 2026, ‌compared with estimates ⁠of $10.07 billion, according to data compiled by LSEG.\n\nEquinix also forecast first-quarter sales between $2.50 billion ⁠and $2.54 billion, above estimates of $2.46 billion.\n\nCisco (CSCO) stock fell 5% after the networking company issued guidance below Wall Street forecasts.\n\nFor the full year, Cisco raised its guidance for earnings per share to $3.00 to $3.08 on revenue of $61.2 billion to $61.7 billion. However, the Street was looking for earnings guidance of $3.12 on revenue of $62.1 billion.\n\nIn Cisco's second quarter, the company reported earnings per share of $0.80, compared to Wall Street analyst estimates of $0.74 per share, according to S&P Global Market Intelligence. Revenue rose 10% year over year to $15.3 billion, compared to estimates of $15.1 billion.\n\n\"We see strong, broad-based demand for our technology solutions and remain focused on capturing the significant opportunities we see ahead,\" Cisco CFO Mark Patterson said.\n\nA surge in data center investments, fueled by technology companies' need ‌for AI ⁠computing infrastructure, has driven strong demand for Cisco's core ⁠networking products, such as switches and routers.\n\nEnterprises are expected to ensure ​their campus ​networks are \"AI ​ready\" as infrastructure ‌readiness will be crucial for AI-era workloads and modernization needs across switching, wireless and IoT systems.\n\nYahoo Finance's Brooke DiPalma reports:\n\nMcDonald's (MCD) reported fourth quarter results on Wednesday that surpassed Wall Street expectations as its value meal focus and marketing efforts brought more customers in the door as US sales grew for the third-straight quarter.\n\nMcDonald's said Wednesday that its US same-store sales grew 6.8% during the quarter, far more than the 5.1% rise the Street expected, according to data from Bloomberg. Its full-year US same-store sales rose 2.1%, also higher than the 1.6% expected.\n\nMcDonald's stock rose 2% following the results.\n\nWhile the US drove growth in the quarter, its international markets also benefited from marketing promotions. Global same-store sales rose 5.7% for the fourth quarter, higher than the estimated 3.8% jump. For the full year, international sales rose 3.1%, more than the 2.6% estimated.\n\nShares of videogame engine maker Unity Software dropped nearly ‌30% on Wednesday after the company ‌forecast first-quarter revenue below Wall Street expectations, signaling ​sluggish demand for its software.\n\nUnity expects revenue between $480 million and $490 million for the first quarter, below analysts' estimates of $492.1 million, ‌according to data ⁠compiled by LSEG.\n\nThe firm's shares have taken a beating this ⁠year largely due to fears that new artificial intelligence technology from Alphabet's Google, ​capable of ​generating interactive worlds, ​could replace a ‌lot of work done by game engines in the future.\n\nThis is in sharp contrast to its stock performance last year, when share prices nearly doubled as ‌investors bet on Unity's ​strong positioning in the ​videogame software market ​and a recovery in mobile ‌gaming.\n\nT-Mobile (TMUS) added fewer wireless subscribers in the fourth quarter than analysts had expected, as rivals ‌extended aggressive deals and offers to lure customers.\n\nShares of the ‌company fell about 4% in premarket trading on Wednesday.\n\nT-Mobile still ​added 962,000 ​monthly-bill-paying phone customers in the quarter, ​the highest among the big ‌three U.S. wireless carriers. But the number fell short of the 981,330 additions expected by analysts polled by FactSet.\n\nThe churn rate, the percentage of customers who discontinue service, stood at 1.02% for T-Mobile's postpaid services, compared with 0.92% a year earlier.\n\nTotal revenue came in at $24.33 billion, compared with ‌estimates of $24.11 billion, according to data compiled ​by LSEG.\n\nThis was helped by more customers ​opting for T-Mobile's premium ​plans that bundled subscriptions for Netflix and Hulu.\n\nKraft Heinz (KHC) announced on Tuesday that it would pause its spin-off plans, with the company's new CEO, Steve Cahillane, saying that its \"challenges are fixable and within our control.\"\n\nThe company, which was set to spin off its meal business, Global Taste Elevation Co., and grocery business North American Grocery Co., plans to invest $600 million across marketing, sales, research and development, and pricing.\n\n\"We are confident in the opportunity ahead and believe this investment will accelerate our return to profitable growth,\" said Steve Cahillane, who became CEO on Jan. 1 and previously led Kellanova, which successfully split from the Kellogg Company in 2023.\n\nShares fell more than 6% in premarket trading.\n\nIn its fourth quarter results, the company reported adjusted earnings of $0.67, a beat compared to the expected $0.61, per Bloomberg consensus data. Revenue came in slightly lower at $6.35 billion, compared with the $6.37 billion expected.\n\nPrices increased 0.5%, slightly below expectations of a 0.79% increase.\n\nFor 2026, the company expects organic net sales to be down 1.5% to 3.5%. Wall Street expected 2026 annual organic revenue to be down 0.56%. Adjusted earnings per share are expected to be in the range of $1.98 to $2.10, whereas Wall Street forecast $2.50.\n\nVertiv (VRT) stock surged 15% after its 2026 financial forecast surpassed Wall Street's expectations, as the data center market booms, and digital infrastructure companies like Vertiv aim to keep up with the demand.\n\nFor the full year, Vertiv expects its adjusted earnings per share to accelerate, reaching $5.97 to $6.07. The Street was looking for adjusted earnings of $5.51 per share, according to S&P Global Market Intelligence.\n\n\"As we look to 2026, we expect this momentum to continue,\" Vertiv CEO Giordano Albertazzi said. \"Our record backlog provides clear visibility into what we expect to be another year of significant growth.\"\n\nThe upbeat outlook overshadowed an earnings miss in the fourth quarter. Vertiv reported earnings of $1.14 per share, just shy of estimates of $1.16. Net sales reached $2.88 billion, roughly in line with estimates.\n\nShopify (SHOP) stock rose 10% before the bell on Wednesday after forecasting quarterly revenue above Wall Street estimates.\n\nThe ​company ​expects ​revenue to ‌rise at a low-thirties percentage rate in the first quarter, compared ‌with analysts' ​average ​estimate ​of a ‌25.2% rise, according ​to ​data compiled by LSEG.\n\nHumana forecast annual ‌profit below ‌Wall Street estimates on ​Wednesday, as the health insurer expects a hit ‌from ⁠lower quality ratings for its ⁠Medicare Advantage plans for older ​adults.\n\nHumana stock fell 7% before the bell on Wednesday following the news on its earnings.\n\nMattel (MAT) reported top- and bottom-line misses on Tuesday, sending shares 24% lower in extended trading.\n\nIn the fourth quarter, the toymaker reported earnings per share of $0.34 on revenue of $1.76 billion. Wall Street analysts were looking for earnings of $0.51 on revenue of $1.83 billion, according to S&P Global Market Intelligence.\n\nThe stock also sharply reacted to Mattel's 2026 forward guidance, which disappointed.\n\nIn 2026, Mattel expects net sales to grow between 3% and 6%. Adjusted earnings per share are expected to be in the range of $1.18 to $1.30, below 2025's earnings per share of $1.41 and the Street's forecast of $1.68 per share.\n\n\"We achieved strong topline growth in the fourth quarter and consumer demand was positive in every region for both the quarter and full year, but December gross billings in the U.S. ended up growing less than expected,\" CEO Ynon Kreiz said in a statement.\n\nLyft (LYFT) stock pulled back by more than 15% in after-hours trading after its first quarter outlook and 2025 operating loss dented expectations of the company's comeback story.\n\nIn the fourth quarter, Lyft reported revenue of $1.6 billion, missing expectations of $1.75 billion, according to S&P Global Market Intelligence. Gross bookings of $5.1 billion were up 19% year over year.\n\nFor the full year, Lyft reported an operating loss of $188 million, whereas analysts expected a profit of $33.3 million.\n\nFor the first quarter of 2026, Lyft guided for adjusted EBITDA (earnings before interest, taxes, depreciation, and amortization) of $120 million to $140 million. The Street consensus estimate was $147 million for EBITDA.\n\nYahoo Finance's Pras Subramanian reports:\n\nFord (F) reported fourth quarter results Tuesday after the bell that missed expectations, with charges stemming from its EV business resulting in a net loss for the quarter and the year.\n\nFord reported Q4 automotive revenue of $42.40 billion vs. $42.40 billion expected, per Bloomberg consensus, with adjusted earnings per share (EPS) of $0.13 vs. $0.19 expected, on adjusted EBIT of $1 billion vs. $1.16 billion.\n\nBut Ford posted a fourth quarter and full-year net loss of $11.1 billion and $8.2 billion, respectively, which reflected the impact of special items, the company said. Ford's full-year adjusted EBIT of $6.8 billion came in near its forecast of around $7 billion but missed estimates of $8.86 billion. Adjusted free cash flow came in at $3.5 billion for the year, at the midpoint of Ford's projection.\n\nRobinhood (HOOD) reported better-than-expected earnings for the fourth quarter, but missed estimates on several other metrics, sending shares as much as 9% lower in after-hours trading. Retail trading buoyed the company during the quarter, offsetting weakness in crypto revenue.\n\nIn Q4, the brokerage and banking platform reported revenue growth of 27% year over year to $1.28 billion, compared to estimates of $1.3 billion, according to S&P Global Market Intelligence. Diluted earnings per share came in at $0.66, compared to estimates of $0.64 and $1.01 in Q4 2024.\n\nRobinhood CEO Vlad Tenev reiterated his ambition to make Robinhood into a \"Financial SuperApp.\" The company has rolled out banking services, stock tokens, crypto trading, and even event contracts.\n\nYahoo Finance's Ines Ferré reports:\n\nCrypto revenue for the fourth quarter came in at $221 million, below estimates of $248.2 million. Options revenue also came in short of expectations, at $314 million versus estimates for $331 million.\n\n\"A top-line miss is not helpful at all,\" Christian Bolou, an analyst at Autonomous Research, told Yahoo Finance.\n\n\"Net deposit growth decelerated in the fourth quarter and looks like it decelerated in January,\" he added. \"The stock reaction might be warranted here given high expectations and a very expensive stock.\"\n\nMarriott (MAR) CEO Anthony Capuano said that, like other travel companies, the hotel chain is seeing a divergence across its customer base and strength primarily in the premium segment.\n\n\"I mean, there is certainly ... a K-shaped economic bifurcation of the consumer,\" Capuano said Tuesday. \"We continue to see really consistent strength across luxury for the full year.\"\n\nYahoo Finance's Brian Sozzi reports:\n\nMarriott's fourth quarter performance and outlook added some concern, however, that a mixed US economy was continuing to weigh on consumers.\n\nThe purveyor of the Ritz-Carlton and JW Marriott brands reported adjusted earnings of $2.58 per share. Wall Street was expecting $2.62 per share.\n\nRevenue per available room (RevPar), a metric of industry health that combines occupancy rates and room prices, increased 2% in 2025. In the US and Canada, RevPar fell slightly in the fourth quarter.\n\nYahoo Finance's Pras Subramanian reports:\n\nFerrari (RACE) stock popped in early trade after upbeat guidance suggested its luxury supercars are still in high demand.\n\nFor 2026, Ferrari projects revenue of about 7.5 billion euros ($8.91 billion), up 5% from a year ago, with adjusted EBITDA expected at 2.93 billion euros ($3.48 billion), up 5.8%. Analysts were expecting revenue of 7.53 billion euros and adjusted EBITDA of 2.91 billion euros, per Bloomberg consensus.\n\nFerrari expects its industry-leading EBITDA margin to hit 39%, up 20 basis points from last year. Ferrari said an improved product mix, including higher-end cars, personalizations, and higher racing revenues, will boost results in 2026.\n\nFerrari stock surged nearly 10% in early trade in New York.\n\nShares in S&P Global (SPGI) began to dig out of a deep post-earnings slump on Tuesday, reversing a roughly 20% loss as executives spoke with analysts and investors on the company's fourth quarter earnings call.\n\nThe company's shares initially plummeted on Tuesday morning after S&P Global reported 2026 profit expectations below analyst estimates, forecasting adjusted per-share profit of $19.40 to $19.65, against estimates of $19.94.\n\nS&P Global also reported adjusted earnings per share at $4.30, missing analyst estimates of $4.34 per share. Top-line revenue for the quarter came in at $3.916 billion, above estimates of $3.91 billion.\n\nDespite the reversal of losses on Tuesday morning, shares in S&P Global remain down by more than 20% on the year. The company has been caught in the software sector sell-off that racked the market through the first week of February.\n\nDatadog (DDOG) fourth quarter earnings beat Wall Street estimates on Tuesday, backed by rising demand for cloud security amid the artificial intelligence boom. The stock surged nearly 15% ahead of the opening bell.\n\nHere's what the company reported, compared to estimates compiled by LSEG:\n\nQ4 revenue: $953.2 ⁠million (29% growth from a year ago), compared with ​estimates of $916.6 million\n\nQ4 adjusted profit: $0.59, compared with estimates of $0.55\n\nQ1 revenue forecast: $951 million ⁠and $961 million, compared with estimates of $935.4 million\n\nFull-year revenue forecast: $4.06 billion and $4.10 billion, compared with estimates of $4.11 billion\n\nFull-year adjusted profit forecast: $2.08 to $2.16 per share, compared with estimates of $2.37\n\nThe rise of generative AI has driven ‌greater data volume and complexity in corporate IT systems, increasing demand for application and infrastructure monitoring tools offered by firms such as Datadog.\n\n\"During 2025, we delivered over 400 new features and capabilities ⁠to help our customers ‌as they migrate to the cloud and begin to deploy to production with next-gen AI,\" CEO Olivier ‍Pomel said.\n\nNew York City-headquartered Datadog provides a cloud-based monitoring and analytics platform that can help companies see how their software and servers are performing ​in one place.\n\nCoca-Cola (KO) barely beat earnings estimates as it continues to see strong demand from high-income consumers but weakness among low-income households.\n\nCoke reported quarterly revenue of $11.82 billion, versus estimates of $12.04 billion, according to S&P Global Market Intelligence. Net income increased to $2.3 billion, or $0.58 per share. Wall Street's expectations for earnings per share were a penny lower, at $0.57 per share.\n\nThe stock fell 4% in premarket trading.\n\nGlobal unit case volumes grew 1% for the October-December period, led by the U.S., Japan and Brazil, the Atlanta beverage giant said Tuesday. Unit case volumes also rose by 1% in North America, reversing several quarters of flat or declining sales.\n\nCoke said it hiked prices 4% in North America and 1% globally during the quarter. Coca-Cola Zero Sugar was a strong performer, with sales up 13% for the October-December period. Water, sports drinks, coffee and tea also saw stronger demand, while juices and dairy products faltered.\n\nThe company said last fall that it's seeing a divergence among consumers in North America and Europe, with higher-income buyers opting for its more expensive brands like Smartwater, Topo Chico and Fairlife while middle- and lower-income consumers are under more pressure.\n\nSpotify (SPOT) reported solid earnings and revenue that beat expectations for the fourth quarter, following price hikes from the streaming company and a change in role for founder Daniel Ek.\n\nThe stock jumped about 10% in premarket trading.\n\nEarnings per share of 4.43 euros ($5.27) came in above estimates of 2.78 euros ($3.31). Revenue of 4.53 billion euros ($5.35 billion) was also slightly above estimates of 4.51 billion euros, according to S&P Global Market Intelligence.\n\nPremium subscribers ​climbed 10% to 290 million in the fourth quarter.\n\nThe ‌results are the first since co-CEOs Gustav Soderstrom and Alex Norstrom took the reins from founder Daniel Ek, ‌who became executive chairman in January.\n\nIts quarterly revenue forecast of ​4.5 billion euros was slightly below the estimate of 4.57 billion euros. Fourth-quarter revenue ‌rose 7% to 4.53 billion euros, in line with estimates.\n\nSpotify raised the price of its monthly premium subscription plan by $1 to $12.99 in the U.S., Estonia and Latvia markets this year, following a similar move in more than 150 markets in 2025.\n\nCVS Health reported a decline in fourth-quarter profit on Tuesday but beat Wall Street estimates, helped by strength in its pharmacy benefit unit and strong prescription ​volume at its retail pharmacies.\n\nCVS said adjusted quarterly profit fell to $1.09 per share from $1.19, ‌above analysts' average estimate of 99 cents per share, according to data compiled by LSEG.\n\n\"I talk about a Say-Do ratio,\" said ‌Chief Financial Officer Brian Newman. \"Where we put out realistic targets and we try to deliver or exceed on expectations.\"\n\nNewman said the pharmacy business' profit had been declining annually about 5% for the past five years, but grew 5% in 2025, helped by its purchase of some assets of pharmacy Rite Aid, which filed ⁠for bankruptcy.\n\nFor 2026, the healthcare conglomerate ‌maintained a full-year adjusted profit forecast between $7.00 and $7.20 per share, unchanged from the previous quarter. Analysts expect the company to book $7.17 per share, according to LSEG data.\n\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "title": "Is Netflix's 10% Dip a Buying Opportunity or a Warning Sign?",
        "url": "https://247wallst.com/investing/2026/02/11/is-netflixs-10-dip-a-buying-opportunity-or-a-warning-sign/",
        "source": "24/7 Wall St.",
        "date": "2026-02-11T17:40:00+00:00",
        "content": "Netflix (NFLX) fell 12.32% year-to-date as EPS declined three consecutive quarters from $0.72 to $0.56.\n\nNetflix missed Q3 2025 earnings by 15.71% with $0.59 EPS versus $0.70 expected.\n\nNetflix agreed to acquire Warner Bros. for $82.7B to consolidate Game of Thrones and Harry Potter franchises.\n\nSending You to Google News in 3\n\nNetflix (NASDAQ: NFLX) opened 2026 with a prediction that it would crush the S&P 500 through 2030. Six weeks later, the stock has fallen 12.32% year-to-date to $82.21, underperforming the broader market by roughly 13 percentage points. This disconnect reflects questions about whether streaming’s growth trajectory remains intact.\n\nNetflix’s recent stumble isn’t driven purely by sentiment. The company missed earnings expectations in Q3 2025, reporting $0.59 EPS split-adjusted versus $0.70 expected, a 15.71% shortfall that broke a flawless 2024 beat streak. More concerning, EPS declined sequentially from $0.72 in Q2 2025 to $0.59 in Q3, then dipped further to $0.56 in Q1 2026. That three-quarter slide suggests operational pressure, not a one-time anomaly.\n\nCompetitive intensity is escalating. NBC invested over $8 billion in sports rights for 2026, targeting Olympics and NBA coverage to bolster Peacock against Netflix and Amazon (NASDAQ: AMZN | AMZN Price Prediction). Disney (NYSE: DIS), with its $195 billion market cap and 12.8% profit margin, continues building its streaming portfolio backed by Marvel, Pixar, and Star Wars IP. Meanwhile, Paramount Skydance raised its Warner Bros. Discovery bid to $30 per share with a $650 million sweetener, signaling aggressive M&A that could reshape the landscape.\n\nInsider activity adds caution. CFO Spencer Neumann sold 9,248 shares for $751,597 in February, while Director Reed Hastings offloaded 390,970 shares worth $32.7 million. Combined with minimal insider ownership of 0.564%, these sales suggest limited conviction at current levels.\n\nDespite near-term volatility, Netflix’s core business shows strength. The company delivered 17.6% quarterly revenue growth year-over-year and maintains a 24.3% profit margin with 42.8% return on equity. Free cash flow generation remains robust, and 86% institutional ownership reflects sustained professional confidence.\n\nThe valuation has reset significantly. Netflix now trades at a forward P/E of 26x, down from a trailing P/E of 32.49x, implying analysts expect earnings acceleration. The analyst target price of $111.43 suggests 35% upside, with 30 of 44 analysts rating the stock Buy or Strong Buy.\n\nStrategic moves bolster the bull thesis. Netflix secured UFC streaming rights after prediction markets priced its bid as the most likely among competitors, validating its sports content strategy. The company’s $82.7 billion Warner Bros. acquisition, pending shareholder approval in March 2026, would consolidate Game of Thrones and Harry Potter franchises without production costs.\n\nNetflix’s 10% dip reflects legitimate concerns about margin pressure and competitive threats, not panic selling. The stock has declined 12.32% year-to-date while trading at a forward P/E of 26x, down from a trailing P/E of 32.49x. The company maintains 17.6% quarterly revenue growth and a 24.3% profit margin. Analysts have set a target price of $111.43, representing potential upside from current levels. The stock’s beta of 1.712 means volatility will persist.\n\nOur top personal finance-related articles today. Your wallet will thank you later.\n\nNetflix (NASDAQ:NFLX) reported strong fourth quarter results that beat Wall Street estimates on revenue and earnings per share. As it…\n\nLive Updates Netflix Earnings Interview Starts in 10 Minutes Jan 20, 2026 at 4:35 PM EST Netflix’s earnings interview starts…\n\nNetflix (NASDAQ:NFLX) won the streaming wars that exploded after the pandemic, outlasting a surge of competitors to stand as the…\n\nNetflix (NASDAQ:NFLX) may be the king of streaming services in the U.S., but Netflix stock isn’t getting the royal treatment…\n\nWall Street can’t seem to stop selling Netflix (NASDAQ:NFLX) after a 631% trough-to-peak rally from mid-2022 to mid-2025. NFLX stock…\n\nIn a stunning twist in the media wars, Paramount Skydance (NASDAQ:PSKY) is gearing up to bid for Warner Bros. Discovery…\n\nNetflix (NASDAQ: NFLX) reports Q4 2025 earnings Tuesday, January 20, after the bell. After a brutal six-month selloff that’s knocked…\n\nNetflix stock fell despite an apparently good earnings report. Shareholders do not seem to be convinced about its pushing into…\n\nLive Updates Cool Inflation Report Heats Up Stock Market Dec 5, 2025 at 11:53 AM EST The U.S. Commerce Department…"
    },
    {
        "title": "Why Astera Labs Stock Is Plummeting Today",
        "url": "https://www.aol.com/articles/why-astera-labs-stock-plummeting-190121637.html",
        "source": "AOL",
        "date": "2026-02-11T21:00:00+00:00",
        "content": "Astera Labs Q4 report arrived with better-than-expected sales and earnings.\n\nThe company's forward guidance also looked pretty strong.\n\nInvestors reacted negatively to the Q4 report due to margin concerns and news that Astera's CFO is stepping into a different role.\n\n10 stocks we like better than Astera Labs ›\n\nAstera Labs (NASDAQ: ALAB) stock is selling off following the company's recent fourth-quarter report. The company's share price was down 19.7% as of 1:40 p.m. ET and had been off as much as 21.2% earlier in trading.\n\nAstera Labs published its Q4 results after the market closed yesterday and reported sales and earnings for the period that beat the average Wall Street targets. On the other hand, the company announced that its chief financial officer was resigning and issued forward guidance and commentary that raised concerns about the outlook on margins.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nAstera Labs reported non-GAAP (adjusted) earnings per share of $0.58 on revenue of $270.6 million -- a performance that came in far better than the average analyst estimates. The average Wall Street targets had called for the business to post adjusted earnings of $0.51 per share on sales of $249.55 million.\n\nThe semiconductor specialist's revenue surged nearly 92% higher year over year, and adjusted earnings per share were up roughly 57% compared to the prior-year period. It was another strong quarter for Astera Labs by most measures, but the stock is getting hit hard in response to a shakeup on the management team and fears that margins could weaken.\n\nFor the current quarter, Astera is guiding for sales between $286 million and $297 million and a gross margin of roughly 74%. Meanwhile, adjusted earnings per share are projected to come in between $0.53 and $0.54. Guidance actually came in ahead of expectations on most key fronts, but some analysts are concerns that rising sales to Amazon will cause Astera Labs' margins to contract further out.\n\nIn addition to the margin fears, news that Mike Tate is transitioning from the CFO role to become a strategic advisor to CEO Jitendra Mohan also appears to be factoring into today's sell-off. Tate will be succeeded in the CFO role by Desmond Lynch, who will step into the position on March 2. While management shakeups often result in volatility for stocks, the passage of time could wind up showing that today's bearish action was an overreaction.\n\nBefore you buy stock in Astera Labs, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Astera Labs wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $443,353!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,155,789!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 920% — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 11, 2026.\n\nKeith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon. The Motley Fool recommends Astera Labs. The Motley Fool has a disclosure policy."
    },
    {
        "title": "Live Nasdaq Composite: Stocks March Higher on Near Goldilocks Scenario",
        "url": "https://247wallst.com/investing/2026/02/11/live-nasdaq-composite-stocks-march-higher-on-near-goldilocks-scenario/",
        "source": "24/7 Wall St.",
        "date": "2026-02-11T21:18:00+00:00",
        "content": "130,000 jobs were added last month while unemployment fell to 4.3%.\n\nShopify exceeded earnings estimates on both revenue and profit.\n\nRosenblatt set a $185 price target on Datadog reflecting 43.4% upside potential.\n\nHedge fund manager Bill Ackman has made some changes to his portfolio. According to SEC filings, Ackman’s Pershing Square has added positions in Amazon (Nasdaq: AMZN), Hertz (NYSE: HTZ) and Meta Platforms (Nasdaq: META) while selling shares of Chipotle (NYSE: CMG) and Nike (NYSE: NKE).\n\nThe markets have surrendered earlier gains after coming out of the gate like gangbusters, with the Nasdaq Composite now lower by 0.15%. The Nasdaq is being dragged lower by Big Tech stocks including Microsoft  (Nasdaq: MSFT), down 2.2%, Alphabet (Nasdaq: GOOGL), down 2%, and Netflix (Nasdaq: NFLX), down 2.5% in today’s sudden sell-off.\n\nGoldman Sachs analysts are bullish on Kingsoft Cloud (Nasdaq: KC), upgrading the stock to “buy” from “neutral” on its AI positioning. The stock is soaring by 9.8% today.\n\nThis article will be updated throughout the day, so check back often for more daily updates.\n\nThe markets are seeing green across the board amid a near Goldilocks scenario in the economy. The latest jobs report reveals that conditions are neither too not nor too cold, with 130,000 jobs added last month, surpassing economist’s most bullish of estimates, while the unemployment rate edged lower to a surprising 4.3% from 4.4% month-over-month. What it means for the Fed and interest rates will depend largely on the latest inflation data, with the CPI due out at the end of the week. The Polymarket online betting platform places higher bets for a rate cut in July over June.\n\nAll three of the major stock market averages are advancing, including a 0.58% jump in the tech-heavy Nasdaq Composite. Leading the charge are Nvidia (Nasdaq: NVDA | NVDA Price Prediction), Tesla (Nasdaq: TSLA) and Micron (Nasdaq: MU), the latter of which is benefiting from bullish comments out of Wall Street analysts. Laggards today are Microsoft (Nasdaq: MSFT) and Amazon (Nasdaq; AMZN), each of which is down about 1%.\n\nHere’s a look at where things stand as of morning trading:\n\nDow Jones Industrial Average: 50,424.86 Up 253.36 (+0.50%)\nNasdaq Composite: 23,240.97 Up 138.50 (+0.58%)\nS&P 500: 6,983.66 Up 41.85 (+0.58%)\n\nShopify (Nasdaq: SHOP) stock is soaring on the heels of its earnings print. The cloud-based e-commerce platform surpassed estimates on both the top and bottom lines, signaling a resilient consumer and optimistic outlook for 2026.\n\nDatadog (Nasdaq: DDOG) also reported quarterly earnings, and the stock is climbing tktk% higher today. The company offered a bullish outlook on robust AI demand. Rosenblatt analysts reemphasized their “buy” rating on DDOG stock with a $185 price target attached, reflecting upside potential of 43.4%.\n\nBernstein analysts have reemphasized their “outperform” rating on Netflix (Nasdaq: NFLX) stock despite being challenged by Paramount and WBD, suggesting that Netflix currently holds the leverage. The stock is down 1.2% today.\n\nSending You to Google News in 3\n\nLive Updates Microsoft Boss on AI Chip Jan 26, 2026 at 12:18 PM EST Microsoft CEO Satya Nadella has posted…\n\nLive Updates Bullish on Meta Dec 4, 2025 at 11:33 AM EST Expanding on the Meta theme, Mizuho analysts reemphasized…\n\nLive Updates NOW Stock Plummets Jan 29, 2026 at 12:18 PM EST ServiceNow (NYSE: NOW) stock is sinking by 11.2%…\n\nLive Updates Amazon Capex Preview Feb 5, 2026 at 12:26 PM EST One stock with the potential to shift market…\n\nLive Updates APP Stock in Spotlight Jan 14, 2026 at 12:09 PM EST AppLovin (Nasdaq: APP) is shaving 9.5% off…\n\nLive Updates Intel Rises Jan 9, 2026 at 11:24 AM EST President Trump has continued his fascination with legacy chipmaker…\n\nLive Updates Markets Extend Gains May 2, 2025 at 3:44 PM EDT | Gerelyn Terzo Today’s tech-fueled rally has gained…\n\nLive Updates Netflix Falls Dec 3, 2025 at 12:29 PM EST Stocks have made their way into positive territory, with…\n\nLive Updates MSFT Dividend Jun 13, 2025 at 12:30 PM EDT | Gerelyn Terzo Microsoft (Nasdaq: MSFT | MSFT Price…"
    }
]