[
    {
        "title": "S&P 500 closes little changed after soft inflation report, index notches losing week: Live updates",
        "url": "https://www.cnbc.com/2026/02/12/stock-market-today-live-updates.html",
        "source": "CNBC",
        "date": "2026-02-13T14:09:00+00:00",
        "content": "The S&P 500 closed barely above the flatline on Friday as a key consumer inflation report that came in slightly lighter than expected failed to spark a substantial rally.\n\nThe broad market index added 0.05% and ended at 6,836.17, while the Nasdaq Composite fell 0.22% and closed at 22,546.67. The Dow Jones Industrial Average gained 48.95 points, or 0.10%, and settled at 49,500.93.\n\nThe Bureau of Labor Statistics reported that the consumer price index — which measures the costs for goods and services in the U.S. economy — rose 0.2% in January, reflecting a gain of 2.4% on an annualized basis. The inflation gauge was expected to show a 0.3% increase on a month-over-month basis and a 2.5% advance from a year earlier, according to economists polled by Dow Jones.\n\nWhen excluding volatile food and energy prices, core CPI came in line with expectations at 0.3% on the month and 2.5% year over year.\n\n\"This should be welcome news for markets, and the presumptive incoming Fed Chair Kevin Warsh,\" said Phil Blancato, Osaic chief market strategist. \"This is only one month's worth of data, but if the trend continues it should pave a path for lower interest rates and reined in inflation.\"\n\nInflation is also \"not unrelated\" to existing fears among investors that artificial intelligence will disrupt revenue potential in various industries, according to Keith Buchanan of Globalt Investments. While Friday's CPI print \"has nothing to do with what we're anticipating\" as far as industry disruption goes, the market is still trying to figure out what AI and its implementation throughout the economy really means, he said, noting that it's creating \"upward pressure on unemployment\" as well as \"downward pressure on inflation.\"\n\n\"How do we think that everyone was going to win and there wouldn't be a loser?\" the senior portfolio manager told CNBC.\n\nAI disruption fears rattled the market this week, spreading beyond the sell-off seen in software and into real estate, trucking and financial services. Financial stocks Charles Schwab and Morgan Stanley fell 10.8% and 4.9% this week, respectively, while software stock Workday dropped 11% in the period. Shares of commercial real estate firm CBRE lost 16% week to date.\n\nThose fears widened to the media industry as well, hitting Walt Disney and Netflix. Disney shares added about 3% on the week, while Netflix shares tumbled 6%.\n\n\"Investors show no mercy for anything seen as an AI loser. The list is growing by the day, driving divergence between new/old economy sectors and U.S./[Rest Of World] equities,\" said Barclays analyst Emmanuel Cau. \"Amid erratic price action and fears of AI disruption turning into a broader macro/credit issue, growth, rates & earnings backdrop is okay.\"\n\nThe major averages all posted declines for the week, with the S&P 500 sliding 1.4% and posting its second consecutive losing week. The Dow dropped 1.2%, and the Nasdaq notched a 2.1% decline.\n\nThe S&P 500 finished Friday's session near flat.\n\nThe broad-based index rose 0.05% to end the session at 6,836.17. The Dow Jones Industrial Average added 48.95 points, or 0.10%, to 49,500.93.\n\nThe Nasdaq Composite, however, fell 0.22% to settle at 22,546.67.\n\nCoinbase has room to run in the long-term, despite what its underwhelming fourth-quarter earnings results may suggest, according to Citizens.\n\nThe investment firm has an \"outperform\" rating on the stock, and it has a $400 price target on shares.\n\nCoinbase reported earnings of $2.49 per share for the last quarter of 2025, — a figure far below its earnings of $4.68 per share from the same quarter a year earlier. Its total revenue also came in at $1.78 billion for the fourth quarter, falling below the Street's consensus estimate of $1.81 billion. Weighing on its results was an unrealized loss of more than $700 million in Coinbase's crypto investment portfolio, fueled by a digital asset market downturn in the last three months of the year.\n\n\"Zooming out, there is not a lot to get excited about from the fourth-quarter results,\" Citizens analyst Devin Ryan said Thursday in a note to clients. \"But our long-term thesis is little changed.\"\n\nThe analyst noted that a pullback in the crypto stock could be healthy \"as it is washing out some of the excess speculation and leverage in the system\" – two factors that have nothing to do with the blockchain technology that undergirds assets like bitcoin and other Web3 offerings.\n\nThe crypto industry is in a transitory moment, Ryan added, \"moving from a speculative phase toward a more serious phase where the technology is increasingly utilized at scale, including in payments, broader asset tokenization, and a range of applications beyond finance that are still in development.\"\n\nThe analyst pointed to the proliferation of tokenized real-world assets, stablecoins and blockchain-based artificial intelligence applications as potential catalysts for Coinbase.\n\nThursday's sell-off in stocks across various sectors due to fears of artificial intelligence disruption is a sign that the market is having trouble figuring out the technology's capabilities, according to JPMorgan's market intelligence desk.\n\n\"This is a market that is dominated by AI, both positive and negative, with seemingly every sector / sub-sector taking a turn at being declared obsolete,\" JPMorgan traders wrote in a Friday note. \"The reality is, the market is struggling to understand the full scope of what AI can do ranging from impressive audio / video features to less impressive usage in consumer services, e.g. changing a flight.\"\n\n\"We think it makes sense to refocus on macro fundamentals where the US is throwing off mixed signals,\" they added.\n\nShares of several gaming stocks dropped this week on artificial intelligence disruption fears, adding to the carnage across several sectors of the market.\n\nThe recent rollout of Google's Project Genie, an interactive AI world generator capable of responding to real-time user interaction, has sparked concerns about the demand for traditional gaming businesses and digital experiences platforms. Big videogame stocks are already being hit, even though the tool remains in early stages and is being rolled out to Google AI Ultra subscribers in the U.S.\n\nShares of Unity Software plunged 25% this week, bringing its year to date loss to more than 57%. Take-Two Interactive Software, down just 1.9% this week, has lost 25% year to date.\n\nGaming giants AppLovin lost 8.3% and Roblox shed around 5% this week, respectively. The stocks are down 42% and 22% this year, respectively.\n\nMaplebear, the parent company of grocery delivery platform Instacart, saw shares surge 7% on Friday after issuing an optimistic forecast for its current quarter. The stock was pacing for its best day since May 2, 2025, when it gained 13.6%.\n\nFor the first quarter, Maplebear expects gross transaction value in the range of $10.13 billion to $10.28 billion, surpassing a $9.97 billion estimate from StreetAccount. The company also guided for EBITDA coming in between $280 million and $290 million, surpassing the $277 forecast.\n\nMeanwhile, Maplebear posted a bottom-line beat for its last quarter, with revenue coming in at $992 million versus estimates of $974 million from LSEG. On the other hand, the company's earnings of 30 cents per share came in below the expected 52 cents.\n\nOn Friday, 24 stocks in the S&P 500 traded at new 52-week highs.\n\nOf these names, 13 tickers reached new all-time highs. Stocks that hit this milestone included:\n\nThe four stocks trading at new 52-week lows on Friday were:\n\nVenezuela's oil sales will not be deposited in an account in Qatar anymore, Energy Secretary Chris Wright told NBC News in an interview this week.\n\n\"An account was set up in Qatar, controlled by the U.S. government the whole time, to land that money in and then send the money from there down to Venezuela,\" Wright told NBC News on Thursday.\n\n\"Now we have an account at the U.S. Treasury. The money won't go to Qatar anymore,\" the energy secretary said.\n\nWright said revenue from Venezuela oil sales now tops $1 billion. He said money was initially put in the Qatar account to prevent creditors from claiming the funds.\n\nPinterest shares plunged 18% on Friday, deepening the social media company's loss after its fourth-quarter earnings miss and disappointing guidance. The move brings the stock's loss this week to about 23% and year to date loss to more than 41.5%.\n\nPinterest CEO Bill Ready said the company \"absorbed an exogenous shock this year related to tariffs\" that impacted its advertising spend. This week's drop mark the second-straight quarter in which Pinterest has shed a fifth of its value on the back of weak results.\n\nJPMorgan, Citi and Bank of America downgraded Pinterest shares after its latest quarterly performance.\n\nFor Bank of America analyst Justin Post, tariffs will be a much smaller problem for Pinterest to tackle compared to ramping competition from artificial intelligence leaders.\n\n\"Our thesis that improving engagement and the ramp of Performance+ would translate into betterperformance has not played out,\" Post wrote in a Friday note to clients. \"While tariffs are a bigger headwind for Pinterest vs peers, AI driven ROAS improvements at larger platforms appear to be impacting Pinterest's ability to capture incremental ad budgets. Tariff headwinds will lap in 3Q, but we expect AI driven competitors (Google, OpenAI soon) to be increasingly competitive.\"\n\nAmazon remained in bear market territory Friday after moving more than 20% below its 52-week-high on Thursday.\n\nSince the stock hit $258.60 in November, it had an initial drawdown below $220 during a rout in tech stocks in the same month, but then rebounded and held steady under its highs. But Amazon took a leg lower last week after an earnings miss, and then continued to fall further amid a broader rotation out of tech stocks.\n\nAmazon was 0.5% in midday trading Friday, and down more than 4% for the week.\n\nAnalysts believe this week's AI-induced sell-off in freight stocks has left behind one strong buying opportunity: transportation company C.H. Robinson Worldwide.\n\nLeading trucking and logistics stocks including C.H. Robinson, RXO, XPO and J.B. Hunt Transportation Services plunged Thursday on fears that a new tool from AI company Algorhythm Holdings could slash major freight inefficiencies, leading to less demand for the industry's services.\n\nJPMorgan, Barclays and Stifel analysts wrote in note to clients this week that they're sticking by C.H. Robinson, however, particularly given the company's strength in AI. C.H. Robinson has unveiled more than two dozen AI agents to manage its full shipment lifecycle, which has led to task automation, workload reduction and productivity gains.\n\nBarclays analyst Brandon R. Oglenski said he sees the weakness as a buying opportunity for C.H. Robinson, which he has an overweight rating on. Shares of C.H. Robinson are down about 13% week to date.\n\n\"Quite the contrary, we see C.H. Robinson as the AI disrupter within the US truck brokerage market and global air and ocean freight forwarding. We see the moves in asset-light transportation stocks as disproportionate to the risk,\" Oglenski wrote in a Thursday note to clients.\n\nJPMorgan analyst Brian P. Ossenbeck similarly highlighted that \"CHRW has a differentiated model and this did not change overnight.\"\n\n\"We believe Robinson's unrivaled data and deep customer connections are competitive advantages which are very difficult to replicate while the lean operating model allows the company to quickly adjust to and adopt new tools and technology,\" Ossenbeck wrote in a Friday note. He added that he does not expect the overhang to dissipate quickly, however. given the market's knee-jerk responses to AI threats.\n\nDollar Tree shares' surge of 73% in the past year may mean its valuation has lost touch with the company's fundamentals, BMO Capital Markets explained in a Friday note.\n\nThe bank downgraded its rating of the stock to underperform from market perform, with a price target of $95, indicating a 26% loss from Thursday's close. Through its surging stock, Dollar Tree now finds itself too highly valued and with lofty earnings expectations that BMO thinks it can't meet.\n\n\"DLTR shares are trading at ~19x consensus EPS for 2026/F27 which calls for +16% YoY EPS growth, as outlined at the company's Oct 2025 Analyst day,\" wrote analyst Kelly Bania. \"We believe this is a very generous valuation to apply to a retailer that: 1) lacks investment in e-commerce, digital and retail media; and 2) carries risk of missing its EBIT margin expansion targets.\"\n\nBania added that lack of a digital strategy could become visible in 2026 after price-driven boosts to revenues as the company managed tariff headwinds.\n\nThe three major averages began Friday's session little changed.\n\nThe S&P 500 traded around the flatline, along with the Nasdaq Composite. The Dow Jones Industrial Average was also flat.\n\nHere are some stocks making moves before the bell:\n\nConsumer prices rose less than expected in January on an annual basis, according to a Bureau of Labor Statistics report Friday.\n\nThe consumer price index, a broad measure of goods and services costs across the U.S. economy, rose 2.4% in January from a year ago. Economists surveyed by Dow Jones had been looking for a reading of  2.5%.\n\nExcluding food and energy, however, the core reading was in line with estimates at a 2.5% increase.\n\nDeutsche Bank believes that AI-enabled search enhancements could strengthen the long-term outlook for Airbnb.\n\nThe bank upgraded the short-term vacation rental marketplace to a buy rating from hold. Analyst Lee Horowitz also hiked his price target to $154 from $128.\n\nShares of Airbnb have dipped 18% over the past 12 months and are down 15% on the year. Horowitz's updated forecast implies an additional 33% upside ahead.\n\nCNBC Pro subscribers can read more here.\n\nInvestors got some good news this week on the state of the labor market, and more may be on the way Friday on inflation.\n\nThe consumer price index, a broad measure of goods and services costs across the U.S. economy, is expected to show a 2.5% gain from a year ago, according to the Dow Jones consensus forecast for the January release.\n\nIf that ends up being accurate, it would bring the widely cited inflation gauge back to its May 2025 level — a month after President Donald Trump enacted his \"liberation day\" tariffs, which many economists thought would send prices spiraling higher.\n\nThe headline, or all-items, CPI was at 2.7% in December and has been on a downward trajectory since peaking just above 3% in September. Excluding food and energy, core CPI stood at 2.6% in December. Both gauges are expected to show 0.3% monthly increases in January. Read more.\n\nInvestors have historically sought stability in the U.S. dollar, Japanese yen and Swiss franc during times of turmoil. But as these currencies have themselves experienced volatility over the past year, the tide may now be turning as investors rethink their safe haven positions.\n\nIn Europe, regional indices were mixed on Friday as investors monitored Thursday's AI-driven sell-off in the U.S., with the U.K.'s FTSE 100 leading the way, as the pan-European Stoxx 600 index oscillated above and below the flatline.\n\nFrench aerospace firm Safran topped the benchmark with a 7% gain following a positive quarterly earnings report.\n\nArtificial intelligence is driving exponential capital expenditure growth, with just the top hyperscalers expecting to spend 70% more this year than they did last year.\n\nRecent earnings reports from Amazon, Alphabet, Meta and Microsoft revealed planned capex of more than $600 billion combined this year. In 2025, these four companies invested just over $350 billion.\n\nPaul Meeks, head of technology research at Freedom Capital Markets, said that while more bearish investors believe that spending will collapse after this year, he sees it plateauing or growing more slowly from here.\n\n\"These guys will not make an announcement for their '26 capital spending and then during the year, change their mind and pull it back,\" he told CNBC. \"I've talked to the management teams of all the hyperscalers, and they see this as a real competitive advantage for them to be early with the heavy spending.\"\n\nInvestor Ken Mahoney noted that not all tech titans are putting their money where it matters the most. \"We're just seeing that there's no guardrails. Feels like companies are just spending and spending and spending, and hope on the other side they come in first place,\" the CEO of Mahoney Asset Management said in an interview.\n\nMore in CNBC Pro here on how to play this spending boom.\n\nCheck out the companies making headlines in after-hours trading.\n\nShortly after 6 p.m. ET on Thursday, futures tied to the S&P 500 and Nasdaq-100 futures added 0.1% and 0.24%, respectively. Futures tied to the Dow Jones Industrial Average added 17 points, or less than 0.1%."
    },
    {
        "title": "Nasdaq 100 and S&P500: Inflation Relief Fails to Lift Tech Stocks Much in US Stock Market Today",
        "url": "https://www.fxempire.com/forecasts/article/nasdaq-100-and-sp500-inflation-relief-fails-to-lift-tech-stocks-much-in-us-stock-market-today-1579494",
        "source": "FX Empire",
        "date": "2026-02-13T17:11:00+00:00",
        "content": "The major U.S. stock indexes are a mixed bag on Friday with the blue chip Dow and benchmark S&P 500 showing modest gains while the tech-weighted Nasdaq struggles to find its footing. Investors could still be reeling from yesterday’s steep sell-off, because in my opinion, the reaction to cooler-than-expected should’ve been a little more bullish.\n\nThe U.S. Bureau of Labor Statistics (BLS) said shortly before the opening that consumer inflation rose 0.2% in January, producing a yearly gain of 2.4%. Both figures came in below the consensus estimate. Core CPI met expectations.\n\nBut what does it mean for stocks? Probably more of a relief than a bullish or bearish outlook. I think investors took the inflation data in stride. Basically, it shows it’s headed in the right direction, but still higher than the Fed’s 2.0% mandate. It does give the Fed some breathing room, however, after Wednesday hot jobs report. Although it likely means Fed policy expectations are going nowhere, I think it does give the central bank a dovish tilt even though there are enough member hawks to prevent a rate cut at this time.\n\nToday’s inflation data may have served as a distraction ahead of a losing weekly close as investors remain rattled by artificial intelligence and its potential disruption of business models and employment. What started as a sell-off in software stocks has now spread into real estate, trucking, and financial services. CNBC reported that financial stocks like Charles Schwab and Morgan Stanley have dropped 10% and 6% respectively this week. Software company Workday is sharply lower this week and commercial real estate firm CBRE has cratered double-digits week to date.\n\nThe fear of contagion into other sectors and subsectors has media stock investors on edge. Walt Disney is down 3% this week and Netflix is off by 7%, suggesting the selling pressure could continue into next week. In my opinion this could turn out to be a major problem because with earnings season over, investors will have nothing to fall back on.\n\nI think it’s easy to say “let’s sell that stock because it’s AI-related” but it goes beyond that. With all the money being pumped into AI, credit issues can develop too and that would be a major concern for banking and the broad-based financial markets.\n\nLooking at the S&P 500 Index (SPX), I see issues with the 50-day moving average, currently at 6895.19. The market has shown the importance of this indicator at least four times since late November with investors getting a little complacent with “buy the dip” when it breaks through it. Well, that trading style will only work for so long before it fails and traders start searching for real value at the 200-day moving average at 6404.87, for example.\n\nContinue to respect the 50-day which is now resistance, but if any buy attempts are rejected repeatedly then the index could start moving decisively down toward the 200-day.\n\nMore Information in our Economic Calendar.\n\nJames Hyerczyk is a U.S. based seasoned technical analyst and educator with over 40 years of experience in market analysis and trading, specializing in chart patterns and price movement. He is the author of two books on technical analysis and has a background in both futures and stock markets.\n\nNASDAQ Index, SP500, Dow Jones Forecasts – NASDAQ Moves Higher As Inflation Rate Drops To 2.4%\n\nGold (XAU/USD) Price Forecast: Strength Emerging Above Key Support\n\nNatural Gas Price Forecast: Oversold Levels Suggest Potential Rally\n\nUS Dollar Forecast: DXY Struggles for Direction After Hot Jobs Report, Soft CPI\n\nNatural Gas, WTI Oil, Brent Oil Forecasts – Oil Rebounds From Session Lows As Trump Puts More Pressure On Iran"
    },
    {
        "title": "Chipotle's CEO Just Admitted the Company Is Staring at a $28 Billion Opportunity",
        "url": "https://www.aol.com/articles/chipotles-ceo-just-admitted-company-022500731.html",
        "source": "AOL",
        "date": "2026-02-13T09:25:00+00:00",
        "content": "Weak foot traffic pressured the company’s sales in 2025.\n\nChipotle's long-term growth profile looks compelling, with huge potential to increase revenue.\n\nWith the valuation multiple coming down sharply in recent years, this opportunity is interesting.\n\n10 stocks we like better than Chipotle Mexican Grill ›\n\nShares of Chipotle Mexican Grill (NYSE: CMG) have been on a volatile run. As of Feb. 10, they trade 42% off their peak. But they have climbed 29% in the past three months.\n\nThe business exceeded analyst estimates for revenue and earnings per share in last year's fourth quarter (ended Dec. 31). However, foot traffic declined in every single quarter of 2025 -- not an encouraging sign.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nInvestors must maintain a long-term focus. That's because the consumer discretionary stock's CEO just admitted that the company is staring at a $28 billion opportunity.\n\nScott Boatwright, who has been in Chipotle's top job since late 2024, after Brian Niccol left to go to Starbucks, provided upbeat commentary about the company's future. \"We still have confidence in the long-term algorithm of getting to $4 million annual unit volumes (AUVs) and approaching 30% margins,\" he said on the Q4 2025 earnings call.\n\nIn Q4, Chipotle generated AUVs of $3.1 million. This figure represents yearly sales at each company-owned location.\n\nThe business currently has 4,042 company-owned stores. But Boatwright also reiterated a target of 7,000 restaurants open in North America one day. By doing some simple math, we can figure out that this outlook implies $28 billion in revenue potential for the leader in Tex-Mex dining. Not including stores in other markets, that's 135% higher than what the company collected in 2025.\n\nIt's understandable if investors aren't so high on Chipotle these days. It just wrapped up a disappointing year. Lower-income and younger consumers are pulling back their spending, which is clearly having a negative impact.\n\nBut Chipotle's leadership team is optimistic. They opened 334 new locations in 2025. The goal is to open 350 to 370 in 2026. Many are being built with Chipotlane drive-through setups, which boost sales, margins, and returns. Throw in ongoing investments in supply chain and tech initiatives, and higher AUVs with improving restaurant-level margins are in play.\n\nSince the COVID-19 pandemic hit almost six years ago, Chipotle has been able to continue growing its store base, revenue, and profits. This impressive trajectory happened during a period of multiple macrorelated developments. Besides the health crisis, there was inflation, rising interest rates, tariff announcements, and weaker consumer confidence last year. Chipotle's ability to navigate the headwinds should give investors confidence in its long-term prospects.\n\nShares aren't as expensive as they used to be. The current price-to-earnings ratio of 34.4 is 72% cheaper than what it was exactly five years ago. I believe this is an interesting opportunity for investors to add an industry-leading company to their portfolios while it's on the dip.\n\nBefore you buy stock in Chipotle Mexican Grill, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Chipotle Mexican Grill wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $429,385!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,165,045!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 913% — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 12, 2026.\n\nNeil Patel has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Chipotle Mexican Grill and Starbucks. The Motley Fool recommends the following options: short March 2026 $42.50 calls on Chipotle Mexican Grill. The Motley Fool has a disclosure policy."
    },
    {
        "title": "Roku stock surges on earnings beat, record quarter for premium subscriptions",
        "url": "https://www.cnbc.com/2026/02/13/roku-stock-earnings-premium-subscriptions.html",
        "source": "CNBC",
        "date": "2026-02-13T14:20:00+00:00",
        "content": "Shares of Roku jumped 8% on Friday after the video streaming company posted fourth-quarter results that trounced analysts' expectations and offered strong guidance.\n\nHere's how the company did based on analysts' estimates compiled by LSEG:\n\n\"The biggest driver of our subscriptions business is just the secular trend of more and more services moving into a service like premium subscriptions instead of just doing their own app,\" Roku CEO Anthony Wood told CNBC's Julia Boorstin on Friday. \"That's really, I think, the core driver.\"\n\nRoku executives said in their shareholder letter that the fourth quarter was the \"biggest quarter ever\" for net adds to premium subscriptions. The program lets users subscribe to different streaming services, like HBO Max and Paramount+, using a single login on the Roku platform.\n\nThe company said it expects to roll out premium subscription bundles this year.\n\nRevenue grew 18% from $1.03 billion a year ago. Net income totaled $80.5 million, or 53 cents per share, compared with a loss of $35.5 million, or 24 cents a share, one year earlier.\n\nFor the current period, Roku said it expects to report $1.2 billion in revenue, which is higher than the $1.16 billion expected by analysts, according to StreetAccount. It also projected full-year revenue of $5.5 billion, surpassing analyst estimates of $5.34 billion, according to StreetAccount.\n\nLast May, Roku acquired Frndly, a live TV subscription streaming service, for $185 million. The company also recently launched an ad-free streaming service, called Howdy, that costs $2.99 a month.\n\nWood told investors on the company's earnings call that Howdy has the potential to become a \"very large service\" over time. Roku also said it's on track to surpass 100 million streaming households this year.\n\nAnalysts at Rosenblatt Securities on Friday upgraded Roku's stock to buy from neutral, citing the strong fourth-quarter results and several potential growth levers for the company in the near term.\n\n\"Big picture — Roku has built a formidable gatekeeper presence for U.S. streaming — half of all streaming in the U.S. on TVs goes through their devices,\" the analysts wrote.\n\nRosenblatt noted the improved ability to monetize streaming with its partnership with Amazon, a new ad tool for small and mid-sized businesses and tweaks made to the front page for advanced ads.\n\nCorrection: Roku reported fourth-quarter earnings of 53 cents per share. An earlier version mischaracterized the figure."
    }
]