[
    {
        "title": "Stock Market Today, Feb. 11: Ford Rises After 2026 Profit Outlook Offsets Record EV Losses",
        "url": "https://finance.yahoo.com/news/stock-market-today-feb-11-220127663.html",
        "source": "Yahoo Finance",
        "date": "2026-02-11T23:43:00+00:00",
        "content": "Ford Motor Company (NYSE:F), a global maker of automobiles and commercial vehicles, closed Wednesday at $13.85, up about 2.1%. The stock moved higher as investors emphasized record 2025 revenue, 2026 EBIT guidance, and cost-cutting plans over Ford’s large EV-driven losses, and they are watching execution on the reshaped EV and hybrid strategy next.Trading volume reached 125.4 million shares, coming in about 113% above compared with its three-month average of 58.8 million shares. Ford Motor Company IPO'd in 1972 and has grown 538% since going public.\n\nS&P 500 (SNPINDEX:^GSPC) closed virtually unchanged at 6,941, while the Nasdaq Composite (NASDAQINDEX:^IXIC) fell 0.16% to finish the session at 23,066. Among automotive rivals, General Motors (NYSE:GM) closed at $79.82, down 0.56%, while Stellantis (NYSE:STLA) ended at $7.62, gaining 1.87% as investors reassessed sector-wide EV losses.\n\nFord stock outpaced peers today after investors ultimately looked beyond a weak Q4 2025 and toward a better 2026. Impairments taken against its electric vehicle (EV) assets, tariff costs, and supply issues drove an approximately $8.2 billion full-year loss for the automaker.\n\nManagement is forecasting adjusted 2026 earnings before interest and taxes (EBIT) to come in between $8 billion and $10 billion, however, meeting or exceeding most most estimates.\n\nA strategic pivot away from purely electric offerings toward hybrid vehicles that have become more popular with consumers is pleasing investors. Management’s focus on profitable growth seems to be what investors wanted to see, helping to drive today’s trading volume and share price.\n\nBefore you buy stock in Ford Motor Company, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Ford Motor Company wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $443,353!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,155,789!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 920% — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 11, 2026.\n\nHoward Smith has no position in any of the stocks mentioned. The Motley Fool recommends General Motors and Stellantis. The Motley Fool has a disclosure policy.\n\nStock Market Today, Feb. 11: Ford Rises After 2026 Profit Outlook Offsets Record EV Losses was originally published by The Motley Fool"
    },
    {
        "title": "lastminute.com N.V. (LSMNF) Q4 2025 Earnings Call Transcript",
        "url": "https://seekingalpha.com/article/4869739-lastminute-com-n-v-lsmnf-q4-2025-earnings-call-transcript",
        "source": "Seeking Alpha",
        "date": "2026-02-12T20:03:00+00:00",
        "content": "lastminute.com N.V. (LSMNF) Q4 2025 Earnings Call February 12, 2026 4:00 AM EST\n\nJulia Weinhart - Head of Investor RelationsAlessandro Petazzi - Executive Director & CEODiego Fiorentini - Chief Financial Officer\n\nVolker Bosse - Baader-Helvea Equity Research\n\nGood morning, and welcome to the lastminute.com Q4 and Preliminary Unaudited Full Year 2025 Financial Results Conference Call. Today's call will be hosted by Julia Weinhart, Head of Investor Relations, and joined by Alessandro Petazzi, Chief Executive Officer; and Diego Fiorentini, Chief Financial Officer. [Operator Instructions] Please note that this call is being recorded.\n\nAt this time, I'd like to turn the call over to Julia, Head of Investor Relations. Please go ahead.\n\nJulia WeinhartHead of Investor Relations\n\nThank you, Valentina. Good morning, everyone, and thank you for joining us for our Investor Relations call this morning. We value your continued support and are pleased to present our latest developments. After the presentation, we will be happy to address your questions.\n\nWith that, I hand over to Alessandro now.\n\nAlessandro PetazziExecutive Director & CEO\n\nThank you. Thank you, Julia. Thank you, everyone. Good morning. Thanks for joining us. We have a lot of positive ground to cover today. We're commenting today the final quarter, but also the preliminary unaudited full year results. And I think you've come to know me throughout this year as we complete my first year as CEO of the company. And you probably know that I normally do not like to be blowing my own trumpet, but it is a real pleasure indeed to be presenting such a strong set of results, I would say, quite exceptional, to be honest.\n\nIf you follow our industry closely, you know that the period from October to December is the lowest from"
    },
    {
        "title": "The AI Sell-Off Created a Rare Buying Opportunity in These 2 Stocks",
        "url": "https://www.aol.com/articles/ai-sell-off-created-rare-183500883.html",
        "source": "AOL",
        "date": "2026-02-12T20:35:00+00:00",
        "content": "Microsoft is delivering strong cloud growth.\n\nNvidia is set to benefit from all of the massive artificial intelligence (AI) spending going on.\n\n10 stocks we like better than Microsoft ›\n\nVery rarely do some artificial intelligence (AI) stocks go on sale. However, there are excellent buying opportunities right now that investors shouldn't miss. At the top of my shopping list are two solid AI stocks that will be OK, even if the market is a bit bearish on them right now.\n\nThese two stocks are Microsoft (NASDAQ: MSFT) and Nvidia (NASDAQ: NVDA). Each has been an incredible long-term investment, but they are trading significantly off of their all-time highs right now. With Microsoft down 23% and Nvidia down 9%, now is a perfect buying opportunity for both stocks.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nMicrosoft is well-positioned to take advantage of generative AI developments. Its software is used by practically every business worldwide and will remain a dominant force in that realm even after all the generative AI innovations have wrapped up.\n\nAnother way Microsoft will benefit from the AI buildout is its cloud computing platform, Azure. Azure is one of the top options for building an AI product, as it provides access to several leading generative AI models. This has led to strong growth, with Azure's revenue rising 39% year over year in Q2 FY 2026 (ending Dec. 31).\n\nThis is the crown jewel of Microsoft's empire and helped power the company to 17% revenue growth and 23% net income growth on a non-GAAP (generally accepted accounting principles) basis; GAAP results are skewed from an OpenAI investment.\n\nIt's rare to see a company as large as Microsoft deliver such impressive results, but that's exactly what it does quarter after quarter. Yet, the market threw a temper tantrum and sold off the stock following its earnings.\n\nI think it's a rare buying opportunity for one of the best stocks on the market, and investors should use the weakness to load up on Microsoft, as the stock hasn't traded at a valuation this low since the 2023 market sell-off.\n\nIf you thought Microsoft's results were impressive for its size, wait until you see Nvidia's. Nvidia is one of the primary beneficiaries of all of the AI spending, as its graphics processing units (GPUs) are the primary computing units deployed by most AI hyperscalers to rent out to clients. Nvidia's technology has become the industry standard, and it will be hard to dethrone it.\n\nThis is reflected in Nvidia's growth outlook, as Wall Street analysts expect 53% revenue growth this next year. For the world's largest company by market cap to be growing its revenue at a 50% or greater pace is nothing short of incredible. If AI demand lasts through 2030, as Nvidia and several others project it will, the party will just be getting started with Nvidia's stock.\n\nDespite a bullish five-year outlook, a leadership position in one of the biggest technological revolutions mankind has ever experienced, and incredible execution, the market still isn't giving Nvidia a premium valuation. It trades for 24 times forward earnings, which is hardly a premium on the S&P 500, which trades for 21.8 times forward earnings.\n\nNVDA PE Ratio (Forward) data by YCharts\n\nNvidia is growing at a far faster rate than the market typically does, so this small premium seems like an absolute bargain. If AI spending continues to rise, as many expect, there will be few better stocks to own than Nvidia. I'm confident we haven't seen the last of unreal AI spending, and Nvidia will be well-positioned to thrive in the coming years and capitalize on it.\n\nThe market rarely gives investors the opportunity to buy Nvidia and Microsoft stock on sale. Investors shouldn't wait for a lower price, as these are among the best prices I've seen in years on them. The time to take action is now, as the market could snap back to reasonable levels in days.\n\nBefore you buy stock in Microsoft, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Microsoft wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $429,385!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,165,045!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 913% — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 12, 2026.\n\nKeithen Drury has positions in Microsoft and Nvidia. The Motley Fool has positions in and recommends Microsoft and Nvidia. The Motley Fool has a disclosure policy."
    },
    {
        "title": "Stock Market Today, Feb. 11: Micron Technology Rallies as AI Data Center Expansion Reinforces AI Revenue Visibility",
        "url": "https://finance.yahoo.com/news/stock-market-today-feb-11-221809774.html?fr=sycsrp_catchall",
        "source": "Yahoo Finance",
        "date": "2026-02-11T23:45:00+00:00",
        "content": "Micron Technology (NASDAQ:MU), a memory and storage chip maker, closed Wednesday at $410.34, up 9.94%. The stock jumped after bullish analyst commentary on high‑bandwidth memory demand, an upgraded Street‑high price target, and strong recent results. Investors are watching Micron’s fiscal 2026 HBM ramp and AI‑driven earnings power.\n\nThe company’s trading volume reached 47.4 million shares, which is 47% above compared with its three-month average of 32.2 million shares. Micron Technology went public in 1984 and has grown 29002% since its IPO.\n\nThe S&P 500 (SNPINDEX: ^GSPC) slipped 0.03% to 6,941, while the Nasdaq Composite (NASDAQINDEX: ^IXIC) fell 0.16% to 23,066. Among semiconductors, Western Digital (NASDAQ:WDC) closed at $273.74 (+4.26%) and Seagate Technology Plc (NASDAQ:STX) finished at $407.25 (+2.78%), as investors continue to favor storage names tied to AI infrastructure demand.\n\nMicron Technology shares climbed on Wednesday after bullish commentary on high-bandwidth memory demand reinforced the company’s role in AI infrastructure. Recent coverage noted that Micron has already sold out its fiscal 2026 HBM supply and expects the HBM market to expand from roughly $35 billion in 2025 to as much as $100 billion by 2028. That outlook strengthened the case for multi-year revenue visibility tied to AI server deployments.\n\nThe move was boosted by an analyst upgrade that set a Street-high $600 price target, following strong fiscal first-quarter results marked by rising revenue and expanding margins. Despite substantial gains over the past year, some analysts believe Micron’s valuation does not yet reflect its AI-driven growth potential. The company is making significant long-term investments, including a $100 billion commitment to a New York megafab and additional projects in Singapore and Taiwan. Investors will continue to monitor whether Micron can convert sold-out HBM supply into sustained margin expansion as AI infrastructure spending accelerates.\n\nBefore you buy stock in Micron Technology, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Micron Technology wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $443,353!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,155,789!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 920% — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 11, 2026.\n\nEric Trie has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Micron Technology and Western Digital. The Motley Fool has a disclosure policy.\n\nStock Market Today, Feb. 11: Micron Technology Rallies as AI Data Center Expansion Reinforces AI Revenue Visibility was originally published by The Motley Fool"
    },
    {
        "title": "3 Key Updates Apple Just Gave Investors",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/INTC/pressreleases/176970/3-key-updates-apple-just-gave-investors/",
        "source": "The Globe and Mail",
        "date": "2026-02-12T04:35:00+00:00",
        "content": "The iPhone continues to impress users, who are buying it at a fast rate.\n\nThe company's costs are on the rise.\n\nThere should be a lot of progress in Apple Intelligence this year.\n\nAlthough most of the big-tech stocks faltered last week after the companies announced huge increases in artificial intelligence (AI) spending, Apple(NASDAQ: AAPL) is keeping its gains since its own phenomenal earnings report.\n\nAfter ignoring the company for much of 2025 due to its falling behind in AI, the market is finally embracing its other excellent qualities as well as expectations for improvements in AI this year.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nHere are three updates Apple just gave investors that you should note.\n\nProbably the most fantastic part of the report on fiscal 2026 first quarter (ended Dec. 27) was that iPhone sales increased 23% year over year. That's an incredible rise considering the base number, and it means that Apple's users are loyal and engaged.\n\nThere was record demand across global markets, so much so that it was constrained by supply. And it's not just the current users who are upgrading; the iPhone installed base reached record levels in the first quarter, implying there are plenty of new users, too.\n\nThe market has been concerned about the company not keeping up with advancements at large in AI, but CEO Tim Cook mentioned the Apple 17's long battery life, advanced camera, and design as attractions for the device's fans. The market wasn't giving these other qualities enough weight, but it's starting to change its tune.\n\nAll hyperscalers are raising their capital expenditures this year, and they're all competing for scarce resources on the AI supply chain. Apple isn't the largest or most important AI company, and it may be losing some leverage to other tech companies. Cook said that the price of memory is \"increasing significantly,\" and so his company is looking into many options.\n\nIn the first quarter, Apple reported an impressive 48.2% gross margin, and management is guiding for 48% to 49% for the second quarter. However, it didn't provide a full-year outlook, and management hinted that there may be pressure on the horizon.\n\nAlthough fans are enjoying the non-AI capabilities, the company has made recent strong progress in Apple intelligence. Cook said that users are enjoying the visual AI they interact with on the iPhone screen, including live translation and quick searches. The company recently announced that it's teaming with Alphabet to use its large language models to drive its own AI platform, and it's going to launch a revamped Siri later this year.\n\nCook didn't elaborate on the Apple Intelligence upgrades, but he said that the company is \"integrating it across the operating system in a personal and private way.\" Rather than release individual AI services, it plans to embed the features in the broader platform and monetize it by adding value to its device and ecosystem.\n\nLook for improvements in Apple Intelligence this year, and for the market to celebrate them.\n\nBefore you buy stock in Apple, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $443,353!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,155,789!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 920% — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 12, 2026.\n\nJennifer Saibil has positions in Apple. The Motley Fool has positions in and recommends Alphabet and Apple. The Motley Fool has a disclosure policy.\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    }
]