[
    {
        "title": "SBI shares jump over 6% on robust Q3; overtakes ICICI Bank as India's 2nd most valued bank",
        "url": "https://www.fortuneindia.com/markets/sbi-shares-jump-over-6-on-robust-q3-overtakes-icici-bank-as-indias-2nd-most-valued-bank/130224",
        "source": "Fortune India",
        "date": "2026-02-09T04:56:00+00:00",
        "content": "Shares of \n                    State Bank of India (SBI)\n                   surged more than 6% in early trade today as investors cheered its robust December quarter earnings, which was better than street expectations. Driven by strong rally, the public sector bank has overtaken \n                    ICICI Bank\n                   to become India’s second most valuable listed bank by market capitalisation.\n\nBoosted by its strong Q3 performance, SBI shares climbed as much as 6.6% to touch a fresh 52-week high of ₹1,136.85 on the BSE. The counter saw spurt in volume as over 7 lakh shares changed hands over the counter in the opening deals, compared with two-week average of 6.86 lakh stocks, taking its market capitalisation (m-cap) to ₹10.46 lakh crore.\n\nOn the other hand, ICICI Bank shares were down 0.32% at ₹1,402.10, with a m-cap of ₹10.02 lakh crore.\n\nHDFC Bank\n                   retained its position as India’s most valued bank, with a market valuation of over ₹14.48 lakh crore, despite the stock trading marginally lower. HDFC Bank shares were down 0.03% at ₹940.85 on the BSE.\n\nNetflix, which has been in India for a decade, has successfully struck a balance between high-class premium content and pricing that attracts a range of customers. Find out how the U.S. streaming giant evolved in India, plus an exclusive interview with CEO Ted Sarandos. Also read about the Best Investments for 2026, and how rising growth and easing inflation will come in handy for finance minister Nirmala Sitharaman as she prepares Budget 2026.\n\nMeanwhile, Indian equity market saw positive opening today, with benchmarks – Sensex and Nifty – rising up to 0.45% in early trade.\n\nEarly today, SBI shares opened 5% higher at 1120, after ending 0.65% lower at 1066.40 on the BSE on Friday. Paring previous session losses, the PSU bank rallied over 6%, rebounding 67% from its 52-week low of ₹679.65 touched on March 3, 2025.\n\nThe PSU bank has added 37% in the past six months and 14.5% in the calendar year 2026.\n\nTechnically, SBI’s price action points to a strong bullish trend, with the stock trading firmly above all key moving averages. The counter is placed above its short-term 5-day and 20-day averages, as well as the medium- and long-term 50-day, 100-day and 200-day moving averages, underscoring sustained positive momentum and strong underlying trend strength, as per Markets Mojo, a stock market research platform.\n\nThe bank posted a strong set of numbers for the December quarter of FY26, with standalone net profit rising 24.5% year-on-year to ₹21,028 crore, compared with ₹16,891 crore in the corresponding quarter last year. The growth was supported by steady expansion in core earnings. Net interest income (NII) grew 9% YoY to ₹45,190 crore, up from ₹41,445 crore a year ago.\n\nThe country’s largest lender also reported a sequential improvement in asset quality during the quarter. The gross NPA ratio improved to 1.57%, compared with 1.73% in the preceding quarter, while the net NPA ratio moderated to 0.39% from 0.42% in Q2 FY26. Provisions fell to ₹4,506 crore during the quarter, lower than ₹5,400 crore in Q2 FY26 and significantly below the level seen a year earlier.\n\nBrokerages remained positive on State Bank of India following its strong Q3 performance, citing diversified growth drivers, resilient margins amid deposit pressures, and industry-leading asset quality, while several raised their target prices on improved earnings visibility.\n\nMotilal Oswal said SBI delivered a strong all-round performance, led by healthy business growth, stable-to-improving margins and benign asset quality trends. It reiterated its ‘BUY’ call and raised its target price to ₹1,300, factoring in higher earnings estimates and the value of subsidiaries.\n\nThe brokerage pointed to steady net interest margins of around 3%, robust fee income, and controlled operating costs, with the cost-to-income ratio expected to hover near 50%.\n\nJM Financial said SBI’s strong and diversified growth profile, stable margins despite deposit competition, superior asset quality and sizeable provision buffers underpin its improving earnings outlook and balance-sheet strength. It maintained a BUY rating and raised its target price to ₹1,250, valuing the core bank at 1.4x FY28E standalone book value.\n\nThe brokerage noted that the bank’s ability to sustain return on assets of over 1% and deliver a mid-teen return on equity justifies a valuation premium over historical PSU bank multiples.\n\nEmkay Global highlighted SBI’s sector-beating credit growth of 15.6% YoY in Q3, with momentum visible across all lending segments. It noted that margins remained largely stable at around 3 per cent, even as some public sector peers saw margin pressure. Higher other income, including dividends from SBI Mutual Fund and treasury gains, helped drive an earnings beat during the quarter.\n\nEmkay said SBI has raised the upper end of its FY26 credit growth guidance to 13–15%, supported by an improved loan-deposit ratio and the full impact of the CRR cut. The brokerage raised earnings estimates for FY26–28 and retained a BUY rating, increasing its target price to ₹1,225.\n\n(DISCLAIMER: The views and opinions expressed by investment experts on fortuneindia.com are either their own or of their organisations, but not necessarily that of fortuneindia.com and its editorial team. Readers are advised to consult certified experts before taking investment decisions.)"
    },
    {
        "title": "Proficient Auto (PAL) Earnings Call Transcript",
        "url": "https://www.aol.com/articles/proficient-auto-pal-earnings-call-224006836.html",
        "source": "AOL",
        "date": "2026-02-09T23:28:00+00:00",
        "content": "Monday, February 9, 2026 at 5 p.m. ET\n\nChief Executive Officer — Richard O'Dell\n\nChief Financial Officer — Bradley Wright\n\nRevenue Growth -- Reported revenue increased by 11% as stated by management, reflecting expansion in both core and acquired operations.\n\nRevenue per Unit -- CFO Wright described average revenue per unit as \"very stable\" following significant volatility over the prior twelve to sixteen months.\n\nSpot Market Exposure -- Management indicated \"very little spot opportunity in the current market,\" and classified any resurgence as potential upside.\n\nCost Savings Initiatives -- Significant cost savings are expected from health care and insurance program consolidations, with the health benefits changes beginning January 1, 2026, and insurance consolidation effective August 2026.\n\nHeadcount and Facilities Reduction -- The company executed restructuring actions late in the year, reducing headcount and exiting a physical location, which are anticipated to yield incremental cost savings in 2026.\n\nClaims Expense Impact -- CFO Wright stated the fourth quarter included an accident with a liability reserve hitting the full $500,000 retention, directly affecting operating ratio.\n\nOperating Ratio (OR) Guidance -- Management expects a 150 basis point improvement in operating ratio for 2026, driven primarily by cost savings and productivity enhancements.\n\nCapital Allocation Priorities -- CFO Wright affirmed that debt reduction remains the top priority, with merger and acquisition flexibility available, while share repurchases are \"probably at the lower end of the priority list.\"\n\nM&A Pipeline -- There is one active acquisition under consideration, with an annual expectation of one to two acquisitions consistent with prior statements.\n\nOEM Contract Dynamics -- Management reported contract gains in several new locations offset by the loss of certain incumbent sites, indicating a disciplined focus on rate and profitability.\n\nVolume and Pricing Outlook -- The company expects flattish core volumes and revenue per unit for 2026, but anticipates growth from market share gains rather than overall market improvement.\n\nInsurance Structure -- The company has increased its self-insurance retention to reduce premiums, introducing greater quarterly claims expense variability.\n\nAsset Utilization Strategy -- Management is shifting revenue from subcontracted hauls to company drivers, which is expected to improve operating ratio by 300-400 basis points for company-delivered moves versus subhaul.\n\nBrothers Acquisition -- Management confirmed that the revenue benefit from the Brothers acquisition will cycle through for one more quarter.\n\nNeed a quote from a Motley Fool analyst? Email pr@fool.com\n\nCEO O'Dell directly stated, \"the market environment was challenging in 2025,\" with weak seasonality in November and December contributing to revenue and volume shortfalls versus internal expectations.\n\nCFO Wright highlighted, \"very little spot opportunity in the current market,\" signaling limited upside from higher-margin spot freight unless conditions tighten.\n\nManagement warned of ongoing aggressive carrier pricing, noting competitors are accepting rates \"below a threshold that we think represents healthy reinvestment.\"\n\nThe company absorbed a $500,000 reserve for a single liability claim in the fourth quarter, exposing earnings volatility under the current self-insurance structure.\n\nManagement confirmed an 11% revenue increase, emphasizing disciplined capital allocation and continued focus on debt reduction. Strategic consolidation of benefits and insurance networks is projected to deliver meaningful cost savings and a 150 basis point operating ratio gain in the coming year. While core volumes and pricing remain flat, leadership expects organic revenue improvement through market share gains and operational efficiencies. The Brothers acquisition will provide a final quarter of incremental benefit before fully cycling. Management is actively pursuing additional M&A, with one transaction currently in process.\n\nLeadership signaled a shift toward maximizing company-owned fleet utilization for improved margin, with company-delivered shipments expected to outperform subcontracted hauls by several hundred basis points on operating ratio.\n\nThe fourth quarter earnings were negatively impacted by seasonally weak volumes and an extraordinary claims expense, both of which management expects to be nonrecurring.\n\nManagement reported that \"meaningful\" open bids were both awarded and lost during recent contract cycles, citing a strict focus on profitability and a readiness to capitalize on service failures by lower-bidding rivals should those opportunities re-emerge.\n\nCFO Wright affirmed ongoing flexibility to pursue strategic acquisitions, supported by balance sheet improvement, while maintaining conservative share repurchase activity.\n\nOperating Ratio (OR): A key efficiency metric for transportation providers, calculated as operating expenses divided by operating revenue; lower OR indicates higher margin performance.\n\nSpot Market: The segment of freight and logistics business transacted at market rates for immediate shipment, typically reflecting greater pricing flexibility and volatility compared to contract business.\n\nM&A: Mergers and Acquisitions; refers to corporate strategies involving the purchase or combination of companies to drive growth or expand capabilities.\n\nSAAR: Seasonally Adjusted Annual Rate; a metric describing total new auto sales projected on an annualized, seasonally adjusted basis.\n\nSubhaul: Freight movements completed by subcontracted or third-party carriers, as opposed to using company-owned fleets and drivers.\n\nOEM: Original Equipment Manufacturer; in this context, auto producers who are principal customers for auto transportation and logistics services.\n\nBradley Wright: You know, the third-party carriers that we are using are those who choose to participate in our freight very regularly. The folks who choose to participate in our break more episodically would not have opportunities for dispatch in this volume environment. So to the extent that some of those French players may be exiting the market, not only for us but in general in the auto haul space, that will be felt. When there is a surge and a need for capacity that is no longer there.\n\nRichard O'Dell: Okay. And maybe this is a question for all three of you. But do you think that rates will be up in '26? Ex fuel.\n\nBradley Wright: So you are asking about revenue per unit. Correct. I think we should be stable, largely stable on a revenue per unit basis. We have significant volatility in our RPU over the course of the last, call it, twelve to sixteen months as we were cycling the reduction in spot traffic and dedicated traffic. The level where we are now, we are very stable from an ARPU perspective.\n\nRichard O'Dell: Okay. And then my last one, just real quick. Brad, obviously, it sounds like cash flow should still be good into twenty-six. How should we think about prioritizing capital allocation between M&A, debt pay down, and even repurchases? Is that even a possibility? Thank you.\n\nBradley Wright: Yeah, Tyler. I think the priorities will be largely as they have been, which is, you know, to continue paying down debt. Now we made significant progress there as I highlighted over the last year, particularly the last three quarters. And so that does give us some flexibility and some dry powder to the extent that, you know, an M&A opportunity came along, for example, you know, we have got a lot of flexibility to use cash or to take on additional leverage or however we might choose to approach that.\n\nBut I think, you know, just on a recurring quarter in, quarter out basis, I would expect us to continue to strengthen the balance sheet first and, you know, again, we never rule out share repurchases, but that is probably at the lower end of the priority list at this point.\n\nRichard O'Dell: Okay. Alright. Thank you very much.\n\nOperator: Our next question comes from the line of Bruce Chan with Stifel. Your line is now open.\n\nBruce Chan: Hey, good afternoon, everyone, and thanks. Maybe just to focus a little bit more on the revenue mix and the pricing. You all mentioned a couple of things that work there with the absence of spot opportunity in the competitive market. I guess, first on the spot side, Rick, you mentioned a few of the kind of points of optimism this year just around the age of the consumer fleet. Any kind of tax rebates, refunds. How do those kind of factors play out through the spot versus contract opportunity? How much are you kind of embedding in your outlook for flat revenue per unit?\n\nAnd then maybe on the competitive front, just to address that, I guess I am a little surprised that given the cost trajectory in the business, carriers are still pricing so aggressively. So maybe any more detail on what you are seeing in that competitive environment there?\n\nRichard O'Dell: Yeah. So, on your first question, with respect to what our expectations are for the spot market or what it would take to see the spot market recovery. I mean, I think as the market tightens, and inventories tighten, then you see there is more of a sense of urgency for delivery of vehicles. You know, that gets maybe presold or if inventories get low and demand is high, then you know, then you see more spot moves. So we just take a healthier demand environment to kind of get a recovery in the spot market.\n\nBradley Wright: Yeah. Rich, from my perspective, at this point, any spot opportunity is upside relative to where we have been over largely the last year. So there is very little spot opportunity in the current market. I do not expect there to be a meaningful amount of spot opportunity in the market that we foresee in the near term. But to Rick's point, any tightening that would introduce that opportunity would represent upside.\n\nRichard O'Dell: Or driver shortages for other, you know, competitors that have contracts. Right? If they cannot handle their contract business, then it goes to the spot market.\n\nBradley Wright: And then to your question on OEM pricing, you know, what we are seeing is there is an impact on the OEM side of that equation. And there is an impact on the carrier side of the equation. On the OEM side, as we have seen in recent earnings releases, peaking large impairment charges around EV investments, and coming off of a year where they bore a significant portion of tariff expense. The OEMs are looking to improve their performance in 2026. And so they have got really stringent cost mandates in place for their procurement departments. And that is what we are seeing in the OEM environment.\n\nOn the carrier side of things, we are seeing a lot of carriers with underutilized capacity for the amount of volume that they are carrying is lesser than they would like to be carrying. And it is resulting in carriers bidding at rates that in many cases, are below a threshold that we think represents healthy reinvestment. And so we are having to show discipline about what we are willing to pursue, what we are willing to defend, and when we walk away, because we do not think that rate level is sustainable in the market over a, call it, three-year price term.\n\nBruce Chan: Okay. Great. Yeah. That is super helpful. And then maybe just, you know, for a final question here, you know, you mentioned the insourcing and the cost control programs. I think we are a little more than a year and a half or so post IPO. Any updates that you can share with us on progress there, any new opportunities that you may have identified?\n\nRichard O'Dell: Well, you know, some of the big ones that have now gotten a lot of traction or that will kick in the first quarter. Then we the consolidation of all of our health care programs. That will kick in or did kick in 01/01/2026. Consolidation of our insurance programs, liability, and cargo damage, etcetera, in August is also something that we expect to see result in cost savings during 2026. You know, the early on stuff has now kind of cycled at this point. The water, oil, and the gas programs, the spare parts, that kind of stuff. You know? And we continue to push on that. And see, you know, marginal improvements there as well.\n\nBut I think it is the insurance and benefits that will kick in the largest portion of the savings in twenty-six. One other comment I would make there, Bruce, is as we move into new vendors and new programs, there is a sort of flushing out of old contracts and prior expense. And so there is some doubling up in the system during that transitional period. And as we move forward, we do see opportunity to just take what I would describe as transitional and integration costs out of the system over time.\n\nRichard O'Dell: I guess the other thing that I failed to mention is, you know, we did some restructuring late in the year last year that reduced some headcount, and also got us out of one physical location that will actually create additional savings in twenty-six.\n\nBruce Chan: K. Great. Thank you. Thank you.\n\nOperator: Our next question comes from the line of Alexander Paris with Barrington Research. Alex, your line is open.\n\nAlexander Paris: Hi. Thank you. Thanks for taking my question, guys. So I have just a couple of questions. First, I think a point of clarification. The market share gains and the Brothers acquisition, we still have one more quarter of a benefit before it cycled through. Did I get that right?\n\nRichard O'Dell: For Brothers, yes. On the market share gains, that was during the first quarter, so less of an impact there.\n\nAlexander Paris: Okay. Gotcha. And then on the organic front, and I am going to finish with M&A. On the organic front, you said you had said last quarter that there are still a number of OEM contracts that were awaiting awards. And at that time, just like this time, you said that some contracts you walked away from due to pricing and so on. I was just wondering if we can get a little update on the color of contract awards, either during the fourth quarter or prospectively.\n\nBradley Wright: Sure. Hi, Alex. We did see several open bids sort of matriculate to the award stage over the last couple of months. And what I would describe is puts and takes. We did pick up some new locations in a number of customer accounts. We also lost some incumbent locations in those same customer accounts. Again, by virtue of rate dynamics, and where the late stages of negotiation went. With respect to rates and profitability. So net, we are pleased with where we ended up. But in a more disciplined environment, we would like to grow our business as well as gain new markets. In the current environment, we are having to make some hard choices.\n\nWith respect to incumbent business. As we pick up some new markets. As we look ahead, there are a number of what I would describe as they are not national and headlining bids. But there are a number of active bids just in the ordinary course of the business. That will play out here over the first and second quarter. We continue to see opportunity to bid on new traffic. And our customers are still acclimating to our broader network and data capability. And we are having much more meaningful discussion with customers about what we can do across a wider swath of their network. So we are encouraged and optimistic about our opportunity to pick up some new business.\n\nAlexander Paris: Great. That is helpful. Then too, anecdotally, and without mentioning the OEM, I had heard a fairly large contract was awarded last year. And you stepped away due to pricing. But I have heard that same OEM is coming back and rebidding some lanes because some of these smaller carriers that bid real low are having service issues. Have we been seeing those kind of things this year? I know you said earlier that it will usually end up in spot, but the absolute, you know, rebidding of certain lanes seems to have happened much sooner than they typically do.\n\nBradley Wright: So you bring up an interesting point. And it is one that we think about. So as we get into the late stages of a negotiation, you ask yourself, would I rather be the carrier that wins this business at a rate that I am not entirely confident I can deliver or would I rather be the carrier waiting in the wing if the guy who wins it cannot entirely deliver? And we have made some of the latter in terms of our choices. So to your point, we do think that there is some business that has been awarded that may ultimately come back to market.\n\nAnd we have tried to position ourselves in a way our customers know we have got capacity, we have got interest, and we are available to support in the event that they have service disruption.\n\nAlexander Paris: Great. That is helpful. And then my final question, I will finish on M&A as I said I would. You know, given the weak market, given the weak SAAR, given pricing pressures and service delivery challenges. Would you ex maybe you can give us a little update on the M&A pipeline? And do you expect to make acquisitions in 2026?\n\nRichard O'Dell: Yeah. We continue to develop a pipeline. We have one that we are, you know, actively engaged on. So I would expect that we still would expect to maybe do one to two acquisitions a year.\n\nAlexander Paris: Right. Which is in line with what you had said at the IPO time, and it is actually what you have delivered over the last twelve months or so.\n\nAlexander Paris: Alright. Well, thank you. I will get back in the queue.\n\nRichard O'Dell: Alright. Thanks. Thank you.\n\nOperator: Our next question comes from the line of Ryan Merkel with William Blair. Your line is now open.\n\nRyan Merkel: Hey, everyone. Thanks for the question. I want to start on 4Q. The OR missed I think, your expectations, and I just want to be clear on why that happened. Sounds like it was the core revenue was a little bit weaker than you thought. What was the core revenue in 4Q? And was the weakness just the November and December seasonality come back as you thought?\n\nRichard O'Dell: Yes. So on the revenue front, when we guided at the last quarter, we kind of gave a range of where we thought 4Q would end up. In the end, it ended up a few million shy of what we had anticipated. That reflects a November and December that did not come to fruition the way seasonally it typically does. So yes, we saw some weaker volume and general there that would have been contributory. From an OR perspective. But there were some specific drivers in the quarter, which Brad could talk about.\n\nBradley Wright: Yeah. So we referenced in our commentary that we had elevated claims expense. So when we consolidated our insurance programs, we got a significant reduction of premium, but we also took on a little more retention or self-insurance. And as a result, we do expect that there will be a little more volatility or subject to it anyway. And we had one accident in the fourth quarter where we did have to basically reserve up to our full retention amount. And so that had an impact on OR for the quarter. And we would not expect that to recur in Q1.\n\nRyan Merkel: How big was that, Brad?\n\nBradley Wright: Well, the full retention that we have on our liability is a half million dollars, and we reserved all of that.\n\nRyan Merkel: Okay. Alright. And then the twenty-sixth guide, let us start with revenue. Just want to make sure I heard it right. So I think you said you do not expect any help from the market. So talk about what you expect from the market. I think you will have one point of M&A that will carry over. You said flat pricing. You are thinking a couple of points of volume. Am I understanding that right?\n\nBradley Wright: You are kind of breaking up a little bit, but I think the point is we do not expect general core market volumes to be higher than 2025, and pretty flattish revenue per unit as well. So but we do still expect that we will be able to generate some increase in our overall full-year revenue through market share gains. As Rick mentioned, we will always be, you know, looking at strategic additions as well, but we do think that we have got some optimism around market share gains that would push our revenue up organically anyway.\n\nRyan Merkel: Okay. So it sounds like mid-single-digit revenue in '26 is in the ballpark.\n\nRichard O'Dell: Well, just from the organic market, I would say, you are probably a little high. But that is it is hard to say this early in the year.\n\nRyan Merkel: Yeah. Get it. Okay. And then on the OR improvement, 150 basis points. Is that just all cost saves and can you tell us how much in dollars you have for cost saves in '26?\n\nBradley Wright: Yeah. So I think most of that would be most of it is cost savings, of course, to the extent that we push revenue higher, we get some fixed cost leverage as well.\n\nRichard O'Dell: And a meaningful portion of that, Ryan, as well is, you know, the ongoing initiative to shift more of our revenue base from the subhealth segment into the company driver segment. We get better asset utilization of our fleet. And we think that on an apples-to-apples basis, the OR on a company-delivered move is as much as 300, 400 basis points better than on a sub haul note. So we do expect to see progress there, which on the one hand is cost-driven, but on the other hand is how we operate.\n\nRyan Merkel: Right. Okay. Very helpful. Thanks.\n\nOperator: Thank you. This concludes the question and answer session. I would now like to hand the call back over to Richard O'Dell for closing remarks.\n\nRichard O'Dell: Well, obviously, the market environment was challenging in 2025. Like I said in my opening comments, certainly pleased with the execution of our employees dedicated to providing quality service in a challenging environment. And, you know, I think what we did demonstrate in 2025 is that our collective network is attractive to our customer base. You know, we grew revenue at 11%. And, you know, as we continue to mature our network, and focus on our cost initiatives, we got a high level of confidence in our ability to improve our operating margins.\n\nAnd in the meantime, cash flow is strong, balance sheet is improving, and you know, we like where we are positioned in the marketplace, but we just need the marketplace to be a little bit better. And I think there are some sort of green shoots out there that could indicate certainly the second half of 2026 can be better. So we are looking forward to that.\n\nOperator: This concludes today's conference. Thank you for your participation. You may now disconnect.\n\nBefore you buy stock in Proficient Auto Logistics, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Proficient Auto Logistics wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $443,299!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,136,601!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 914% — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 9, 2026.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy."
    },
    {
        "title": "Chegg (CHGG) Q4 2025 Earnings Call Transcript",
        "url": "https://www.aol.com/finance/chegg-chgg-q4-2025-earnings-222347010.html",
        "source": "AOL",
        "date": "2026-02-09T23:18:00+00:00",
        "content": "Monday, February 9, 2026 at 4:30 p.m. ET\n\nPresident and Chief Executive Officer — Daniel Rosensweig\n\nChief Financial Officer — David Longo\n\nVice President, Investor Relations — Tracey Ford\n\nChegg Skilling Revenue -- $18 million in Q4, with management stating \"double-digit growth\" ahead and providing a foundation for 2026 projections.\n\nLegacy Academic Services Revenue -- $55 million in Q4, with the segment now managed specifically for free cash flow generation.\n\nAdjusted EBITDA -- $13 million for Q4, resulting in an 18% margin, with Q4 performance exceeding the high end of guidance by $2 million.\n\nNon-GAAP Operating Expenses -- $44.8 million for Q4, marking a 47% year-over-year reduction driven by restructuring and cost discipline.\n\nNon-GAAP Expense Trend -- Targeting below $250 million for 2026, though management indicates this will be a 53% decline from 2024 levels.\n\nCapEx -- $6 million in Q4, down 51% year over year, with a plan for a further 60% reduction in 2026, allocating approximately 90% to Chegg Skilling.\n\nFree Cash Flow -- Negative $15 million in Q4, primarily impacted by $12 million in employee severance tied to restructuring.\n\nSeverance Charges -- $18 million in related cash expenditures expected in 2026, with about 80% to occur in the first quarter.\n\nCash and Investments -- $85 million on hand at quarter-end, with a net cash balance of $31 million.\n\nConvertible Note Repurchases -- $9 million of 2026 convertible notes repurchased at a discount to enhance capital structure.\n\nQ1 2026 Guidance -- Chegg Skilling revenue expected at $17.5 million–$18 million; total revenue between $60–$62 million; gross margin between 57%–58%; adjusted EBITDA between $11 million–$12 million.\n\nBusiness Model Shift -- Company now oriented toward B2B skills learning, with Chegg Skilling as the \"core business\" and Busuu transitioning toward majority B2B by year-end.\n\nDistribution Partners Expansion -- New partnerships announced with DHL, GI Group, and Wolfe University; ongoing contracts extended with L'Oreal and PPG.\n\nOperational Structure -- Two focused business units: Chegg Skilling as growth engine, legacy academic learning managed for cash generation.\n\nManagement Addition -- Karine Alouch appointed to lead European language learning and skills operations, bringing experience from Microsoft (NASDAQ:MSFT), NetApp (NASDAQ:NTAP), Global English, and Coursera (NYSE:COUR).\n\nNeed a quote from a Motley Fool analyst? Email pr@fool.com\n\nDavid Longo stated, \"delisting notice we received from the NYSE,\" clarifying there is \"no immediate impact on our listing status,\" but underscoring a potential compliance issue with possible future consequences.\n\nFree Cash Flow Negative -- Q4 free cash flow was negative $15 million, attributed primarily to severance payments, which may indicate ongoing operational cash flow pressures during restructuring.\n\nChegg (NYSE:CHGG) completed a strategic shift centered on Chegg Skilling, reporting $18 million in skilling segment revenue and outlining plans for double-digit growth and an adjusted EBITDA margin target of at least 20% in coming years. Management emphasized a lean operating model with non-GAAP expense reductions, disciplined capital allocation—including a $9 million convertible note repurchase—and ongoing restructuring costs predominantly front-loaded in 2026. The academic services segment, now managed primarily for free cash flow, continues to serve over a million students but faces persistent traffic headwinds from changes in search interfaces. Newly announced partnerships and significant leadership additions are intended to expand curriculum and B2B reach, particularly in high-demand AI and technical skills content distribution channels.\n\nChegg's evolution from a D2C textbook model to a B2B skilling focus underpins strategic expectations for enhanced margin and free cash flow.\n\nManagement stated plans to end 2026 with zero debt and maintain a \"meaningful cash balance,\" aiming for a more resilient balance sheet.\n\nQ1 2026 guidance sets Chegg Skilling revenue at $17.5 million–$18 million with projected sequential improvement in the second half from expanded distribution partnerships.\n\nCompany views Coursera (NYSE:COUR) and Udemy (NASDAQ:UDMY) not as direct competitors but as potential channel partners to distribute Chegg's proprietary content.\n\nWolfe University partnership introduces degree-credit earning opportunities for Chegg's skills courses, supporting both enrollment and value proposition expansion.\n\nChegg Skilling: Chegg’s business unit focused on workplace skills, language, and technical education for enterprise and institutional clients, primarily via B2B channels.\n\nBusuu: Chegg's online language learning division, transitioning from direct-to-consumer sales to a mainly B2B model.\n\nTracey Ford: Thank you for joining Chegg's Fourth Quarter 2025 Conference Call. On today's call are Daniel Rosensweig, President and CEO, and David Longo, Chief Financial Officer. A copy of our earnings press release along with our investor presentation is available on our Investor Relations website, investor.chegg.com. A replay of this call will also be available on our website. We routinely post information on our website and intend to make important announcements on our media center website at chegg.com/mediacenter. We encourage you to make use of these resources. Before we begin, I would like to point out that during the course of this call, we will make forward-looking statements regarding future events including the future financial and operating performance of the company.\n\nThese forward-looking statements are subject to material risks and uncertainties that could cause actual results to differ materially from those in the forward-looking statements. We caution you to consider the important factors that could cause actual results to differ materially from those in the forward-looking statements. In particular, we refer you to the cautionary language included in today's earnings release and the risk factors described in Chegg's annual report on Form 10-Ks for the year ended 12/31/2024, filed with the Securities and Exchange Commission as well as our other filings with the SEC. Any forward-looking statements that we make today are based on assumptions that we believe to be reasonable as of this date.\n\nWe undertake no obligation to update these statements as a result of new information or future events. During this call, we will present both GAAP and non-GAAP financial measures. Our GAAP results and GAAP to non-GAAP reconciliations can be found in our earnings press release on the investor slide deck found on our IR website investor.chegg.com. We also recommend you review the investor datasheet, which is also posted on our IR website. Now I will turn the call over to Daniel Rosensweig.\n\nDaniel Rosensweig: Thank you, Tracey, and thank you, everyone, for joining Chegg's Fourth Quarter 2025 Earnings Call. This is a period of reinvention at Chegg. We are rebuilding the company focused on the $40 billion skilling market which we believe will be a double-digit revenue growth business for Chegg with strong margins and cash flow in the years ahead. To achieve this, we have reorganized Chegg around two focused business units, Chegg Skilling which is now our growth engine, and our legacy academic learning services, which we are managing to generate free cash flow. Together, this structure gives us the financial flexibility to invest and grow opportunities within skilling while creating long-term shareholder value.\n\nWe are excited about our future and feel confident that this new structure sets us up for success. We are already seeing positive early signs. In Q4, Chegg Skilling delivered $18 million in revenue, positioning us for double-digit growth for 2026. Our legacy business, Chegg Study, continues to serve more than a million students. And with our new streamlined org structure, is providing meaningful cash flow to fund value creation. As we have expressed, changes in search interfaces continue to impact our traffic. Yet despite these changes, the quality and the accuracy of our services continues to drive high retention rates.\n\nWe are now focused on optimizing pricing and packaging and testing multiple strategies to extend our operational runway and drive more free cash flow. We have a clear objective to use that cash to fund new growth opportunities and increase the value for our shareholders. Given the global demand for workforce scaling has already reached $40 billion, we feel it's a huge opportunity for Chegg, and we are well positioned to serve this market. Particularly in AI, language, technical fluency, and durable skills. Our brand is trusted by learners worldwide, and our skills courses are grounded in learning science and data-driven instructional design.\n\nOur platform tracks learner progress in real-time delivering predictive nudges and timely interventions that improve engagement, retention, and completion rates. This combination of brand credibility, evidence-based course design, and intelligent learner support consistently leads our channel partners to report stronger outcomes versus our competitors. To capture the growth opportunity we see ahead, we are expanding our course catalog with high-demand technical AI language and professional skills. While simultaneously broadening our global footprint across B2B distribution channels. As part of this strategy, we're excited to announce new partnerships with DHL GI Group, and Wolfe University. Wolfe specifically expands how we can serve learners as they provide accredited degree pathways that allow for acquired skills to count towards recognized credentials.\n\nWe've also extended a few key contracts from companies like L'Oreal and PPG. Our goal is to further extend our reach into global enterprise institutional, and academic markets. Looking ahead to 2026, we plan to onboard additional employer and institutional partners both directly and through leading marketplaces. We continue to expand the depth and breadth of our curriculum. To support this opportunity, I'm thrilled to announce that Karine Alouch is joining our team to run our European language learning and skills operation. Karim brings deep experience in building and scaling enterprise businesses across Microsoft, NetApp, Global English, and most recently, at Coursera, where she led the transformation of their enterprise business.\n\nWe are thrilled to have her leadership and expertise as we scale our skilling business around the world. We have made significant progress in the reinvention of Chegg. Our goal is to continue to grow our skilling business by double digits annually and over the next couple of years to achieve an adjusted EBITDA margin of at least 20%. To achieve that, our 2026 priorities are straightforward. Accelerate the growth of our skilling business, by expanding our offerings and network partners domestically and through Europe, increase free cash flow to invest in the future growth of Skilling, and strengthen our balance sheet by ending the year with zero debt and meaningful cash balance.\n\nWe are encouraged by the results we are seeing in the skills business and are excited about the path ahead. We successfully transformed our business from a print textbook rental business to an online learning company, and now we are transitioning from a D2C business to a B2B skills learning platform. We are excited about the work we have done so far, and we look forward to updating you next quarter. And with that, I'll turn it over to David Longo.\n\nDavid Longo: Thank you, Daniel, and good afternoon. Today, I will be presenting our financial performance for 2025 along with the company's outlook for 2026. We are introducing our new revenue breakout to provide transparency into our Chegg skilling business. Historical revenue breakout for the past few years can be found on our datasheet on our investor relations website. We delivered a good fourth quarter. We exceeded our revenue expectations and surpassed the high end of our adjusted EBITDA guidance by $2 million reflecting the initial positive impact of our new focus and turnaround efforts. Our strategic shift into the large skilling market positions us for the next phase of long-term sustainable growth with strong margins.\n\nDuring the quarter, we also took steps to enhance our capital structure repurchasing $9 million of our 2026 convertible notes at a discount. In the fourth quarter, we delivered $18 million in skilling revenue with double-digit growth underscoring the significant market opportunity and the momentum we are seeing. Academic services revenue was $55 million as we continued to operate the business with a focus on cash generation. As Daniel mentioned earlier, we are testing different pricing and packaging strategies to extend its operational runway. Moving on to expenses. Non-GAAP operating expenses were $44.8 million in the quarter, a reduction of $39.8 million or 47% year over year.\n\nAs we maintain fiscal discipline and continue to benefit from the successful execution of our restructuring activities. Our fourth quarter adjusted EBITDA was $13 million representing a margin of 18%. Our adoption of AI along with our new business structure has enabled us to significantly lower expenses while preserving our ability to grow. We overhauled our cost structure to improve efficiency and create capacity for reinvestment in Chegg Skilling. We are on track to reduce total non-GAAP expenses to less than $250 million in 2026 a 53% decline from 2024. Our strategic investment in AI has allowed us to significantly reduce CapEx without compromising quality. Q4 CapEx was $6 million down 51% year over year.\n\nFor 2026, we are targeting a further 60% reduction in CapEx. With approximately 90% dedicated to our growing skilling business. Free cash flow in the fourth quarter was negative $15 million which was primarily impacted by $12 million in employee severance payments related to our restructuring activities. In 2026, we expect $18 million in severance-related cash expenditures related to our last two restructuring with approximately 80% occurring in the first quarter. Despite these items, we expect to generate meaningful free cash flow in 2026. Looking at the balance sheet, we concluded the quarter with cash and investments of $85 million and a net cash balance of $31 million.\n\nBefore I move to guidance, I'd like to quickly address the delisting notice we received from the NYSE. The notice has no immediate impact on our listing status. And we have ample time and multiple avenues available to regain compliance. Including a potential reverse stock split. Our primary focus is on strengthening the fundamentals of the business. We believe that executing on our priorities will be the most effective path to restoring compliance and delivering long-term shareholder value. Looking ahead at Q1 guidance, we expect $17.5 million to $18 million of revenue from our Chegg skilling business.\n\nWe expect double-digit growth for the year and anticipate stronger performance in the second half than in the first driven by continued investment in the business and the addition of new distribution partners. Total revenue between $60 and $62 million gross margin to be in the range of 57% to 58% and adjusted EBITDA between $11 million and $12 million. In 2026, our capital allocation strategy is focused on optimizing free cash flow, strengthening our cash position, and eliminating our debt to create a more flexible and resilient balance sheet. We will also evaluate opportunities to deploy capital through a disciplined approach that supports sustainable growth and generates long-term shareholder value.\n\nIn closing, we have taken deliberate actions to strengthen the company for long-term success. We are leaner, more efficient, and poised for double-digit revenue growth in our Chegg's skilling business and meaningful free cash flow in 2026. We believe we are turning the corner and are on a clear path toward future growth, profitability, and increased shareholder value. With that, I will turn the call over to the operator for your questions.\n\nOperator: Thank you. We will now be conducting a question and answer session. A confirmation tone will indicate your line is in the question queue. You may press 2 to remove yourself from the queue. For participants using speaker equipment, it may be necessary to pick up the handset before pressing the star keys. One moment, please, while we poll for questions. Our first question comes from the line of Bryan Smilek with JPMorgan. Please proceed with your question.\n\nBryan Smilek: Great. Thanks for taking the questions, and good to see the skill in progress Daniel, can you just help us understand the key drivers of the skilling growth and focus between VUSU and other skilling credentialing areas? And then secondarily, more on the core business as well. Can you just elaborate on what you're seeing in the early price test and plan mix across the legacy business? Thanks.\n\nDaniel Rosensweig: Yeah. Great questions. I just want to reverse the way we think about it, which is the core business now is skilling. So the historic business is the academic services business. Let me start with that one, and then I'll talk about the key KPIs that we look at with skilling. So we're probably about 40% through the quarter on the learning business. And it's pretty much where we talk it would be with the exception of the retention continues to be a little bit stronger than we thought. And that's very good for free cash flow generation.\n\nSo what we know is when Google doesn't block our traffic or when the traffic gets through, that we continue to convert well and retention continues to actually achieve the highest levels that I've seen, not since I've been back, but even before that. So that gives us a runway to be able to reinvent that product, which we have several ideas and we're sort of excited about them of where Chegg Study can go in the future. But in the interim, the price testing the key for us is all they do a month in, which is retention. And so far, they're performing actually quite well.\n\nSo you know, it's too early to declare, you know, one way or the other, but we're very pleased with the fact that retention continues to be so high. On the skilling business, so we used to be a B2C business. On whether it was Busu or whether it was on Chegg Skills. Both those businesses over the last twenty-four months have been converted into B2B businesses. Skills is exclusively B2B. And by the end of this year, Busuu will be more B2B than B2C.\n\nAnd so the key metrics that we're looking at are some of the things that we began to talk about, which is how do we expand the number of distribution partners that we have, and we announced one, and we expect to announce more over the course of the year, which we're excited about. And then second is how do we continue to expand the curriculum we have to sell more into the businesses or the channels that we already have. And so we'll just be focused on number of channels and expanding curriculum. And over time, we'll talk about sort of the average volume of a transaction. It's too early to do that.\n\nBut at the moment, it's more channels of distribution and more curriculum to be able to sell into the existing and to the new channels. And both of those things are up to a slightly faster start than I would have expected, you know, only nine weeks back on the job. So I'm actually excited about it.\n\nBryan Smilek: Great. Thanks, Daniel.\n\nOperator: Thank you. Our next question comes from the line of Ryan MacDonald with Needham and Company. Please proceed with your question.\n\nRyan MacDonald: Hi. Thanks for taking my questions. Daniel, maybe to ask you about the state of the skilling market. Obviously, a lot of change that's about to happen with the Coursera Udemy merger, obviously, two of the biggest players in the space. And so as I think about Chegg skilling and sort of how you gain share within the marketplace in B2B, you know, you talk about expanding the number of distribution partners, expanding the curriculum you have.\n\nWhat opportunities do you think present themselves from this impending merger of areas where you can look to either take mindshare from a distribution partner or expand content by bringing on maybe new content creators as this transition occurs over the next year or so?\n\nDaniel Rosensweig: Thanks. Yeah. It's a very interesting question, and that merger is sort of fascinating. In terms of how the two companies are performing. But the significant difference is they are marketplaces. For other people's content mostly and one has a B2B they both have a version of B2B and B2C. And so rather than looking at how do we how do we take share, can actually think the other way, which is can we work with them? Because our content continues to outperform the places we put it. And the definition of outperform for us is not just conversion, but completion. And renewal with those companies that are inside those channels.\n\nAnd we are and we mentioned it in the prepared remarks that we continue to hear from the partners that we have that we continue to outperform the other partners in the channel. And it's because we have a basis for actually teaching. That we've been able to apply over into this world. So we don't see Coursera and Udemy as competitors. We actually see them as potential partners to work with going forward.\n\nAnd our view is if we continue you know, if you look at how value gets created, we think it's now the person that's creating the content and can actually serve the student, educate the student, and that those businesses are gonna be more higher margin businesses. So than just the channels and distribution. So we see ourselves looking to we don't have to take share from them. We could take share potentially by working with them by also providing our content through their channels and other channels. So it's different than what we would've looked at before.\n\nRyan MacDonald: Really helpful clarification there, Daniel. I appreciate the color on that. Maybe as a follow-up. Obviously, we're starting to see a lot of the, let's call it, AI strategies at the board level start to be implemented within enterprise organizations broadly. Are you seeing that now translate into greater usage or consumption of AI learning content on your platform through your partnerships that you have?\n\nDaniel Rosensweig: Absolutely. Yes. So when we first started this several years ago, I mean, we went from zero to the size that we plan to be this year in just three and a half years. So we're seeing actually real good growth. And this will be the first time that we've expanded beyond our partnership with Gil to add new partners. So we're you know, we see double-digit growth ahead for the next several years because we're really just at the beginning of this thing. But when you ask what the demand is for, the original deals that we did were for frontline workers, who needed just basic technology skills.\n\nNow the demand is shifting rapidly towards how do we make sure that every single employee, not just frontline workers, but workers across the board, actually begin to understand how to utilize AI. So, you know, a different way to think about it is rather than say what should I build, everybody needs to learn the tools that I can use to build. And that's the role that we're playing, and we think that's a very big growth market which is why we're sort of accelerating the kinds of classes that we're teaching. And, honestly, the relationship that we now announced with Wolfe is also a very big opportunity going forward. It's very early to be able to size it.\n\nBut this is the first time Chegg is gonna be offering courses through a partner where our courses can count towards a degree. And so you can imagine the demand from students about wanting to have courses that they can take that also contribute to their college degree where they can put on their resumes that they actually understand how to use the tools around AI. And so these are all really fun and interesting and high growth areas for us.\n\nRyan MacDonald: Awesome. Thanks for taking my questions.\n\nDaniel Rosensweig: Thanks for asking them, and thanks for covering us. Appreciate it. A lot of small companies don't get that kind of coverage, so we're grateful.\n\nOperator: Thank you. And we have reached the end of the question and answer session. And this also concludes today's conference call. We do thank you for your participation. And you may now disconnect your lines at this time. Thank you.\n\nBefore you buy stock in Chegg, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Chegg wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $443,299!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,136,601!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 914% — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 9, 2026.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool recommends Chegg. The Motley Fool has a disclosure policy."
    },
    {
        "title": "Succession Sequel for Disney",
        "url": "https://labusinessjournal.com/featured/succession-sequel-for-disney/",
        "source": "Los Angeles Business Journal",
        "date": "2026-02-09T16:25:00+00:00",
        "content": "The Walt Disney Co. tries again to succeed Bob Iger – what do the leadership selections indicate?\n\nHaving weathered much financial turbulence and a long deliberation, The Walt Disney Co. finally chose a new leader – again.\n\nIn a unanimous vote Monday by the Disney board of directors, Disney Experiences Chairman Josh D’Amaro emerged to succeed Bob Iger as chief executive, effective March 18 at the company’s annual meeting.\n\n“Josh D’Amaro is an exceptional leader and the right person to become our next CEO,” Iger said in a statement. “His ability to combine creativity with operational excellence is exemplary, and I am thrilled for Josh and the company.”\n\nA 28-year veteran at the Burbank-based entertainment giant, D’Amaro joined as a business planner at the Anaheim resort and worked his way up to helm Disney Experiences (formerly known as Parks, Experiences and Products) in 2020, overseeing 12 theme parks and 57 resort hotels worldwide. He previously served in finance, business strategy, marketing, creative and operational departments for Disney in the U.S. and around the world.\n\nD’Amaro has his work cut out for him after Iger, who is considered one of the most successful chief executives in media and entertainment – so much so that Disney brought him back in 2022 after he’d already retired as chief executive.\n\n“Of course, I feel the weight on my shoulders,” D’Amaro said in an interview with ABC World News Tonight last Tuesday. “I think I should feel it.”\n\nIger told ABC World News Tonight that one of the many reasons D’Amaro was chosen is because he “observed him over the years that we’ve worked together as someone that views technology as an opportunity and not a threat.”\n\nAs part of the announcement, Disney tapped Dana Walden, Disney Entertainment co-chairman,​ to serve as president and chief creative officer – reporting directly to D’Amaro. Iger described Walden as “a wonderful choice” for the newly created role, given her status in the creative community and that “creativity is at the heart of everything Disney does.”\n\nNews about the new leadership came a day after Disney’s released its first-quarter earnings – posting 5% growth in year-over-year revenue at roughly $26 billion and beating Wall Street’s expectations of $25.7 billion.\n\nUnder D’Amaro’s leadership, Disney Experiences hit a record $10 billion revenue from its parks, cruise ships, hotels and merchandise for the first time in Disney’s centennial run. It generated $3.3 billion of operating income – a 6% boost year-over-year – accounting for 71% of total operating profits for the quarter.\n\nDespite hitting key financial goals, Disney shares took a tumble – falling 7.4% Monday to close at $104.57 a share. The price dipped further by 2% the following day though bounced back to close at $104.24. It closed at $104.97 on Thursday.\n\nInvestors are likely weighing the choice for the top job, along with Disney’s future.\n\n“At face value, it would be concerning to Hollywood talent that Disney once again opted for the parks chief to head the company,” said Alicia Reese, senior vice president in equity research at Pasadena’s Wedbush Securities. “However, we think Iger’s decision was thoughtful and balanced, and by placing Dana Walden as chief creative officer, the message should be clear that Disney will remain committed to Hollywood.”\n\nIger built Disney into what it is today – the giant among giants.\n\nHe had many accomplishments during his first term between 2005 and 2020, including acquiring Pixar, Marvel and Lucasfilm, introducing Disney+ and transforming Disney into a powerhouse. Dow Jones market data showed a 438% increase in Disney stock prices during Iger’s first run, surpassing the 155% gain by S&P500 during that same period.\n\nAfter retiring and hand-picking Bob Chapek as his successor, Iger eventually returned for a second stint in 2022. The board fired Chapek due to some miscalculations and missteps, exacerbated by the Covid-19 pandemic that shut down the theme parks – Disney’s historic top revenue and profit driver. Disney shares dropped more than 40% over the course of the last five years.\n\nIger’s second term is marked by his efforts to stabilize the company through tough times. In his final earnings call on Monday, he noted the company’s successes – turning the streaming business around and improving theme park performance.\n\nIn its first-quarter report, the company reported strong growth from Disney+ and Hulu at a total revenue of $5.35 billion and an operating income of $450 million – a whopping rise of 72% from the first quarter of 2025. Film studios generated more than $6.5 billion in global box office in calendar year 2025 – with “Avatar: Fire and Ash” reaching the $1 billion bar. “Zootopia 2” was marked as Hollywood’s highest-grossing animated film on record, generating more than $1.7 billion.\n\nIger leaves behind a legacy of significant growth despite the company’s stock taking\nthe hit.\n\n“The good news is that the company is in much better shape today than it was three years ago. Because we have done a lot of fixing,” Iger said on the earnings call. “Three years ago, (streaming) lost about a billion-five in the last quarter before I came back, and I think almost $4 billion last year. And you see the results this quarter … it’s making more than a billion dollars and we’re on a path to turning into a far better business.”\n\nChanges in consumer habits and new technology have signaled media and entertainment giants like Disney to shift focus.\n\nA Deloitte survey last year found 35% of all respondents spending more time watching videos on social media than on streaming services. It also found the younger the audience is, the more they prefer social media, with 58% of Gen Z respondents agreeing.\n\nO the other hand, artificial intelligence has also become pivotal for entertainment executives from Kartoon Studios Inc. in Beverly Hills to Universal Music Group in Santa Monica. Disney too tested the waters with a $1 billion, three-year licensing agreement with OpenAI last December.\n\nThat partnership allows users to make videos using more than 200 Disney characters with OpenAI’s short-form generative AI video platform, known as Sora. Users can then post them to Disney+ to be viewed and shared, blurring the line between streaming and social media.\n\n“We have obviously noticed the huge growth in short-form and user-generated content on other platforms such as YouTube,” said Iger. The deal “jump starts our ability to have short form video on Disney Plus” as a “positive step” to boost user engagement.\n\n“I also believe that you know, in a world that changes as much as it does, that in some form or another trying to preserve the status quo was a mistake,” Iger said. “I’m certain that my successor will not do that. So, they’ll be handed, I think, a good hand in terms of the strength of the company.”\n\nExpanding the Disney experience\n\nThe Disney theme parks are certainly booming. World of Frozen in Paris opens in a few months, Disneyland Abu Dhabi is in active development and a high percentage of consumers rushed to Shanghai Disneyland just to see Zootopia.\n\n“Experiences segment is the one the company heavily invests in,” Seeking Alpha analyst Florian Muller wrote in a report. “It is the most profitable way to monetize Disney’s valuable IP.”\n\nDespite the growth Disney Experiences saw this quarter, some analysts say the outlook on parks might be opaque. The same political tension that reduces international patronage to domestic parks also reduces Disney hotel bookings, which could further shrink profit margins.\n\n“We expect Disney to continue to use promotions and other yield management efforts to manage through the uncertainty,” wrote Ric Prentiss, head of telecommunication services and media equity research at Raymond James Financial Inc., in a report. “But on top of Comcast/Universal’s Epic Universe competition, the (fiscal first quarter 2026) results further clouded the near-term Parks’ outlook rather than bringing clarity.”\n\nSome analysts noted that D’Amaro will focus on the extensive library of intellectual property that includes Marvel, 20th Century Fox and Pixar assets as an avenue to maintain and bolster the growth that the company is experiencing.\n\n“This is a make-or-break moment for Disney, as the company cannot afford another strategic misstep,” another Seeking Alpha analyst pointed out. “A disciplined rollout of high-quality IP would reinvigorate Disney’s entire flywheel, from streaming to Parks and Experiences.”\n\nEntertainment companies are already wrestling for popular intellectual property. The bidding war between Netflix Inc. and Paramount Skydance Corp. over Warner Bros. Discovery Inc., who has an extensive library, serves as the latest example.\n\nEven Iger acknowledged the tussle in his call, saying Disney will focus on growing its existing intellectual property and creating new ones.\n\n“If anything, the battle for control of Warner Brothers Discovery should emphasize or cause investors to appreciate the tremendous value of our assets,” Iger said. “Particularly our (intellectual property), that includes, obviously, all of our brands and our franchises.”\n\nIger added: “We’ve got an unbelievable bedrock of stories already told to grow from.”\n\nThis will all be in the hands of D’Amaro, who seems to share Iger’s vision that a good leader for Disney should find “that careful balance between legacy and innovation.”\n\nD’Amaro also shared in his interview with ABC News that he would keep on taking risks, just like Iger did.\n\n“I just feel so fortunate to be in a position to be able to be that next steward for the brand into the next 100 years,” he said.\n\n11150 Santa Monica Boulevard, Suite 350 \nLos Angeles, CA 90025 \n323-549-5225"
    },
    {
        "title": "Options Traders Have Been Eyeing Netflix Stock After Earnings",
        "url": "https://www.schaeffersresearch.com/content/options/2026/02/09/options-traders-have-been-eyeing-netflix-stock-after-earnings",
        "source": "Schaeffer's Investment Research",
        "date": "2026-02-09T20:00:00+00:00",
        "content": "Netflix Inc (NASDAQ:NFLX) stock has been mired in an extended pullback, which wasn't helped by a post-earnings drop on Jan. 21. The 20-day moving average has helped guide NFLX lower since the beginning of December, though the shares now appear to be consolidating above the $80 level -- a potential level of support for this pullback.\n\nOptions traders have been targeting the streaming giant after earnings. In fact, NFLX made the list of Senior Quantitative Analyst Rocky White's equities that have attracted the highest options volume in the past two weeks. In the last 10 days, the stock has seen more than 3.9 million calls and 2.8 million puts exchanged, with the most activity at the May 68 call during this time.\n\nThe amount of call volume over the last five weeks is notable as well. NFLX's 50-day call/put volume ratio of 3.04 at the International Securities Exchange (ISE), Cboe Options Exchange (CBOE), and NASDAQ OMX PHLX (PHLX) ranks higher than all other readings from the past year.\n\nNFLX premium is reasonably priced at the moment, too. The stock's Schaeffer's Volatility Index (SVI) of 32% ranks in the very low 6th percentile of its annual range, meaning options traders are pricing in low volatility expectations.\n\n$40 Gets You 4 High-Conviction Trades. Let's Go.\n\nWe just booked back-to-back double-digit gains on Celsius and Palantir in Trade of the Week, and we’re eyeing even bigger wins!\n\nEvery week starts with a fully defined options trade straight from the desk Schaeffer’s Senior V.P. of Research, Todd Salamone, backed by 30+ years of proven market experience and disciplined risk management.\n\nRight now, you can get 4 total trades over the next 4 weeks for $40 – just $10 per trade.\n\n👉 Sign Up Now to Receive Your First Trade!"
    }
]