[
    {
        "title": "Bold Prediction: Nvidia Is About to Soar. Here's Why.",
        "url": "https://www.fool.com/investing/2026/02/19/bold-prediction-nvidia-is-about-to-soar-heres-why/",
        "source": "The Motley Fool",
        "date": "2026-02-19T23:27:00+00:00",
        "content": "Nvidia stock has only gone sideways this year. That is about to change.\n\nNvidia (NVDA +0.94%) isn't some hidden-gem stock. Plenty of individual investors, as well as institutions and mutual funds, own it.\n\nYet sometimes the best stock to pick is the one you already know. Nvidia stock has done nothing this year. There's a good reason to think that's about to change.\n\nThe company has continued to grow sales, led by its data center segment. Over the last year, it has grown data center revenue by 14% each quarter on average. Management has guided investors to expect total revenue growth of 14% again in fiscal Q4, compared with Q3. Nvidia is scheduled to report its fiscal fourth-quarter 2026 results on Feb. 25.\n\nEven with continued growth expectations, investors haven't been buying Nvidia stock this year. Share prices are down about 2% year to date, and the stock now trades at a forward price-to-earnings (P/E) ratio of about 23. That's in line with the overall market for a company with massive ongoing growth.\n\nNvidia CFO Colette Kress has repeated several times that Nvidia sees artificial intelligence (AI) infrastructure spending of between $3 trillion and $4 trillion by 2030. She stated, \"The scale and scope of these buildouts present significant long-term growth opportunities for Nvidia.\"\n\nI predict that investors will start to see the value in the business, along with the stock's very reasonable valuation, when the company reports earnings on Wednesday, Feb. 25. That should justify a stock price well above the market's average multiple.\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."
    }
]