[
    {
        "title": "Nvidia's stock is down and AMD is up. The culprit may be Arista.",
        "url": "https://www.cnbc.com/2026/02/13/nvidias-stock-is-down-and-amd-is-up-the-culprit-may-be-arista-.html",
        "source": "CNBC",
        "date": "2026-02-13T18:38:00+00:00",
        "content": "Shares of Nvidia and Advanced Micro Devices moved in opposite directions on Friday, after the CEO of Arista Networks told investors that her company is seeing some deployment shifting to AMD.\n\nNvidia's stock fell almost 3%, while AMD gained close to 1%.\n\n\"A year ago, it was pretty much 99% Nvidia, right?\" Ullal said on Arista's earnings call late Thursday, when asked by an analyst about the company's work with AMD. \"Today, when we look at our deployments, we see about 20%, maybe a little more, 20% to 25%, where AMD is becoming the preferred accelerator of choice.\"\n\nThe stock moves weren't dramatic, but Ullal's comments are notable because Nvidia has dominated the market for graphics processing units (GPUs) in AI since the industry started taking off a little over three years ago with the launch of OpenAI's ChatGPT.\n\nNvidia currently has roughly 90% of the the market for AI chips, with challenges potentially coming from AMD as well as Google, which is seeing increased traction for its tensor processing units. Nvidia is the most valuable U.S. company, with a market cap of over $4.5 trillion. AMD is worth about $335 billion after an 85% jump in its stock price in the past 12 months.\n\nArista's role in the AI infrastructure boom is in providing the Ethernet switching technology that connects powerful chips together. AMD announced late last year that it was partnering with Arista to build customized AI clusters that could be used for training and inference.\n\nBut for Arista, much of the diversification in its deployments is coming out of necessity.\n\nNvidia has diminished its need for Arista's technology by building its own networking technology to link together its powerful GPUs. In October, Nvidia said that Meta and Oracle would be adopting the chipmaker's networking technology in their ecosystems, an announcement that contributed to a 10% drop in Arista's stock over two days.\n\nIt's \"not the end of the world but obviously being designed in with Nvidia helps, and they are being designed out, if not fully, to a degree,\" Ben Bajarin, an analyst covering chips at Creative Strategies, told CNBC by email on Friday.\n\nNvidia launched its Spectrum-X Ethernet platform in 2023, and the following year Arista lost more than half its value. The stock bounced back some last year, climbing 19%, and is now up 6% in 2026.\n\nAn Nvidia spokesperson declined to comment. AMD didn't immediately respond to a request for comment.\n\nWATCH: AMD CEO Lisa Su says AI is accelerating at a pace she wouldn't have imagined"
    }
]