[
    {
        "title": "Nvidia's Week: UBS Raises Target, Hyperscaler Spending Holds, AMD Stumbles",
        "url": "https://247wallst.com/investing/2026/02/15/nvidias-week-ubs-raises-target-hyperscaler-spending-holds-amd-stumbles/",
        "source": "24/7 Wall St.",
        "date": "2026-02-15T18:27:00+00:00",
        "content": "NVIDIA shares dropped from last week and are now underperforming broad semiconductor ETFs by 15% this year.\n\nHyperscaler CapEx from Microsoft, Amazon and Alphabet continues to drive demand for Nvidia GPUs.\n\nThere continues to be worry that NVIDIA faces pressure from programs like Amazon’s Trainium and AMD’s upcoming MI450. Yet, AMD shares fell dramatically after issuing earnings on February 4th.\n\nSending You to Google News in 3\n\nNvidia closed the week at $182.81, down 1.4% from the prior week’s close. Three distinct storylines emerged that matter far more than the short-term price action. Here’s what moved the needle for Nvidia (NASDAQ:NVDA | NVDA Price Prediction) this week.\n\nNvidia’s 1.4% decline slightly underperformed the S&P 500, down 1.29% over the same period. More notably, Nvidia lagged the semiconductor sector, as the VanEck Semiconductor ETF (NYSEARCA:SMH) gained 1.51% for the week. Year-to-date, Nvidia sits down 1.98% while semiconductors broadly are up 13.21%.\n\nThat divergence is striking since NVIDIA is such a natural beneficiary of massive AI infrastructure spending that’s been announced in recent weeks.\n\nUBS lifted its price target on Nvidia from $235 to $245, maintaining a Buy rating. The firm cited “positive earnings backdrop and supply chain trends” heading into next month’s GTC event, Nvidia’s annual developer conference that typically serves as a product roadmap reveal. UBS expects fiscal Q4 results to exceed company guidance, banking on robust gross margins and sustained production growth. The $245 target implies roughly 34% upside from current levels. That’s a vote of confidence that Blackwell momentum continues and that supply constraints have eased enough to meet hyperscaler demand.\n\nCapital expenditure cycles at Microsoft (NASDAQ:MSFT), Amazon (NASDAQ:AMZN), and Alphabet (NASDAQ:GOOGL) are driving semiconductor demand.\n\nThe Invesco PHLX Semiconductor ETF (NASDAQ:SOXQ) amassed $1 billion in assets, with Nvidia as a top holding alongside Advanced Micro Devices (NASDAQ:AMD) and Broadcom (NASDAQ:AVGO). The fund’s 59% concentration in its top 10 holdings underscores how much of the AI chip thesis rests on a handful of players.\n\nWhen hyperscalers announce CapEx plans, Nvidia’s revenue trajectory gets written in real time. Arista Networks (NYSE:ANET) raised its 2026 AI revenue guidance to $3.25 billion on Thursday, signaling that AI infrastructure spending isn’t slowing.\n\nHowever, Arista’s earnings weren’t all good news. The company also mentioned they’re seeing increased interest in AMD’s systems over NVIDIA. This quote was a key reason NVIDIA shares sank 2.23% in Friday’s trading.\n\nYet, there’s more to the AMD story this week…\n\nAMD reported disappointing Q4 results and Q1 guidance on February 3rd, with the stock down 17% post-earnings. The results weren’t bad, but expectations have grown significantly.\n\nAMD expects significant growth in the second half of 2026 with its MI450 chip release, so we’ll get a better picture whether the MI450 can actually cut into NVIDIA’s market share at that time.\n\nThe bigger concern this week was likely Amazon. The company is spending $200 billion in capex this year, but mentioned its homegrown Trainium chips a staggering 27 times on its earnings call. The company would love to drive more usage of Trainium, but the question is whether customer demand is equal to NVIDIA’s chips. Another concern: how many Trainium chips can Amazon actually produce this year? The company will likely need to rely heavily on NVIDIA as there’s a limited amount of Trainium chips to soak up Amazon’s $200 billion in capex guidance.\n\nIf you’re looking for more NVIDIA news, make sure to subscribe to 24/7 Wall St.’s AI Investor Podcast. Each week we run down the biggest news in the AI space and issue our top AI stock recommendations in a $500,000 portfolio managed (for free!) for all listeners. You can pick your favorite podcast player to subscribe and receive updates whenever new episodes drop.\n\nOpenAI vs. Google And What Investors Can Expect From Other Titans In 2026\n\nSee us invest in our favorite AI stock ideas for free\n\nThe AI infrastructure arms race has reached a staggering scale. Hyperscalers are collectively pouring approximately $700 billion into AI CapEx…\n\nper share The cloud computing sector is experiencing explosive growth, with combined backlogs from major providers like Microsoft (NASDAQ:MSFT |…\n\n2024 will go down as another year that NVIDIA (Nasdaq: NVDA | NVDA Price Prediction) was the story stock of AI, but…\n\nBank of America slapped a $275 price target on Nvidia (NASDAQ:NVDA | NVDA Price Prediction) stock. This is nowhere near…\n\nJust three weeks after Taiwan Semiconductor Manufacturing (NYSE:TSM) delivered fourth-quarter results that beat estimates and reaffirmed the durability of AI…\n\nHere’s the paradox keeping Wall Street analysts up at night: Tech giants are pouring $700 billion into AI infrastructure, yet…\n\nIt’s Christmas in February for AI investors. Last night Alphabet (Nasdaq: GOOGL | GOOGL Price Prediction) reported earnings and investors weren’t happy…\n\nTwo of tech’s most dominant companies just hit a milestone investors hoped to avoid. Amazon (NASDAQ:AMZN | AMZN Price Prediction)…\n\nBroadcom closed Friday trading at $325.17, down 2.3% for the week. While the semiconductor sector gained ground with the SOXX…"
    }
]