[
    {
        "title": "NVIDIA (NVDA) Trading 41% Below Analyst Targets After Recent Drop",
        "url": "https://247wallst.com/investing/2026/02/17/nvidia-nvda-trading-41-below-analyst-targets-after-recent-drop/",
        "source": "24/7 Wall St.",
        "date": "2026-02-17T20:45:00+00:00",
        "content": "NVIDIA (NVDA) dropped 4.55% this week despite 62% revenue growth and analyst price targets showing 41% upside.\n\nNVIDIA insiders completed 115 stock sales over 90 days with zero purchases during the recent price decline.\n\nTraders assign 94.5% probability NVIDIA beats earnings February 25 but only 52% chance stock holds above $180.\n\nSending You to Google News in 3\n\nNVIDIA (NASDAQ:NVDA | NVDA Price Prediction) is down 4% over the past week. That’s a sharper drop than the broader market’s 2.21% decline and more than double the semiconductor sector’s 1.07% pullback measured by the VanEck Semiconductor ETF. Yet Wall Street analysts maintain an average price target of $253.88, implying 41% upside from current levels. That’s a massive gap for a stock that just delivered a 62% year-over-year revenue surge and 65% net income growth in its most recent quarter.\n\nThe AI infrastructure leader dominates the data center GPU market, with $51.2 billion in Data Center revenue last quarter, up 66% year-over-year. CEO Jensen Huang described demand as “off the charts” for the company’s new Blackwell architecture, noting that “cloud GPUs are sold out.” With the company guiding to $65 billion in Q4 revenue, the fundamental story appears intact. So why the disconnect between price action and analyst conviction?\n\nNVIDIA’s recent weakness is particularly striking because it’s company-specific rather than sector-wide. While NVIDIA fell 4% this past week, the semiconductor sector dropped only 1.07%. That 3.5 percentage point gap suggests investors are reacting to NVIDIA-specific concerns rather than broad chip industry headwinds.\n\nThe weakness appears tied to several factors. First, insider selling has been relentless. CFO Colette Kress sold approximately 48,870 shares on February 4 at prices ranging from $172.40 to $179.16, right in the middle of this week’s decline. EVP Ajay Puri disposed of 200,000 shares on January 21 at $180.04. Across the past 90 days, there have been 115 insider disposals and zero purchases. When executives sell during weakness rather than buy, it raises questions about their confidence in near-term upside.\n\nSecond, competitive pressure is building. AMD announced a partnership with Tata Consultancy Services to deploy AI data center infrastructure in India, directly targeting NVIDIA’s dominance in emerging markets. While NVIDIA maintains superior profitability and systems integration capabilities, the narrative of unchallenged market leadership is showing cracks.\n\nThird, prediction markets reveal a disconnect between earnings optimism and price expectations. Traders on Polymarket assign a 94.5% probability that NVIDIA will beat its $1.52 EPS estimate when it reports on February 25. Yet those same traders price only a 52% probability the stock will finish above $180 by week’s end and just a 28.5% chance of reaching $185. This suggests concerns about forward guidance or margin pressure despite beating the current quarter’s numbers.\n\nWall Street’s bullish stance rests on NVIDIA’s structural advantages and the compounding growth in AI compute demand. The analyst community shows overwhelming conviction, with 12 Strong Buy ratings, 48 Buy ratings, 3 Hold ratings, and just 1 Sell rating. That’s 94% of analysts in the Buy camp.\n\nTheir thesis centers on Blackwell’s ramp. The new architecture is achieving record performance in industry benchmarks and transitioning to volume production. Major deployments are already locked in: OpenAI is deploying at least 10 gigawatts of NVIDIA systems, Anthropic committed to 1 gigawatt of capacity, and Oracle’s Solstice supercomputer will use 100,000 Blackwell GPUs. These are not speculative projects. They are contracted revenue streams.\n\nAnalysts also point to margin expansion ahead. NVIDIA guided Q4 gross margins to 74.8% GAAP and 75.0% non-GAAP, up roughly 140 basis points from Q3. The company’s 53% profit margin and $4.04 in trailing twelve-month EPS support a valuation argument that the stock is not expensive relative to growth. At a forward P/E of 23.75 and a PEG ratio of 0.706, NVIDIA trades below its growth rate on a PEG basis, which is rare for a company growing revenue at 62%.\n\nThe ecosystem momentum is undeniable. Applied Materials, Arista Networks, and Lattice Semiconductor all beat earnings recently with strong guidance, signaling sustained demand for AI infrastructure. ASML raised its sales outlook, and Taiwan’s data center market is projected to grow at a 19.44% CAGR through 2031. NVIDIA sits at the center of this buildout.\n\nThe ratings breakdown shows extreme bullish skew. With 94% of analysts in the Buy camp and only one Sell rating, consensus is rarely this one-sided for a mega-cap stock. That level of agreement can be a contrarian warning sign, but it also reflects the durability of NVIDIA’s competitive moat. The 41% implied upside is significant for a $4.45 trillion market cap company, suggesting analysts see another $1.8 trillion in potential value creation.\n\nThe February 25 earnings call will be critical for determining whether the current price represents a buying opportunity or signals deeper concerns. Analysts will be watching for confirmation that Blackwell demand is translating to contracted revenue rather than just customer interest. The transition from Hopper to Blackwell architecture needs to show it is not causing customer hesitation or margin compression beyond what management has disclosed.\n\nThree metrics matter most: First, whether gross margins are expanding as promised, with Q1 guidance maintaining the 75% level management projected. Second, whether Q1 revenue guidance shows sequential growth above $70 billion, confirming the momentum continues. Third, any signals about demand patterns in China, where H20 sales were insignificant in Q3, or indications that cloud providers are slowing GPU purchases to digest existing capacity.\n\nThe insider selling pattern raises questions about executive confidence in near-term price appreciation. When the CFO systematically sells during a 6% weekly drop rather than buying, it suggests caution about immediate catalysts. Prediction markets pricing in an earnings beat but a flat-to-down stock reaction indicates traders expect a “sell the news” event, where strong results are already priced in.\n\nFor investors with a 12-month time horizon who believe AI infrastructure spending will accelerate through 2026, the risk-reward calculation may favor accumulation at current levels. NVIDIA’s $62.2 billion in remaining buyback authorization provides downside support, and the company returned $12.7 billion to shareholders in Q3 alone. However, the gap between $180 and the $254 analyst target will not close overnight. The next major catalyst arrives in eight days, and clarity on forward guidance will determine whether the bullish thesis remains intact or requires reassessment.\n\nOur top personal finance-related articles today. Your wallet will thank you later.\n\n1. Netflix’s Business Model Under Fire Despite Q4 Beat Netflix beat Q4 earnings estimates but the stock dropped 7% anyway,…\n\nNvidia (NASDAQ:NVDA | NVDA Price Prediction) has been among the most closely-watched Magnificent 7 stocks on the market. The AI chip…\n\nAdvanced Micro Devices (NASDAQ: AMD) | AMD Price Prediction reports FY2025 full-year and Q4 earnings on Feb. 3, 2026, after…\n\nNvidia (NASDAQ:NVDA | NVDA Price Prediction) stands as the undisputed leader in artificial intelligence (AI) chips, powering data centers and…\n\nNvidia’s (NASDAQ:NVDA | NVDA Price Prediction) highly-anticipated fiscal 2025 Q3 results are set to be released on Nov. 20, and…\n\nHere’s the paradox keeping Wall Street analysts up at night: Tech giants are pouring $700 billion into AI infrastructure, yet…\n\nNvidia remains the dominant AI chipmaker in the market, but where is the stock headed for the rest of this…\n\nThe Trump administration plans to exempt certain companies from upcoming tariffs on advanced semiconductors. The exemptions are tied to Taiwan…\n\nNvidia (NASDAQ:NVDA | NVDA Price Prediction) sits at $188.52 after a 6% weekly surge. Prediction markets assign just 6% odds…"
    },
    {
        "title": "Stock market today: Dow, S&P 500, Nasdaq end higher in volatile trading day as Apple jumps",
        "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-end-higher-in-volatile-trading-day-as-apple-jumps-210119999.html",
        "source": "Yahoo Finance",
        "date": "2026-02-17T21:12:00+00:00",
        "content": "US stocks edged higher Tuesday in volatile trading as Wall Street continued assessing the AI jitters that have hammered markets in recent weeks.\n\nThe tech-heavy Nasdaq Composite (^IXIC) flipped into the green to end 0.1% higher, recovering from steep losses early in the session. The S&P 500 (^GSPC) rose just above the flatline. The Dow Jones Industrial Average (^DJI) was little changed.\n\nApple (AAPL) shares gained more than 3% over optimism that the iPhone maker is ramping up development of wearable devices with AI capabilities.\n\nAfter a break for Presidents Day, AI concerns continued to simmer. Investors are on the lookout for the next potential victim after fresh worries about AI's ability to upend industries hit stocks in sectors from wealth management to transportation to logistics. The Dow and S&P 500 have fallen in four of the past five weeks amid that pressure.\n\nThis week, earnings season enters its final stretch. The week's highlight is Walmart's (WMT) quarterly report on Thursday, the first since the retail giant joined the trillion-dollar market cap club.\n\nElsewhere in corporates, Paramount Skydance (PSKY) stock rose over 5% on Tuesday following the news that Warner Bros. Discovery (WBD) has given the studio one week to come back with a better offer. Warner Bros. rejected the latest bid from the Hollywood studio.\n\nStocks went from negative to positive territory on Tuesday with the three major averages closing just above the flatline.\n\nThe tech-heavy Nasdaq Composite (^IXIC) rose 0.1%, while the S&P 500 (^GSPC) rose 0.1%. The blue-chip-heavy Dow Jones Industrial Average (^DJI) closed slightly higher.\n\nApple (AAPL) shares gained more than 3% after a Bloomberg report indicated the tech giant is ramping up development of three wearable devices with AI capabilities, including glasses, a pendant, and AirPods.\n\nFinancial (XLF) stocks gained while some software players continued their decline over fears that AI will disrupt the industry.\n\nGE Aerospace (GE) is dragging aerospace & defense higher today, up over 3% heading into the close.\n\nOther winners include Raytheon (RTX), Honeywell (HON), Parker-Hannifin (PH), and Wabtec (WAB).\n\nStill, it’s not a sea of green for a group that’s been a bastion of strength since the post–\"Liberation Day\" lows last April. General Dynamics (GD), Lockheed Martin (LMT), and Teledyne (TDY) are slightly in the red.\n\nGE’s the standout story either way. After spinning off GE Vernova (GEV), the stock has pushed back above its old 2000 peak — a long way from the two lost decades in between. It’s up more than 10x from the 2020 lows and back within spitting distance of the Jan. 6 all-time high.\n\nThe Dow Jones Transportation Index (^DJT) rallied Tuesday into key technical resistance above 19,500. That’s the 61.8% Fibonacci retracement from the Feb. 6 all-time closing high to the Feb. 12 closing low — and it’s the line in the sand for bears to defend.\n\nTransportation and logistics stocks like RXO Inc. (RXO) and C.H. Robinson Worldwide (CHRW) were among last week’s biggest losers, as the “AI scare trade” morphed from a software-only problem into a sledgehammer that hit anything tied to efficiency, labor, and fee pressure — including asset managers and insurance brokers. Now they’re bouncing hard, with RXO at the top of the transport tape.\n\nAirlines weren’t in the AI crosshairs, but they still got swept up in the industry sell-off. The spark was a paper from microcap Algorythm Holdings (RIME) on using AI in transportation logistics, which set off nerves in an index that had already notched 10 record closes in 2026.\n\nToday, Southwest (LUV) is leading the airlines bounce — up near 7% — with United (UAL), American (AAL), and Alaska (ALK) in tow, each up more than 3%.\n\nMeanwhile, RIME is down 17% after opening at a one-year high.\n\nFor the Dow Transports: holding above 19,500, bulls take control. Rejected, 19,000 is the downside target.\n\nApple (AAPL) shares gained more than 3% on Tuesday after a Bloomberg report indicated the tech giant is ramping up development of three new wearable devices with AI capabilities, including glasses, a pendant, and AirPods.\n\nThe devices are all built around Apple’s Siri digital assistant, according to the report.\n\nThe iPhone maker is competing with Meta (META), which is developing smart glasses, and OpenAI, which is exploring wearable devices.\n\nApple shares also gained following a bullish note from Wedbush Securities analyst Dan Ives, who brushed off a recent decline in Apple shares amid a broader tech sell-off.\n\n\"This recent worry and sell-off in Apple Inc.’s shares is unwarranted, as the focus is on Apple getting its AI strategy right and releasing its advanced AI features by the summer timeframe, which still appears to be on track,\" wrote Ives.\n\nWedbush maintained an Outperform rating and a $350 price target.\n\nGold (GC=F) retreated more than 2% on Tuesday, but the recent volatility may be temporary as Wall Street analysts see a bullish outlook for the precious metal in 202\n\nGold futures hovered around $4,900 as Asian markets closed for the Chinese New Year. Meanwhile, Iran and the US reached a “general agreement” on a possible nuclear deal, easing tensions in the Middle East.\n\n\"Despite short-term softness, the structural drivers supporting gold remain firmly in place,\" Ole Hansen, head of commodity strategy at Saxo Bank, wrote in a newsletter.\n\nThe strategist highlighted central bank buying, geopolitical fragmentation, and portfolio diversification as key factors driving gold’s safe-haven appeal amid concerns over currency debasement.\n\nPalantir (PLTR) has moved its headquarters to Miami from Denver, joining a growing list of firms through the financial and tech sectors to decamp for the growing \"Wall Street South.\"\n\nThe company announced the move in an X post on Tuesday. Shares picked up roughly 0.5% in midday trading.\n\nIn moving its headquarters to Miami, Palantir follows a large list of companies looking to Florida for lower taxes and a lighter business regulation scheme. Among those are Citadel, one of the largest hedge funds in the world, led by Ken Griffin, and Related Companies, the real estate investment firm led by Stephen Ross.\n\nGriffin and Ross, both billionaires, recently launched a $10 million campaign aimed at convincing more corporate leaders to relocate their firms to Miami. Peter Thiel, the chairman of Palantir, also recently opened an office for his private investment firm in Miami, according to Bloomberg.\n\nAfter Ford's first release of electric vehicles, the automaker faced demand below expectations — and a massive bill of roughly $19.5 billion in write-offs. With its latest EV plan, the company is pivoting to a \"universal electric vehicle (UEV) platform\" designed to lower manufacturing costs.\n\nShares in renewable power provider Ormat Technologies (ORA) surged Tuesday morning, gaining more than 5% on the announcement of a deal that will see Ormat provide geothermal energy for Google (GOOG) data center projects.\n\nUnder the terms of the deal, Ormat will develop several geothermal power projects throughout Nevada that the company said provide Google with around 150 megawatts of power for the Big Tech hyperscaler's data center projects in the region.\n\nThe sites are expected to come online between 2028 and 2030, Ormat said in its press release announcing the deal. The Purchase Power Agreement underpinning the project is subject to approval from the Public Utilities Commission of Nevada (PUCN), expected in the second half 20206, Ormat said.\n\n“AI is fundamentally increasing electricity demand across the technology sector, and geothermal power is uniquely positioned to deliver the reliable, carbon-free power required to support that growth,” Doron Blachar, Chief Executive Officer of Ormat Technologies, said in the press release.\n\nOil prices fell Tuesday after Iran announced it had reached a \"general agreement\" with the US on a potential nuclear deal that would lift some sanctions on the Iranian regime.\n\nFutures on Brent crude (BZ=F), the international pricing benchmark, fell by 0.6% to trade below $67.50. Those on the US pricing benchmark West Texas Intermediate (WTI) crude (CL=F), lost 0.9% to change hands around $62.25.\n\nIn comments to state TV, Iranian foreign minister Abbas Araghchi said, “We were able to reach a general agreement on a set of guiding principles, based on which we will proceed from now on and move toward drafting a potential agreement.\"\n\nIran's leadership has spent the past month in talks with US Special Envoy Steve Witkoff. The news is seen as lowering the risk of a military conflict between the two countries, which would apply an immediate risk premium to oil prices.\n\nIran largely controls the Strait of Hormuz, a key shipping chokepoint that sees roughly 20 million barrels of oil traverse its waters every day. Any moves to restrict access to the strait, or attacks against infrastructure in the region, would push oil prices much higher as buyers priced in longer and slower shipping routes and a drop-off in Middle Eastern supply.\n\nEarlier on Tuesday, Iranian leadership said Tehran would partially close the strait for several hours due to military drills, according to Bloomberg. The move comes as the US has steadily built up its naval armament in the region, sending a second aircraft carrier to the region late last week. The US Maritime Authority advised ship captains in early February to avoid Iran's territorial waters if possible, for fear of potential interference or forcible boardings.\n\nYet despite seeming progress toward a deal the X account for the Ayatollah Ali Khamenei, Iran's supreme leader, posted several comments disparaging US involvement in Iran's energy industry.\n\n\"The Americans say, ‘Let's negotiate over your nuclear energy, and the result of the negotiation is supposed to be that you do not have this energy!'\" the X account posted early Tuesday morning.\n\n\"If that’s the case, there is no room for negotiation; but if negotiations are truly to take place, determining the outcome of the negotiations in advance is a wrong and foolish act.\"\n\nCorporate profits are rising while labor income keeps falling, a sign that so-called \"K-shaped\" movements in the economy are continuing, analysts for Bank of America wrote on Tuesday.\n\nSince the COVID-19 pandemic, the analysts wrote, an increasing amount of economic data has pointed toward an uptick in productivity. However, the economic gains from that productivity seem to be aggregating in corporate profits, while wages steadily fall.\n\nThis split between profits and income is consistent and being reinforced by the rally in financial as well as real assets, which are more concentrated among higher- and middle-income households,\" the analysts wrote. The dichotomy in the data also \"begs the question of whether these are real improvements in labor productivity.\n\n\"It remains to be seen whether wages and salaries recoup some of their lost ground relative to corporate profits,\" the analysts wrote. \"But for now, higher profits relative to wages are yet another driver of a K-shaped economy, as higher-income consumers tend to be more exposed.\"\n\nUS stocks opened Tuesday's session split, as the tech sector continued its downturn in a sign that investor concerns about AI disruption aren't yet settling.\n\nThe tech-heavy Nasdaq Composite (^IXIC) led losses, shedding roughly 0.5%, while the S&P 500 (^GSPC) lost a thinner 0.2%. Meanwhile, the blue-chip-heavy Dow Jones Industrial Average (^DJI), which is less exposed to the tech sector, rose roughly 0.3% before paring gains.\n\nFourth-quarter results from Walmart (WMT), a recent member of the the trillion-dollar market cap club, on Thursday will highlight the week's earnings calendar. Constellation Energy (CEG), Energy Transfer (ET), Medtronic (MDT), and Palo Alto Networks (PANW) will also report this week, all on Tuesday.\n\nThe Personal Consumption Expenditures index and an advance read on fourth-quarter GDP, both on Friday, will dominate investor attention on the economic calendar. Investors will also get meetings from the Federal Reserve's January meeting on Wednesday.\n\nShares in consumer food giant General Mills (GIS) fell by more than 3.3% in premarket trading after the company lowered its 2026 sales outlook. \"Weak consumer sentiment, heightened uncertainty, and significant volatility have weighed on category growth and impacted consumer purchase patterns\" contributed to the dour outlook, the company said.\n\nGeneral Mills is now projecting organic net sales of -1.5% to -2%, down from a previous range of -1% to 1%. Adjusted operating profit and adjusted diluted earnings per share are now expected at a range of -16% to -20%, down from a previously stated range of -10% to -15%.\n\n\"While the company is making meaningful progress in strengthening its remarkability to position the business for long-term sustainable growth, this progress has come amid a more challenging backdrop,\" General Mills said in its statement.\n\nWhile General Mills has managed to return roughly 4% since the beginning of the year, the company's shares are down more than 18% over the past year. Meanwhile, an index tracking the consumer staples sector (XLP) has returned 15% year to date and roughly 10% since the same time last year.\n\nParamount Skydance (PSKY) stock is moving higher after Warner Bros. (WBD) agreed to reopen acquisition discussions.\n\nThe move comes after Paramount proposed a new all-cash offer last week of $30 per share to acquire the entire company. That offer came with a $ 0.25-per-share \"ticking fee\" — under which Warner Bros.' shareholders would receive $0.25 per share each quarter until the transaction is not closed beyond the end of this year.\n\nParamount also floated an informal acquisition proposal for $31 a share, WBD said.\n\nThe new window for discussions will last seven days, ending on Feb. 23, 2026, \"to seek clarity for Warner Bros. stockholders and provide Paramount the ability to make its best and final offer.\"\n\nIn the release, Warner Bros. Chair Samuel A. Di Piazza said the board of directors said it still suggests the Netflix offer, worth some $82.7 billion, which does not include the entire business.\n\n\"The Netflix merger is in the best interests of WBD shareholders due to the tremendous value it provides\" with a \"clear path to achieve regulatory approval,\" he said in the release.\n\nParamount's current offer of $30 per share values the whole company at $108.4 billion.\n\nNetflix’s co-CEO Ted Sarandos testified before the Senate Judiciary Subcommittee last week, negating claims that it would lead to a monopoly, or higher prices for consumers.\n\nYahoo Finance's Jake Conley lays out the key events ahead for investors in a holiday-shortened week.\n\nRead more here on what to look out for.\n\nDTE Energy (DTE) stock rose as much as 10% before paring gains. The energy company is due to release its earnings before the bell today, and the stock has risen 13% over the past year.\n\nNorwegian Cruise Line (NCLH) stock rose 7% during premarket trading on Tuesday after activist investor Elliott built a stake in the company.\n\nStrategy (MSTR) stock fell 3% before the bell today. The company, which is one of the largest corporate holders of bitcoin, has been struggling recently due to the sell-off with the world's largest cryptocurrency.\n\nA growing number on Wall Street are assessing the recent AI sell-offs. And despite many fearing the bubble has burst, for stock pickers, now might be the time for them to get greedy.\n\nGermany's Hapag-Lloyd (HLAG.DE, HPGLY) is buying ZIM Integrated Shipping Services in a deal worth $4.2 billion, bringing together two of the world's biggest shipping lines.\n\nShares of Israel-based ZIM rocketed over 35% higher in premarket trading, after the two companies confirmed the takeover on Monday.\n\nThe Wall Street Journal reports:\n\nNothing like a BofA fund manager survey drop the day after a market holiday.\n\nLots of great nuggets in the one out this morning, but the chart below stood out to me. So many on the Street I talk with expect a very robust economy this spring, in part because of expectations for a strong tax refund season.\n\nGoes a long way in explaining the hot small-caps trade.\n\nMasimo (MASI) stock surged over 30% in premarket following a report that Danaher (DHR) is closing in on a deal to buy the medical technology company.\n\nThe deal moves come two years after activist investor Politan succeeded in pushing through a change in Masimo's board.\n\nIt would be the biggest acquisition by Danaher in over half a decade, the Financial Times reported. Shares of the US life sciences manufacturer fell over 5% before the bell.\n\nRead more here (premium subscribers)\n\nNorwegian Cruise Line (NCLH) stock rose 6% before the bell on Tuesday following a report from The Wall Street Journal that activist investor Elliott has built a 10% stake in the company and plans to push for changes.\n\nElliott has become one of the cruise line's top investors and is keen to fix the company's underperformance. Elliott has so far built stakes in Southwest Airlines (LUV), as well as oil refiner Phillips 66 (PSX) and Toyota Industries (TYIDY). According to The Wall Street Journal, Elliott has over $79 billion in assets under management and is concerned about Norwegian Cruise Line's financial performance."
    },
    {
        "title": "The Staggering Number That Shows Why Nvidia Is Still a Buy",
        "url": "https://247wallst.com/investing/2026/02/16/the-staggering-number-that-shows-why-nvidia-is-still-a-buy/",
        "source": "24/7 Wall St.",
        "date": "2026-02-16T22:48:00+00:00",
        "content": "Nvidia (NVDA) reported Q3 revenue of $57B and guided Q4 to $65B. Nvidia grew revenue 62% year-over-year.\n\nGoldman Sachs projects Nvidia revenue will reach $513B by 2028 versus $400B consensus.\n\nNvidia’s forward P/E sits at 24 with a PEG ratio under 0.5.\n\nSending You to Google News in 3\n\nNvidia (NASDAQ:NVDA | NVDA Price Prediction) stock has been stuck in neutral since last August, trading in a fairly narrow range around $180 per share as questions about artificial intelligence (AI) spending fester. Despite blowout quarterly numbers and expectations that hyperscalers could spend as much as $700 billion in capex this year on AI — much of it likely going to Nvidia for its latest accelerators like Blackwell — the stock has gone nowhere.\n\nYet there is one staggering number that indicates you should buy Nvidia stock while it is still a bargain because it will soon explode higher.\n\nNvidia reported fiscal third-quarter results in November showing revenue reached a record $57 billion, up 22% sequentially and 62% year-over-year. Data Center revenue — the primary AI driver — hit $51.2 billion, rising 25% from the prior quarter and 66% from a year earlier. Management guided fourth-quarter revenue to $65 billion, plus or minus 2%.\n\nThe AI chipmaker has grown exponentially over the past few years, with revenue surging from earlier bases through relentless demand for its GPUs in AI training and inference. While it might not be able to continue doubling revenue every year — the arithmetic simply gets harder the larger the base becomes — it doesn’t mean Nvidia is still not growing at a breakneck pace. The company’s full-stack ecosystem, including hardware, software like CUDA, and partnerships with model builders, continues to fuel sustained expansion.\n\nAnalysts widely expect the upcoming Q4 report on Feb. 25 to show another beat, with the consensus around $65.6 billion in revenue and potential for larger numbers driven by Blackwell sales ramping higher.\n\nGoldman Sachs wrote in a recent research note that its analysts expect Nvidia to beat fourth-quarter revenue estimates by roughly $2 billion — some 5% higher than consensus forecasts, potentially pushing results toward $67 billion. The firm is also calling for a 9% beat on the consensus for the first quarter of fiscal 2027.\n\nThe truly staggering number comes from Goldman’s revenue projection for 2028: $513 billion, well above the $400 billion consensus and representing a 53% compound annual growth rate from fiscal 2026 estimates of about $215 billion. At that level, Nvidia would be generating well over $1 billion in sales every single day of the year.\n\nThis outlook assumes strong ramps in Rubin GPUs starting in late 2026, continued AI infrastructure demand from hyperscalers, and Nvidia’s dominance in accelerators. Even conservative views see multi-year tailwinds from sovereign AI projects, enterprise adoption, and software monetization.\n\nNvidia’s current valuation appears attractive relative to its growth trajectory. Today, with the stock around $183, the forward P/E ratio sits near 24, a level not seen in nearly a year and close to the S&P 500‘s multiple. The PEG ratio — its valuation relative to its projected earnings growth rate — hovers under 0.5, signaling significant undervaluation. This compression has occurred as short-term concerns over supply constraints and capex sustainability have taken hold, but the chipmaker’s fundamentals remain robust.\n\nFew companies have achieved what analysts are expecting from Nvidia. Walmart (NYSE:WMT) — the world’s biggest sales producer — generated $681 billion in revenue in fiscal 2025. It is expected to grow that some 5% in 2026 and almost 12% in 2027. Even if it continues at that higher rate thereafter — a big assumption — Nvidia will overtake it by 2030 based on Goldman’s trajectory.\n\nThere is just no way Nvidia stock can remain range-bound for very long at that pace. Producing the kind of revenue and profits that it is — backed by hyperscaler spending — means the stock will soon soar higher, making its current very cheap valuation a bargain price to pay. With fourth-quarter results imminent, any beat-and-raise scenario could accelerate the breakout investors have been waiting for.\n\nOur top personal finance-related articles today. Your wallet will thank you later.\n\nNvidia (NASDAQ:NVDA | NVDA Price Prediction) is at the forefront of the artificial intelligence (AI) revolution, providing the essential GPUs…\n\nNvidia (NASDAQ:NVDA | NVDA Price Prediction) reported blockbuster earnings in Q3, with many believing that the report was enough to…\n\nLive Updates How Close Is NVIDIA to $5 Trillion Dollars? Nov 19, 2025 at 5:02 PM EST NVIDIA’s third quarter…\n\nNvidia remains the dominant AI chipmaker in the market, but where is the stock headed for the rest of this…\n\nNvidia (NASDAQ:NVDA | NVDA Price Prediction) stock is slumping, dropping 12% from its recent record high. Despite a blowout quarter…\n\nNvidia (NASDAQ:NVDA | NVDA Price Prediction) has ridden the AI wave to extraordinary heights. Since late 2022, when generative AI…\n\nThe artificial intelligence revolution has brought plenty of attention to specific tech stocks servicing the ultra-high expected growth the AI…\n\nMarket Myopia Mars Nvidia’s Q2 Triumph Nvidia (NASDAQ:NVDA | NVDA Price Prediction) unveiled its second-quarter earnings yesterday, showcasing a blockbuster…\n\nNvidia (NASDAQ:NVDA | NVDA Price Prediction) delivered a blowout earnings report yesterday, easing fears that artificial intelligence (AI) spending might…"
    }
]