[
    {
        "title": "AMD Vs. Nvidia : What's the Better AI Stock?",
        "url": "https://www.investing.com/analysis/amd-vs-nvidia--whats-the-better-ai-stock-200674870",
        "source": "Investing.com",
        "date": "2026-02-11T17:02:00+00:00",
        "content": "A big chunk of the S&P 500 has already reported 2025 Q4 results, though the reporting docket remains stacked for weeks to come. We’ve already heard from six of the Magnificent Seven members, with NVIDIA (NVDA) the only one yet to report from the beloved group.\n\nA peer to NVIDIA, namely Advanced Micro Devices (AMD), has already delivered its results, with the stock facing pressure post-earnings. AMD shares have lagged relative to NVDA over the past three months by a fairly wide margin, as shown in the chart below.\n\nImage Source: Zacks Investment Research\n\nWere AMD’s results bad, or was it more a reflection of profit-taking after a big run over the past year? And what can investors expect from NVIDIA earnings? Let’s take a closer look at the results from AMD and expectations for NVDA.\n\nAMD’s results were positive across the board, breaking records across many key metrics. Q4 revenue grew by 34% year-over-year to a record $10.3 billion, and importantly, Data Center revenue of $5.4 billion also reached a new all-time high. Both metrics clearly paint a strong demand picture for the company, underpinned by the broader AI frenzy that won’t be slowing anytime soon.\n\nBelow is a chart illustrating AMD’s Data Center sales on a quarterly basis.\n\nImage Source: Zacks Investment Research\n\nThe overall revenue acceleration over recent periods can be seen below. Please note that the chart below does not show actual sales figures but rather the YoY growth rates.\n\nImage Source: Zacks Investment Research\n\nSales acceleration is a key factor in share outperformance, particularly so for stocks involved in the AI trade. The sales acceleration paired with favorable sales revisions for its upcoming period (2026 Q1) reflects a notably bullish pairing, with the $9.7 billion expected in the next release suggesting a 32% YoY growth rate.\n\nAs shown below, the sales estimate has been revised 6% higher since roughly mid-November of 2025, with the biggest revisions happening more recently.\n\nImage Source: Zacks Investment Research\n\nThe company’s EPS outlook for the upcoming release (2026 Q1) is also bullish, with the current $1.27 Zacks Consensus EPS estimate up 7% since mid-November and suggesting 33% YoY growth. The outlook for shares continues to remain bright, with the recent weakness in shares post-earnings also giving shares a nice, healthy breather after a massive run.\n\nThe valuation picture here isn’t overly rich, either, relative to its history, with the current 31.0X forward 12-month earnings multiple well off the 38.0X five-year median. The current multiple reflects a 34% premium to the S&P 500, reflecting investors’ above-average growth expectations but remains well below the 77% five-year median premium.\n\nNVIDIA is always a ‘late reporter’ in the earnings cycle, with its results coming well after many of the notable tech players. EPS and sales revisions for the upcoming release, expected on Feb. 25th after the close, have remained both stable and bullish since mid-November, up by 3.4% and 2.5%, respectively.\n\nWhile no upward revisions have occurred since the beginning of the new year, the stability here is a big positive. Below is a chart illustrating how the EPS and sales revisions trends have evolved over recent months.\n\nImage Source: Zacks Investment Research\n\nConcerning the Data Center, undoubtedly the most important metric for NVIDIA nowadays, the Zacks Consensus estimate stands at $58.7 billion, suggesting a 65% YoY growth rate. Keep in mind that NVDA has regularly exceeded our consensus estimate over recent periods, penciling in five beats over the last six quarters.\n\nBelow is a chart illustrating NVDA’s data center sales on a quarterly basis, with our consensus $58.7 billion estimate also blended in.\n\nImage Source: Zacks Investment Research\n\nShares aren’t rich by any stretch despite the massive run, with the current 25.8X forward 12-month earnings multiple nearly half of the 41.3X five-year median while reflecting just a 12% premium relative to the S&P 500. Keep in mind that shares traded well above current valuation levels in 2021 and 2022, when the AI theme had not yet been fully recognized by the market.\n\nImage Source: Zacks Investment Research\n\nBoth stocks reflect great options for those seeking AI exposure, though it’s undeniable that NVIDIA (NVDA - Free Report) remains the leader of the pair, underpinned by CUDA, its software platform that has let developers use GPUs for general computing, not just graphics. It was launched way back in 2006, providing a big head start.\n\nAdvanced Micro Devices (AMD) remains a powerhouse in its own right, but it continues to trail NVIDIA, particularly in market penetration. NVIDIA currently ranks as a Zacks Rank #2 (Buy), whereas Advanced Micro Devices is currently a Zacks Rank #3 (Hold).\n\nThis article originally published on Zacks Investment Research (zacks.com).\n\nMore from Zacks Investment Research:"
    },
    {
        "title": "Lattice Semiconductor (LSCC) Earnings Transcript",
        "url": "https://www.fool.com/earnings/call-transcripts/2026/02/10/lattice-semiconductor-lscc-earnings-transcript/",
        "source": "The Motley Fool",
        "date": "2026-02-11T00:28:00+00:00",
        "content": "Tuesday, Feb. 10, 2026 at 5 p.m. ET\n\nNeed a quote from a Motley Fool analyst? Email [email protected]\n\nLattice Semiconductor (LSCC +15.92%) reported sequential and year-over-year acceleration in revenue and earnings, citing strong demand across both communications/computing and industrial/automotive end markets.\n\nFord Tamer, Lattice's CEO, and Lorenzo Flores, Lattice's CFO. We'll provide a financial and business review of the 2025 and the business outlook for 2026. If you have not obtained a copy of our earnings press release, it can be found at our company website in the Investor Relations section at latticesemi.com. I would like to remind everyone that during our conference call today, we may make projections or other forward-looking statements regarding future events or the future financial performance of the company. Wish to caution you that such statements are predictions based on information that is currently available and that actual results may differ materially.\n\nWe refer you to documents that the company files with the SEC, including our 10-K, 10-Q, and 8-K. These documents contain and identify important risk factors that could cause the actual results to differ materially from those contained in our projections or forward-looking statements. This call includes and constitutes the company's official guidance for the 2026. If at any time after this call, we communicate any material changes to this guidance, we intend that such updates will be done using a public forum such as a press release or publicly announced conference call. We will refer primarily to non-GAAP financial measures during this call.\n\nBy disclosing certain non-GAAP information, management intends to provide investors with additional information to permit further analysis of the company's performance and underlying trends. For historical periods, we've provided reconciliations of these non-GAAP financial measures to GAAP financial measures that can be found on the Investor Relations section of our website at latticesemi.com. Let me now turn the call over to our CEO, Ford Tamer.\n\nFord Tamer: Thank you, Rick, and welcome everyone to our fourth quarter and full year 2025 earnings call. At the close of 2024, we told you what we're going to do. And over the last year, we did what we said. We accomplished that by delivering on our commitments, stabilizing the business, normalizing channel inventory, improving execution, and positioning Lattice to capitalize on two of the most powerful secular trends shaping our industry: data center AI and physical AI. As we begin 2026, I'm most excited to see that low power FPGAs are being widely adopted at an accelerating rate, becoming the everywhere companion chips. With the Super Bowl still fresh on everyone's mind, I will use a sports analogy.\n\nThe primary processors GPUs, custom AI accelerators, CPUs, and MPUs are the system's most valuable players or MVPs. These MVPs are powerful but cannot win a game, let alone a championship, without a team. And Lattice is that team. We provide the FPGAs, those everywhere companion chips, that perform many of the critical system functions. These include boot, fire sequencing, security, control, IO expansion, board and rack management, leak detection, power and cooling, bridging, sensor aggregation, sensor fusion, pre-processing, and many other valuable system functions.\n\nWe do this across both data center AI and physical AI. We do this across all major markets: communications, compute, industrial, automotive, aerospace, defense, medical, and consumer. And we do this across some of the world's fastest-growing applications: Security, rack management, communication, quantum cryptography, humanoids, industrial automation, logistics, robotaxis, space, and AR/VR wearables. Those powerful companion chips provide pervasive interoperability across all these vital functions, markets, applications, and diverse suppliers. You can consider Lattice as Switzerland for data center and physical AI applications. The other big benefit of our companion chip strategy is that it drives sustainable diversified growth across all markets and applications, which is helping us to deliver on our financial targets. And this companion role becomes foundational as AI workloads push system-level complexity higher and higher and drive to faster time to market.\n\nAs AI servers disaggregate into processor boards, networking cards, security cards, power and cooling modules, storage, and other specialized blades, FPGAs show up everywhere in the data center. We are also seeing the same trend accelerating in physical AI. Intelligence is moving closer to the sensors, where data is created. A single robot can have multiple vision sensors, including image, LIDAR, radar, and infrared, requiring fusion, aggregation, and pre-processing. In addition, humanoid robots could have dozens of motors requiring high precision and low latency control. Companionship FPGAs sit beside those sensors and actuators to synchronize high-bandwidth vision streams with real-time motion and deliver deterministic responses.\n\nInstead of software running on a microcontroller, Lattice FPGAs do this in hardware, making it easier to guarantee the same cycle-accurate responses every time. Finally, in some cases, FPGAs can also serve as the primary compute, such as signal processing, real-time networking, and what has become known as far edge AI.\n\nWe at Lattice define far edge AI as near sensor contextual AI with tiny or small self-contained models. And our momentum is building For example, we recently won a design in a human-machine interface (HMI) industrial robotics, and we are seeing the pull for applications under one TOPS and under one Watt. We came out of our recent global sales conferences with strong momentum, reinforcing our optimistic outlook for 2026. We are seeing accelerated design win momentum in both data center AI and physical AI, and we are excited about the future ahead with our tier-one customer deployments. Now, let me turn to the numbers.\n\nIn Q4, we delivered $145.8 million in revenue, up 9.3% sequentially, our strongest sequential performance in seven years, and up 24.2% year over year. Full-year revenue of $523.3 million was in line with expectations. Looking ahead, our Q1 revenue guidance of $165 million at the midpoint, representing over 37% year-over-year growth, reflects our confidence in a strong recovery and accelerated momentum. Our Q1 EPS guidance of $0.36 at the midpoint represents nearly 65% year-over-year growth as we expect to continue to deliver earnings growth that is faster than revenue growth.\n\nAs you can see, we've got a lot of positive operating leverage. We are operating on mature nodes, which means our capital spending is more reasonable than competitors on advanced nodes. This allows us to drive significantly faster EPS growth than revenue growth. New products remain a key driver for our long-term growth. In 2025, new product revenue grew approximately 70%. We remain on track for new product revenue to reach the mid-twenty percent range as a percent of total revenue in 2026, entering the year with strong momentum. As Nexus and AVANT adoption continues to broaden. Given the scale of the opportunities ahead of us, Lattice is investing for the future accordingly.\n\nOur 2026 slogan, \"go big, be great,\" reflects our ambition and our commitment. We are making investments across silicon, software, systems, operations, and infrastructure. To support growth at scale and to extend our leadership in small and mid-range FPGAs.\n\nIn summary, 2025 was a year of disciplined execution and meaningful progress. We stabilized the business, built tremendous momentum in data center applications, advanced our product and software roadmap, and significantly improved operational performance, including the normalization of channel inventory. We entered 2026 with high confidence. That confidence is supported by a strong backlog, durable data center demand, industrial market returning to growth, expanding companion use cases, and continued new product ramps. Our focus remains on differentiated innovation, deeper customer engagement, and delivering long-term shareholder value. With that, I'll turn the call over to Lorenzo for a comprehensive review of our fourth quarter and full year results. Lorenzo?\n\nLorenzo Flores: Thank you, Ford, and good afternoon, everyone. We will begin with a brief overview of our 2025 fiscal year performance, including our fourth quarter, followed by our first quarter 2026 outlook and our current framing of fiscal 2026. For the full year 2025, we are pleased to report that Lattice delivered on expectations with revenue, gross margin, operating profit, and EPS all in line with our outlook for the full year, including the fourth quarter. We did this while completing our transformation and investing in areas that we believe support long-term profitable growth. Our full-year 2025 revenue increased 2.7% to $523.3 million in line with expectations.\n\nGrowth was driven by our platform successes across communications and computing, with revenue up 28%. This growth was partially offset by an 18% decline in revenue in industrial and automotive, which was expected as we successfully normalized channel inventory throughout the year. Our non-GAAP gross margin continues to reflect our value proposition to our customers and expanded 190 basis points to 69.3% in 2025. We improved revenue and gross margin in 2025 even as we reduced non-GAAP operating expense approximately 1% to $213.5 million. As we completed our restructuring, we made targeted investments in talent, infrastructure, and technology to give us a more robust and efficient platform to drive long-term growth.\n\nAs a result, in 2025, our non-GAAP operating margin expanded 340 basis points and our EBITDA margin increased 320 basis points to 35%, and we delivered non-GAAP EPS growth of 17% to $1.05, demonstrating leverage in our business model by growing earnings faster than revenue. Other metrics improved accordingly.\n\nIn 2025, GAAP net cash flow from operating activities increased to $175.1 million, up from $140.9 million in 2024, with a GAAP operating cash flow margin improving to 33.5%, up from 27.7% in 2024. Free cash flow in the full year 2025 was $133 million with a 25.3% free cash flow margin, up from $120 million and 23.5% in 2024. Focusing specifically on Q4, our performance started to ramp. We will continue into 2026. In Q4, revenue hit $145.8 million, an increase of 9.3% quarter-on-quarter and 24.2% on a year-over-year basis. Growth was driven by a record performance in communications and computing, up 25% sequentially and 60% on a year-over-year basis.\n\nWe are clearly benefiting from the exceptionally strong data center growth as Ford discussed.\n\nQ4 gross margin was 69.4%, slightly down from Q3 on a non-GAAP basis. Our gross margin, even as our mix shifted, continues to reflect the value and differentiation our products provide for our customers. Non-GAAP operating expense was up to $56.4 million, up roughly 5% sequentially and 7% on a year-over-year basis. As Ford and I have stated previously, we see significant near and long-term opportunities and are investing to expand our future leadership in the small and mid-range FPGA markets and our companionship program. Our Q4 non-GAAP operating margin expanded 170 basis points to 30.7% and our EBITDA margin increased 90 basis points to 36.5%.\n\nQ4 non-GAAP EPS grew 14% quarter-on-quarter to $0.32, in line with our guidance. GAAP net cash flow from operating activities for 2025 increased to $57.6 million, up from $47 million in Q3, with a GAAP operating cash flow margin of 39.5%, up from 35.3% in Q3. Free cash flow in Q4 was $44 million with a 30.2% free cash flow margin, up from $34 million and 25.2% in Q3. This remains a focus area for Lattice, and we expect the trend of increased free cash flow margin to continue. We are achieving these improvements while strategically investing in CapEx in support of R&D and operational improvement projects. One last point on results.\n\nWe achieved our overall target level of channel inventory and are well-positioned to benefit from growth in all the end markets we serve. Now let me turn to capital allocation.\n\nOur balance sheet remains strong as our operations have improved our cash flow generation, and we remain debt-free. We have ready access to capital if we need it. This leaves us well-positioned to navigate macro uncertainties and invest for future growth. Given our balance sheet strength and our business model, returning capital to shareholders remains a key component of our capital allocation strategy. For the full year 2025, we repurchased approximately 1.8 million shares or $100 million of the company's common stock. As we completed that repurchase program in Q4, our board of directors authorized the company to repurchase an additional $250 million of its outstanding common stock.\n\nNow for our guidance, which has our typical detail for Q1 2026, and additional commentary to help frame expectations for the full year 2026. For both Q1 and the full year 2026, our outlook reflects the exceptional strength we are currently seeing in demand. In Q1 2026, we expect revenue to grow into the range of $158 million to $172 million. At the midpoint of this range, this is 37% growth from Q1 2025 and 13% over the prior quarter. Gross margin is expected to be 69.5% plus or minus 1% on a non-GAAP basis. Non-GAAP operating expense is expected to be between $59 million and $61 million.\n\nMost of the growth in OpEx will be in R&D and reflects disciplined investments to drive future growth. The income tax rate for Q1 is expected to be between 46% on a non-GAAP basis. Non-GAAP EPS is expected to be in the range of $0.34 and $0.38 per share.\n\nRegarding the full year, we begin 2026 excited about the catalyst driving multiple growth opportunities ahead of us. I would like to share with you our financial framework for the year. We have stated previously that we are highly confident that we will grow at least 20% year over year and the start of the year indicates that we have improved visibility to growth above that. We plan to update you with more specific guidance as we move through the year. Our gross margin for the full year 2026 is expected to be in the same range as we are providing for Q1, with perhaps some fluctuations during the year as customer mix vary.\n\nOn OpEx, we continued to see significant opportunities to expand our leadership in small and mid-range FPGAs. These investments, primarily in R&D, drive the increase in OpEx in Q1. We expect another increase in Q2 but then slower growth in the second half. We have a tight grip on the knobs and levers that control OpEx and will adjust as necessary to hit our profitability objectives. Our income tax rate is expected to be between 47% on a non-GAAP basis.\n\nWith channel inventories now normalized, revenue in 2026 should more closely track consumption, setting up a strong environment for growth in 2026 and beyond. We will continue partnering with our channel to support end customer demand while reducing channel inventory where appropriate. For internal inventory, we are deliberately building inventory to support this growth environment. Because we see such strong growth potential and our products have long life cycles, we see a low risk of obsolescence. In closing, we remain focused on executing our strategy and making investments to strengthen our leadership in small and mid-range FPGA. We are highly confident in driving revenue growth while growing EPS at a faster rate. Operator, that concludes our formal remarks.\n\nWe can now open the call for questions.\n\nOperator: Thank you. We will now be conducting a question and answer session.\n\nRuben Roy: Thank you. Ford and Lorenzo, congrats on a strong finish to the year. For the first question, Ford, if you could walk us through the really strong server growth and you've talked about the dynamics in the data center and the MVPs out there. Thinking about how you're looking at that business going forward, we've heard a lot about server CPU strength from some of the CPU vendors. There have been some supply constraints in the mix. So maybe you could frame those dynamics as well as your growth relative to unit volumes versus dollars of content per server?\n\nFord Tamer: Thank you, Ruben. Yes, we do see demand being strong for the foreseeable future. It is driven by CapEx growth, driven by our attach rates, the increased ASP, and the increased number of applications that we're finding in these servers. At a high level, as we look at server units, growing from 15.3 million units total to 16.5 million units in 2026, our attach rates have been steadily going up every generation. In the 2024 time frame, we were in the mid-1s. As far as attach rate last year, we were in the mid-2s, and this year, we'll pass three units per server, FPGA units per server.\n\nYou multiply this by the number of server units, our attach rate growing, and our ASP is growing as well from the $3 call it to above $4. You put all this together and you could see that this is driving an overall very nice increase in that business.\n\nRuben Roy: Great. Thanks for the detail, Ford. Lorenzo, maybe just a follow-up on the guidance for Q1, very strong guidance. Can you walk us through assumptions by segment? It sounds like we're finally seeing some recovery in industrials and automotive. Communication and compute continue to grow, but maybe you could parse that out for us?\n\nLorenzo Flores: Yeah. I think in aggregate across the business, we're just very, very positive about the trends we're seeing underneath it. Of course, the OMS and compute areas of our business are the leaders in our strength. But as we said, we've gotten our channel inventory down toward our target, and we expect to see growth there as well.\n\nRuben Roy: Great. Thanks, guys. Thank you.\n\nMelissa Weathers: Hi. Thank you for the question, and congrats on a nice outlook. I know it's taken a lot of work to get here. I'm gonna try on the revenue side. It doesn't sound like you guys are super willing to give full-year guidance for 2026, but last quarter, you indicated comms computing could be up 20% to 40%, I think, and industrial up 5% to 15%, if I remember right. You're starting off the year a lot stronger than that. Is there any other color you can help us with, and how to think about which of those grows faster, and maybe where total revenue growth could shake out for '26?\n\nFord Tamer: Yeah. We're very strong. Our conviction has increased on the demand in both segments, Melissa. First, thank you for the question. The demand environment is much stronger now than it used to be three months ago across both the comms and compute and industrial markets. In the comms and compute, as we said, we are very well booked for the year and now booking into '27, so great visibility. And the industrial automotive, where our shipping to the true demand. The inventory in the channel is under three and would be in the twos in Q1. So we're confident in the growth in both segments.\n\nMelissa Weathers: Got it. My follow-up is about the physical AI opportunity. It's a bit harder for us to kind of figure out how big the physical AI opportunity could be. Any way for us to help or to help us size how big this physical AI piece be? Because it seems like you're seeing a lot of momentum there.\n\nFord Tamer: Yeah. We're seeing tremendous momentum there. Along with this companionship strategy. We are very strong with companies like NVIDIA that have we publicly announced together the Holoscan design reference design where we feed different video streams into the FPGA and into the NVIDIA processors. We've made some great progress in our companionship strategy with NXP. Along with the microprocessors, we had an event in Europe in January where the top industrial and automotive and telecom and aerospace defense companies in Europe joined us and NXP at a joint event where we launched the year. We're making progress with quite a few other partners on the sensor side, on the analog side, and others in the microprocessor side.\n\nThe potential expansion is vast because we are gaining share in markets where we were not big players. The best example is aerospace defense, which has gone from very little content in '24 to we expect a very big year coming in '27. Across all geographies: US, Europe, Asia. All geographies are observing some very strong design wins in aerospace defense. With our new red hard and red tolerant designs. In industrial robotics, we continue to grow in industrial robotics and AMRs. Well as humanoid opportunity is vast. We are winning across the board in vision. We've done very well in vision in humanoid.\n\nWe have gotten two marquee design motor control, and we see this is a beachhead as a teaching customers on how we're gonna make progress because the latency, determinism, parallel performance, and accuracy of FPGA hardware-based solutions is vastly superior to the alternative. So we're very excited about what humanoids can mean for us as a market going into '27. We've also made great progress in robotaxis. We have a win in robotaxis that we're again very excited about going into '27. We're making progress in medical and telecom across the board in physical AI.\n\nIt's hard to give a as clear of a of a metric as we can on the server because the application are so much more diverse a much more broad-based across our 11,000 customers and really broad-based channel reach. But we're very excited about the opportunity in industrial and with Avant coming in, in 2027.\n\nQuinn Bolton: Hey, guys. I'll take a shot at 2026. Just looking at the segment guidance you guys talked about last quarter of 20% to 40% in comms and compute and 5% to 15% in industrial and automotive. It looks like just based on the strength of the first quarter guide, you're probably tracking to at least the high end of those ranges, if not above. Wondering if that's the right way to think about growth in the respective segments? Or do you think that one of the segments is significantly stronger than what you were thinking ninety days ago?\n\nFord Tamer: Yeah. Thanks, Quinn. Thanks for pointing out that we talked about this ninety days ago. I think you should have picked up you all should have picked up during our commentary our confidence and the basis of our outlook has strengthened considerably over the last ninety days. So I think the overall view that the PoNS and compute will be fastest growing of our end market sets maintains, but we're also seeing improvement across the board in our industrial end markets as well. And in all geographies.\n\nRuben Roy: Yeah. I would think you're probably at the higher end since you beat more by almost $20 million relative to consensus. And then I guess maybe Ford, you mentioned in response to one of the questions that you're booking. You're pretty much all the way booked through 2026 in comms and compute. Starting to book into 2027. Can you just talk about one, kind of lead times? Are they stretching out? Are you comfortable with lead times? And given that you're already booking out to 2027, is there any indication that you may be starting to pick up double ordering given that you're booking that far out at this point?\n\nFord Tamer: Yeah. Quinn, as you can imagine, this is a very important question. We spent a lot of time as a management team, as our channel partner, with our customers, across the globe. Really digging into this question. And we, at this point, do not believe there's double ordering. What's giving us confidence is these orders are being scheduled throughout the year. So it's not like these are all bunching up in Q1. This is scheduled throughout '26 and into '27. So you could see five, six quarters out as far as orders. The lead times have increased for us and everybody else in the industry. We have been very forthcoming and proactive with our customers.\n\nAnd pointing out these increased lead times. And I think we're doing a service to our customer by pointing these out. We are seeing competitors that may not be as forthcoming, and we are being very forthcoming and making sure that we work hand in hand with our suppliers and our customers to deal with the situation. We've been ordering substrate and putting incremental orders in place since the summer. So we've been for the past six months now increasing our supply orders to our suppliers and it putting us in a good shape to weather this next few months.\n\nChristopher Rolland: Hey, guys. Thank you for the question. Maybe just piggybacking Quinn's around M&A as well. I think INA was perhaps a little bit disappointing last quarter. Do you think there was some inventory burn there? And then looking forward, like, is this a trough growth rate and we build from here potentially even with some inventory build on top of that, like, what do you guys view as kind of the normalized no inventory burn, quarterly rate for INA that we can build off of? Thank you.\n\nFord Tamer: Yeah. I'll give you the structure that we look at it. One is the inventory overall inventory number that we talked about was obviously our aggregated number at the end of the year across all of our end markets and our distributors. If you go back from where we started, it worked down first in comps, compute, and then as you pointed out, in industrial and auto. What we have seen now is a drive in some cases across all end markets from our channel partners to build inventory. So we're gonna continue to manage it down with the end objective not being channel inventory, but getting to the right levels of customer support and responsiveness.\n\nThere will be times when it might have to go up, to support, demand that's expected, and there will be times when we're going to continue to manage it down tactically. So, I don't think it would be actually that useful to give you another number to baseline off of.\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."
    }
]