[
    {
        "title": "Nvidia (NVDA) Stock: Top Analyst Raises Target to $245 on Strong Revenue Outlook",
        "url": "https://blockonomi.com/nvidia-nvda-stock-top-analyst-raises-target-to-245-on-strong-revenue-outlook/",
        "source": "Blockonomi",
        "date": "2026-02-12T12:39:00+00:00",
        "content": "UBS analyst Timothy Arcuri boosted his Nvidia price target to $245 from $235 ahead of the company’s Q4 earnings report on February 25. The upgrade maintains a Buy rating on the stock.\n\nArcuri ranks fifth among over 12,000 analysts on TipRanks. His track record shows a 77% success rate with 41.4% average returns per rating.\n\nThe new price target implies 28% upside from current trading levels. Nvidia stock has gained 45% over the past year despite recent sideways movement.\n\nThe UBS analyst now models Q4 fiscal 2026 revenue at approximately $67.5 billion. This projection sits $2.5 billion above Nvidia’s official guidance.\n\nFor the April quarter, Arcuri forecasts around $76 billion in revenue. Current investor expectations range between $74 billion and $75 billion.\n\nRecent supply chain checks continue showing strength. The analyst views the earnings setup as favorable heading into the February 25 report.\n\nNvidia’s GTC developer conference takes place in March. The event could provide additional momentum for shares.\n\nChina remains an uncertain factor in Nvidia’s revenue outlook. Local companies are increasingly adopting domestically produced chips.\n\nHowever, Arcuri notes potential China orders could still add several billion dollars to results. UBS expects the company may exclude China from formal guidance.\n\nInvestors have raised concerns about margin sustainability. Large technology companies are developing their own AI processors.\n\nThe analyst sees limited near-term risk to Nvidia’s 75% gross margin target. Management will likely address competition from Google and Broadcom TPU chips during the earnings call and at GTC.\n\nNvidia currently trades at a P/E ratio of 47.47 with a market capitalization of $4.65 trillion. Revenue growth reached 65.22% over the last twelve months.\n\nWall Street maintains a Strong Buy consensus on the stock. TipRanks data shows 37 Buy ratings, one Hold, and one Sell from analysts.\n\nThe average analyst price target stands at $260.38, implying 37% upside potential. UBS believes steady AI demand and clearer guidance could improve investor sentiment heading into the earnings report.\n\nDiscover top-performing stocks in AI, Crypto, and Technology with expert analysis.\n\n📈 Futures & Crypto Trader 🔍 Sharing charts, strategies, & mindset tips to help you level up 🚨 Not Financial Advice Follow on X @Pro_Trader_Edge\n\nType above and press Enter to search. Press Esc to cancel.\n\nGet Up To $100k Back! Exclusive Thrill Originals!"
    },
    {
        "title": "Prediction: This AI Stock Will Soar After Feb. 25. Here's Why.",
        "url": "https://www.fool.com/investing/2026/02/12/prediction-this-ai-stock-will-soar-after-feb-25-he/",
        "source": "The Motley Fool",
        "date": "2026-02-12T05:16:00+00:00",
        "content": "A strong set of results and healthy guidance could supercharge this AI stock later this month.\n\nShares of Nvidia (NVDA 1.70%) have been under pressure over the past three months, shedding almost 2% of their value owing to a variety of factors.\n\nFrom geopolitical tensions related to the shipments of its chips to China to the sustainability of the huge spending on artificial intelligence (AI) data centers to concerns about AI being in a bubble, investors have found multiple reasons to doubt Nvidia's prospects. However, they seem to be overlooking the remarkable growth that Nvidia has been clocking despite its status as the largest company in the world.\n\nAs a result, it won't be surprising to see the stock soaring when it releases another round of terrific results on Feb. 25.\n\nNvidia will release its fiscal 2026 fourth-quarter results (for the period ended Jan. 25, 2026) after the market closes on Feb. 25. The company has exceeded consensus earnings estimates in each of the last four quarters, which is impressive considering that it has witnessed headwinds such as restrictions on sales of its chips to Chinese customers.\n\nAnalysts are expecting a 67% increase in Nvidia's revenue for fiscal Q4 to $65.5 billion, almost in line with the company's guidance. Its earnings are expected to jump by 71% from the year-ago period, which seems achievable considering Nvidia's improving product mix and cost-control initiatives. It is worth noting that Nvidia's guidance didn't include any potential sales to Chinese customers.\n\nLooking ahead, analysts forecast Nvidia's earnings growth to accelerate to 63% in fiscal 2027 from 57% last year. The solid growth forecasts for the new fiscal year aren't surprising. Nvidia is on track to launch its next-generation Vera Rubin data center graphics cards this year. These cards are already in full production, as Nvidia pointed out last month.\n\nAccording to HSBC, Vera Rubin chip systems will carry a premium over the previous-generation Blackwell systems. Given that the Vera Rubin data center chips are expected to reduce AI inference costs by 10 times when compared to Blackwell, it won't be surprising to see sales of these new processors take off.\n\nSo, there is a possibility Nvidia will deliver better-than-expected guidance when it releases its results later this month, and that could be enough for the stock to regain its mojo.\n\nNvidia stock's recent weakness and the company's impressive growth have made it a no-brainer buy right now. It can be bought at just 24 times forward earnings, a discount to the tech-focused Nasdaq-100 index's forward earnings multiple of 26 (using the index as a proxy for tech stocks).\n\nWhat's more, analysts are bullish about the stock's prospects over the next year. Nvidia stock has a 12-month median price target of $250, which would be a 35% jump from current levels. However, this semiconductor stock could clock bigger gains given its strong revenue pipeline and the arrival of its new generation of AI processors, which is why it would be a good idea to buy it before Feb. 25 while it trades at attractive levels.\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."
    },
    {
        "title": "NVDA Stock Price Prediction",
        "url": "https://247wallst.com/companies/nvda/price-prediction",
        "source": "24/7 Wall St",
        "date": "2026-02-12T00:00:00+00:00",
        "content": "Based on 24/7 Wall St.'s proprietary analysis, we are setting a target price of $204.94 for NVIDIA Corporation (NVDA) over the next 12 months. \n\t\t\t\t\t\tThis target price suggests a 9.62% upside from the current price of $186.96. \n\t\t\t\t\t\tIn an optimistic scenario, NVDA could reach as high as $231.62, while our conservative scenario places the floor at $166.84. \n\t\t\t\t\t\t\t\t\t\t\t\t\tWall Street analyst sentiment shows 60 Buy, 3 Hold, and 1 Sell ratings from 64 analysts covering the stock.\n\nNVIDIA Corporation appears attractively valued at current levels. With a 9.6% upside to our $204.94 target, the risk-reward profile looks favorable for investors with a 12-month time horizon.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWall Street agrees, with 94% of analysts rating it a Buy.\n\nWhere NVDA could be in one year\n\nThis chart shows three potential price paths for NVDA over the next 12 months: our Target Price, an Optimistic Scenario, and a Conservative Scenario. \n\t\t\t\t\t\t\tLearn how we calculate our price targets →\n\nFactors that could drive upside\n\nIn our optimistic scenario, NVDA could reach $231.62 (+23.9% from current price). Key catalysts include:\n\nFactors that could limit upside\n\nIn our conservative scenario, NVDA could fall to $166.84 (-10.8% from current price). Key risks include:\n\nOur proprietary price adjustment model\n\n24/7 Wall St.'s stock forecasts utilize a number of factor adjustments that either increase or decrease a stock's 12-month price target. Toggle the factors our model uses on or off below to see how each impacts NVDA's share price.\n\nFactor Components\nToggle to simulate\n\nLong-term quarterly forecast through 2031\n\nLong-term projections factor in increased uncertainty over time.\n\n53% sentiment score\n\nNVDA stock price predictions and forecasts\n\nLooking ahead to 2030, our model projects NVDA could trade at an average price of $246.16, with a potential range between $184.62 and $307.71. This represents a potential 31.7% return from today's price. Long-term forecasts depend heavily on company execution, competitive dynamics, and broader market conditions.\n\n24/7 Wall St. currently rates NVDA as a BUY. Moderate upside (+9.6%) \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAmong Wall Street analysts, 60 rate it Buy, 3 rate it Hold, and 1 rate it Sell.\n\nIn our optimistic scenario for NVDA, the stock could reach $231.62 over the next 12 months, representing a 23.9% gain from today's price. This scenario assumes favorable conditions materialize, including strong earnings growth, positive market sentiment, and successful execution of company initiatives.\n\nIn our conservative scenario, NVDA could trade as low as $166.84 over the next 12 months, representing a 10.8% decline from current levels. This scenario accounts for potential headwinds including earnings misses, competitive pressures, or broader market weakness.\n\nStock price predictions are forward-looking estimates, not guarantees. Our model for NVDA incorporates analyst consensus, valuation metrics, technical indicators, and market sentiment. However, actual stock performance depends on many unpredictable factors including earnings surprises, macroeconomic changes, and market psychology. We provide optimistic and conservative scenarios alongside our target price to illustrate the range of potential outcomes. Always conduct your own research before investing.\n\nOur top personal finance-related articles today. Your wallet will thank you later."
    }
]