[
    {
        "title": "Stock Market Today Highlights: Sensex jumps 283 pts; Nifty 50 ends above 25,800; PSU Banks, metals shine;IT stocks slump",
        "url": "https://www.livemint.com/market/stock-market-news/stock-market-today-live-sensex-today-nifty-50-gift-nifty-gold-rate-today-silver-price-rupee-iran-us-talks-infosys-bhel-11771378983223.html",
        "source": "Mint",
        "date": "2026-02-18T11:36:00+00:00",
        "content": "Stock Market Today Highlights: The Indian stock market benchmark indices, Sensex and Nifty 50, recovered from a slow start to conclude higher on Wednesday, led by financial and metal stocks. Meanwhile, IT lagged due to ongoing uncertainties surrounding AI and restrained wider advances.\n\nFor the third consecutive day, the Sensex gained 0.34% to 83,734.25, while the Nifty 50 increased 0.37% to 25,819.35.\n\nThe BSE 250 SmallCap Index rose 0.39% while the BSE 150 MidCap Index finished with a decent gain of 0.50%, indicating that the market saw buying across all segments.\n\nAs the total market capitalization of companies listed on the BSE increased to around  ₹472 lakh crore from  ₹470 lakh crore in the previous session, investors made roughly  ₹2 lakh crore in a single session.\n\nSensex opened 102.63 points, or 0.12%, higher at 83,553.59, while the Nifty 50 opened at 25,752.65, up 27.25 points, or 0.11%. The Bank Nifty index gained 0.13% to open at 61,255.35 level.\n\nGlobally, Asian markets rose in a thin trade, with Nikkei rallying nearly 1% and most markets closed for the Lunar New Year holiday. The US stock market indices eked out gains overnight, supported by technology and financial stocks.\n\nGeopolitical tensions seem to ease after Iranian Foreign Minister Abbas Araqchi said that Iran and the United States reached an understanding on main “guiding principles” in talks aimed at resolving their longstanding nuclear dispute.\n\nInfosys, Bharti Airtel, Eternal, Dabur India, Bharat Heavy Electricals Ltd (BHEL), Dilip Buildcon, Bosch, Hexaware Technologies, Saatvik Green Energy and NDL Ventures are some of the key stocks in focus today.\n\nGold and silver prices on MCX opened higher on Wednesday amid short-covering, following gains in international bullion prices. MCX gold price opened higher by  ₹1,885, or 1.24%, at  ₹1,53,303 per 10 grams, as against its previous close of  ₹1,51,418 level.\n\nMCX silver price opened higher by  ₹4,146, or 1.81%, at  ₹2,32,929 per kg as against its previous close of  ₹2,28,783 level.\n\nIn the global markets, gold prices traded flat after a two-day decline. Spot gold price was little changed at $4,880.18 an ounce, while Silver price fell 1% to $72.83 an ounce.\n\nStay tuned to our Stock Market Today Live Blog for the latest updates.\n\nSensex Today | Stock Market Updates: Today marked a positive day for Indian equities, with benchmark indices closing higher. The Nifty 50 finished at 25,820, and the Sensex reached 83,734. Strong performances in FMCG, metals, and PSU banks contributed to this upward trend, effectively counterbalancing the ongoing softness in IT stocks.\n\nFMCG stocks particularly stood out, driven by a rebound in the cigarette sector. Companies such as ITC, Godfrey Phillips, and VST Industries saw their stock prices rise as investors recognized the potential benefits of recent price hikes and adjustments in tax regulations, which may help sustain profit margins despite rising taxes.\n\nAdditionally, reports of significant price increases across various product categories at ITC, coupled with notable gains for Godfrey Phillips and VST Industries, generated heightened investor interest in the broader cigarette market. This collective momentum signals a constructive outlook for these sectors moving forward.\n\n\"Looking ahead, the market outlook remains cautiously positive. We are balancing stable domestic fundamentals and earnings visibility against high valuations and global growth risks. In the near term, flows are likely to favour large cap financials, consumption led names, and quality PSU stocks, while IT may remain volatile. Overall, the trend stays positive, with stock selection and earnings delivery remaining key,\" said Abhinav Tiwari Research Analyst at Bonanza.\n\nSensex Today | Stock Market LIVE Updates: Some 100 stocks, including Info Edge (India), L&T Technology Services, Brainbees Solutions, and Cello World, hit their 52-week lows in intraday trade on the BSE.\n\nSensex Today | Stock Market LIVE Updates: Some 112 stocks, including Larsen & Toubro, Bajaj Auto, Cummins India, Indus Towers, JSW Steel, and Marico, hit their 52-week highs in intraday trade on the BSE.\n\nSensex Today | Stock Market LIVE Updates: Barring Nifty IT (down 1.23%), all sectoral indices ended higher. Nifty Metal (up 1.33%), PSU Bank (up 1.31%), and FMCG (up 1.21%) ended with strong gains.\n\nNifty Bank rose 0.62% to end at 61,550.80. Nifty Financial Services, too, rose by 0.62%.\n\nSensex Today | Stock Market LIVE Updates: Wipro (down 1.73%), Eternal (down 1.47%), Adani Enterprises (down 1.41%), Infosys (down 1.26%), and Tech Mahindra (down 1.25%) ended as the top losers in the index.\n\nSensex Today | Stock Market LIVE Updates: As many as 31 stocks ended higher in the Nifty 50 index, among which Kwality Wall's (India) (up 4.94%), HDFC Life Insurance Company (up 3.37%), Tata Steel (up 2.93%), ITC (up 2.15%), and Bajaj Auto (up 1.56%) ended as the top gainers.\n\nSensex Today | Stock Market LIVE Updates: Sudeep Shah, Head - Technical and Derivatives Research at SBI Securities, said - Going ahead, the immediate resistance for Nifty 50 is placed in the 25,900–25,950 zone. Any sustainable move above this zone could result in Nifty 50 extending its up move towards 26,100, followed by 26,300 in the short term. On the downside, the zone of 25,700–25,650 zone is likely to act as an immediate support.\n\nSensex Today | Stock Market LIVE Updates: According to Vinod Nair, Head of Research, Geojit Investments Ltd, Indian markets witnessed a late surge driven by broad‑based buying after a cautious start, as positive domestic sectoral cues helped offset lingering global uncertainties.\n\nBanking and financial stocks remained resilient on the back of steady asset‑quality expectations, while selective buying in FMCG names contributed to relative outperformance. In contrast, the IT sector continued to lag, weighed down by concerns over AI‑led disruption and margin pressures, which kept investor sentiment subdued.\n\nOn the earnings front, Q3FY26 results for the Nifty 500 were broadly in line with expectations, underscoring that while growth trends remain mixed, the domestic macro environment continues to offer medium‑term stability.\n\nSensex Today | Stock Market LIVE Updates: The Indian stock market benchmark indices, Sensex and Nifty 50, recovered from a slow start to conclude higher on Wednesday, led by financial and metal stocks. Meanwhile, IT lagged due to ongoing uncertainties surrounding AI and restrained wider advances.\n\nFor the third consecutive day, the Sensex gained 0.34% to 83,734.25, while the Nifty 50 increased 0.37% to 25,819.35.\n\nSensex Today | Stock Market LIVE Updates: Shares of Netweb Technologies India soared as much as 14% after the Indian original equipment manufacturer (OEM) announced plans to launch a ‘Make in India’ AI supercomputer powered by Nvidia. The stock has touched the day's high of  ₹3,532 on the BSE, but pared some gains to trade nearly 7% higher at  ₹3,331 during the late afternoon trade.\n\nStock Market LIVE Updates: The Indian stock market indices rebounded from day’s low. At 3:00 PM, the benchmark Sensex was up 267.97 points, or 0.32%, at 83,718.93, while the Nifty 50 was up 94.80 points, or 0.37%, at 25,820.20.\n\nSensex Today | Stock Market LIVE Updates: Gold and silver prices traded with mild gains, stabilising after recent sharp declines as bargain buying emerged at lower levels. MCX gold hovered near the  ₹1.52 lakh –  ₹1.55 lakh per 10 grams zone, while silver saw a modest rebound, reflecting short-covering after heavy profit-booking.\n\n“Near-term sentiment remains cautious amid a firmer US dollar and uncertainty around the policy outlook of the US Federal Reserve. However, safe-haven interest and ongoing central-bank buying continue to provide support on dips. Overall, the current price action is being viewed as consolidation within a broader corrective phase rather than a breakdown of the long-term bullish trend. Investors may consider staggered accumulation, while traders should remain cautious amid elevated volatility,” said Gaurav Garg, Research Analyst at Lemonn Markets Desk.\n\nStock Market LIVE Updates: The Nifty Bank index has witnessed a healthy uptrend in recent sessions, even as the domestic equity benchmark Nifty 50 has struggled to sustain gains. The banking index is up nearly 3% year-to-date, while the Nifty 50 has slipped about 1.5% during the same period. The Bank Nifty climbed to 61,309 in intraday trade on Wednesday, February 18, moving closer to its all-time high of 61,764.85, which it hit on February 3 this year. Strong Q3 earnings, a pause on RBI rate cuts, and relatively attractive valuations have boosted investor interest in banking stocks.\n\nMotilal Oswal's preferred picks are ICICI Bank, HDFC Bank, SBI, and AU Small Finance Bank.\n\nSensex Today | Stock Market LIVE Updates: The initial public offering (IPO) of Fractal Industries, which opened for bidding on Monday, February 16, is slated to close today, February 18. The offer is witnessing a decent demand from all categories of investors. It had sailed through on the opening day itself. Fractal Industries IPO was booked 4 times. The offer received bids for 60,32,400 shares as against 15,09,600 shares on offer. The qualified institutional buyer (QIB) quota was booked the most at 5.82 times, followed by the non-institutional investor (NII) segment at 4.99 times and the retail portion at 2.53 times.\n\nSensex Today | Stock Market LIVE Updates: Easy Trip Planners share price rallied over 11% in intra-day deals today extending gains for the third straight session. The scrip has soared almost 60% in these 3 sessions. Easy Trip Planners stock price attracted strong buying interest on Tuesday following multiple bulk deals executed on the exchanges. As per National Stock Exchange (NSE) bulk deal data dated February 17, 2026, Arthkumbh Ventures LLP purchased 3,92,88,523 shares of the company at  ₹9.41 per share.\n\nSensex Today | Stock Market LIVE Updates: Larsen & Toubro (L&T) announced a proposed venture under the India AI Mission to build sovereign, scalable GW-scale Nvidia AI factory infrastructure. This partnership integrates L&T’s engineering, infrastructure development, and execution with NVIDIA AI infrastructure including NVIDIA GPUs, CPUs, Networking, NVIDIA-accelerated storage platforms from leading providers, the NVIDIA AI Enterprise software stack, and reference architectures to enable rapid, secure AI adoption. It will deploy AI-ready datacenter infrastructure, advanced computing platforms, and ecosystem enablement required to support large-scale AI workloads across priority sectors.\n\nStock Market LIVE Updates: Ola Electric share price rebounded 5% to  ₹29.35 apiece after shedding over 9% during four straight sessions of losses. The electric two-wheeler maker’s stock staged a U-turn after the Bombay High Court (HC) ordered a stay on the warrant issued by the District Consumer Commission of Goa for CEO Bhavish Aggarwal.\n\nStock Market LIVE Updates: The week-long closure of major hubs like the Shanghai Gold Exchange (SGE) for the Lunar New Year creates a significant \"liquidity vacuum\" in the global bullion market. As the world’s largest physical buyers go offline, trading volumes thin out, often resulting in exaggerated price volatility and wider bid-ask spreads. Historically, this period triggers a price correction; once the pre-holiday buying pressure from China ceases, traders who entered positions early often engage in profit-taking, leading to a downward shift in momentum.\n\nSilver is particularly vulnerable during this timeframe compared to gold; because Chinese industrial production hits a standstill during the festivities, the dramatic drop in manufacturing demand makes silver prices much more susceptible to a sharp decline. With this perspective, it is advised to traders to avoid taking trades in bullion, said Aamir Makda Commodity & Currency Analyst, Choice Broking.\n\nStock Market LIVE Updates: While the road EPC cycle is currently passing through a slower execution and awarding phase, select non-road infrastructure segments are demonstrating stronger visibility, healthier order books, and better margin resilience. This creates a selective but compelling entry opportunity in high-quality infrastructure names with diversified exposure and balance sheet strength, Axis Securities said.\n\nHere are the top conviction ideas in non-road infrastructure sector by Axis Securities:\n\nKalpataru Projects International | Buy | Target Price:  ₹1,450\n\nRITES | Buy | Target Price:  ₹275\n\nAhluwalia Contracts India | Buy | Target Price:  ₹915\n\nStock Market LIVE Updates: On the geopolitical front, nuclear talks between the United States and Iran concluded a second round in Geneva on February 17, with both sides reporting \"good progress\" despite high regional tensions. Iran is expected to return in the next two weeks with detailed proposals to address the gaps, according to a United States official.\n\nStock Market LIVE Updates: Signature Global has inked a joint venture agreement with RMZ to develop an office-centric mixed-use annuity asset of ~5.5 mn sq ft in Gurugram. The asset will be placed in a subsidiary, which will be equally held by Signature Global and RMZ, wherein RMZ will infuse  ₹12.8 billion for its stake. The construction will be completed in the next five years, post which Signature Global sees a capital value of  ₹140 billion - 160 billion for the asset.\n\nThe agreed consideration values the land at ~ ₹26 billion versus Axis Securities’ estimated development value of  ₹34 billion, which post capex and discount seems fair. Axis Securities maintained a ‘Buy’ call on Signature Global shares with an unchanged target price of  ₹1,300 apiece.\n\nStock Market LIVE Updates: InCred Equities maintained its ‘Add’ rating on Lupin shares and raised the target price to  ₹2,675 apiece from  ₹2,400 earlier, given the improved US earnings visibility, expanding biosimilar and injectable pipeline, strengthening India mix and a robust balance sheet with net cash position.\n\nWhile margins are expected to normalise to 24-25%, the brokerage firm sees earnings durability supported by extended Mirabegron visibility, staggered Tolvaptan competition, emerging injectable and biosimilar ramp-up, and structural mix improvement in India. Downside risks include US market pricing pressure, earlier-than-expected generic competition, and higher R&D intensity.\n\nStock Market LIVE Updates: The domestic market is witnessing volatility amid a lack of fresh triggers. However, experts believe the domestic market could be on the cusp of a trend reversal. They highlight five factors that suggest the market may see a healthy upside this year, including earnings growth, FII buying, fair valuations of large-caps, healthy macroeconomic outlook and volatility in gold, silver prices.\n\nSensex Today | Stock Market LIVE Updates: Blue Cloud Softech Solutions share price jumped over 6% on Wednesday, after the company informed that it secured national ISP licence to advance AI-driven data centres, Sovereign Cloud, and Digital Infrastructure. The small-cap stock rallied as much as 6.48% to  ₹24.45 apiece on the BSE.\n\nSensex Today | Stock Market LIVE Updates: Bitcoin price is trading at a critical inflection point where market structure is being shaped less by major announcements and more by positioning shifts beneath the surface. A developing golden triangle formation on the charts highlights a compression phase, suggesting that a decisive breakout is approaching. The recent sell-off has flushed out leveraged participants, reflected in declining open interest and forced liquidations, while long-term holders continue to absorb supply, creating a fragile equilibrium, said Avinash Shekhar, Co-Founder & CEO, Pi42.\n\nA sustained move below the $65,000 range would expose Bitcoin to a fast repricing toward the $60,000 liquidity pocket, driven by stop cascades rather than gradual selling. Conversely, if buyers reclaim control and push prices firmly above $70,000, it could trigger a renewed uptrend. This ongoing deleveraging is resetting market conditions and may lay the groundwork for a more sustainable directional move ahead, he added.\n\nSensex Today | Stock Market LIVE Updates: E2E Networks share prcie surged a whopping 17% in intraday deals after tech giant Nvidia announced it is collaborating with next-generation cloud providers, including E2E, to meet India's growing need for AI compute.\n\nSensex Today | Stock Market LIVE Updates: Adani Ports and Special Economic Zone Ltd (APSEZ) and the Port of Marseille Fos have signed a Memorandum of Understanding (MoU) to deepen cooperation on trade facilitation, port innovation, and energy transition. This partnership proposes the creation of an IMEC Ports Club to strengthen coordination among key ports along the India–Middle East–Europe Economic Corridor (IMEC) route, reinforcing connectivity between India and the European Union.\n\nAdani Ports share price was trading 1.60% lower at  ₹1,541.55 apiece on the BSE.\n\nSensex Today | Stock Market LIVE Updates: AI-native enterprise applications are likely to depend on legacy service vendors’ deep client relationships and delivery capabilities to scale effectively, which could support a gradual sector recovery. A partnership ecosystem is emerging - for example, Infosys-Cognition, Infosys-Cursor and Infosys-Anthropic - which it believes will be critical for enabling AI diffusion across enterprises. These collaborations should become increasingly important as organizations move toward scaled adoption, Motilal Oswal said.\n\nThe brokerage firm believes CY26 should represent the bottoming of the growth cycle, setting the stage for a more meaningful acceleration in 2HFY27 and FY28 as AI services move into scaled deployment. It sees limited evidence for earnings cuts and believes cyclical recovery in core businesses is underway. However, concerns around terminal value and AI-led disruption may restrict near-term multiple re-rating. The brokerage firm, therefore, values Infosys at 22x FY28E EPS, with a target price of  ₹1,850, implying 33% upside, while reiterating a ‘Buy’ call on the stock.\n\nSensex Today | Stock Market LIVE Updates: The better-than-expected Q3 results and indications of continuing momentum in earnings growth, going forward, are positive factors that will keep the market resilient. The volatility in IT stocks may continue, in response to incoming news relating to the sector. Overall, IT stocks may remain weak since uncertainty surrounding the sector is huge and large institutional investors are unlikely to invest big time in IT stocks, unless valuations become compelling. There can be churns away from IT towards other sectors like banking and financials, automobiles, telecom, pharmaceuticals etc where there is good earnings visibility. This is the time to gradually increase exposure to equity, said Dr. VK Vijayakumar, Chief Investment Strategist, Geojit Investments Limited.\n\nBut many retail investors are increasing investments in gold and silver ETFs, which is a risky game in the present context. Early signs of a shift in the investment strategy of FIIs are visible now. In the cash market, FIIs have been buyers in eight out of the last thirteen trading days. This trend and improving prospects for corporate earnings bode well for the market, he added.\n\nSensex Today | Stock Market LIVE Updates: Shares of cigarette manufacturers ITC, Godfrey Phillips India and VST Industries surged up to 8% on Wednesday, extending their winning run to the second day in a row. The rally in cigarette stocks comes amid several reports that these companies have taken steep price hikes to offset the impact of the excise duty increase.\n\nSensex Today | Stock Market LIVE Updates: Blue Cloud Softech Solutions share price rallies over 6% after the company gets national ISP licence to advance AI-driven data centres, sovereign cloud and digital infrastructure. The smallcap stock surged as much as 6.48% to  ₹24.45 apiece on the BSE.\n\nStock Market Today LIVE: Dilip Buildcon share price jumped over 6% after the company emerged as the L-1 (lowest) bidder for a  ₹702 crore project awarded by the Narmada Water Resources, Water Supply & Kalpasar Department, Government of Gujarat. Dilip Buildcon shares rallied as much as 6.66% to  ₹464.00 apiece on the BSE.\n\nStock Market Today LIVE: Tata Steel, Hindalco Industries, Bharat Electronics (BEL), JSW Steel and Jio Financial Services were the top Nifty 50 gainers, while Kwality Wall’s India, Infosys, Adani Ports & SEZ, Tech Mahindra and Wipro were the top index losers.\n\nStock Market Today LIVE: Bharat Electronics (BEL), Tata Steel, ITC, Bajaj Finance and Bajaj Finserv were the top gainers on Sensex. Kwality Wall's India, Adani Ports & SEZ, Infosys, Tech Mahindra, HCL Technologies and Power Grid Corporation of India were the top index losers.\n\nStock Market Today LIVE: Among sectoral indices, gains were seen in Nifty Metals, Nifty PSU Banks, Nifty Realty, and Nifty Oil & Gas indices, while IT stocks reeled under selling pressure, with the Nifty IT index falling nearly 1%.\n\nStock Market Today LIVE: The Indian stock market opened flat with a positive bias on Wednesday. Sensex opened 102.63 points, or 0.12%, higher at 83,553.59, while the Nifty 50 opened at 25,752.65, up 27.25 points, or 0.11%.\n\nStock Market Today LIVE: Gold and silver prices on MCX opened higher on Wednesday amid short-covering, following gains in international bullion prices. MCX gold price opened higher by  ₹1,885, or 1.24%, at  ₹1,53,303 per 10 grams, as against its previous close of  ₹1,51,418 level.\n\nMCX silver price opened higher by  ₹4,146, or 1.81%, at  ₹2,32,929 per kg as against its previous close of  ₹2,28,783 level.\n\nStock Market Today LIVE: The Indian rupee opened 2 paise higher at 90.65 against the US dollar as compared with its previous close of 90.67 per USD.\n\nStock Market Today LIVE: Gold prices rose on dip-buying, after losing more than 2% in the last session on progress in the US-Iran talks, while thin trade on account of the Lunar New year holidays across Asia pressured prices. Spot gold price rose 0.2% to $4,886.69 per ounce, after declining more than 2% to a more than one-week low on Tuesday. US gold futures for April delivery were steady at $4,904.50. Spot silver price fell 0.8% to $72.86 per ounce after dropping over 4% in the last session.\n\nStock Market Today LIVE: Both FIIs and DIIs ended as net buyers on Tuesday, with FIIs buying Indian shares worth  ₹995 crore. DIIs bought shares worth  ₹187 crore. On account of positive domestic equity markets and lower crude prices overseas, the Indian National Rupee (INR) finished 2 paise higher at 90.72 against the USD on Tuesday. Experts have recommended these eight intraday stocks for today: Sun TV, Sapphire Foods India, BPCL, Fortis Healthcare, Prestige Estates, Tata Motors PV, Paytm, and DCX Systems. Read here\n\nStock Market Today LIVE: Mainland China, Hong Kong, Singapore, South Korea, Taiwan and Vietnam markets are closed for the Lunar New Year holiday.\n\nStock Market Today LIVE: Sensex is holding an uptrend continuation formation on intraday charts, and also formed a bullish candle on daily charts, which is largely positive. Nifty 50 formed a reasonable positive candle on the daily chart with minor upper and lower shadow. Read here\n\nStock Market Today LIVE: Infosys, Bharti Airtel, Adani Enterprises, Eternal, Dabur India, Bharat Heavy Electricals Ltd (BHEL), Dilip Buildcon, Bosch, Hexaware Technologies, Saatvik Green Energy and NDL Ventures are some of the key stocks that will be in focus today. Read here\n\nStock Market Today LIVE: From Gift Nifty and Iran-US talks to oil prices and gold rates, here are 8 key things that changed for the Indian stock market overnight. Read here\n\nStock Market Today LIVE: IT stocks are likely to remain in sharp focus as the sector has been under sustained pressure over the past week amid concerns around AI-driven disruption to traditional IT services models. Although the previous session saw a tentative rebound in select frontline names, sentiment remains fragile.\n\n“Market participants will closely monitor whether the recent selling momentum resumes or shows signs of stabilisation. In the near term, positioning is expected to remain cautious, with investors preferring clarity over conviction,” said Hariprasad K, SEBI - registered Research Analyst and Founder - Livelong Wealth.\n\nStock Market Today LIVE: Bank Nifty continues to exhibit strong relative outperformance, sustained leadership from private sector banks, along with renewed traction in select PSU banks, is supporting the index’s march toward record levels. Immediate support is seen in the 60,900 – 60,600 zone, which aligns with the prior breakout area and trendline support, making it a crucial demand cluster, said Ponmudi R.\n\nOn the upside, resistance is placed around 61,300 – 61,400; a decisive breakout above this band could extend the rally toward 61,800 – 62,000 in the near term. The overall structure remains decisively bullish, marked by a pattern of higher highs and higher lows, while the RSI near 62 reflects strong yet sustainable momentum without signaling overbought conditions. As long as the index holds above 60,600, the bias remains firmly positive with scope for continued outperformance versus the broader market, he added.\n\nStock Market Today LIVE: Nifty 50 has decisively reclaimed and sustained above its key moving averages 20, 50, 100, and 200-day, indicating improving short-term strength and scope for gradual upside continuation. Immediate support is placed in the 25,600 – 25,550 zone, which coincides with recent swing pivots and serves as a crucial near-term base; holding above this range keeps the current structure constructive, said Ponmudi R, CEO - Enrich Money.\n\nOn the upside, resistance is positioned around 25,750 – 25,800, and a sustained breakout above this band could accelerate momentum toward the 25,900 – 26,000 zone, where psychological resistance and call-writing interest may limit gains, he added.\n\nMomentum indicators are showing signs of improvement, with RSI near 52 suggesting a neutral-to-bullish bias, while MACD has generated a positive crossover following the recent correction. Overall, the technical configuration reflects a positive reversal setup with mild upside potential in the near term, said Ponmudi R.\n\nStock Market Today LIVE: On Tuesday, the Indian stock market ended higher, extending gains for the second consecutive session. The Sensex gained 173.81 points, or 0.21%, to close at 83,450.96, while the Nifty 50 settled 42.65 points, or 0.17%, higher at 25,725.40.\n\nStock Market Today LIVE: Iran and the United States reached an understanding on main “guiding principles” in talks aimed at resolving their longstanding nuclear dispute, but that does not mean a deal is imminent, Iranian Foreign Minister Abbas Araqchi said.\n\nStock Market Today LIVE: Asian markets traded modestly higher in thin holiday trading, following overnight gains on Wall Street. Japan’s Nikkei rallied 0.86%, and the broader Topix gained 1.11%. Mainland China, Hong Kong, Singapore, South Korea, Taiwan and Vietnam markets are closed for the Lunar New Year holiday.\n\nDhanya Nagasundaram is a Content Producer at Livemint, specialising in financial markets, and business news.  With over eight years of experience in j...Read More\n\nCatch all the Business News ,  Market News , Breaking News Events and Latest News  Updates on Live Mint. Download The Mint News App  to get Daily Market Updates."
    },
    {
        "title": "Stock Market Highlights: Sensex, Nifty extend winning streak to 3rd day; Financials and metals lead, IT lags",
        "url": "https://www.thehindubusinessline.com/markets/share-market-nifty-sensex-live-updates-18th-february-2026/article70643209.ece",
        "source": "The Hindu BusinessLine",
        "date": "2026-02-18T10:58:00+00:00",
        "content": "Concept of global financial crisis. Blurry planet hologram with double exposure of falling digital graphs. 3d rendering toned image istock photo for BL\n                                                  | Photo Credit:  \n                          ismagilov\n\nStock Market today | Share Market Highlights - Find here all the highlights related to Sensex, Nifty, BSE, NSE, share prices and Indian stock markets for 18th February 2026.\n\nEquity benchmarks shook off a sluggish start to close higher on Wednesday, with financials and metal stocks leading the advance, ‌while IT lagged on persistent uncertainty around AI and kept a lid on broader gains.\n\nThe ⁠Nifty 50 rose 0.37% to 25,819.35 and the BSE Sensex added 0.34% to 83,734.25, their third straight day of gains.\n\nBoth benchmarks ‌opened flat and edged 0.2% lower in the early session, before staging a recovery in ‌the final two hours of trade.\n\nFifteen of the 16 ‌major ⁠sectors rose. State-owned lenders added 1.3% after advancing ⁠2.1% in the previous session. The heaviest-weighted financials rose 0.6%.\n\nMetals gained 1.3%, reversing previous session’s losses, after media reports quoted U.S. trade representative Jamieson Greer saying that ‌Washington is open to simplifying steel tariffs amid industry pushback.\n\nSteel makers Tata Steel rose 2.9%, JSW Steel gained 0.7% and Steel Authority of India added 1.4%.\n\nThe broader small-caps ‌and mid-caps added 0.5% each.\n\nOn the flipside, IT index fell 1.2%, pulling back from a 1% rise in the previous session.\n\nAll 10 constituents ⁠of the IT index declined, with Infosys shedding 1.3% to give away previous session’s gains.\n\nNifty 50 closed 93.95 pts or 0.37% higher at 25,819.35\n\nMetal, PSU Bank and FMCG indices rose over 1%, while the IT index fell by 1%\n\nFifteen of the 16 ‌major ⁠sectors rose. State-owned lenders added 1.3% after advancing ⁠2.1% in the previous session. The heaviest-weighted financials rose 0.6%.\n\nRupee rises 6 paise to close at 90.66 (provisional) against the US dollar\n\nThe rupee rose 5 paise to close at 90.67 (provisional) against the US dollar on Wednesday driven by inflow of foreign funds and positive domestic equity markets.\n\nBenchmark indices end in green for the third consecutive trading session. Sensex ended 283.29 pts or 0.34% higher at 83,734.25, and Nifty 50 increased by 93.95 pts or 0.37% to 25,819.35.\n\nMetal, PSU Bank and FMCG indices rose over 1%, while the IT index fell by 1%.\n\nThe name of the subsidiary of Indian Energy Exchange has been changed from “International Carbon Exchange Private Limited” to “ICX Private Limited.”\n\nSBI Funds Management plans a $1.5 billion IPO in March amid a slowing Indian public offering market.\n\nAbout 4,328 stocks were traded on the BSE at around 3 pm, with 2,224 advancing, 1,903 declining, and 201 remaining unchanged. 105 stocks reached their 52-week highs, while 91 fell to their 52-week lows. Additionally, 179 stocks were in the upper circuit and 140 in the lower circuit.\n\nAt 3 pm, Sensex was up 191.03 points at 83,641.04 and Nifty50 was up 90.1 points at 25,816.40\n\nPNB (+2.76%)Bank of Maharashtra (+2.63%)UCO Bank (+2.52%)Union Bank (+2.47%)IOB (+2.42%)\n\nKotak Alternate Asset Managers Limited (“Kotak Alts”), through its Kotak Life Sciences Fund I (KLSF-I), which invests in early to growth stage life sciences and healthcare businesses, has made an investment of INR 400 Mn in Zeroharm Sciences.\n\nThe investment marks a pivotal growth milestone for Zeroharm, providing capital to accelerate scale up, enhancing brand visibility, strengthening customer loyalty, and driving expansion into new markets.\n\nE2E Networks has clarified that it has an existing relationship with NVIDIA that underpins our cloud and AI infrastructure offerings. “The recent news item is reiteration and public acknowledgment of this relationship, and does not represent any new or recently concluded commercial arrangement.”\n\nIndia needs to scale up investment in Artificial Intelligence from the current $1.2 billion to match the global levels and the Budget announcement of 20-year tax holiday to foreign companies offers \"foundational infrastructure\" for expanding AI, a senior NVIDIA official said on Wednesday.\n\nAt 2 pm, Sensex was trading at 83,430.72, down 20.24 points, while Nifty was at 25,723.40 points, down 2 points.\n\nTop gainers of Nifty Midcap 100:\n\nGodfrey Phillips (+15.48%), Cummins India (+3.05%), Marico (+2.61%), BSE (+2.46%)\n\nWaaree Energies (-3.80%), Aurobindo Pharma (-2.62%), Persistent Systems (-2.12%), KPIT Tech (-1.97%), Mphasis (-1.95%)\n\nAt the India AI Summit, Larsen & Toubro (L&T) today announced a proposed venture under the India AI Mission to build sovereign, scalable GW-scale NVIDIA AI factory infrastructure to reinforce India’s position as a global AI powerhouse.\n\nShares flat on the NSE at Rs 4,303.50\n\nNMDC is engaged in scouting for mineral assets across different geographies, including Canada. These engagements remain preliminary in nature, and no negotiation / binding agreement has been entered into, by the company.\n\nShares flat on the NSE at Rs 79.74\n\n· Gold and silver prices moved lower as investor preference for safe-haven assets eased. In recent sessions, geopolitical tensions have shown signs of stabilising, reducing the urgency for defensive allocations into precious metals. As a result, some investors chose to book profits after the recent rally.\n\n· At the same time, the U.S. dollar strengthened, emerging as the dominant factor influencing price action. While January’s softer inflation data supported expectations of multiple rate cuts this year, strong nonfarm payroll numbers, steady private hiring, and continued economic growth have reduced the likelihood of an aggressive or immediate easing cycle. This shift in expectations has supported the dollar and created headwinds for gold and silver.\n\n· Geopolitical developments — including renewed U.S.–Iran nuclear discussions and ongoing Russia–Ukraine negotiations — continue to offer underlying support to gold’s safe-haven appeal. However, in the current phase, currency movements have had a stronger impact than geopolitical factors.\n\n· Markets are now awaiting the minutes of the Federal Reserve’s January meeting for clearer signals on the future interest rate path, which will likely guide the next move in precious metals.\n\n· In the short term, gold prices are likely to consolidate within the $4,650–$5,100 range (~ ₹147,000–₹ 160,000). A buy-on-dips and sell-on-rallies approach is advisable.\n\n· Silver is also expected to trade weak and consolidate in the $70–$90 range (~ ₹225,000 – ₹285,000). Traders should follow a buy-on-dips, sell-on-rallies strategy. A breakdown below $70 may trigger further downside toward $64 (~ ₹200,000).\n\nShares of cigarette makes Godfrey Phillips, VST Industries and ITC ltd surged in Wednesday’s trading session after reports suggested price hikes across the product segment, boosting investor confidence in the sector’s revenue outlook.\n\nThe development follows the government’s notification ending the GST compensation cess and initiating a new tobacco tax regime from February 1, moves that could reshape pricing dynamics across the sector\n\nMicrosoft on Wednesday said it is on ‌pace to invest $50 billion by ⁠the end of the decade to help ‌expand AI to countries ‌across the ‘Global ‌South’.\n\nMicrosoft on Wednesday ​said it is on ‌pace to invest $50 ​billion by ⁠the end of the decade to help ‌expand AI to countries ‌across the ‘Global ‌South’.\n\nShares of Dabur India fell nearly 2 per cent on Wednesday morning on the National Stock Exchange, trading at ₹507.75 as of 10.35 am, down ₹10.30 from the previous close of ₹516.80.\n\nDabur shares drop 2% following management restructuring, with analysts expressing concerns over growth uncertainties and a bearish outlook.\n\nCopper futures is now trading at ₹1,165 (per kg). The contract has been on a decline since the beginning of the month. Extending the decline, it slipped below the support at ₹1,200 last week. On Tuesday (February 17), it lost nearly 4 per cent and closed below another support at ₹1,180, indicating good downward momentum.\n\nFor the near term, the downswing may not extend much as there is a support ahead at ₹1,135, the 50 per cent Fibonacci retracement of the prior uptrend. Subsequent support is at ₹1,080\n\n360 ONE has appointed investment banker & industry veteran Kamal Sultania as Co-Head – Coverage within its Investment Banking division, underscoring the firm’s ambitions to scale its advisory franchise across key sectors.\n\nKamal will spearhead coverage across Industrials, Real Estate and Infrastructure — three sectors poised for heightened deal activity amid India’s ongoing capital expenditure cycle and market momentum, as per people aware of the matter.\n\nE2E Networks stock locked in upper circuit on the NSE at Rs 3,068.20, higher by 20%.\n\nNVIDIA said it is collaborating with next-generation cloud providers Yotta, L&T and E2E Networks to deliver advanced AI factories to meet India’s growing need for AI compute. (PTI)\n\nBHEL shares traded flat on the NSE at Rs 264.50, and SAIL rose 2% to Rs 159.95.\n\nBHEL has received a Letter of Acceptance from SAIL for a contract covering a Captive Power Plant Package for SAIL’s 4.08 MTPA Cold Strip expansion at IISCO Steel Plant, Burnpur.\n\nAdani Ports and Special Economic Zone Ltd (APSEZ) has signed a Memorandum of Understanding with France’s Port of Marseille Fos to deepen cooperation on trade facilitation, port innovation and energy transition, strengthening the India–Europe leg of the India–Middle East–Europe Economic Corridor (IMEC).\n\nAPSEZ and France's Port of Marseille Fos sign MoU to enhance trade facilitation and strengthen the India-Europe connectivity corridor.\n\nBlue Cloud Softech Solutions surged 3% on the BSE to Rs 23.67, following the receipt of a Letter of Intent (LoI) from the Department of Telecommunications, Government of India, for the grant of Unified License (Virtual Network Operator) – ISP Category “A” authorization for National Area Service.\n\nLatteys Industries has approved the acquisition of equity shares of Amigo Green Energies Pvt Ltd. by way of subscription to shares through preferential allotment.\n\nThe company will acquire 12.57% of the post-issue paid-up equity share capital for ₹23 lakh.\n\nBharti Airtel shares rise as Airtel Money receives RBI NBFC license, boosting the telecom giant's financial services prospects.\n\nNifty Bank index began today’s session higher at 61,255 compared to yesterday’s close of 61,174. It is now hovering around 61,234, up by a marginal 0.1 per cent.\n\nThe advance-decline ratio is at 9-5, showing a bullish bias. Punjab National Bank (up about 2%) and Union Bank of India (up 1.7%) top the chart\n\nOla Electric Mobility shares rose to Rs 29.35 on the NSE from the previous close of Rs 27.98. The company, in a clarification to the stock exchanges, said the Bombay High Court at Goa stayed an arrest warrant issued against its CEO, Bhavish Aggarwal, by the District Consumer Commission, South Goa.\n\nAdani Ports and Special Economic Zone Ltd (APSEZ) and the Port of Marseille Fos, France’s leading port and the Mediterranean’s premier gateway, have signed a Memorandum of Understanding (MoU) to deepen cooperation on trade facilitation, port innovation, and energy transition.\n\nAdani Ports traded at Rs 1,542.60 on the NSE, down 1.51%.\n\nThe rupee rose 5 paise to 90.67 against the US dollar on Wednesday on the back of a drop in global crude oil prices and FII inflows.\n\nAt the interbank foreign exchange, rupee opened at 90.60 but lost some ground to trade at 90.67 against the US dollar, higher by 5 paise from its previous close\n\nNifty 50 is trading flat at 25,718. The price action since yesterday indicates that the index is struggling to get a strong follow-through buying. So, we may have to wait and watch what happens. The advances/declines ratio is at 22:28. This is negative for now. This has to turn in favour of the advances in order to take the Nifty higher during the day.\n\nNifty 50 February Futures contract has good support around 25,600\n\n​Equity benchmarks​ opened higher on Wednesday morning but quickly surrendered early gains, weighed down by a sharp selloff in information technology stocks even as metals, steel, and consumer stocks provided some support.\n\n​Sensex, Nifty slip into red as IT stocks bleed; metals, steel shineSensex was trading at 83,256.74, down 194.22 points or 0.23%; Nifty 50 opened at 25,752.65 was trading at 25,668.05, down 57.35 points or 0.22% ​\n\nSensex was trading at 83,256.74, down 194.22 points or 0.23%; Nifty 50 opened at 25,752.65 was trading at 25,668.05, down 57.35 points or 0.22%\n\nCrude oil futures traded higher on Wednesday morning despite encouraging talks between the US and Iran regarding Iran’s nuclear programme.\n\nApril Brent oil futures were at $67.66, up by 0.36%, and April crude oil futures on WTI (West Texas Intermediate) were at $62.43, up by 0.27%\n\nShares of Eternal traded flat after rising 1 per cent in early trade on Wednesday, as investor sentiment reacted to news of a strategic collaboration with OpenAI.\n\nThe companies enter into a partnership aimed at advancing artificial intelligence capabilities across Eternal’s businesses\n\n“Bitcoin is trading at a critical inflection point where market structure is being shaped less by major announcements and more by positioning shifts beneath the surface. A developing golden triangle formation on the charts highlights a compression phase, suggesting that a decisive breakout is approaching. The recent sell-off has flushed out leveraged participants, reflected in declining open interest and forced liquidations, while long-term holders continue to absorb supply, creating a fragile equilibrium. A sustained move below the $65,000 range would expose Bitcoin to a fast repricing toward the $60,000 liquidity pocket, driven by stop cascades rather than gradual selling. Conversely, if buyers reclaim control and push prices firmly above $70,000, it could trigger a renewed uptrend. This ongoing deleveraging is resetting market conditions and may lay the groundwork for a more sustainable directional move ahead.”\n\nMaintain Buy with TP of Rs 1840\n\nSeveral positives on positioning\n\nNet opportunity could be bigger but path is still evolving\n\nEnterprise AI isn’t plug and play\n\nRevenue from AI-first offerings stands at 5.5%, not too different from others that have disclosed the metric\n\nKey risk with AI, as per company, is less about opportunity and more about strategy and execution\n\nAnthropic partnerships signify role of a services company in enterprise AI shift\n\nMaintain Buy with TP of Rs 1870\n\nOpportunities from AI to outweigh compression\n\nAI potential fast expanding, but organisations not ready\n\nUS$300-400bn opportunity from AI to outweigh productivity-led compression\n\nIT Service vendors need to build capabilities via talent, platforms / IP, partnerships and acquisitions\n\nWill keep an eye on Infosys’ progress on these fronts going ahead\n\nInfosys hosts AI Investor Day, sees USD300-400bn new AI service opportunity by 2030\n\nLong relationships + enterprise context + accountability are key strengths of Infosys to be AI partner for its customers\n\nTo manage deflationary impact in traditional services, Infosys targets for wallet share gains from AI augmentation\n\nAt its Investor AI Day, flagged its core strengths to ensure continued market share gains amid start of new tech cycle\n\nIt flagged important data points and addressed key investor concerns around the potentially negative impact of AI for IT service companies.\n\nIt mentioned 5.5% of its revenues in 3QFY26 came from GenAI (implying close to 1.5% global market share) & overall GenAI services opportunity to be around US$300bn-US$400bn by 2030. They believe increase in volume would be larger than potential cannibalisation of existing business\n\nIt introduced a hexagonal framework to approach AI services opportunity.\n\n(1) AI is driving an enterprise tech pivot to build over buy that is services-accretive\n\n(2) a significant opportunity in clearing Tech debt brought to the fore by AI transitions\n\n(3) greenfield tech deployment is a lot easier than “real world” enterprise brownfield deployment.\n\nInfosys also laid out its six-sided AI new services opportunity that is already at 5.5% of revenues (3Q26), addressing a $300bn-400bn AI services spend led by Process AI and Agentic legacy modernization.\n\nIt is also reimagining existing services with best-in-class AI models & tools amplified by its unique enterprise context & quality talent\n\nInfosys management dismissed concerns around opportunity risk for Services businesses in current tech transition and showcased Infosys’ capabilities and readiness for adopting the same along with relevant client case studies.\n\nIt quantified new AI services are already contributing 5.5% of revenue.\n\nAt its AI Day, Infosys highlighted that IT services will remain key to enterprise AI implementation.\n\nInfosys has built its AI platform – Infosys Topaz Fabric – is jointly going to market with AI ecosystem partners & has devised a 2-pronged talent strategy not only to capture new service demand (US $300-400bn by 2030) but also to augment its existing service lines.\n\nClient AI adoption is increasing with new AI services contributing 5.5% of revenues in 3QFY26.\n\ni) Legacy modernisation is a large opportunity enabled by AI.\n\nii) Enterprise wants to build app and tool internally rather than buying—IT companies will enable it.\n\niii) Agentic AI would be integrated within Enterprise ecosystem with internally built Agent as well as external agents.\n\niv) AI revenue contributes 5.5% of revenue\n\nView recent sharp correction in IT stocks as overdone, as fears of disruption by Gen AI have been highly exaggerated.\n\nBuy, TP cut to Rs 395 from Rs 420\n\nDistributor checks indicate range of imminent price hikes, is now arriving. ITC’s 84mm cigarettes (KSFT segment), is expected to be priced at Rs 24 per stick (from Rs 17)\n\nThis segment has seen the steepest tax increase.\n\nWhile on other extreme, 64mm is expected to priced Rs 7 per stick (from Rs 5.9).\n\nWhile pricing of 69mm Goldflake (large volume driver, currently at Rs 9.5 per stick) is yet to be known, expect around Rs 12 to be its new price (given competing Marlboro is at Rs 11.5).\n\nIt is clear that price hikes have been fully passed on in premium cigarettes, while it is kept minimal in price sensitive segments of 69mm and 64mm\n\nThis pricing approach is likely to keep ITC’s volume and EBIT impact to minimum.\n\nCo well-placed to grow faster than industry in near to medium term due to\n\n1) shifting income cohort mix and rising penetration leading to faster industry growth in mid and premium products;\n\n2) LGEL’s consistent track record of innovation enabling it to sustain its premiumization trends;\n\n3) LG Electronics Inc’s ‘Global South’ strategy, which should enable it to improve exports while expanding its manufacturing in India.\n\nHowever, rising competitive intensity in an increasing commodity price environment should keep margin expansion potential limited.\n\nMohit Malhotra (currently Whole Time Director & CEO) has been redesignated to Whole Time Director & Global CEO w.e.f. 17 February 2026\n\nHerjit S. Bhalla has been appointed as CEO - India Business w.e.f. 15 April 2026 or such other date as may be mutually agreed\n\nMr. Bhalla brings more than 25 years of experience across sales, marketing and general management roles.\n\nWait for the industry cycle to turn could be a long one with potential structural concerns\n\nLimited further tailwinds from weak raw materials prices and competitive industry dynamics amid weak demand\n\nRe-iterate Hold on APNT and BRGR; valuations elevated for high-single digit EBITDA growth over FY27e\n\n3Q saw: 1) Slower sales growth vs 2Q as weak Oct offset pick-up in Nov/Dec; 2) guarded outlook on demand; 3) stabilisation of competitive pressures.\n\nModerate pace of recovery which expect to pan out in 2HCY26 & 3Q Ebitda miss drives cuts to EPS/ TP across board.\n\nDemand uptick key for performance\n\nAPNT>KNPL>BRGR as see APNT witnessing lower margin impact from Grasim’s competitive actions.\n\nAurobindo received US FDA approval for Adquey (difamilast 1%), a non-steroid topical treatment for atopic dermatitis (AD)\n\nThink Adquey has potential to become a USD250-300m brand; Aurobindo needs to invest for specialists sales hires\n\nMarketing execution will be key for Adquey success in US\n\nView negative stock reaction to Novelis’s Oswego fire and consolidated debt increase are excessive\n\nOverall, while March could be another weak quarter at Novelis, net debt should decline from 2HFY27\n\nvaluations at 5.7x FY27e/5.2x FY28e EV/EBITDA as attractive given 14% EPS CAGR over FY25-28e & well calibrated capex profile\n\neVitara launched at attractive BaaS pricing\n\nCompetitively priced to boost EV penetration, but may not be profitable\n\nAssume 12k/24k unit domestic volumes for the e Vitara and its Toyota variant, combined over FY26F/FY27F\n\nThis could imply some upside if the outright purchase price is ~INR1.6mn onwards, but might drag margins.\n\nAmid an unprecedented competitive environment in CY25, marked by aggressive industry-wide discounting and adverse weather conditions, VBL adopted a disciplined and differentiated strategy anchored in pack optimization and surgical market interventions\n\nLooking ahead, strategic innovation, capacity investments, and premiumization initiatives position VBL to deliver double-digit domestic volume growth in CY26, with margins expected to stabilize near current levels despite near-term realization pressures.\n\nExpect a CAGR of 13%/13%/16% in revenue/EBITDA/PAT over CY25-27\n\nQ3 EBITDA was 7% above JEFe led by better performance in International & Issuer Solutions businesses.\n\nPAT, adjusting for one-time labor code impact of c.Rs86mn, was 11% ahead\n\nExpect International Business to grow at 25% CAGR over next 3 years, accounting for 20%/15% of revenue/EBITDA by FY30e.\n\nDespite opportunity, reverse SOTP suggests investors are not giving any value to International Business\n\nGoldman Sachs on India aerospace & defence\n\nQ3 FY26 earnings beat consensus estimates by approximately 11% on average (excluding BDL and PTC).\n\nMost companies delivered around 20% year-on-year EPS growth; margins improved broadly.\n\nOrder books remain robust, although execution challenges persist for a few companies.\n\nEarnings momentum is expected to stay strong.\n\nTailwinds come from a favourable defence budget and a sharp rise in Awards of Necessity (AoNs).\n\nPreferred ideas: Solar Industries and PTC Industries.\n\nAmong DPSUs, BEL remains a Buy.\n\nMaintains Overweight rating with a raised target price of ₹4,529 (previously ₹4,062).\n\nDomestic jewellery growth outlook has been raised; margin assumptions have been tweaked.\n\nFY26 revenue, EBITDA, and PAT estimates increased by 12%, 5%, and 6% respectively.\n\nFY27–28 EPS estimates raised by 2–3%.\n\nTarget price increase driven by higher near-term earnings expectations and a 3-month model roll-forward.\n\nBull, base, and bear case values raised by 9–12%.\n\nBSE 100 EBITDA/PAT grew ~12% year-on-year in Q3, ahead of estimates.\n\nEarnings performance broadly in line with the long-term growth trend.\n\nFinancials, consumer, and industrials sectors offset the drag from IT services.\n\nRisk-reward appears reasonable following EM underperformance; valuations are fair.\n\nTrade deals could reduce export-related uncertainty.\n\nKey risks include IT slowdown, wage moderation, and flow volatility.\n\nCiti’s December 2026 Nifty target: 28,500.\n\nInitiate pair trade: Overweight GAIL / Underweight ONGC.\n\nONGC has underperformed GAIL by ~21% over the last 3 months.\n\nONGC’s valuation looks unattractive amid growth and margin risks.\n\nThe temporary Henry Hub spike and tariff concerns are expected to reverse.\n\nONGC shows muted production growth compared to guidance and has limited dividend yield support.\n\nPotential OFS overhang remains a concern.\n\nGAIL’s near-term outlook is improving after recent headwinds.\n\nTransmission and LPG margins expected to improve in Q4; seasonal summer demand and ONGC volume recovery should support GAIL.\n\nJefferies India strategy (Mahesh Nandurdikar)\n\nQ3 showed a strong rebound in EPS growth.\n\nDecember quarter earnings performance was good, with pre-exceptional earnings seeing an 8-quarter high YoY growth of 18% and a small EPS upgrade.\n\nSequential improvements in growth were visible in most sectors.\n\nRevenue growth for domestic staples also recovered to an 11-quarter high of 16%.\n\nMSCI India earnings growth for FY26 is now estimated at 10%.\n\nImprovement in employee cost growth to 10% is also encouraging.\n\nIndian metal stocks have traded choppy over the last month.\n\nStocks reacted to earnings commentary, geo-economic developments, and commodity price movements.\n\nIn the near-to-medium term, steel price outlook remains supportive.\n\nThe ongoing rally in steel prices appears driven by supply tightness, restocking, and coking coal cost increases rather than significant demand improvement.\n\nIndian steel prices have some more room to run until the seasonally strong period.\n\nAluminium stocks declined in tandem with falling commodity prices.\n\nHindalco corrected sharply on debt concerns following the Novelis disruption.\n\nHindalco’s current stock price still implies a favourable ~$3,075–3,100/t LME aluminium price.\n\nTop pick is Tata Steel; least preferred stocks are NMDC and Coal India.\n\nQC webinar takeaways: Competitive intensity remains high across leaders, e-commerce, and retail.\n\nWinning differentiation is shifting from cost to catalog and convenience.\n\nNon-grocery categories are gaining traction with higher AOVs and better unit economics.\n\nExecution quality, forecasting, SKU mix, and delivery precision remain key.\n\nTier-2 cities are the next battleground; cracking the next 100 cities is critical for scale.\n\nFMCG, regional, and D2C brands are increasingly using quick commerce as a growth engine.\n\nDelivery capacity and rider availability are key constraints at peak demand.\n\nBitcoin remained range-bound and struggled to reclaim the psychologically important $70,000 mark even as broader risk markets steadied. The largest crypto asset was trading between $67,200 and $67,800. This is indicative of a market that continues to sell into rallies rather than build momentum. Repeated failures near $70,000 over the past fortnight have reinforced that level as a firm near-term ceiling.\n\nOn the downside, $67,000 has emerged as the immediate line of defence. A decisive break below this zone would likely expose the $63,000-$60,000. This is where earlier demand had surfaced during the recent drawdown. Deeper on-chain reference points suggest that any sharper risk-off move could still gravitate toward the $55,000 region, which aligns closely with Bitcoin’s realised price. This is a widely tracked measure of the market’s aggregate cost basis.\n\nOn-chain data continues to frame the current phase as one of distribution rather than capitulation. Glassnode’s latest weekly on-chain assessment places Bitcoin well below its estimated ‘true market mean’ near $79,000. The realised price sits just under $55,000. This wide gap suggests persistent overhead supply. This means longer-term holders are largely inactive and shorter-term participants are driving price action within a broad $60,000-$72,000 corridor. Major analysts’ desks like CryptoQuant echoed this view and pointed to $55,000 as the next major stress-test level.\n\nInfosys unveiled its AI first value framework to help global enterprises unlock AI value at scale, harnessing the power of its generative and agentic AI suite, Infosys Topaz.\n\nShares traded 2% lower on the NSE at Rs 1,367.70\n\nCrude oil futures traded higher on Wednesday morning despite encouraging talks between the US and Iran regarding Iran’s nuclear programme. At 9.23 am on Wednesday, April Brent oil futures were at $67.63, up by 0.31 per cent, and April crude oil futures on WTI (West Texas Intermediate) were at $62.40, up by 0.22 per cent. February crude oil futures were trading at ₹5655 on Multi Commodity Exchange (MCX) during the initial hour of trading on Wednesday against the previous close of ₹5642, up by 0.23 per cent, and March futures were trading at ₹5679 against the previous close of ₹5662, up by 0.30 per cent.\n\nTop gainers: Hindalco (+1.29%), BEL (+1.19%), Tata Steel (+0.90%), Bajaj Finance (+0.69%)\n\nTop losers: Kwality Wall’’s (-4.97%), Infosys (-1.21%), Adani Ports (-1.21%), Tech Mahindra (-0.87%)\n\nJapan — Stocks rose, exports surged strongly (especially to Asia and Europe), and manufacturer sentiment improved slightly.\n\nAustralia — Currency weakened slightly while wage growth remained steady, showing stable labour conditions.\n\nIndia — Rupee stayed under pressure amid regional currency weakness, with central bank support near key levels.\n\nUnited Kingdom — Pay settlements edged higher, pointing to potentially stronger wage growth in 2026.\n\nRussia — Ongoing peace talks linked to the conflict continue to influence global energy and market sentiment.\n\nNew Zealand — Central bank kept rates low to support recovery, leading to currency weakness.\n\nGS on LG Electronics: Initiate Buy on Company, target price at Rs 1750/Sh (Positive)\n\nMS on TITAN: Maintain Overweight on Company, raise target price at Rs 4529/Sh (Positive)\n\nHSBC on Hindalco: Maintain Buy on Company, target price at Rs 1210/Sh (Positive)\n\nMS on Infosys: Maintain Equal weight on Company, target price at Rs 1760/Sh (Positive)\n\nBofA on Infosys: Maintain Buy on Company, target price at Rs 1840/Sh (Positive)\n\nUBS on Infosys: Maintain Buy on Company, target price at Rs 1870/Sh (Positive)\n\nNuvama on Infosys: Maintain Buy on Company, target price at Rs 1900/Sh (Positive)\n\nJefferies on Infosys: Maintain Buy on Company, target price at Rs 1880/Sh (Positive)\n\nJefferies on India Strategy: Q3 numbers showed strong rebound in EPS growth (Positive)\n\nJP Morgan on Steel Stocks: Near-to-medium term, believe the steel price outlook remains supportive. Top pick is Tata Steel and least preferred stocks are NMDC and Coal India. (Positive)\n\nMS on Dabur: Maintain Underweight on Company, target price at Rs 400/Sh (Neutral)\n\nHSBC on Brookfield REIT: Downgrade to Hold on REIT, raise target price at Rs 370/Sh (Neutral\n\nUBS on ITC: Maintain Buy on Company, cut target price at Rs 395/Sh (Neutral)\n\nDomestic markets are likely to see a flat opening on Wednesday amid mixed global cues. Gift Nifty at 25,755 indicates a marginal decline at opening.\n\nMarkets expected to open flat to negative, with a focus on IT stocks amid anticipated volatility and selective trading opportunities.\n\nLong Buildup: # INDIANB # DELHIVERY # PNB\n\nShort Buildup : # SRF # MCX # SWIGGY # WAAREEENER\n\nShort Covering: # BANKBARODA # ADANIENT # ADANIENSOL\n\nStocks banned in F&O Segment: SAIL, SAMMAANCAP\n\nSENSEX February Futures on 17.02.26 @ +122\n\nSENSEX February Futures on 16.02.26 @ +211\n\n\\u0009•\\u0009US markets mixed; tech volatility persists amid AI disruption concerns.\n\n\\u0009•\\u0009Europe subdued; Asia mixed ahead of China reopening next week.\n\n\\u0009•\\u0009Dollar strength pressuring metals; crude stable.\n\n\\u0009•\\u0009Bank Nifty: ~61,100\n\n\\u0009•\\u0009India VIX: ~12.7 (cooling volatility) ￼\n\nMarkets have rebounded after recent IT-led weakness and remain in consolidation mode.\n\n\\u0009•\\u0009IT led gains after recent selloff.\n\n\\u0009•\\u0009Infosys gained after AI partnership news. ￼\n\n\\u0009•\\u0009Sector strength is cushioning benchmark indices.\n\n2️⃣ PSU Banks & Financials Strong\n\n\\u0009•\\u0009PSU banks saw buying interest on credit growth optimism. ￼\n\n\\u0009•\\u0009Banking continues to provide downside protection.\n\n3️⃣ Metals & Autos Under Pressure\n\n\\u0009•\\u0009Metals weakened due to stronger dollar. ￼\n\n\\u0009•\\u0009Commodity volatility may continue.\n\n4️⃣ Adani Capex & AI Infra Theme\n\n\\u0009•\\u0009Adani Enterprises surged on $100B AI-ready data center plans. ￼\n\n\\u0009•\\u0009Signals India’s positioning in AI infrastructure.\n\n\\u0009•\\u0009Nearly 50% of smallcaps are ~40% below ATH, suggesting selective long-term opportunities. ￼\n\n\\u0009•\\u0009Market breadth improving with many new highs. ￼\n\n\\u0009•\\u0009Support: 25,600 → 25,500\n\n\\u0009•\\u0009Resistance: 25,800 → 26,000 ￼\n\n\\u0009•\\u0009Break above 26,000 may trigger fresh momentum.\n\n\\u0009•\\u0009Resistance: ~61,400+\n\n\\u0009•\\u0009Support: ~60,700 ￼\n\n\\u0009•\\u0009Earnings outlook improving; consumption recovery visible. ￼\n\n\\u0009•\\u0009IT disruption fears + US rate outlook remain key global risks.\n\n✔ AI infrastructure & data center theme\n\n✔ Metals & global commodity movement\n\n✔ Midcap/smallcap selective accumulation\n\nShort Term: Range-bound with stock-specific action.\n\nMedium Term: Bullish undertone remains intact.\n\nTactical Play: Buy quality on dips; avoid chasing rallies.\n\nhttps://play.google.com/store/apps/details?id=com.intelegain.rb\n\nConference call Replay available in Various speeds !\n\nAs of 07:05 AM Wednesday 18 February 2026\n\nCan set alert for them at www.researchbytes.com\n\nWeblink: https://tinyurl.com/mpw8cyxr\n\nWeblink: https://tinyurl.com/4ddty5w2\n\nWeblink: https://tinyurl.com/mtmc33dv\n\n(Results, Investor/Analyst Presentation, Press Release )\n\nWeblink: https://tinyurl.com/2ydj8nnk\n\nhttps://www.researchbytes.com/webcast.aspx?WID=355670\n\nhttps://www.researchbytes.com/webcast.aspx?WID=355661\n\nhttps://www.researchbytes.com/webcast.aspx?WID=355660\n\nhttps://www.researchbytes.com/webcast.aspx?WID=355657\n\nhttps://www.researchbytes.com/webcast.aspx?WID=355658\n\nhttps://www.researchbytes.com/webcast.aspx?WID=355659\n\nhttps://www.researchbytes.com/webcast.aspx?WID=355674\n\nhttps://www.researchbytes.com/webcast.aspx?WID=355630\n\nhttps://www.researchbytes.com/webcast.aspx?WID=355629\n\nDar Credit and Capital : (replay)\n\nhttps://www.researchbytes.com/webcast.aspx?WID=355627\n\nhttps://www.researchbytes.com/Default.aspx?cc=result\n\nhttps://www.researchbytes.com/Default.aspx?cc=interview\n\nReplays available at www.researchbytes.com\n\nGPT Infra: Company’s JV with RVNL bags contract worth Rs 1,201.36 Crore (Positive)\n\nHexaware Technologies: Company in partnership with Replit, has launched an open version of its AI platform, RapidX®️, with native integration to Replit. (Positive)\n\nBharti Airtel: Company secures RBI registration as type ii NBFC-ND (ICC) to commence non-banking financial operations (Positive)\n\nThe Ruby Mills: India Ratings and Research has upgraded The Ruby Mills’s bank loan facilities to IND BBB+’/Stable, removing the previous ‘Rating Watch with Developing Implications’. (Positive)\n\nDilip Buildcon: Company has been declared the L-1 bidder for a significant new project awarded by the Narmada Water Resources Water Supply & Kalpasar Department, Government of Gujarat. (Positive)\n\nEternal: Company announces collaboration with OpenAI to advance AI infrastructure (Positive)\n\nPanorama: Company signed MoU with Ada 360 Degree LLP for theatrical rights of Hindi film ‘Shatak’ (Positive)\n\nBHEL: Company wins major ₹1,200-1,500 Cr captive power plant order from SAIL (Positive)\n\nSwelect Energy: Company forms Joint Venture for Solar BESS Projects in ASEAN (Positive)\n\nGodrej Ind: Group’s security solutions business has secured a contract from Cochin International Airport Limited (CIAL) to deploy next-generation gates and a perimeter security system across key access points of the airport. (Positive)\n\nChalet Hotels: Company has received a stay order from the High Court at Karnataka, preventing the Greater Bengaluru Authority from proceeding with the sale of its Whitefield property. (Positive)\n\nBEL/HAL: India-France extend Defense agreement for another decade (Positive)\n\nIndian Hotels Company: Company announced the signing of a 115-key SeleQtions hotel in Devanahalli, Bengaluru. (Positive)\n\nSyngene: Nippon India increases its stake to 5.08% after acquiring an additional 2.6% stake. (Positive)\n\nSaatvik Green: Company secures orders worth Rs 44.1 crore for the supply of solar photovoltaic modules. (Positive)\n\nAshok Leyland: Company partnered with Rajasthan Gramin Bank to provide end-to-end financial solutions to its customers, according to a company official. (Positive)\n\nEasy Trip: Arthkumbh Ventures bought 3.92 crore shares at Rs. 9.41 per share. (Positive)\n\nSteel Stocks: US Open to Metals Tariff Enforcement Adjustments, Greer Says (Positive)\n\nDabur: Company appoints Herjit Bhalla as the CEO-India Business of the Co w.e.f April 15, 2026Feb 16 (Neutral)\n\nDabur India: Company announced Mr. Herjit S. Bhalla has been appointed as the Chief Executive Officer - India Business. (Neutral)\n\nIGI India: Company approves incorporation of wholly owned subsidiary in Saudi Arabia (Neutral)\n\nHindustan Tin Works: Company announced the appointment of Mr. Himanshu Aggarwal as Vice President (Accounts & Finance) effective 17th Feb, 2026. (Neutral)\n\nIKIO Technologies: Company announces the incorporation of a new step-down subsidiary, ROYALUX GENERAL TRADING LLC, in the UAE. (Neutral)\n\nThe New India Assurance Company: Company announces the appointment of Mr. S. Sivasankar as Executive Director on its Board. (Neutral)\n\nAxis Bank: The Competition Commission of India has approved the acquisition of the portfolio management services business of Axis Securities Limited by Axis Asset Management Company Limited. (Neutral)\n\nAdani Ent: Adani Road Transport Limited completed acquisition of 49% stake in Sree Vishwa Varadhi Private Limited on February 17, 2026 (Neutral)\n\nEngineers India: Board to meet on February 26 to consider dividend (Neutral)\n\nKotak Bank: Dr. Ashok Gulati will retire as an Independent Director on March 5, 2026, upon completing his term. (Neutral)\n\nAdani Green Energy: Company announces the incorporation of its wholly-owned step-down subsidiary, Skyspin Energy Limited (SEL), on Feb 17. (Neutral)\n\nNTPC: Company starts operations for an additional 5 MW of its Bhilai Solar Project, bringing the group’s commercial capacity to 86,729 MW. (Neutral)\n\nBosch: Company names Tillmann Olsen as CFO; Karin Gilges to step down in May 2026. (Neutral)\n\nPrabha Energy: Company approves a draft letter of offer for a rights issue of shares worth Rs 140 crore to eligible shareholders. (Neutral)\n\nTVS Motor: Company completes the sale of its equity and preference shares in Roppen Transportation Services to MIH Investments One BV. (Neutral)\n\nStylam Industries: A promoter sells a 10% stake in the company, bringing their total shareholding down to 13.19%. (Neutral)\n\nSpandana Sphoorty: Avinash Yadav is appointed as the Chief Information Officer of the company. (Neutral)\n\nYatra: THCL Travel Holding Cyprus sold 28.33 lakh shares at Rs. 158.05 per share (Neutral)\n\nList of stocks included in the short term ASM Framework: Engineers India, RACL Geartech. (Neutral)\n\nCircuit filter change from 20% to 10%: RACL Geartech. (Neutral)\n\nAlkem Laboratories Ltd Ex-Date Friday, Interim Dividend - Rs. – 43.00 (Neutral)\n\nThe BBTC Ltd Ex-Date Friday, Interim Dividend - Rs. – 17.00 (Neutral)\n\nCantabil Retail Ltd Ex-Date Friday, Interim Dividend - Rs. – 0.75 (Neutral)\n\nFirstsource Solutions Ltd Ex-Date Friday, Interim Dividend - Rs. – 5.50 (Neutral)\n\nIndia Nippon Electricals Ltd Ex-Date Friday, Interim Dividend - Rs. – 15.50 (Neutral)\n\nIRCTC Ltd Ex-Date Friday, Interim Dividend - Rs. – 3.50 (Neutral)\n\nKirloskar Oil Engines Ltd Ex-Date Friday, Interim Dividend - Rs. – 2.50 (Neutral)\n\nKSE Ltd Ex-Date Friday, Interim Dividend - Rs. – 5.00 (Neutral)\n\nInfo Edge (India) Ltd Ex-Date Friday, Interim Dividend - Rs. – 2.40 (Neutral)\n\nNCL Industries Ltd Ex-Date Friday, Interim Dividend - Rs. – 1.50 (Neutral)\n\nNirlon Ltd Ex-Date Friday, Interim Dividend - Rs. – 15.00 (Neutral)\n\nPower Finance Corporation Ltd Ex-Date Friday, Interim Dividend - Rs. – 4.00 (Neutral)\n\nRACL Geartech Ltd Ex-Date Friday, Interim Dividend - Rs. – 1.50 (Neutral)\n\nRashtriya Chemicals and Fertilizers Ltd Ex-Date Friday, Interim Dividend - Rs. – 1.00 (Neutral)\n\nSenco Gold Ltd Ex-Date Friday, Interim Dividend - Rs. – 0.75 (Neutral)\n\nSJVN Ltd Ex-Date Friday, Interim Dividend - Rs. – 1.15 (Neutral)\n\nTaneja Aerospace & Aviation Ltd Ex-Date Friday, Interim Dividend - Rs. – 2.50 (Neutral)\n\nTitan Biotech Ltd Ex-Date Friday, Stock Split From Rs.10/- to Rs.2/- (Neutral)\n\nAshiana Housing Ltd Ex-Date Today, Interim Dividend - Rs. – 1.00 (Neutral)\n\nBazel International Ltd Ex-Date Today, Bonus issue 1:1 (Neutral)\n\nBharat Forge Ltd Ex-Date Today, Interim Dividend - Rs. – 2.00 (Neutral)\n\nBhaskar Agrochemicals Ltd Ex-Date Today, Interim Dividend - Rs. – 1.00 (Neutral)\n\nBliss GVS Pharma Ltd Ex-Date Today, Interim Dividend - Rs. – 0.50 (Neutral)\n\nBrisk Technovision Ltd Ex-Date Today, Interim Dividend - Rs. – 1.40 (Neutral)\n\nCMS Info Systems Ltd Ex-Date Today, Interim Dividend - Rs. – 2.75 (Neutral)\n\nCoal India Ltd Ex-Date Today, Interim Dividend - Rs. – 5.50 (Neutral)\n\nGoodluck India Ltd Ex-Date Today, Interim Dividend - Rs. – 3.00 (Neutral)\n\nG R Infraprojects Ltd Ex-Date Today, Interim Dividend - Rs. – 2.50 (Neutral)\n\nHindustan Aeronautics Ltd Ex-Date Today, Interim Dividend - Rs. – 35.00 (Neutral)\n\nHonda India Power Products Ltd Ex-Date Today, Interim Dividend - Rs. – 3.50 (Neutral)\n\nIndraprastha Gas Ltd Ex-Date Today, Interim Dividend - Rs. – 3.25 (Neutral)\n\nMSTC Ltd Ex-Date Today, Interim Dividend - Rs. – 7.60 (Neutral)\n\nNatco Pharma Ltd Ex-Date Today, Interim Dividend - Rs. – 1.50 (Neutral)\n\nOil India Ltd Ex-Date Today, Interim Dividend - Rs. – 7.00 (Neutral)\n\nOil and Natural Gas Corporation Ltd Ex-Date Today, Interim Dividend - Rs. – 6.25 (Neutral)\n\nOnix Solar Energy Ltd Ex-Date Today, Right Issue of Equity Shares (Neutral)\n\nPremco Global Ltd Ex-Date Today, Interim Dividend - Rs. – 2.00 (Neutral)\n\nSical Logistics Ltd Ex-Date Today, Right Issue of Equity Shares (Neutral)\n\nTorrent Pharmaceuticals Ltd Ex-Date Today, Interim Dividend - Rs. – 29.00 (Neutral)\n\n“The India AI Impact Summit reinforces India’s technological ambition, strengthening India’s positioning within the global AI ecosystem. The emphasis on access to compute infrastructure, data governance and responsible AI frameworks indicates a long-term capacity-building approach. At a time when global markets are navigating volatility driven by AI-led disruption and valuation recalibrations, clarity around execution pathways and private sector participation will be closely watched. The ongoing focus on innovation, human capital and institutional readiness is encouraging. We believe sustained follow-through will be key in translating technological ambition into productivity gains and long-term market confidence.” - Anooshka Soham Bathwal, Founder & CEO, Dhanvesttor\n\nGreenzo Energy India Ltd and Lord’s Mark Industries Limited have signed a Memorandum of Understanding (MoU) to jointly develop green hydrogen and renewable energy projects across Uttar Pradesh.\n\nUnder the agreement, the companies will collaborate on developing approximately 60 MW of green hydrogen capacity, along with integrated solar rooftop projects coupled with battery energy storage systems, across key locations including Gorakhpur, Aligarh, Jhansi, and Lucknow.\n\nAs part of the partnership, Greenzo Energy will serve as the technology and EPC partner, responsible for engineering, procurement, construction, and commissioning of the projects. Lord’s Mark Industries will act as the project developer and investor, overseeing financing, regulatory approvals, project development, and commercial structuring.\n\nCapri Group, sponsor of alternative investment funds including Capri Stressed Assets Fund and Capri Special Situations Fund 1, said Sanjay Jain will be joining the Investment Manager to the Funds as Managing Partner, subject to requisite approvals from investors and the Securities and Exchange Board of India.\n\nJain will oversee the management and investment strategy of Capri Stressed Assets Fund and Capri Special Situations Fund 1. Capri Group is seeking regulatory approvals, to enable Mr Jain acquire 35% ownership in the Investment Manager & Sponsor of CSAF and CSSF1, reinforcing long-term alignment across the platform. Pending investors’ and SEBI’s approvals for reorganising the Investment Manager, Mr. Jain is currently serving as Managing Director & Chief Investment Officer.\n\nTrue North Private Equity via its alternative investment platform, the Credit Opportunities Fund I, has entered into definitive agreements to invest Rs 150 crore in ACN Healthcare RCM, a leading Revenue Cycle Management (RCM) solutions provider with operations in India and a global client base.\n\nACN Healthcare has demonstrated robust growth of over 68% CAGR over the last 3 years. The funds will be utilized towards growth and expansion of ACN Healthcare’s service portfolio, pursue strategic initiatives, and establish new delivery facilities, strengthening its ability to serve global healthcare providers.\n\nWodehouse Capital Advisors acted as the exclusive financial advisor to ACN Healthcare for the transaction and continues to advise the company on its ongoing fundraise and strategic initiatives. Sources indicate that several leading private equity funds are also in advanced discussions to participate and invest up to an additional $20 million in the current funding round.\n\nAccording to CareEdge Ratings, the Indian leather sector is set for significant expansion, targeting a $50 billion turnover by 2030, supported by rising export momentum and increasing domestic consumption.\n\nIndia’s leather industry remains a value-added, labour-intensive sector with a strong export orientation. The industry’s export basket is dominated by finished products such as footwear, leather goods, and garments, rather than raw hides, indicating significant domestic processing and value addition.\n\nCareEdge Ratings notes that India’s Union Budget 2026–27, along with the completion of the India–European Union (EU) Free Trade Agreement (FTA) as of January 27, 2026, and the recent cut in U.S. import tariffs, collectively create a positive policy environment for India’s leather industry. The Budget’s focus on streamlining import duties, reducing input costs, and simplifying procedures is likely to boost cost efficiency and operational performance. Additionally, the EU–FTA significantly improves market access and export competitiveness.\n\nGiven the industry’s existing focus on finished footwear, leather goods, and garments, the improved trade environment strengthens its ability to scale exports, stabilise demand, and deepen engagement with global buyers, enabling the Indian leather industry to capture a larger market share in the medium to long term. Together, these developments are expected to generate cost efficiencies, thereby improving profitability margins.\n\nWhatsApp Image 2026-02-18 at 7.26.23 AM.jpeg\n\nWhatsApp Image 2026-02-18 at 7.26.23 AM.jpeg\n\nThe short-term outlook is bullish for Astral. The 3 per cent rise this week has taken the share price well above the key resistance level of ₹1,593. The region around ₹1,590 will now act as a strong support. A fall below ₹1,590 is less likely, as new buyers can enter the market and limit the downside.\n\nBuy Astral shares at ₹1,646; target price ₹1,720 with strong support around ₹1,590 and bullish short-term outlook.\n\nPublished on  February 18, 2026\n\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\n\nWe have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.\n\nTerms & conditions  |  Institutional Subscriber"
    },
    {
        "title": "Earnings live: Carvana stock plunges after profit miss, DoorDash slides amid mixed results",
        "url": "https://finance.yahoo.com/news/live/earnings-live-carvana-stock-plunges-after-profit-miss-doordash-slides-amid-mixed-results-213711279.html",
        "source": "Yahoo Finance",
        "date": "2026-02-18T21:41:00+00:00",
        "content": "Fourth quarter earnings season is entering its final stretch.\n\nAs of Feb. 13, 74% of S&P 500 (^GSPC) companies had reported results, according to FactSet data, and blended earnings growth — meaning a combination of reported results from companies and projected profits from analysts — stood at 13.2%.\n\nIf that growth rate holds, it would represent the 10th consecutive quarter of annual earnings growth for the index and the fifth consecutive quarter of double-digit growth.\n\nOn Wednesday, Carvana (CVNA) and DoorDash (DASH) took focus on the earnings docket. Carvana saw its shares sink after a profit miss and vague guidance, while DoorDash shares slid after its own mixed results.\n\nOver the balance of the week, investors will digest results from Walmart (WMT), the highlight of the week, as well as Deere & Co. (DE), Analog Devices (ADI), Booking Holdings (BKNG), and eBay (EBAY).\n\nCarvana stock fell as much 20% late Wednesday after the company reported fourth quarter profit that was light of estimates.\n\nYahoo Finance's Pras Subramanian reports:\n\nDoorDash (DASH) reported fourth quarter results that slightly missed Wall Street's expectations on the top and bottom lines, while total orders rose more than forecast.\n\nEarnings per share came in at $0.48, compared with the $0.55 the Street had forecast. But adjusted EBITDA reached $780 million in the quarter — up 38% compared to a year ago and almost $5 million above the Street's estimates.\n\nMeanwhile, revenue grew 28% year over year to $3.96 billion, a tick lower than the nearly $4 billion Wall Street predicted. Total orders, which means all orders through its marketplaces and commerce platform, also jumped 32% to 903 million in the quarter. That's more than the 888 million analysts had anticipated.\n\nMarketplace GOV — the total dollar value of transactions completed through the marketplace, including taxes, tips, and fees related to DashPass and its international platform Wolt+, clocked in at $29.7 billion compared to the expected $29.1 billion.\n\nThat was driven higher by growth in new customers and order rates among existing customers in the US restaurant category.\n\nIts stock fell as much as 8% following the results. Shares had lost about 20% this year through Wednesday's close.\n\nFor the first quarter of 2026, the company expects marketplace GOV to be in the range of $31.0 billion to $31.8 billion, above the Street's forecast of $30.75 billion.\n\nAdjusted EBITDA is expected to be in the range of $675 million to $775 million, which is below what the Street predicted of $800 million.\n\nWingstop (WING) shares jumped 14% on Wednesday after the popular restaurant chain reported fourth quarter earnings which beat analysts' expectations.\n\nAnalog Devices (ADI) stock rose 6% before the bell on Wednesday following the release of its second quarter earnings, which beat analysts' estimates. The company cited strong demand from its industrial and data ‌center customers as the artificial intelligence boom continues ​to drive semiconductor sales.\n\nGeneral Mills (GIS) stock fell 6% on Tuesday after the maker of Cheerios cereal lowered its fiscal 2026 sales forecast due to a more challenging consumer environment.\n\nTrading platform eToro's (ETOR) stock jumped 11% before the bell on Tuesday after beating estimates for fourth quarter profit.\n\nFourth quarter earnings season is entering the final stretch.\n\nIn the week ahead, the consumer will be in focus, with results from Walmart before the open on Thursday the headline event.\n\nThis report will be the first under its new CEO, John Furner, and the first since the company joined the trillion-dollar market cap club.\n\nOther notable companies reporting results include Booking Holdings (BKNG), DoorDash (DASH), and eBay (EBAY), all of which are set to report on Wednesday.\n\nData from FactSet published Friday noted some 74% of S&P 500 companies have reported results through the end of the week. Blended earnings growth for the quarter — meaning actual reported results and forecast earnings from analysts — has the pace of growth at 13.2% for the fourth quarter.\n\nThis puts the index on track to record a fifth straight quarter of double-digit profit gains.\n\nHere's the full calendar for the week ahead. And note that US markets are closed on Monday for Presidents' Day, but a few companies are still expected to report results.\n\nMonday: BHP Group (BHP), Sonoco Products Company (SON), Otter Tail Corporation (OTTR), ReNew Energy Global (RNW)\n\nTuesday: Medtronic (MDT), Palo Alto Networks (PANW), Constellation Energy (CEG), Cadence Design Systems (CDNS), Republic Services (RSG), Energy Transfer (ET), Vulcan Materials (VMC), EQT Corporation (EQT), Kenvue (KVUE), DTE Energy Company (DTE), FirstEnergy Corp. (FE), Devon Energy (DVN), Expand Energy (EXE), Leidos Holdings (LDOS), InterContinental Hotels Group (IHG), Genuine Parts Company (GPC), Sunoco (SUN)\n\nWednesday: Analog Devices (ADI), Booking Holdings (BKNG), Lloyds Banking Group (LYG), CRH (CRH), Moody's Corporation (MCO), Carvana (CVNA), DoorDash (DASH), Occidental Petroleum (OXY), Kinross Gold Corporation (KGC), Garmin (GRMN), eBay (EBAY), Nutrien (NTR), Texas Pacific Land Corporation (TPL), Edison International (EIX), American Water Works Company (AWK), Verisk Analytics (VRSK), Pan American Silver Corp. (PAAS), Royal Gold (RGLD), Global Payments (GPN), Reliance (RS), Western Midstream Partners (WES), Host Hotels & Resorts (HST), Jones Lang LaSalle (JLL), Equinox Gold Corp. (EQX), Figma (FIG), HF Sinclair (DINO), Molson Coors (TAP), Wingstop (WING), Wyndham Hotels & Resorts (WH)\n\nThursday: Walmart (WMT), Rio Tinto (RIO), Deere & Company (DE), Newmont Corporation (NEM), The Southern Company (SO), Quanta Services (PWR), Targa Resources (TRGP), Comfort Systems USA (FIX), Consolidated Edison (ED), Cenovus Energy (CVE), Live Nation Entertainment (LYV), Copart (CPRT), Extra Space Storage (EXR), Teck Resources (TECK), CenterPoint Energy (CNP), Alliant Energy Corporation (LNT), Fidelity National Financial (FNF), Guardant Health (GH), DT Midstream (DTM), American Homes 4 Rent (AMH), Gaming and Leisure Properties (GLPI), Texas Roadhouse (TXRH)\n\nFriday: AngloGold Ashanti (AU), PPL Corporation (PPL), Lamar Advertising Company (LAMR), Sibanye Stillwater (SBSW), Hudbay Minerals (HBM), Portland General Electric Company (POR), Balchem Corporation (BCPC), Array Digital Infrastructure (AD), The Western Union Company (WU)\n\nCoinbase (COIN) posted a quarterly loss in the fourth quarter amid a sharp retrenchment in the crypto trade that saw bitcoin (BTC-USD) fall 45% over the past six months.\n\nThe crypto exchange reported a loss of $667 million, compared with a $1.3 billion profit in the same quarter a year ago. Revenue of $1.78 billion fell below expectations of $1.83 billion, according to S&P Global Market Intelligence.\n\nTransaction revenue of $983 million also fell slightly below estimates. Coinbase said it has seen $420 million of transaction revenue in the first quarter through Feb. 10.\n\nFor the first quarter, Coinbase expects subscription and services revenue of $550 million to $630 million, compared to $710 million to $790 million in Q4.\n\nThe stock initially sold off but then reversed course and rose 3% in after-hours trading. Shares had fallen about 8% heading into the earnings report as Coinbase users experienced issues buying and selling on the exchange. \"Your funds are safe,\" a Coinbase customer support account posted on X.\n\nListen to the Q4 earnings call here at 5:30 p.m. ET.\n\nApplied Materials (AMAT) stock climbed 9% after the ⁠semiconductor equipment maker beat Wall Street expectations on the top and bottom lines.\n\nThe after-hours reaction to Applied Materials' results added to the strong run for the stock in 2026. Year to date, shares are up 27%.\n\nAirbnb (ABNB) stock gained 4% in extended trading after the travel company issued an upbeat first quarter revenue outlook, suggesting it's seeing strong demand for premium bookings.\n\nAirbnb forecast revenue between $2.59 ​billion and $2.63 billion for the quarter, compared with analysts' expectations of $2.52 billion, according to S&P Global Market Intelligence consensus estimates.\n\nFourth quarter revenue of $2.78 billion beat expectations of $2.71 billion, but Airbnb's earnings per share in the quarter of $0.56 missed estimates of $0.65, as the company invested heavily in new experiences and offerings.\n\nYahoo Finance's Pras Subramanian reports:\n\nMcDonald's (MCD) said its value campaign to get customers to return to the fast food chain after high prices tarnished its reputation for affordable food is working. And with fourth quarter US same-store sales growing 6.8% during the quarter, there may be some truth to that.\n\n\"We're not going to not win on value,\" CFO Ian Borden told Yahoo Finance. \"We've made, I think, significant progress on our value and affordability platforms and how those are resonating with consumers.\"\n\nIn the first quarter, McDonald's is expected to pull back on the support it sent franchisees for the Extra Value Meal push. But Borden suggested that many locations would keep the meal deal, calling it \"fundamental in the environment that we're operating in today.\"\n\nBorden and McDonald's CEO Chris Kempczinski also indicated that they're aware of the growing adoption of GLP-1 weight-loss medications, especially now that pill versions are rolling out.\n\n\"As adoption grows, we know that consumers' behavior changes,\" Kempczinski said. \"We know that in general, they eat fewer calories in the day, but also what they eat, the mix of that changes.\"\n\nKempczinski added that the company is factoring in changing diet preferences, such as customers opting for less sugary drinks, into the offerings it is testing.\n\nRead more about how McDonald's is responding to weight-loss drugs here.\n\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\n\nRead the latest financial and business news from Yahoo Finance"
    }
]