[
    {
        "title": "Tesla's (TSLA) 'Investment Year' Strategy Is Turning Heads on Wall Street",
        "url": "https://uk.finance.yahoo.com/news/tesla-tsla-investment-strategy-turning-142216389.html",
        "source": "Yahoo Finance UK",
        "date": "2026-02-14T14:23:00+00:00",
        "content": "Your privacy is important to us\n\nYahoo is part of the Yahoo family of brandsThe sites and apps that we own and operate, including Yahoo and Engadget, and our digital advertising service, Yahoo Advertising.Yahoo family of brands.\n\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\n\nIf you would like to customise your choices, click 'Manage privacy settings'.\n\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy and Cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
    },
    {
        "title": "Rivian Predicts Big Jump in Sales as R2 SUV Set to Launch Soon. Its Stock Surged 27% Friday.",
        "url": "https://www.investopedia.com/rivian-predicts-big-jump-in-sales-as-new-r2-suv-set-to-launch-soon-the-stock-is-soaring-today-earnings-update-11906134",
        "source": "Investopedia",
        "date": "2026-02-13T22:44:00+00:00",
        "content": "A solid fourth quarter and ambitious plans for 2026 sent Rivian stock soaring Friday.\n\nRivian (RIVN) shares jumped more than 25% after the electric vehicle maker narrowly topped revenue estimates at $1.29 billion, while recording a smaller adjusted loss than analysts had forecast at 54 cents per share.\n\nThe company said its plans to start selling the R2, an SUV that will be cheaper than its current vehicles, remain on track for the second quarter. Rivian said that more details about its product lineup will be coming at a March 12 event.\n\nRivian is looking to grow its share of the American EV market, at a time when Tesla's sales are declining and other major automakers are shifting focus away from EVs. Friday's move suggests investors are bullish on the company's plans for this year.\n\nRivian expects to deliver between 62,000 and 67,000 vehicles this year, a more than 50% jump at the midpoint from the 42,247 it delivered in 2025. The company hopes software upgrades and its new model can help drive demand that has slowed in the U.S. after the Trump administration allowed EV tax credits to expire last September.\n\nWedbush analysts said they remain confident in Rivian's long-term plan and said the EV maker is in the midst of a \"massive transformation\" as it looks to streamline production of its R1 vehicles and ramp production of R2s this year. Wedbush has an \"outperform\" rating on the stock and a $25 price target.\n\nRivian shares rose 27% to close Friday's session at $17.73. Despite today's surge, the stock is still down 10% since the start of 2026 after hitting its highest level in two years in December.\n\nUPDATE: This article has been updated to reflect closing share price information.\n\nRivian. \"Q4 2025 Rivian Shareholder Letter.\"\n\nRivian. \"Rivian Releases Fourth Quarter and Full Year 2025 Financial Results.\"\n\nWedbush. \"Good Results and Better Guidance Amid the EV Storm; R2 Ramp Crucial.\""
    },
    {
        "title": "BofA revamps Applied Materials stock price target after CEO message",
        "url": "https://finance.yahoo.com/news/bofa-revamps-applied-materials-stock-230700596.html",
        "source": "Yahoo Finance",
        "date": "2026-02-14T00:10:00+00:00",
        "content": "Applied Materials (AMAT) reported its Q1 earnings on February 12. The earnings beat consensus estimates for adjusted EPS and revenue, and the stock is trading 10% higher at the time of writing, Friday morning, Feb. 13, according to Yahoo Finance.\n\nThe supplier of semiconductor and semiconductor-related fabrication equipment reported revenue of $7 billion, a 2% year-over-year decline, yet the earnings report got investors excited and prompted Bank of America analyst Vivek Arya to raise his price target for Applied Materials.\n\nThe cause of excitement was CEO Gary Dickerson’s prepared remarks during the earnings call: “For Applied, we expect to grow our semiconductor equipment business more than 20% this calendar year. We see the demand profile weighted towards the second half of the calendar year, with availability of customer cleanroom space being a key factor pacing the rate of investment.”\n\nDickerson continued by making this great outlook sound even better. “Our largest customers are giving us increased longer-term visibility to ensure we have operational capacity and service support in place for their ramps,\" he added.\n\n\"Based on this visibility, we expect strong growth momentum to be carried into 2027.”\n\nTo put it all in perspective, we can look at the complete Q2 guidance versus what analysts expected. The numbers come from the Bank of America research note shared with TheStreet.\n\nThe great outlook makes even more sense when we consider what the Semiconductor Industry Association (SIA) estimates for 2026.\n\n“The global semiconductor industry posted its highest-ever annual sales in 2025, nearly hitting $800 billion, and global sales in 2026 are projected to reach roughly $1 trillion,” stated SIA CEO John Neuffer.\n\nFollowing the report’s release, Bank of America analyst Vivek Arya and his team updated their view on AMAT stock.\n\nThe team estimates the company will gain approximately 1% in 2026, thanks to cyclical growth, leadership in DRAM, advanced packaging, and deposition and conductor etch systems.\n\nAnalysts raised their non-GAAP EPS estimates for 2026 and 2027 by 18% and 24% to $11.86 and $14.57, respectively.\n\nApplied Global Services could grow at a rate higher than the typical low-double-digit pace through steady install base expansion, with all recurring revenue helping fund capital returns.\n\nApplied Materials captures more than 50% of the serviceable addressable market share in inflection points such as Gate-All-Around (GAA) and backside power delivery, where revenue opportunities increase by 30% versus FinFET.\n\nSystems' gross margins of 54% improved by 1% year over year and can expand further as Applied Materials prices to value.\n\nRelated: Bank of America resets Amazon stock price target after earnings\n\nArya reiterated his buy rating for AMAT stock and raised the price target to $420 from $350, based on his 29 multiple of his price-to-earnings ratio estimate for calendar year 2027.\n\nHe said the multiple is at the high end of Applied Materials’ historical trading range of 10 to 30. The numbers are justified by the potential for wafer fab equipment outgrowth in 2026 and 2027, Arya added, and they remain at a discount relative to other large peers, given a more balanced growth profile and lower profitability.\n\nSlower-than-expected capital spending cycle\n\nMarket share loss in deposition, implant, thermal, chemical mechanical planarization, etch, or process control segments\n\nDemand destruction in PCs and mobile as a headwind\n\nMerger and integration risk, along with macro headwinds\n\nApplied Materials reached a settlement agreement with the U.S. Department of Commerce, Bureau of Industry and Security, regarding allegations that certain customer shipments to China between November 2020 and July 2022 did not comply with the U.S. Export Administration Regulations, based on the company’s misunderstanding of the applicability of those regulations.\n\nThe company has agreed to pay $252.5 million to the Department of Commerce. The U.S. Department of Justice and the SEC have closed their related investigations without action.\n\nMorgan Stanley sets jaw-dropping Micron price target after event\n\nBank of America updates Palantir stock forecast after private meeting\n\nMorgan Stanley drops eye-popping Broadcom price target\n\nApplied Materials announced that Samsung Electronics will join the new, $5 billion Equipment and Process Innovation and Commercialization (EPIC) Center in Silicon Valley. According to Applied Materials, its EPIC Center will open this year as the world’s largest facility for collaborative research and development of semiconductor process technology and manufacturing equipment.\n\nThe co-development programs at the EPIC Center will be designed to speed up the development and deployment of next-generation semiconductor technologies. The joint research and development programs will work on new materials and process technologies for chips, multiple manufacturing processes (nodes) ahead of the current generation.\n\nApplied Materials introduced new deposition, etch, and materials-modification systems that boost the performance of logic chips at 2nm and beyond. The transition to GAA transistors is a pivotal moment for the industry, as it will enable energy-efficient computing needed to deliver more powerful AI chips.\n\n“The rapid progress of AI is pushing compute performance to the limit, and breakthroughs in computing begin with the transistor,” said Dr. Prabu Raja, president of the Semiconductor Products Group at Applied Materials.\n\n“To keep pace in the angstrom era, Applied is delivering materials engineering breakthroughs that improve energy-efficient compute. Together, these new systems extend Applied’s longstanding leadership in driving major transistor and wiring inflections, while helping customers accelerate their chip roadmaps to keep up with the blistering pace of AI.”\n\nRelated: Bank of America resets Qualcomm stock price target after earnings\n\nThis story was originally published by TheStreet on Feb 13, 2026, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here."
    },
    {
        "title": "Markets News, Feb. 13, 2026: Stocks Post Worst Week of 2026 as Tech Jitters Trump Encouraging Inflation, Jobs Reports",
        "url": "https://www.investopedia.com/stock-market-today-dow-jones-s-and-p-500-02132026-11906132",
        "source": "Investopedia",
        "date": "2026-02-13T23:06:00+00:00",
        "content": "ANGELA WEISS / AFP via Getty Images\n\nStocks were mixed at the close of a rough week after a crucial inflation report showed prices rose less than expected last month.\n\nThe benchmark S&P 500 and blue-chip Dow Jones Industrial Average each advanced 0.1% on Friday, while the tech-heavy Nasdaq Composite fell 0.2%. Stocks were coming off a bruising session Thursday, when the AI jitters that sparked last week’s “SaaSpocalypse” flared up.\n\nAll three indexes suffered their largest weekly losses of the year. The Dow, which closed at record highs on Monday and Tuesday, finished the week down 1.2%. The S&P 500 dropped 1.4%, and the Nasdaq fell 2.1% to notch its fifth consecutive weekly loss.\n\nInflation slowed to 2.4% in January, its lowest reading since May and a bigger slowdown than economists expected, according to data released Friday. Core inflation, which excludes volatile food and energy prices, fell to 2.5%, its lowest print since March 2021.\n\nFriday’s data will be one of several inflation and labor market reports factoring into the conversation when Federal Reserve officials meet to set monetary policy next month. The odds the Fed cuts interest rates in the next few months dropped sharply on Wednesday when data showed the U.S. added twice as many jobs as economists expected last month.\n\nTreasury yields fell following the release of Friday's inflation report. The yield on the 10-year Treasury, which impacts interest rates on a variety of consumer loans including mortgages, fell to 4.05% from 4.11% at Thursday’s close.\n\nCorporate earnings continued to be a driver of big stock moves on Friday. Coinbase (COIN) stock soared 17% despite reporting a steep drop in revenue due to slumping crypto prices. Shares of Applied Materials (AMAT) jumped 8% after the semiconductor manufacturing equipment maker topped earnings estimates on strong demand for AI chips. The AI data center boom also drove strong results at Arista Networks (ANET), shares of which rose 5%. Pinterest (PINS) stock plummeted 17% on its weak results and DraftKings (DKNG) fell 14% after issuing a disappointing revenue forecast.\n\nBig tech stocks continued to feel the pressure after sliding yesterday. Nvidia (NVDA) and Apple (AAPL) each fell more than 2%, while Alphabet (GOOG) and Meta (META) shed more than 1%. Microsoft (MSFT) and Amazon (AMZN) posted smaller losses. Tesla (TSLA) was the only Magnificent Seven stock to inch higher.\n\nGold futures rebounded from yesterday's sharp drop, rising to $5,050 an ounce. West Texas Intermediate futures, the U.S. crude oil benchmark, were little changed at $62.85 a barrel.\n\nBitcoin rebounded from yesterday's lows around $65,000 to trade at $68,800 in the late afternoon. The U.S. dollar index, which tracks the value of the greenback against a basket of global currencies, dipped 0.1% at 96.85.\n\nPinterest's Stock Is Getting Hammered. Its Earnings Flashed a Warning Signal About Trump’s Tariffs\n\nPinterest’s stock is plunging after the company said its business took a hit from tariffs—though maybe not in the way you'd expect.\n\nShares of Pinterest (PINS) were down nearly 20% Friday afternoon, a day after the social media platform cited the impact of higher tariffs on its ad clients for its disappointing quarterly results.\n\nPinterest CEO Bill Ready told investors in Thursday's earnings call that tariffs are \"disproportionately affecting ad spend from our top retail advertisers\" as they grapple with rising costs, according to an AlphaSense transcript.\n\nPinterest reported adjusted earnings per share of 67 cents on a 14% year-over-year jump in revenue to $1.32 billion for the fourth quarter. Both figures narrowly missed analysts' estimates compiled by Visible Alpha. The company's first-quarter outlook of $951 million to $971 million in revenue also fell short of projections.\n\nJPMorgan and Bank of America analysts downgraded Pinterest's stock to neutral from \"buy\" or equivalent ratings following the results. JPMorgan analysts warned the pressure from large retailers' ad spend could worsen in the current quarter.\n\nPinterest's worries have had a limited impact on other social media stocks. Shares of Snapchat parent Snap (SNAP) and Instagram owner Meta (META) briefly turned lower Friday before recovering later in the session. Ready said Pinterest's “higher mix of large retailers relative to some of our peers has resulted in us feeling more of an impact.\"\n\nWith Friday's move, Pinterest shares have lost over 40% of their value since the start of the year, and more than 60% in the last 12 months.\n\nDraftKing Stock Slumps as Revenue Forecast Comes Up Short\n\nShares of DraftKings (DKNG) dropped 13% on Friday after the online sports betting operator’s full-year revenue guidance came up short of Wall Street estimates.\n\nDraftKings on Thursday evening forecast revenue would be between $6.5 billion and $6.9 billion in 2026. The consensus estimate on Wall Street heading into Thursday’s earnings report was about $7.3 billion.\n\nDraftKings’ soft revenue forecast overshadowed otherwise solid fourth-quarter results. Revenue rose 43% to $1.99 billion, about in-line with estimates. The company swung to a profit of $136 million, or 25 cents a share, from a $135 million loss in the year-ago quarter.\n\nDraftKings revenue forecast was particularly disappointing given the investments it plans to make in prediction markets, a rapidly growing niche that’s increasingly encroaching on sportsbook businesses. Bank of America estimates that about 20% of all Super Bowl-related betting last weekend occurred on prediction markets. DraftKings was the fifth-most downloaded app last Sunday, while prediction market Kalshi, on which trading volume totaled nearly $900 million the day of the game, ranked second.\n\n“We plan to deploy growth capital to build the best customer experience in Predictions and acquire millions of customers,” said DraftKings CEO Jason Robins in a letter to shareholders on Thursday. “We are targeting hundreds of millions in annual revenue for DraftKings Predictions in the years ahead, and we believe there is much more upside over the long-term.”\n\nThe momentum behind prediction markets has been a headwind for DraftKings stock. Shares are down more than 50% in the past year, and have shed 37% of their value in the last month and a half alone.\n\nCoinbase Is Buying the Dip in Bitcoin. Some Experts See More Downside Ahead\n\nCrypto whales are rushing in where other investors fear to tread.\n\nBitcoin is struggling to stage a turnaround. Recent prices are stuck under the $70,000 level, and altcoins including ether and solana are in a similar state. Though the volatility in crypto markets appears to be putting off retail investors, some industry players are buying. Crypto exchange Coinbase Global (COIN), for example, said it will continue to \"buy the dip\" in bitcoin—and its own stock.\n\nThat optimism has yet to meaningfully register in crypto markets, but some crypto-linked stocks are climbing today. Coinbase is up 18%, while shares of the Tyler and Cameron Winklevoss-founded exchange Gemini have risen about 12%. Strategy (MSTR) and Circle (CRCL) are also climbing, though more modestly.\n\nSome experts worry that the reprieve in crypto stocks may be short-lived. One bank is calling for more pain in the near future, citing a lack of new buyers.\n\nArista Networks Stock Rises on Earnings Beat, Steady Margin Forecast\n\nShares of Arista Networks (ANET) rose on Friday after the networking equipment provider topped estimates with its fourth-quarter results and offered a strong outlook for the current quarter.\n\nArista Networks on Thursday afternoon reported fourth-quarter adjusted earnings of $1.05 billion, or 82 cents per share, a nearly 25% increase from a year ago. It was the company’s first quarter in which net income exceeded $1 billion. Revenue grew 29% year-over-year to $2.49 billion.\n\n“We exceeded both our AI networking and campus expansion goals, delivering profitable growth and revenue of $9 billion,” said CEO Jayshree Ullal in a press release.\n\nThe company expects current-quarter of $2.6 billion, and gross margin to fall between 62% and 63%. The latter metric stood in stark contrast to that of networking competitor Cisco (CSCO), which said in its earnings report earlier this week that the soaring cost of memory components would pressure its margins. Cisco shares tumbled 12% after it issued that warning.\n\nShares of Arista Networks were recently up about 6%. The stock has traded sideways since tumbling following its earnings report in November. Still, shares are up about 30% over the past year.\n\nWall Street is overwhelmingly bullish on Arista Networks stock, with 8 of 9 analysts with current ratings tracked by Visible Alpha calling the stock a “buy.” The lone holdout has assigned the stock a neutral rating. The average price target of $178.63 is about 25% above the stock’s intraday level on Friday.\n\nRivian Predicts Big Jump in Sales as R2 SUV Set to Launch Soon. Its Stock Soars\n\nA solid fourth quarter and ambitious plans for 2026 have Rivian stock soaring Friday.\n\nRivian (RIVN) shares jumped more than 25% after the electric vehicle maker narrowly topped revenue estimates at $1.29 billion, while recording a smaller adjusted loss than analysts had forecast at 54 cents per share.\n\nThe company said its plans to start selling the R2, an SUV that will be cheaper than its current vehicles, remain on track for the second quarter. Rivian said that more details about its product lineup will be coming at a March 12 event.\n\nRivian expects to deliver between 62,000 and 67,000 vehicles this year, a more than 50% jump at the midpoint from the 42,247 it delivered in 2025. The company hopes software upgrades and its new model can help drive demand that has slowed in the U.S. after the Trump administration allowed EV tax credits to expire last September.\n\nWedbush analysts said they remain confident in Rivian's long-term plan and said the EV maker is in the midst of a \"massive transformation\" as it looks to streamline production of its R1 vehicles and ramp production of R2s this year. Wedbush has an \"outperform\" rating on the stock and a $25 price target.\n\nRivian shares were up 26% at $17.70 in recent trading. Despite today's surge, the stock is still down more than 10% since the start of 2026 after hitting its highest level in two years in December.\n\nApplied Materials Jumps as AI Chips Drive Profit Growth\n\nShares of Applied Materials (AMAT) jumped 9% on Friday after the maker of semiconductor manufacturing equipment said profit surged last quarter amid booming demand for advanced chips.\n\nApplied Materials’ profit soared more than 70% to $2.03 billion, or $2.45 a share, in the first quarter of its 2026 fiscal year. Revenue declined 2% to $7.01 billion.\n\n“The need for higher performance and more energy-efficient chips is driving high growth rates for leading-edge logic, high-bandwidth memory and advanced packaging,” said CEO Gary Dickerson in a press release. Dickerson said demand in those areas should help Applied Materials grow its semiconductor equipment business by more than 20% this year.\n\nThe AI data center buildout has caused a spike in demand for more powerful, energy-efficient semiconductors. That’s been a boon to companies like Applied Materials whose equipment and processes enable the fabrication of said chips.\n\nDickerson expects demand to remain strong through this year, when he estimates global semiconductor industry revenues will hit $1 trillion.\n\nApplied Materials forecast current quarter revenue will fall between $7.15 billion and $8.15 billion, and adjusted earnings per share between $2.44 and $2.84. The upper-end of those ranges would represent double-digit growth on both metrics.\n\nApplied Materials stock was already flying high heading into Thursday’s report, with shares up nearly 28% since the start of the year. As of midday Friday, the stock is up about 95% in the last 12 months.\n\nAI Fears, Political Pressure Put Apple Stock on the Back Foot Again\n\nApple (AAPL) stock is in the red again.\n\nShares slumped 5% yesterday after the Federal Trade Commission said it had sent a warning letter to the company over its Apple News service. The stock was also pressured by reports Wednesday that the company was once again delaying the release of some AI-powered Siri features, adding to persistent concerns the iPhone maker’s AI capabilities lag peers.\n\nApple and its Magnificent Seven peers are having a rough 2026 so far. Shares of hyperscalers Alphabet, Microsoft (MSFT), Amazon (AMZN) and Meta (META) have been weighed down by concerns that the tech giants are overspending on AI infrastructure. Their massive data center spending has historically been a boon to chipmaker Nvidia (NVDA), but even that stock is treading water amid anxiety about tech sector valuations.\n\nBefore this week’s setbacks, Apple stock appeared to have turned a corner. Apple announced in mid-January that it had selected Alphabet’s (GOOG) Gemini to power its future AI features, including the updated Siri features that are reportedly delayed. Weeks later, Apple reported record results for the all-important holiday quarter, when iPhone and services revenue easily beat estimates.\n\nApple shares rose nearly 8% in the week following that earnings report, lifting the stock into the green for the year. Thursday’s slump erased most of those post-earnings gains. Shares slid about 0.8% Friday morning, putting them down nearly 4.5% year-to-date.\n\nWhat Does the Inflation Report Mean for the Federal Reserve?\n\nSofter inflation will likely give the Federal Reserve breathing room to wait and see how the economy evolves in the coming months.\n\nAccording to the CME Group's FedWatch Tool, traders are pricing in a 70% chance that central bankers will next cut their influential fed funds rate at their June meeting. That was up from 66% just before the report was released. The FedWatch tool forecasts rate movements based on fed funds futures trading data.\n\n\"January’s inflation data, paired with a strong job payroll report, support the FOMC members who think the easing cycle should remain on hold in the coming months,\" wrote Moody’s Analytics Economist Matt Colyar.\n\nThe Consumer Price Index rose 2.4% over the year in January, down from a 2.7% annual increase in December. That was less than economists expected and the lowest since May.\n\nCore inflation fell to a 2.5% annual increase from 2.6% in December, the lowest since March 2021. Economists expect core inflation to be a better measure of inflation because it excludes volatile food and energy prices, which can fluctuate for factors not reflective of the broader economy.\n\nStock Indexes Slip Ahead of January CPI Report\n\nFutures contracts connected to the Dow Jones Industrial Average were down about 0.2% in premarket trading.\n\nS&P 500 futures were also off 0.2%.\n\nNasdaq 100 contracts dipped 0.3%.\n\nDraftKings. “DRAFTKINGS REPORTS FOURTH QUARTER REVENUE GROWTH OF 43%.”\n\nDraftKings. “Letter to Shareholders - February 2026.”\n\nArista Networks. \"Arista Networks, Inc. Reports Fourth Quarter and Year End 2025 Financial Results.\"\n\nApplied Materials. \"Applied Materials Announces First Quarter 2026 Results.\"\n\nApplied Materials. \"Q1 Fiscal 2026 Earnings Call.\"\n\nApplied Materials. \"APPLIED MATERIALS ANNOUNCES SECOND QUARTER 2025 RESULTS.\""
    },
    {
        "title": "Upstart: A Directional Bet On Falling Rates",
        "url": "https://seekingalpha.com/article/4870349-upstart-a-directional-bet-on-falling-rates",
        "source": "Seeking Alpha",
        "date": "2026-02-14T01:16:00+00:00",
        "content": "imaginima/iStock via Getty Images\n\nimaginima/iStock via Getty Images\n\nUpstart (UPST) beat Wall Street estimates for the fourth fiscal quarter on Tuesday amid a strong product uptake in a favorable lending environment. Upstart is going to benefit from lower federal fund rates in 2026, and\n\nAnalyst’s Disclosure: I/we have a beneficial long position in the shares of UPST, SOFI, AFRM either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body."
    }
]