[
    {
        "title": "Stock market today: CPI inflation cools more than expected, putting pressure on S&P 500, Dow, Nasdaq",
        "url": "https://finance.yahoo.com/news/live/stock-market-today-cpi-inflation-cools-more-than-expected-putting-pressure-on-sp-500-dow-nasdaq-234823957.html",
        "source": "Yahoo Finance",
        "date": "2026-02-13T15:17:00+00:00",
        "content": "US stocks lost steam heading into the close on Friday to post weekly losses as Wall Street digested a cooler-than-expected inflation reading for a steer on the path of interest rates.\n\nThe S&P 500 (^GSPC) inched just above the flatline, while the Dow Jones Industrial Average (^DJI) closed up 0.1%. The tech-heavy Nasdaq Composite (^IXIC) fell 0.2%.\n\nThe Dow and S&P 500 posted losses of more than 1%, while the Nasdaq fell more than 2% over the same period.\n\nInflation cooled more than expected in January, data released Friday by the Bureau of Labor Statistics showed. The Consumer Price Index showed that consumer prices increased 0.2% in January from a month earlier, and 2.4% on an annual basis.\n\nThe report is likely to shape expectations for an already complicated Federal Reserve policy. Traders revived some bets on a June cut, with a majority expecting a quarter-point reduction that month. Most bets remain on two cuts by the end of 2026, though a larger percentage of traders is now betting on more reductions.\n\nThe moves came after a day of heavy selling as fears about AI disruption spilled into sectors such as real estate, logistics, and transportation — \"old economy\" names previously seen as a safe alternative to AI-tied stocks. Techs got pummeled, with all seven of the \"Magnificent Seven\" megacaps finishing lower. The sell-off has set the Dow, S&P 500, and Nasdaq for sharp weekly losses.\n\nInvestors are also scrutinizing the latest earnings for the next \"shoot first, ask questions later\" AI scare. Applied Materials (AMAT) stock surged as the chip toolmaker's upbeat outlook mirrored robust AI demand. But Pinterest (PINS) shares tumbled after revenue fell short and analysts fretted about AI risks to its discovery platform.\n\nElsewhere on the earnings front, Rivian (RIVN) shares soared by more than 25% following its fourth quarter earnings beat late Thursday. The EV maker said its R2 midsize model is on track for delivery before the summer. Moderna (MRNA) shares surged 10% after it topped quarterly revenue estimates thanks to resilient sales of its Covid shot.\n\nStocks gave up early session gains to close mixed on Friday following a cooler-than-expected inflation print.\n\nThe Dow Jones Industrial Average (^DJI) rose 0.1% while the tech-heavy Nasdaq Composite (^IXIC) lost 0.2%. The S&P 500 (^GSPC) also wobbled, closing the session just above the flat line.\n\nAll three major averages ended the week in negative territory.\n\nStocks capped a volatile week in which wealth management, transportation, and logistics stocks followed the software sector, battered by fears that AI will disrupt their business models.\n\n\"We believe that these initial reactions to the disruption story may turn out to be overblown, since many industries and individual businesses could very well turn out to be AI beneficiaries in the long term,\" Daniel Skelly, head of Morgan Stanley's Wealth Management market research & strategy team, said in a note on Friday.\n\nHe added, \"Overall, with the S&P 500 flattish for the year, the bull market has certainly paused, and given way to a bull market in ‘disruption hysteria.'\"\n\nNext week will be a shortened trading week, as the market will be closed Monday for Presidents’ Day.\n\nYahoo Finance's Ben Werschkul reports:\n\nBitcoin (BTC-USD) jumped 5% on Friday after a softer-than-expected inflation print and renewed hopes that crypto legislation stuck in Congress will ultimately be passed and sent to the President's desk to sign.\n\nThe token rebounded near $69,000 after falling as low as $65,000 on Thursday during a broader market sell-off.\n\nUS Treasury Secretary Scott Bessent said on Friday during an interview that it was important for Congress to pass a bill creating federal rules for digital assets by Spring.\n\nNvidia (NVDA) shares are off by over 1% today, even as the broader market rebounds after yesterday's tech-driven sell-off.\n\nBloomberg notes this is part of a recent trend of stagnation for Nvidia, whose shares have remained fairly range-bound since hitting an all-time high last October. (Shares are down around 1% for the year. That is happening despite Big Tech's plans to balloon capital expenditures for AI build-outs — with Nvidia poised to be one of the main beneficiaries of that spending.\n\nNvidia reports earnings on Feb. 25.\n\nAfter Coinbase reported its second-worst quarterly net loss ever, at $667 million, CEO Brian Armstrong attempted to ease investor and analyst concerns on the company's fourth quarter earnings call.\n\nRivals duking it out for AI supremacy is the story of the tech world. But it's increasingly becoming a key narrative in American politics, too.\n\nYahoo Finance's Hamza Shaban writes:\n\nRead more here in the takeaway from today's Morning Brief.\n\nShares in Rivian (RIVN), Moderna (MRNA), and Applied Materials (AMAT) all surged upward with double-digit increases on Friday after strong earnings reports, while shares in Pinterest (PINS) plunged.\n\nEV maker Rivian jumped more than 20% through Friday morning trading after the company reported a strong fourth quarter earnings beat late Thursday. Rivian executives said the EV maker's R2 midsize model is on track for delivery before the summer.\n\nMeanwhile, Moderna shares gained 10% after the drugmaker topped quarterly revenue estimates thanks to resilient sales of its COVID shot. While the company had been struggling to find profit as demand for shots has fallen, Moderna reaffirmed its expectation of 10% ‌revenue growth in ​2026 and solidly beat analyst estimates for top-line revenue.\n\nApplied Materials stock gained more than 11% as beats on revenue and adjusted EPS complemented strong demand forecasts for the company's semiconductor equipment. Semiconductors are a key component of AI technology, fueling bets that Applied Materials will see continued strength.\n\nIn a showing that the AI trade cuts both ways, Pinterest saw its shares plunge by more than 20% as analysts evaluated the possibility for disruption by AI advancements. The company also missed analyst expectations on the top and bottom lines.\n\nConsumer energy prices largely fell in January, according to data released by the Bureau of Labor Statistics on Friday, moving in line with a broader oil market that had until January been falling.\n\nHeadline energy costs, one of the more volatile categories in the Consumer Price Index, fell 1.5% in January from the previous month and ticked down 0.1% from the previous year. (Energy prices are excluded from the \"core\" CPI reading due to their volatility.)\n\nEnergy commodities saw the largest move downward on both a monthly and yearly basis, with gasoline prices dropping by 3.2% month-on-month and fuel oil prices dropping by 5.7%, according to BLS data. On a yearly basis, gasoline prices have fallen by 7.5% since last January.\n\nWhile the price of gasoline is one component of the price paid by consumers to fill their cars, that cost also factors in in crude oil prices, refining costs, distribution costs, and taxes. Pump prices have ticked up to a national average of $2.94 today versus $2.82 one month ago, but they are down from $3.16 a year ago.\n\nMeanwhile, in the energy services category, electricity prices shed 0.1% from the previous month, while utility gas services prices rose by 1% as cold weather shocks throughout the country saw both residential and commercial demand for natural gas soar.\n\nBoth electricity and utility gas saw large jumps upward year-on-year, increasing by 6.3% and 9.8%, respectively, as the explosive power demand from the data center buildout has sent energy costs soaring.\n\nThe US stock market opened in the red on Friday after a broad market sell-off as Wall Street digested a cooler-than-expected inflation reading.\n\nThe Dow Jones Industrial Average (^DJI) and tech-heavy Nasdaq Composite (^IXIC) both shed roughly 0.4%, while the S&P 500 (^GSPC) fell roughly 0.2% the day after intense selling pressure on tech stocks.\n\nInflation cooled more than expected in January, data released Friday by the Bureau of Labor Statistics showed, as consumer prices increased 0.2% in January from a month earlier and 2.4% on an annual basis. So-called \"core\" CPI ticked up by 0.3% month-on-month and 2.5% year-on-year.\n\nMore than half of traders are now pricing in a 25-basis-point cut by June, but most bets still remain on two cuts by the end of 2026.\n\nOn the earnings front, Rivian (RIVN) shares jumped more than 23% following its fourth quarter earnings beat late Thursday, while Pinterest (PINS) shares shed more than 20% on a revenue miss and concerns about AI.\n\nConsumer prices rose 0.2% in January over the previous month, according to data released by the Bureau of Labor Statistics on Friday morning, cooling more than economists had expected. The inflation measure rose 2.4% year-on-year.\n\nThe so-called \"core\" consumer price index, which excludes the often volatile food and energy categories, rose by 0.3% from the previous month and 2.5% over the previous year.\n\nThe headline increases in inflation were just below economists' expectations of gains of 0.3% on a monthly basis and 2.5% on a yearly basis. January's core CPI readings were directly in line with expectations month-on-month and year-on-year.\n\nThe readings on inflation swung traders' outlook for rate cuts from the Federal Reserve, now pricing in a 51% chance of at least one 25 basis-point cut by the Fed's June meeting. Though, traders remain broadly convinced the Fed will hold rates steady in its upcoming March meeting, with less than 10% pricing in a rate cut at that meeting.\n\nDraftKings (DKNG) stock fell 17% before the bell on Friday after the US gambling company missed analyst expectations for this year's guidance as it steps up its investments in prediction markets.\n\nRoku (ROKU) stock rose 15% during premarket hours after the streaming company beat analysts' estimates for fourth quarter earnings. Roku also issued strong guidance for the year.\n\nMaplebear (CART), also known as Instacart, saw its stock jump by 12% before the bell today after beating analysts estimates for revenue, which rose 12% to $992 million. However, the group's fourth quarter earnings were dented by a $60 million settlement with the Federal Trade Commission amid claims that it used underhand tactics to raise costs for shoppers.\n\nRivian (RIVN) stock soared 19% during premarket hours on Friday following the release of better-than-expected fourth quarter results on Thursday.\n\nYahoo Finance's Pras Subramanian reports:\n\nApplied Materials (AMAT) stock climbed 11% during premarket hours on Friday after the ⁠semiconductor equipment maker beat Wall Street expectations on the top and bottom lines.\n\nThe after-hours reaction to Applied Materials' results added to the strong run for the stock in 2026. Year to date, shares are up 27%.\n\nPinterest stock sank 19% before the bell on Friday after forecasting first quarter revenue below analysts' estimates on Thursday."
    },
    {
        "title": "Hyatt Hotels Reports 2025 Results and 2026 Outlook",
        "url": "https://www.theglobeandmail.com/investing/markets/stocks/H-N/pressreleases/204467/hyatt-hotels-reports-2025-results-and-2026-outlook/",
        "source": "The Globe and Mail",
        "date": "2026-02-13T06:26:00+00:00",
        "content": "Hyatt Hotels ( (H) ) has issued an update.\n\nHyatt Hotels Corporation reported its fourth-quarter and full-year 2025 results on February 12, 2026, showing system-wide hotels RevPAR growth of 4.0% in the quarter and 2.9% for the year, and particularly strong 8.6% full-year Net Package RevPAR growth at all-inclusive resorts. Full-year net rooms growth reached 7.3%, the pipeline of executed management and franchise contracts expanded to about 148,000 rooms, and Adjusted EBITDA rose 5.8% to $1,159 million despite reported net losses of $20 million in the quarter and $52 million for 2025.\n\nThe company accelerated its asset-light strategy by selling the Alua Portfolio and completing the Playa Real Estate Transaction, using proceeds to repay and terminate a $1.7 billion term loan while securing long-term management agreements on the sold properties. Hyatt ended 2025 with $4.3 billion in total debt, $2.3 billion in liquidity, continued share repurchases totaling $293 million for the year, and a declared first-quarter 2026 dividend, while providing 2026 guidance that points to modest RevPAR and rooms growth, higher gross fees, and a sharp swing to positive net income alongside a revised Adjusted EBITDA definition that excludes unconsolidated ventures’ contribution.\n\nOperationally, Hyatt’s fourth quarter was driven by strength in luxury and upper-upscale hotels, robust leisure and group demand, and rising management fees, although franchise fees were pressured by the Playa acquisition structure and softer U.S. select-service demand. The company opened 8,253 rooms in the quarter, including flagship properties such as Park Hyatt Cabo del Sol and Andaz One Bangkok, and grew its development pipeline by 7% in 2025, with strong signings in the U.S., Greater China, and India and rapid expansion of its Hyatt Studios extended-stay brand.\n\nThe most recent analyst rating on (H) stock is a Buy with a $179.00 price target. To see the full list of analyst forecasts on Hyatt Hotels stock, see the H Stock Forecast page.\n\nAccording to Spark, TipRanks’ AI Analyst, H is a Neutral.\n\nHyatt Hotels’ overall stock score is driven by significant financial challenges, including high leverage and negative profitability, which weigh heavily on the score. Positive technical indicators and strategic growth initiatives provide some support, but valuation concerns and mixed earnings call sentiment limit the upside potential.\n\nTo see Spark’s full report on H stock, click here.\n\nHyatt Hotels Corporation is a global hospitality company that operates, manages, franchises, and develops full-service and select-service hotels, resorts, and all-inclusive properties under multiple brands. The company focuses on luxury and upper-upscale segments, extended-stay offerings, and an expanding pipeline across key markets including the United States, Asia Pacific, and Latin America, with a growing emphasis on asset-light, fee-based earnings.\n\nAverage Trading Volume: 769,349\n\nTechnical Sentiment Signal: Buy\n\nFor a thorough assessment of H stock, go to TipRanks’ Stock Analysis page.\n\nDisclaimer & DisclosureReport an Issue\n\nAll market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2026.\n\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab)."
    },
    {
        "title": "US Two-Year Yield Set for Lowest Since 2022 on CPI: Markets Wrap",
        "url": "https://www.swissinfo.ch/eng/us-two-year-yield-set-for-lowest-since-2022-on-cpi:-markets-wrap/90937271",
        "source": "SWI swissinfo.ch",
        "date": "2026-02-13T18:35:00+00:00",
        "content": "(Bloomberg) — Wall Street got a degree of relief as relatively tame inflation data spurred bigger bets on Federal Reserve rate cuts, with bond yields falling and most stocks rising at the end of a wild week for markets. Bitcoin jumped.\n\nTreasuries climbed across maturities, with two-year yields dropping toward their lowest since 2022. Money markets priced in higher chances the Fed will slash rates more than twice this year. About 375 shares in the S&P 500 advanced, with economically sensitive sectors outpacing technology. The Russell 2000 climbed 1.2%. The dollar underperformed most major currencies.\n\nThe consumer price index rose 0.2% in January, the smallest gain since July and restrained by lower energy costs. While services costs picked up last month, prices of core goods remained stable. The core CPI rose from a year ago by the least since 2021. The overall gauge also eased on an annual basis.\n\n“There remain some trouble spots, but overall, the trend in inflation is lower,” said Steve Wyett at BOK Financial. “While the Fed is on pause for now, we expect somewhat lower rates as we move forward in 2026.”\n\nMarkets are “breathing easier” as price pressures remain contained, according to Seema Shah at Principal Asset Management.\n\n“Continued labor-market strength gives policymakers cover to stay on hold, while further disinflation in the second half of the year should reopen the door to easing,” she said.\n\nThe Fed chose to hold interest rates steady in January given signs of stabilization in the labor market and inflation that’s still elevated. Data this week showed US payrolls rose by the most in more than a year and the unemployment rate unexpectedly fell, suggesting the labor market continued to stabilize at the start of 2026.\n\nThe yield on two-year Treasuries slid five basis points to 3.41%. The S&P 500 rose 0.1%, while heading for a weekly loss. Its equal-weighted version – which strips out market-value biases – climbed 1%. US markets will close Monday for Presidents’ Day.\n\nGold reclaimed its $5,000 mark. Aluminum fell along with other metals as traders reacted to a possible reduction in the scope of US import tariffs on some aluminum and steel products.\n\nThe January CPI inflation report was “benign” relative to fears of a “hot start” to the year, but it’s not enough to motivate a near-term Fed cut given January’s strong jobs report, according to Krishna Guha at Evercore.\n\nStill, he says the latest data increases the likelihood inflation will be on the downslope in time for the Fed to cut in June or if not, July.\n\nTwo key positives emerge from this report: significantly lower goods inflation and reduced housing inflation persistence. These developments keep the Fed on track for a potential third rate cut, though this remains data-dependent, noted Florian Ielpo at Lombard Odier Asset Management.\n\n“The report fundamentally reinforces the ‘Goldilocks’ narrative – improving growth alongside moderating inflation – creating an ideal environment for diversified investment portfolios,” he said.\n\nWhile normally these types of inflation readings would give the Fed the go-ahead to ease policy, the robust job numbers that came out Wednesday mean we seemingly are entering a “gold medal” economy with strong growth, a stabilizing job market and lower inflation, noted John Kerschner at Janus Henderson Investors.\n\n“The bond market is basically telling investors ‘nothing to worry about here’,” he added.\n\nThe CPI report was confirmation that: tariff-related adjustments have largely run their course, shelter inflation is set to moderate to a below pre-pandemic pace and unit labor costs should also moderate inflation over time, according to Tiffany Wilding at Pacific Investment Management Co.\n\n“This report did not meaningfully change our year-end 2026 inflation outlook of 2.4%, and we are still penciling in two more cuts later this year,” she said.\n\n“Overall, this won’t change Fed policy, but it will ease the path towards a cut in rates sooner rather than later,” said Neil Birrell at Premier Miton Investors. “The US economy looks to be in fine fettle with growth strong, inflation stable, the job market looking firmer and a Fed that has room to maneuver.”\n\nThe data suggest that price pressures remain a little too hot for comfort, but the direction of travel for inflation continues to look to be lower — even if this has proved a bumpy and slow process, according to James McCann at Edward Jones.\n\n“For the Fed, this probably doesn’t change much in the near term,” he said. “We do see scope for further easing later this year. However, this is contingent on a more convincing decline in inflation towards target with the urgency for additional cuts lower now that downside risks in the labor market have seemingly eased.”\n\nIn the near-term, the case for a cut looks flimsy and the strong likelihood is that the Fed stands pat in March, barring a shock to the economy in the interim, according to Jim Baird at Plante Moran Financial Advisors. Whether or not a reduction comes in the following months remains to be seen, but he says it will likely require further progress in inflation’s drop to the Fed’s 2% target.\n\n“That could change if the pace of layoffs accelerated or job creation faltered meaningfully again in the coming months,” Baird noted. “For now, policymakers appear convinced that the three quarter-point cuts late last year were enough to reduce that risk sufficiently, allowing them to take a patient approach in assessing whether additional easing will be needed.”\n\nThe latest data reinforced the sense that inflation isn’t re-accelerating and that the Fed won’t need to extend its pause as long as the more hawkish voices feared, noted Karen Manna at Federated Hermes.\n\n“Paired with the recent jobs data — where revisions told the real story — this report keeps the narrative intact: Rate cuts move a little closer into view, even if they’re still not near,” she said.\n\nTraders continue to fully price in a Fed rate cut in July, as well as a strong likelihood of a move in June. Swaps project roughly 63 basis points of easing by year-end — equivalent to two quarter-point cuts and about half of a third — up from 58 basis points on Thursday.\n\n“Today’s inflation report is a relief for investors rattled by AI disruptions in the stock market,” said David Russell at TradeStation. “It also offsets this week’s strong payrolls report, giving the Fed a little more reason to lean dovish. However, it’s still well above the central bank’s target and does little to move the needle near term. Policy expectations are going nowhere in a hurry.”\n\nAlthough much has been made about whether or not the Fed can keep cutting rates this year, the markets seem to care much more about the possibilities of artificial-intelligence disruption across a broad swath of industries, according to Chris Zaccarelli at Northlight Asset Management.\n\n“As long as CPI remains in check – which so far it has – then the rates discussion will revert back to the labor market, and under the current economic conditions the Fed is likely to proceed cautiously lowering rates a couple of times later this year,” he said.\n\nDespite the recent bout of volatility, the bull market is likely to remain intact as long as the economy keeps growing, the labor market holds up, and inflation measures continue to fall, Zaccarelli noted.\n\n“All of these conditions are in place and there haven’t been any new data points this month to contradict that,” he concluded.\n\nInflation is fading into the background, and behavior is doing more of the work than policy: Consumers are pushing back, companies are absorbing costs, and pricing power is thinning, according to Gina Bolvin at Bolvin Wealth Management Group.\n\n“Markets responded because this gives the Fed flexibility — and shifts the investor focus away from rate cuts and back to fundamentals. The next phase won’t reward macro bets, it will reward earnings discipline and balance-sheet strength,” she said.\n\nWhile the S&P 500 is still seeing losses for the week, the gauge is not that far from its late-January record.\n\n“After a powerful rally since last April, some consolidation during a typically weak February isn’t unhealthy,” said Mark Hackett at Nationwide. “Valuations have moderated, earnings expectations continue to improve, and bond yields are easing. The fundamental backdrop still supports this bull market.”\n\nStill, he noted that leadership is shifting, with investors finding better risk-reward in international, value and small-cap stocks.\n\nApplied Materials Inc. soared after the company delivered a surprisingly upbeat sales forecast, signaling that demand for artificial intelligence and memory semiconductors is fueling equipment purchases. A data center project expected to be leased by Nvidia Corp. sold $3.8 billion of junk bonds on Friday after receiving about $14 billion of orders from investors, an indication that lenders are eager to continue funding the buildout of artificial-intelligence infrastructure. OpenAI has partnered with two defense technology companies that the Pentagon has selected to compete to develop voice-controlled, drone swarming software for the US military, according to multiple people familiar with the matter. Goldman Sachs Group Inc. has rolled out a new custom basket aimed at navigating the growing upheaval in software stocks, betting on companies perceived to be better insulated from artificial intelligence disruption than others. The US Federal Trade Commission is accelerating scrutiny of Microsoft Corp. as part of an ongoing probe into whether the company illegally monopolizes large swaths of the enterprise computing market with its cloud software and AI offerings, including Copilot. Anthropic PBC has named Chris Liddell to its board of directors, expanding its leadership with a seasoned finance executive who played a key role in taking General Motors Co. public. SpaceX is considering a dual-class share structure in its planned IPO this year, according to people familiar with the matter, mirroring a strategy its billionaire founder Elon Musk floated for Tesla Inc. Blackstone Inc.’s private equity fund for wealthy individuals notched a net 20% gain last year, thanks in part to some artificial intelligence investments the firm doesn’t hold in its institutional portfolios. The Pentagon added Alibaba Group Holding Ltd., BYD Co., Baidu Inc. and TP-Link Technologies Co. to a list of companies that aid the Chinese military – before withdrawing it minutes later without explanation. Pinterest Inc. tumbled after the company projected current-quarter sales that fell short of Wall Street estimates, the latest in a rocky period marked by layoffs and a pivot toward artificial intelligence products. DraftKings Inc., the online betting company, issued a 2026 forecast for sales and profit that fell short of Wall Street estimates, sending the stock slumping. Instacart climbed after the company issued a strong outlook for the start of 2026 that far exceeded analyst expectations, signaling sustained demand for its grocery delivery services. Airbnb Inc. gained after the company posted strong fourth-quarter bookings and issued an upbeat revenue outlook, citing strong travel demand and growing adoption of its new flexible payment and booking options. Rivian Automotive Inc. closed out 2025 with better-than-expected financial results, sending the shares higher ahead of the electric-vehicle maker’s critical debut of its next-generation SUV. Moderna Inc. beat fourth-quarter revenue estimates as its struggling Covid vaccines business declined less than expected. Moderna lashed out at the US Food and Drug Administration for making it harder for companies to create new medicines, escalating a dispute between the vaccine maker and the regulator. Wendy’s Co. rebounded after the chain said sales would be little changed this year, suggesting that the struggling fast food chain has reached a low point. Constellation Brands Inc., the owner of the Modelo brand in the US, named Nicholas Fink its next chief executive officer as the company looks for new ways to spur growth amid a drop in the beer business. Toyota Motor Corp. is safeguarding its nearly $1 billion investment pledge to air taxi maker Joby Aviation Inc. by troubleshooting production processes and mulling a deeper manufacturing role. First Brands Group and some of its creditors are weighing a shift of some of its units into the Chapter 7 bankruptcy liquidation process as the company runs low on cash, according to people familiar with the matter. Capgemini Chief Executive Officer Aiman Ezzat said the French IT company is “clearly pivoting” to facilitate artificial intelligence adoption, which will fuel sales this year. The Paris prosecutor’s office opened probes into allegedly tainted infant formula distributed by Nestlé SA, Danone, Groupe Lactalis and two other brands. What Bloomberg Strategists say…\n\n“Friday’s CPI report certainly underscores the tension between the two sides of the Fed’s mandate, and raises the question of whether policymakers will heed labor market strength or capitalize on softer inflation to provide the economy with more support via lower rates.”\n\n—Kristine Aquino, Managing Editor, Markets Live. For the full analysis, click here.\n\nSome of the main moves in markets:\n\nThe S&P 500 rose 0.1% as of 3:17 p.m. New York time The Nasdaq 100 rose 0.3% The Dow Jones Industrial Average rose 0.1% The MSCI World Index was little changed Bloomberg Magnificent 7 Total Return Index fell 0.9% Philadelphia Stock Exchange Semiconductor Index rose 0.7% IShares Expanded Tech-Software Sector ETF rose 2.1% The Russell 2000 Index rose 1.2% S&P 500 Equal Weighted Index rose 1% Currencies\n\nThe Bloomberg Dollar Spot Index was little changed The euro was little changed at $1.1866 The British pound rose 0.2% to $1.3645 The Japanese yen was little changed at 152.80 per dollar Cryptocurrencies\n\nBitcoin rose 4.5% to $68,745.95 Ether rose 6.5% to $2,048.08 Bonds\n\nThe yield on 10-year Treasuries declined five basis points to 4.05% Germany’s 10-year yield declined two basis points to 2.75% Britain’s 10-year yield declined four basis points to 4.42% The yield on 2-year Treasuries declined five basis points to 3.41% The yield on 30-year Treasuries declined four basis points to 4.70% Commodities\n\nWest Texas Intermediate crude fell 0.3% to $62.68 a barrel Spot gold rose 2.2% to $5,030.08 an ounce ©2026 Bloomberg L.P.\n\nSWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR\n\nSWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR"
    },
    {
        "title": "U.S. Dollar Attempts To Move Higher As Traders Focus On CPI Data: Analysis For EUR/USD, GBP/USD, USD/CAD, USD/JPY",
        "url": "https://www.fxempire.com/forecasts/article/u-s-dollar-attempts-to-move-higher-as-traders-focus-on-cpi-data-analysis-for-eur-usd-gbp-usd-usd-cad-usd-jpy-1579496",
        "source": "FX Empire",
        "date": "2026-02-13T17:11:00+00:00",
        "content": "U.S. Dollar Index was mostly flat as traders reacted to CPI data. Inflation Rate declined from 2.7% in December to 2.4% in January, compared to analyst forecast of 2.5%.\n\nCore Inflation Rate decreased from 2.6% to 2.5%, in line with analyst estimates.\n\nThe surprising report provided significant support to Treasuries as traders rushed to bet on dovish Fed.\n\nThe yield of 2-year Treasuries pulled back towards the 3.40% level, while the yield of 10-year Treasuries declined towards the 4.05% level.\n\nInterestingly, falling Treasury yields did not put pressure on the American currency. Forex traders believe that Fed Chair Powell may keep rates unchanged until the end of his term to highlight Fed’s independence.\n\nThe nearest resistance level for U.S. Dollar Index is located in the 97.10 – 97.25 range. In case U.S. Dollar Index climbs above the 97.25 level, it will move towards the next resistance near recent highs at 98.00 – 98.15.\n\nEUR/USD is flat as traders focus on U.S. CPI data and react to economic reports from the EU.\n\nGermany’s Wholesale Prices increased by +0.9% month-over-month in January, compared to analyst consensus of +0.1%.\n\nEuro Area employment increased by +0.7% year-over-year in the fourth quarter, while analysts expected that it would grow by +0.6%.\n\nEUR/USD continues its attempts to settle below the nearest support at 1.1835 – 1.1850. If EUR/USD manages to settle below the 1.1835 level, it will move towards the next support, which is located in the 1.1770 – 1.1785 range.\n\nRSI remains in the moderate territory, so there is plenty of room to gain additional downside momentum in case the right catalysts emerge.\n\nGBP/USD is swinging between gains and losses as traders focus on CPI data from the U.S.\n\nThere are no important economic reports scheduled to be released in the UK today, so traders will stay focused on Fed policy outlook.\n\nThe British pound has mostly ignored the recent political crisis in the UK, which may indicate that the currency has the potential to get stronger in the near term.\n\nGBP/USD is trying to settle above the 50 MA at 1.3637. In case this attempt is successful, GBP/USD will move towards the next resistance level at 1.3710 – 1.3725.\n\nOn the support side, a successful test of the support at 1.3570 – 1.3585 will open the way to the test of the next support at 1.3485 – 1.3500.\n\nUSD/CAD is stuck in a tight range as traders monitor the rebound in precious metals markets.\n\nGold managed to climb back above the $5000 level, while silver climbed above the $77.00 level. Precious metals are moving higher as traders react to U.S. inflation data.\n\nOther commodity-related currencies are losing ground in today’s trading session, so rising commodity markets did not provide material support to this segment of the forex market.\n\nIf USD/CAD settles above the 50 MA at 1.3617, it will get to the test of the resistance level at 1.3650 – 1.3665.\n\nUSD/JPY is moving higher despite falling Treasury yields. Some traders are ready to bet on a rebound after the strong pullback, which pushed USD/JPY from 157.50 to 152.50.\n\nCurrently, USD/JPY is trying to settle above the 153.00 level. In case USD/JPY settles above 153.00, it will head towards the nearest resistance, which is located in the 154.50 – 155.00 range. A move above the 155.00 level will push USD/JPY towards the next resistance at 158.00 – 158.50.\n\nIf you’d like to know more about how to trade forex, please visit our educational area.\n\nVladimir is an independent trader, with over 18 years of experience in the financial markets. His expertise spans a wide range of instruments like stocks, futures, forex, indices, and commodities, forecasting both long-term and short-term market movements.\n\nNASDAQ Index, SP500, Dow Jones Forecasts – NASDAQ Moves Higher As Inflation Rate Drops To 2.4%\n\nGold (XAU/USD) Price Forecast: Strength Emerging Above Key Support\n\nNatural Gas Price Forecast: Oversold Levels Suggest Potential Rally\n\nUS Dollar Forecast: DXY Struggles for Direction After Hot Jobs Report, Soft CPI\n\nNatural Gas, WTI Oil, Brent Oil Forecasts – Oil Rebounds From Session Lows As Trump Puts More Pressure On Iran"
    }
]