[
    {
        "title": "Rivian (RIVN) Stock Rises 26% Following Multiple Analyst Upgrades",
        "url": "https://blockonomi.com/rivian-rivn-stock-rises-26-following-multiple-analyst-upgrades/",
        "source": "Blockonomi",
        "date": "2026-02-16T13:47:00+00:00",
        "content": "Rivian shares exploded 26.64% higher to $17.73 Thursday as Wall Street analysts upgraded their outlook on the electric vehicle maker. The surge followed Q4 earnings and improved sentiment around the company’s 2026 prospects.\n\nRivian Automotive, Inc., RIVN\n\nTD Cowen analyst Itay Michaeli boosted his price target from $13 to $17 while maintaining a Hold rating. He described the quarterly results as encouraging given recent weakness in EV sentiment. The firm noted 2026 guidance aligned with consensus but exceeded lowered expectations around demand concerns.\n\nUBS upgraded Rivian from Sell to Neutral with a $16 target, up from $15. The firm said near-term risk/reward has become more balanced at current prices. Deutsche Bank also upgraded shares to Buy in the same session.\n\nThe analyst upgrades reflect a valuation reset that has created buying opportunities. UBS specifically noted its prior Sell rating was partly based on valuation concerns. The firm expressed continued excitement about Rivian’s product lineup and brand positioning.\n\nRivian’s R2 vehicle begins shipping early this year at a price point under $50,000. This marks the company’s first entry into the mass-market EV segment where Tesla dominates.\n\nNearly 70% of American car buyers want vehicles priced under $50,000. Tesla’s Model 3 and Model Y transformed the company by targeting this demographic. Those two models now represent over 90% of Tesla’s total vehicle sales.\n\nThe R2 will be followed by R3 and R3X models through 2027. All three vehicles stay under the critical $50,000 threshold. This pricing strategy could replicate Tesla’s successful playbook for growth.\n\nOnly a handful of automakers have managed to profitably produce EVs at this price level. The manufacturing scale required presents major challenges. Rivian’s ability to execute will determine its competitive position over the next three years.\n\nRivian has positioned artificial intelligence as central to its growth plans. The company ranks second only to Tesla in self-driving technology development despite having less capital to invest.\n\nRecent AI platform announcements signal Rivian’s commitment to autonomous capabilities. Advances in AI have accelerated self-driving technology faster than industry experts predicted. Full autonomy now appears within reach for leading manufacturers.\n\nTesla has spent billions building its AI infrastructure. Rivian must match these efforts to remain competitive as software becomes as important as hardware. The company is allocating capital toward AI as a critical differentiator.\n\nUBS analysts highlighted their enthusiasm for Rivian’s brand strength and upcoming products. The firm believes 2026 guidance incorporates both upside opportunities and downside protection. Wall Street sees the company positioned to compete as AI capabilities become essential to vehicle buyers.\n\nRivian’s 2026 guidance came in line with consensus estimates. This eased fears about potential cannibalization between its R1 line and new models. The company’s market cap now stands at $22 billion with shares trading in a 52-week range of $10.36 to $22.69.\n\nDiscover top-performing stocks in AI, Crypto, and Technology with expert analysis.\n\n📈 Futures & Crypto Trader 🔍 Sharing charts, strategies, & mindset tips to help you level up 🚨 Not Financial Advice Follow on X @Pro_Trader_Edge\n\nType above and press Enter to search. Press Esc to cancel.\n\nZunaBet New Crypto Casino: 250% Bonus & 75 Free Casino Spins, Claim!"
    },
    {
        "title": "Stocks, Bonds Fluctuate in Holiday-Thinned Trade: Markets Wrap",
        "url": "https://finance.yahoo.com/news/stocks-gain-bonds-steady-holiday-124715230.html",
        "source": "Yahoo Finance",
        "date": "2026-02-16T16:51:00+00:00",
        "content": "(Bloomberg) -- Stocks and bonds posted small moves amid muted holiday trading after Friday’s benign US inflation data reinforced expectations that the Federal Reserve will cut interest rates this year.\n\nFutures on the S&P 500 were flat and Europe’s Stoxx 600 index gained 0.1%. NatWest Group Plc climbed 4.8% after Citigroup Inc. raised its price target on the UK lender. German bunds and Treasury futures were steady after US yields touched the lowest since December on Friday.\n\nA Tunnel to Transform Los Angeles\n\nNew Zealand Net Migration Sinks to Lowest Level in More Than a Decade\n\nTexas Airspace Closure Fallout Grows, Senators Seek Answers\n\nNFL’s Houston Texans to Shift HQ to New Suburban Development\n\nWith the US observing the Presidents’ Day holiday and mainland China’s markets closed for Lunar New Year holidays, trading volumes were thin. Still, the path of US interest rates remains in focus following the slower-than-expected US inflation print as traders fully price a Fed cut in July and the strong chance of a move in June.\n\n“The backdrop for equities is positive post CPI,” said Andrea Gabellone, head of global equities at KBC Securities. At the same time, there could be “more dispersion ahead as sentiment around key AI-exposed sectors is still very critical,” he added.\n\nThat sentiment was echoed by other strategists seeking to distinguish between AI losers and winners.\n\nA JPMorgan Chase & Co. team led by Mislav Matejka urged caution on stocks at risk of AI-driven “cannibalization,” including software, business services and media companies.\n\nFutures on the tech-heavy Nasdaq 100 were down 0.2%.\n\nFirms are developing tools to capitalize on the divergence. Goldman Sachs Group Inc. launched a new basket of software stocks that goes long firms that will benefit from AI adoption, while shorting the companies whose workflows could be replaced.\n\nWith AI disruption rippling through markets, a lot will come down to earnings resilience, in particular in the US.\n\n“When you look at the current earnings season, the companies are showing 13% of growth,” Nataliia Lipikhina, head of EMEA equity strategy at JPMorgan, told Bloomberg TV. “Overall, this is the reason why we continue to be positive on the S&P.”\n\nLater this week, traders will be watching for ADP private payrolls numbers on Tuesday and the minutes from the Fed’s January meeting on Wednesday for a fresh read on the economy.\n\nWhat Bloomberg strategists say...\n\nGlobal equities are likely to retreat as the fracturing AI outlook drags down megatechs and sectors vulnerable to disruptions. Stock declines will help bonds extend their rallies.\n\n— Garfield Reynolds, MLIV Team Leader. For full analysis, click here.\n\nElsewhere, gold dipped below $5,000 an ounce, as traders booked profits from a gain in the previous session.\n\nThe dollar was steady. Bitcoin fell 1.5% to $68,505 after posting its fourth consecutive weekly loss, with the cryptocurrency struggling to find clear direction as a weekend rally fizzled.\n\nWarner Bros Discovery Inc. is considering reopening sale talks with rival Hollywood studio Paramount Skydance Corp. after receiving its hostile suitor’s most recent amended offer, people with knowledge of the matter said.\n\nAlibaba Group Holding Ltd. unveiled a major upgrade of its flagship AI model, accelerating a race with a panoply of startups and sectoral leaders aiming to get in ahead of Chinese sensation DeepSeek’s next big platform.\n\nNatWest rose the most since October. Citi analyst Andrew Coombs raised his price target on the UK bank to a Street-high and upped his estimates for pretax profit and earnings-per-share to account for the acquisition of wealth manager Evelyn Partners and higher net interest income.\n\nOrsted A/S advanced as much as 4% after an upgrade from analysts at Kepler Cheuvreux, who were positive on the wind turbines operator’s outlook despite ongoing uncertainty for the industry in the US.\n\nVolkswagen plans to cut costs by 20% by the end of 2028, Manager Magazin reported, without saying where it got the information.\n\nA group led by Macquarie Asset Management will buy Qube Holdings Ltd. in a deal worth around A$11.7 billion ($8.3 billion).\n\nSome of the main moves in markets:\n\nS&P 500 futures were little changed as of 4:49 p.m. New York time\n\nFutures on the Dow Jones Industrial Average were little changed\n\nThe MSCI World Index was little changed\n\nThe Bloomberg Dollar Spot Index rose 0.1%, more than any closing gain since Feb. 5, 2026\n\nThe euro weakened 0.1%,falling for the fifth straight day, the longest losing streak since Nov. 21, 2025\n\nThe British pound fell 0.2% to $1.3627\n\nThe Japanese yen slipped 0.6%, more than any closing loss since Feb. 4, 2026\n\nThe offshore yuan rose 0.2% to the highest in almost three years\n\nThe Mexican peso was little changed at 17.1648\n\nBitcoin fell 0.5% to $68,504.79\n\nThe yield on 10-year Treasuries was little changed at 4.05%\n\nGermany’s 10-year yield was little changed at 2.75%\n\nBritain’s 10-year yield declined two basis points, falling for the fifth straight day, the longest losing streak since Jan. 12, 2026\n\nWest Texas Intermediate crude rose 1.3%, more than any closing gain since Feb. 4, 2026\n\nSpot gold fell 1% to $4,992.08 an ounce\n\nThis story was produced with the assistance of Bloomberg Automation.\n\n--With assistance from Richard Henderson and Sebastian Boyd.\n\nMost Read from Bloomberg Businessweek\n\nThe Georgia Pastor Accused of Defrauding the VA of Nearly $24 Million\n\nAmerica’s Most Powerful CEOs Are Awfully Quiet Lately\n\nDrug Cartels Are Shifting Their Money Laundering to Crypto. Cops Can’t Keep Up\n\nEpstein Files Contain a Big Clue About Cambodia’s Missing Masterpieces\n\nIndustry TV Recap: Shades of Epstein"
    },
    {
        "title": "The Week in EV Stocks: Rivian Gains 19.8% While Tesla Lags Behind | RIVN, TSLA",
        "url": "https://247wallst.com/investing/2026/02/15/the-week-in-ev-stocks-rivian-gains-19-8-while-tesla-lags-behind-rivn-tsla/",
        "source": "24/7 Wall St.",
        "date": "2026-02-15T23:05:00+00:00",
        "content": "Rivian (RIVN) gained 19.8% this week as Q4 delivered $120M gross profit and $7,200 per-vehicle cost improvement year-over-year. Its gains outpaced Tesla (TSLA), which gained 1.5% during the week. Both stocks outperformed the S&P 500.\n\nRivian software revenue surged 109% to $447M in Q4 from Volkswagen joint venture. Software now exceeds one-third of total revenue.\n\nRivian’s R2 SUV launches Q2 2026 to compete directly with Tesla Model Y. Delivery guidance reaches 62,000-67,000 units for 2026.\n\nSending You to Google News in 3\n\n© 2024 Getty Images / Getty Images Entertainment via Getty Images\n\nRivian Automotive Inc (NASDAQ:RIVN | RIVN Price Prediction) gained 19.8% this week, closing at $17.73 on Friday, February 13, 2026. While Tesla Inc (NASDAQ:TSLA) managed just 1.54% over the same period, Rivian’s surge came despite year-to-date losses of 10.05%.\n\nThree storylines drove this momentum: Rivian’s Q4 earnings that revealed hidden strength, the imminent R2 launch, and software revenue growth reshaping the business model.\n\nRivian’s February 11 earnings were immediately cheered by the market. Revenue of $1.29 billion beat estimates by $13 million, and automotive revenue plunged 45% year-over-year to $839 million. The culprit? A $270 million drop in regulatory credit sales and collapsing demand after the federal EV tax credit expired on September 30, 2025.\n\nBut the profitability story improved dramatically. Rivian posted $120 million in Q4 gross profit and $144 million for the full year, a $1.3 billion improvement from 2024’s losses. Cost of goods sold per vehicle improved by more than $7,200 year-over-year. CEO RJ Scaringe framed it clearly: “In 2025 we focused on execution as we laid the foundation for dramatically scaling our business.”\n\nThe company beat EPS estimates, posting an adjusted loss of $0.53 versus the $0.67 expected loss. With $6.08 billion in cash and equivalents, Rivian has runway to reach the R2 launch without immediate financing pressure.\n\nThe R2 SUV, Rivian’s answer to Tesla’s Model Y, is on track for first customer deliveries in Q2 2026. Manufacturing validation builds were completed in mid-January 2026, and Scaringe noted “early strong reviews of the R2 pre-production builds.” Additional product details will be revealed on March 12, 2026.\n\nThe company guides for 62,000 to 67,000 deliveries in 2026, up from 2025’s 42,247 units. R2 represents Rivian’s first mass-market vehicle, priced to compete directly where Tesla dominates. The 1.1 million square foot manufacturing expansion at the Normal facility is complete, positioning Rivian to scale production rapidly once R2 ramps.\n\nThe most overlooked storyline is software and services revenue, which exploded 109% year-over-year to $447 million in Q4. This growth came primarily from the Volkswagen Group joint venture, where Rivian provides vehicle electrical architecture and software development services.\n\nWhile automotive revenue collapsed, software revenue grew sequentially from $416 million in Q3 to $447 million in Q4, cushioning the blow from vehicle sales. This segment now represents over a third of total revenue and carries significantly higher margins than vehicle manufacturing. If Rivian can maintain this trajectory while ramping R2 production, the business model starts to look less like a traditional automaker and more like a hybrid technology platform.\n\nThe week’s 19.8% gain suggests investors are looking past near-term delivery headwinds and focusing on structural improvements: unit economics turning positive, R2 on schedule, and a software business becoming material. With 2026 guidance calling for negative $2.1 billion to $1.8 billion adjusted EBITDA, profitability remains distant. But the trajectory is bending in the right direction, and the R2 launch could be the inflection point that determines whether Rivian survives the EV shakeout.\n\nOur top personal finance-related articles today. Your wallet will thank you later.\n\nRivian (NASDAQ: RIVN | RIVN Price Prediction) delivered its Q4 2024 earnings report on yesterday, and while the electric vehicle…\n\nLive Updates Little Rivian Movement During Conference Call Feb 12, 2026 at 5:52 PM EST The Rivian call is still…\n\nRivian (NASDAQ:RIVN | RIVN Price Prediction) has proven to be a disappointing investment since its initial public offering in November…\n\nAmong one of the top-performing and reputable electric vehicle makers in the U.S., Rivian Automotive (NASDAQ:RIVN | RIVN Price Prediction)…\n\nRivian Automotive (NASDAQ:RIVN | RIVN Price Prediction) is betting its future on the R2, a midsize electric SUV scheduled to…\n\nRivian Automotive (NASDAQ:RIVN | RIVN Price Prediction) has certainly been among the worst-performing EV stocks in the market this year, down…\n\nRivian stock has been pulling back this year due to various challenges. Here is a look at where Wall Street…\n\nShares of Rivian Automotive (NASDAQ:RIVN | RIVN Price Prediction) lost 2.79% over the past five trading sessions after losing 10.76%…\n\nElectric vehicle (EV) maker Rivian Automotive (NASDAQ:RIVN | RIVN Price Prediction) has endured a rollercoaster ride since its 2021 debut.…"
    }
]