[
    {
        "title": "The SaaS-pocalypse Crushes S&P Global — Is the Data Giant a Screaming Buy?",
        "url": "https://finance.yahoo.com/news/saas-pocalypse-crushes-p-global-152131816.html",
        "source": "Yahoo Finance",
        "date": "2026-02-15T16:45:00+00:00",
        "content": "S&P Global (SPGI) dropped 25% in one month after 2026 earnings guidance of $19.40-$19.65 missed the $19.96 consensus.\n\nS&P Global now trades at 21x estimates, its lowest valuation in five years versus a 30x average.\n\nThe company posted a 39% free cash flow margin and maintains 50+ consecutive years of dividend increases.\n\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here.\n\nS&P Global (NYSE:SPGI) shares have plunged due to the so-called \"SaaS-pocalypse\" sell-off that hit software-as-a-service stocks hard. That was followed by another sharp drop after the global ratings and index provider's fourth-quarter earnings report. While it beat revenue expectations, guidance for 2026 came in below forecasts. Still, the company showed solid growth across segments and strong cash flow.\n\nEven so, S&P Global has tumbled 25% in the past month, hitting a 52-week low of $381.61 per share before bouncing back over the past two trading days. Yet, with more than 50 years of dividend increases, is this a buy-the-dip opportunity for a business with strong data advantages and reliable returns, or is there more room to fall?\n\nThe company runs four main segments:\n\nGlobal Ratings: Provides key credit ratings for financial markets.\n\nDow Jones Indices: Manages benchmarks like the S&P 500, tied to trillions in assets.\n\nS&P Global Market Intelligence: Supplies data and analytics for investors.\n\nGlobal Commodity Insights and Engineering Solutions: Offers specialized energy and commodities data.\n\nS&P Global's revenue hit $3.92 billion, up 9% year-over-year and above the $3.91 billion expected. Non-GAAP earnings rose 14% to $4.30 per share, just shy of the $4.32 per share forecast. Adjusted full-year 2025 EPS reached $17.83.\n\nImportantly, all business segments expanded margins and grew revenue at upper single-digit rates. This shows the company's core operations remain resilient despite economic uncertainty and negative investor mood.\n\nS&P's gross margin has stayed around 69% to 70% for a decade, showing pricing power and cost control. Last year's free cash flow margin hit 39%, meaning it threw off nearly $39 in cash for every $100 it made in revenue -- greater than the year-ago period thanks to higher sales and efficiency.\n\nThis cash powers dividends, investments, and possible buybacks, strengthening the balance sheet and creating long-term value.\n\nAs a Dividend King, S&P Global has raised payouts for over 50 consecutive years. The current yield is about 0.92%, with a 10-year dividend growth rate of 10.3%. Last year's smaller hike was related to a planned business spinoff to simplify its operations. Still, the dividend stays well-covered by earnings and cash flow, making it dependable even in volatile markets.\n\nGuidance was the weak spot: S&P Global expects adjusted earnings of $19.40 to $19.65 per share -- below the $19.96 per share consensus -- and projected revenue growth of 6.6% to 8.6%, which was also under expectations and below 2025's 8% pace.\n\nThis cautious outlook, combined with broader selling in software stocks since late 2025 -- driven by AI competition fears -- amplified the market's reaction. S&P Global is now down 24% over the past year and almost 22% year-to-date.\n\nHowever, unlike standard software firms at risk from AI, S&P Global owns unique, hard-to-replicate data assets -- proprietary credit records, exclusive indices, and vast financial datasets. AI can't easily replace these.\n\nIn fact, AI can help: it may increase demand for licensed data and improve internal efficiency. Credit ratings become even more vital in uncertain times. This deep \"data moat\" sets it apart from easily copied SaaS players, and its stock now trades at an attractive valuation.\n\nShares go for less than 21x estimates -- the lowest in five years and far below its 30x average. This reflects a dour market sentiment, not weaker business performance. Earnings still grow 11% to 12% annually.\n\nAnalysts' average price target is $576 per share, implying 40% upside. The consensus had been as high as $615 per share a month ago, but targets were lowered after the earnings report.\n\nS&P Global isn't just another software stock -- its strength lies in irreplaceable data ownership and durable moats in ratings and indices. AI is more of a boost than a threat.\n\nThe stock price drop to near $382 -- a level not seen since 2023 -- stems from short-term guidance worries and sector pressure, not core weakness. For long-term investors, this offers a chance to buy a high-quality company at a discount.\n\nMost Americans drastically underestimate how much they need to retire and overestimate how prepared they are. But data shows that people with one habit have more than double the savings of those who don’t.\n\nAnd no, it’s got nothing to do with increasing your income, savings, clipping coupons, or even cutting back on your lifestyle. It’s much more straightforward (and powerful) than any of that. Frankly, it’s shocking more people don’t adopt the habit given how easy it is."
    },
    {
        "title": "Calculating The Fair Value Of JAG Capital Berhad (KLSE:JAGCPTL)",
        "url": "https://finance.yahoo.com/news/calculating-fair-value-jag-capital-025908167.html",
        "source": "Yahoo Finance",
        "date": "2026-02-15T04:15:00+00:00",
        "content": "The projected fair value for JAG Capital Berhad is RM1.09 based on 2 Stage Free Cash Flow to Equity\n\nWith RM0.99 share price, JAG Capital Berhad appears to be trading close to its estimated fair value\n\nThe average premium for JAG Capital Berhad's competitorsis currently 15,619%\n\nToday we will run through one way of estimating the intrinsic value of JAG Capital Berhad (KLSE:JAGCPTL) by taking the expected future cash flows and discounting them to today's value. One way to achieve this is by employing the Discounted Cash Flow (DCF) model. It may sound complicated, but actually it is quite simple!\n\nWe would caution that there are many ways of valuing a company and, like the DCF, each technique has advantages and disadvantages in certain scenarios. Anyone interested in learning a bit more about intrinsic value should have a read of the Simply Wall St analysis model.\n\nWe've found 21 US stocks that are forecast to pay a dividend yield of over 6% next year. See the full list for free.\n\nWe are going to use a two-stage DCF model, which, as the name states, takes into account two stages of growth. The first stage is generally a higher growth period which levels off heading towards the terminal value, captured in the second 'steady growth' period. In the first stage we need to estimate the cash flows to the business over the next ten years. Seeing as no analyst estimates of free cash flow are available to us, we have extrapolate the previous free cash flow (FCF) from the company's last reported value. We assume companies with shrinking free cash flow will slow their rate of shrinkage, and that companies with growing free cash flow will see their growth rate slow, over this period. We do this to reflect that growth tends to slow more in the early years than it does in later years.\n\nGenerally we assume that a dollar today is more valuable than a dollar in the future, so we discount the value of these future cash flows to their estimated value in today's dollars:\n\nPresent Value (MYR, Millions) Discounted @ 8.4%\n\n(\"Est\" = FCF growth rate estimated by Simply Wall St)Present Value of 10-year Cash Flow (PVCF) = RM228m\n\nWe now need to calculate the Terminal Value, which accounts for all the future cash flows after this ten year period. The Gordon Growth formula is used to calculate Terminal Value at a future annual growth rate equal to the 5-year average of the 10-year government bond yield of 3.8%. We discount the terminal cash flows to today's value at a cost of equity of 8.4%.\n\nTerminal Value (TV)= FCF2035 × (1 + g) ÷ (r – g) = RM38m× (1 + 3.8%) ÷ (8.4%– 3.8%) = RM844m\n\nPresent Value of Terminal Value (PVTV)= TV / (1 + r)10= RM844m÷ ( 1 + 8.4%)10= RM377m\n\nThe total value, or equity value, is then the sum of the present value of the future cash flows, which in this case is RM606m. In the final step we divide the equity value by the number of shares outstanding. Compared to the current share price of RM1.0, the company appears about fair value at a 8.9% discount to where the stock price trades currently. The assumptions in any calculation have a big impact on the valuation, so it is better to view this as a rough estimate, not precise down to the last cent.\n\nNow the most important inputs to a discounted cash flow are the discount rate, and of course, the actual cash flows. You don't have to agree with these inputs, I recommend redoing the calculations yourself and playing with them. The DCF also does not consider the possible cyclicality of an industry, or a company's future capital requirements, so it does not give a full picture of a company's potential performance. Given that we are looking at JAG Capital Berhad as potential shareholders, the cost of equity is used as the discount rate, rather than the cost of capital (or weighted average cost of capital, WACC) which accounts for debt. In this calculation we've used 8.4%, which is based on a levered beta of 0.800. Beta is a measure of a stock's volatility, compared to the market as a whole. We get our beta from the industry average beta of globally comparable companies, with an imposed limit between 0.8 and 2.0, which is a reasonable range for a stable business.\n\nCheck out our latest analysis for JAG Capital Berhad\n\nEarnings growth over the past year exceeded the industry.\n\nDividends are covered by earnings and cash flows.\n\nDividend is low compared to the top 25% of dividend payers in the Oil and Gas market.\n\nCurrent share price is below our estimate of fair value.\n\nLack of analyst coverage makes it difficult to determine JAGCPTL's earnings prospects.\n\nNo apparent threats visible for JAGCPTL.\n\nAlthough the valuation of a company is important, it shouldn't be the only metric you look at when researching a company. The DCF model is not a perfect stock valuation tool. Rather it should be seen as a guide to \"what assumptions need to be true for this stock to be under/overvalued?\" If a company grows at a different rate, or if its cost of equity or risk free rate changes sharply, the output can look very different. For JAG Capital Berhad, we've compiled three pertinent aspects you should look at:\n\nRisks: For example, we've discovered 2 warning signs for JAG Capital Berhad (1 is significant!) that you should be aware of before investing here.\n\nOther High Quality Alternatives: Do you like a good all-rounder? Explore our interactive list of high quality stocks to get an idea of what else is out there you may be missing!\n\nOther Top Analyst Picks: Interested to see what the analysts are thinking? Take a look at our interactive list of analysts' top stock picks to find out what they feel might have an attractive future outlook!\n\nPS. The Simply Wall St app conducts a discounted cash flow valuation for every stock on the KLSE every day. If you want to find the calculation for other stocks just search here.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned."
    }
]