[
    {
        "title": "Fractal Analytics IPO Day 3 Highlights: Issue booked 2.66x as QIBs step in — GMP turns negative",
        "url": "https://www.livemint.com/market/ipo/fractal-analytics-ipo-gmp-remains-flat-last-day-to-apply-for-fractal-analytics-ipo-check-review-11-february-2026-11770782214072.html",
        "source": "Mint",
        "date": "2026-02-12T00:08:00+00:00",
        "content": "Fractal Analytics IPO Day 3 Highlights: The initial public offering (IPO) of AI solutions provider Fractal Analytics has opened for the final day of bidding on Wednesday, February 11. The offer has so far seen a tepid response from investors. As of the second day of bidding, Fractal Analytics IPO was booked 20%.\n\nFractal Analytics’  ₹2,834-crore IPO has a price band of  ₹857 to  ₹900 per share, valuing the company at approximately  ₹15,500 crore.\n\nThe company has reduced the size of its IPO from the initially proposed  ₹4,900 crore. The revised issue consists of a fresh equity issue of up to  ₹1,023.5 crore and an offer for sale (OFS) worth  ₹1,810.4 crore, bringing the total issue size to  ₹2,833.9 crore.\n\nShareholders participating in the OFS include Quinag Bidco Ltd, TPG Fett Holdings Pte Ltd, Satya Kumari Remala Rao, Venkateswara Remala, and GLM Family Trust.\n\nProceeds from the fresh issue will be deployed to invest in its subsidiary, Fractal USA, for debt repayment, purchase of laptops, establishment of new offices in India, research and development initiatives, expansion of sales and marketing efforts under Fractal Alpha, funding acquisitions and strategic initiatives, as well as for general corporate purposes.\n\nFractal Analytics IPO grey market premium (GMP) has slumped to  ₹7 today. This means that shares of Fractal Analytics IPO are trading at  ₹907 as against the offer price of  ₹900.\n\nAt the current levels, Fractal Analytics IPO listing pop could be less than 1% only.\n\nThe company is scheduled to list on the stock exchanges on February 16.\n\nFounded in 2000, Fractal Analytics provides end-to-end AI solutions and data-driven insights to large global enterprises across various industries and business functions.\n\nThe company specialises in sectors such as consumer packaged goods and retail, technology, media and telecom, healthcare and life sciences, and banking, financial services and insurance.\n\nAs of March 31, 2025, Fractal’s client roster included global giants such as Microsoft, Apple, Nvidia, Alphabet, Amazon, Meta and Tesla.\n\nWatch this space for LIVE updates on Fractal Analytics IPO Day 3\n\nAs of September 2025, Fractal’s top ten clients had an average relationship tenure of over eight years, with marquee clients including Citibank, Costco, Franklin Templeton, Mars, Mondelez, Nationwide, Nestlé, and Philips.\n\nFractal Analytics IPO is -  ₹2. This means that shares of Fractal Analytics are trading  ₹2 below the IPO price of  ₹900.\n\nThe company operates through two business segments: Fractal.ai, which delivers AI services and products primarily through its proprietary agentic AI platform, Cogentiq, and Fractal Alpha, which houses independent AI ventures targeting core clients, adjacent markets, and new geographies.\n\nFractal Analytics IPO's NII segment was also fully subscribed as of 4 pm on the final day of bidding. QIB was the most booked segment at 4x bids.\n\nFractal Analytics has a strong presence across its four focus industries and serves large global clients, with the top 10 clients averaging over eight years of engagement. At the upper price band of  ₹900, the issue is valued at 78.9x FY25 P/E (post-issue), there are no listed companies in India or globally for comparison for similar business model , with positive sector outlook with moderate growth—18% revenue CAGR during FY23–25 and 20% YoY growth in 1HFY26.\n\nAttrition remains elevated at 16.3% in FY25 and 15.7% in 1HFY26. also Fractal is India’s first pure-play AI company to list, positioned as a Decision Intelligence player combining AI services with incubated SaaS products (Fractal Alpha ).\n\nWe assign a Subscribe rating for Long Term high-risk growth focused investor. ( 3–5 year horizon)\n\nFractal’s portfolio includes proprietary platforms and models such as Cogentiq (an agentic AI orchestration platform), Vaidya (a multimodal medical foundation model ecosystem), Kalaido.ai (a diffusion‑based generative image model), Pioneer (a multi‑agent system for software development and autonomous data science), and the Fathom family of reasoning and deep‑research models, alongside investments in ecosystem assets such as Qure.ai (AI for radiology) and Analytics Vidhya.\n\nThe global data, analytics and AI industry is undergoing a structural shift toward an AI-native, GenAI-led enterprise stack, with core AI services and platforms emerging as the fastest-growing layers of digital transformation spend.\n\nWithin this rapidly evolving landscape, Fractal Analytics is strategically positioned as a mission-critical, end-to-end enterprise AI partner, combining consulting, services, platforms and product businesses to help large global clients operationalize AI at scale across functions and industries.\n\nIt operates in a long-duration, secular growth market, with its total serviceable addressable market across AI services, platforms and software expected to expand from about US$85 billion in FY25 to around US$171 billion by FY30P, implying a robust mid-teens CAGR in line with, or above, broader DAAI growth.\n\nThis expansion is driven by accelerating GenAI adoption, rising demand for domain-specific AI, and the shift from pilot projects to scaled, production-grade AI and agentic systems embedded in core workflows, providing strong multi-year revenue visibility.\n\nFractal’s offerings are deeply integrated into client decision journeys and technology stacks, supported by high net revenue retention, long-standing relationships with marquee “must win” clients, and an increasing mix of recurring and product-linked revenues, resulting in high switching costs and improving earnings quality.\n\nWe recommend subscribing to the issue with a long-term investment horizon, as sustained execution on its IP- and platform-led strategy, deepening penetration within must-win clients, and powerful GenAI-led industry tailwinds could translate into meaningful value creation over time.\n\nWhile the emergence of Artificial General Intelligence (AGI) poses a long-term disruptive risk to traditional AI business models, Fractal’s dominant position in the analytics niche suggest a strong competitive strength and deep-rooted client trust. As the company continues to capitalize on the global demand for enterprise-grade AI, its ability to maintain high margins and operational leverage, we recommend a ‘SUBSCRIBE’ rating for long-term investors, said Lakshmishree Investment.\n\nFractal, in its RHP, said that it has experience in serving several large enterprises, including the majority of the “magnificent seven” companies (Alphabet, Amazon, Apple, Meta, Microsoft, Nvidia, and Tesla).\n\nFractal Analytics IPO was subscribed 1.45 times as of 1.15 pm, thanks to massive QIB demand. Other segments, however, remained undersubscribed.\n\nQIB quota was booked 2.27 times, QIB segment received 46% bids and the retail portion garnered 78% subscription.\n\nFractal Analytics operates in a niche segment of Data Analytics leveraging AI developed through in-house R&D and resources as well as on external models. It has a healthy presence across its 4 focus industries with top MNCs as its clients and an average tenure of 8+ years across the top 10 clients.\n\nAt the upper price band of  ₹900, the issue is valued at FY25 P/E multiple of 78.9x based on post-issue capital. This looks elevated given the relatively modest revenue growth (18% revenue CAGR between FY23-25 and 20% YoY growth in 1HFY26). Attrition rate for the company continues to be elevated (16.3% in FY25/15.7% in 1HFY26). Risks such as insourcing by clients especially with the advent of AI tools could lead to loss of clients and impact the company’s business model.\n\nConsidering the elevated valuation, we assign a NEUTRAL rating to the issue and would like to track the performance of the company for a few quarters post listing.\n\nThe company works with marquee clients such as Citibank, Costco, Franklin Templeton, Mars, Mondelez, Nationwide, Nestle, Phillips, etc., ensuring participation across its focus industries of CPGR, TMT, HLS, and BFSI. As of Sep’25, the company served 122 Must Win Clients (MWCs)and served its top 10 clients by revenue in 1HFY26 for an average of more than eight years.\n\nFractal Analytics IPO was subscribed 54% so far as QIB investors ramped up buying, with their quota booked 55%.\n\nFractal Analytics IPO subscribed 28% as of 12 pm. The QIB segment was booked 8% and the NII portion was subscribed 38%. The retail portion garnered 73% bids and the employee segment 27%.\n\nAs of 1HFY26/FY25, the company’s top 10 clients contributed 54.2%/53.8% to the total revenue from the Fractal.ai business segment. Thus, failure to maintain and expand relationships with its existing client base or add new clients, may impact the company’s business and financial performance.\n\nThe issue is priced at a P/BV of 7.76 based on its NAV of Rs. 116 as of September 30, 2025 and asking price is at a P/E of ~109.12x if we attribute FY26 annualized earnings. There are no listed peers to compare with as per the RHP. The issue is very aggressively priced.\n\nFractal Analytics offers investors an opportunity to contribute in a rapidly growing sector of DAAI services and generative AI that serves high-end consumer brands in India and globally but, Looking at all the factors, risks, opportunities and Elevated valuation, Investors with High-risk appetite can apply for Long term horizon.\n\nFractal Analytics IPO is a book build issue of  ₹2,833.9 crore, consisting of a fresh issue of 1.1 crore shares, aggregating to  ₹1,023.5 crore and an offer for sale of 2 crore shares aggregating to  ₹1,810.4 crore. The company plans to use the fresh funds raised for the following:\n\n1. Investment in Fractal USA for Debt Repayment –  ₹264.9 crore\n\n2. Purchase of Laptops –  ₹57.1 crore\n\n3. Setting-up New Office Premises in India –  ₹1,211 crore\n\n4. Investment in R&D and Sales & Marketing under Fractal Alpha –  ₹355.1 crore\n\n5. Inorganic Growth and General Corporate Purposes\n\nFractal Analytics IPO subscribed 22% as of 10.30 am. The QIB segment was booked 2% and the NII portion was subscribed 31%. The retail portion garnered 67% bids and the employee segment 23%.\n\nFractal is India’s first pure-play AI company to list, positioned as a Decision Intelligence player combining AI services with incubated SaaS products (Fractal Alpha). The company has seen a sharp turnaround, moving from a  ₹55 crore loss in FY24 to a  ₹221 crore profit in FY25 on the back of 26% revenue growth.\n\nAt the upper band of  ₹900, valuations look expensive at ~79x (post) FY25 P/E, but this reflects a scarcity premium for a listed AI platform. Best suited for high-risk, growth-focused investors with a 3–5 year view looking to ride the global GenAI cycle.\n\nFractal has built a diversified revenue profile. In FY25, revenue from the Fractal.ai segment stood at  ₹2,703.7 Cr, with CPGR contributing  ₹1,061.5 Cr, TMT  ₹808.7 Cr, HLS  ₹374.5 Cr, BFSI  ₹298.0 Cr, and other industries  ₹161.0 Cr.\n\nRevenue from operations grew from  ₹1,985.4 Cr in FY23 to  ₹2,196.3 Cr in FY24, and further to  ₹2,765.4 Cr in FY25, reflecting a 25.9% YoY growth. For the six months ended September 30, 2025, revenue stood at  ₹1,559.0 Cr, up 19.9% YoY.\n\nProfitability improved materially in FY25. EBITDA increased to  ₹398.0 Cr, with an EBITDA margin of 14.4%, compared to  ₹97.2 Cr and 4.4% in FY24. Adjusted EBITDA stood at  ₹482.1 Cr, with an adjusted EBITDA margin of 17.4%.\n\nProfit after tax (PAT) for FY25 was  ₹220.6 Cr, compared to a loss of  ₹54.7 Cr in FY24, with a PAT margin of 8.0%, while adjusted PAT stood at  ₹347.8 Cr, translating into an adjusted PAT margin of 12.6%.\n\nFractal Analytics IPO opened for the final day of bidding today at 10 am. Investors can place their bids till 5 pm today. Issue was booked 20% as of the second day.\n\nInvestors can apply for the IPO in multiples of 16 shares, requring a minimum investment of  ₹14,400.\n\nFractal Analytics IPO grey market premium (GMP) has slumped to  ₹7 today. This means that shares of Fractal Analytics IPO are trading at  ₹907 as against the offer price of  ₹900.\n\nAt the current levels, Fractal Analytics IPO listing pop could be less than 1% only.\n\nThe company is scheduled to list on the stock exchanges on February 16.\n\nFractal Analytics IPO received bids for 36,40,320 shares against 1,85,79,360 shares on offer, according to NSE data, resulting in 20% bids.\n\nThe category for retail individual investors (RIIs) fetched 60 per cent subscription, while the quota for non-institutional investors subscribed 27 per cent. The portion for qualified institutional buyers (QIBs) received a 2 per cent subscription.\n\nCatch all the Business News ,  Market News , Breaking News Events and Latest News  Updates on Live Mint. Download The Mint News App  to get Daily Market Updates."
    },
    {
        "title": "Flowers Foods Q4 Earnings Call Highlights",
        "url": "https://finance.yahoo.com/news/flowers-foods-q4-earnings-call-221931111.html",
        "source": "Yahoo Finance",
        "date": "2026-02-12T22:32:00+00:00",
        "content": "Finished fiscal 2025 at the high end of guidance and launched a comprehensive review to \"reignite top-line growth\" — management called 2026 an \"investment and transition\" year with higher marketing and innovation spend that will pressure near-term margins, and guided 2026 net sales of $5.163B–$5.267B, adjusted EBITDA of $465M–$495M and adjusted EPS of $0.80–$0.90.\n\nQ4 results included a $136M non‑cash impairment, $9M of restructuring costs and a GAAP diluted loss of $0.32 (adjusted diluted EPS $0.22); the Simple Mills acquisition added $57.5M in sales and ~$6.3M to adjusted EBITDA but lifted net debt to roughly 3.3x trailing adjusted EBITDA.\n\nBrand and category performance was mixed: Dave’s Killer Bread, specialty premium, breakfast and buns/rolls outpaced the category while traditional loaf weakened, and management appointed a new CFO and reorganized DSD with regional P&L responsibility to boost execution and profitability.\n\nInterested in Flowers Foods, Inc.? Here are five stocks we like better.\n\n3 High-Yield Bargains to Watch in 2025’s Second Half\n\nFlowers Foods (NYSE:FLO) executives said the company finished fiscal 2025 at the high end of its guidance range, even as demand in several bread segments remained pressured. In recorded remarks discussing fourth-quarter and full-year results, Chairman and CEO Ryals McMullian pointed to ongoing efficiency initiatives and portfolio actions as key contributors, while warning that category headwinds are expected to continue into 2026.\n\nManagement said it is launching a comprehensive review of operations designed to “reignite top-line growth and expand margins.” The review includes evaluating and optimizing the brand portfolio, assessing supply chain enhancements, and reassessing capital allocation to fund growth initiatives. Executives characterized 2026 as an “investment and transition year,” with higher marketing and innovation spending expected to create near-term margin pressure.\n\n→ Once Upon A Farm: Buy the $1B Growth Story?\n\nMcMullian said Flowers maintained unit share in fresh packaged bread during the year, led by Dave’s Killer Bread (DKB), which gained 20 basis points. Nature’s Own, Canyon Bakehouse, and Wonder held share, according to management.\n\nTraditional loaf remained a weak spot. Flowers said traditional loaf unit sales declined 4% in the fourth quarter, compared with a 2% decline for the bread category overall, while overall food category units posted a modest increase.\n\n→ No Rally? Coca-Cola’s Results Still Look Like a Sweet Deal\n\nWithin the company’s growth focus areas, management highlighted several segments where it said performance outpaced the broader category:\n\nDave’s Killer Bread: Unit sales rose 3% in the quarter, with dollar sales increasing at each of its top 10 customers. Management cited distribution gains in underpenetrated areas such as sandwich buns and rolls and breakfast.\n\nSpecialty premium loaf: Flowers said it gained 60 basis points of unit share, driven largely by DKB (up 50 basis points), with Canyon Bakehouse and Nature’s Own each adding 10 basis points.\n\nBreakfast: The company reported unit and dollar share gains of 40 basis points and 50 basis points, respectively, supported by Wonder and DKB. Management noted DKB has grown dollar share in breakfast every year since 2021.\n\nSandwich buns and rolls: Unit share increased 50 basis points and units grew 3%, which management said outpaced the overall category by about 600 basis points. Nature’s Own innovation, including keto buns and Perfectly Crafted Brioche Buns, was cited as a contributor.\n\nCake: Flowers said actions to mitigate category weakness improved revenue, aided by a Wonder-branded cake line launched in 2025. In the fourth quarter, management said category unit sales fell 3% while Flowers’ cake unit sales grew 5%, and that Tastykake sales remained solid with minimal cannibalization.\n\nMcMullian introduced Anthony Scaglione as Flowers’ new chief financial officer and said he has already had a positive impact since joining in January. The company also named David Roach, previously chief strategic projects officer, as chief DSD (direct store delivery) operations officer in a newly created role with full profit-and-loss responsibility for the DSD business.\n\n→ AI Power Crunch: Why Bloom Energy Is the Hidden Winner\n\nTo support the shift, Flowers is implementing a new DSD structure that places full P&L responsibility at the regional level. Management said the change is intended to improve execution, increase accountability, and strengthen sales performance and profitability across the network.\n\nScaglione said fourth-quarter net sales increased 11% year over year. Price/mix rose 70 basis points, helped by pricing actions taken late in the quarter to offset input cost inflation, while volume declined 2.2%, which management attributed primarily to branded traditional loaf, foodservice, and store-brand cake. The Simple Mills acquisition contributed 4.7% to sales growth and the extra week in the fiscal year added 7.8%, according to the CFO.\n\nGross margin (excluding depreciation and amortization) was 48.5% of sales, down 30 basis points from the prior-year quarter. Scaglione said higher outside purchases tied to the Simple Mills business model were partially offset by lower labor and ingredient costs associated with the addition of Simple Mills and higher sell-through of finished goods.\n\nSelling, distribution, and administrative expenses were 39.9% of sales, down 10 basis points year over year. Excluding matters affecting comparability, adjusted SD&A was 39% of net sales, a 60 basis point improvement driven by efficiency efforts and lower distributor distribution fees as a percentage of sales, including an impact from Simple Mills’ co-manufacturing structure.\n\nGAAP diluted EPS was a loss of $0.32, down $0.52 from the prior-year period. Scaglione cited several significant items, including:\n\n$136 million non-cash impairment of intangible assets\n\n$9 million in restructuring-related implementation costs\n\n$3 million loss tied to inferior supplier ingredients, which also impacted sales\n\nAdjusted diluted EPS was $0.22, consistent with the prior-year quarter, he said.\n\nScaglione said the impairment charge followed an early-stage evaluation of the brand portfolio and current and future investments, in conjunction with the company’s typical goodwill and intangibles process. He said the long-term outlook for certain brands was “lower than previously forecasted,” leading to the write-down, but added that in the short term management does not expect further impairments based on the outlook for the remaining portfolio.\n\nThe Simple Mills acquisition contributed $57.5 million in net sales and $6.3 million to adjusted EBITDA in the quarter, and resulted in a $0.03 adjusted diluted loss per share, inclusive of $0.04 of related financing costs, management said.\n\nAt year-end, net debt to trailing 12-month adjusted EBITDA was approximately 3.3x, up year over year due to the Simple Mills acquisition. Scaglione said Flowers remains focused on maintaining a strong balance sheet, particularly ahead of an upcoming bond maturity.\n\nOperating cash flow for fiscal 2025 was $446 million, up $34 million from the prior year. Capital expenditures were $127 million, down $5 million, and dividends paid were $209 million, up $6 million, management said.\n\nFor fiscal 2026, Flowers guided for net sales of $5.163 billion to $5.267 billion, adjusted EBITDA of $465 million to $495 million, and adjusted diluted EPS of $0.80 to $0.90. Management said guidance reflects one fewer week (a roughly 1.5% headwind to annual net sales growth), inflationary pressures including labor, and continued weakness in traditional loaf, where the company “over-indexes.” The company expects total sales to range from down 180 basis points to up 20 basis points.\n\nScaglione said the plan assumes category headwinds of about 4% in 2026, and also incorporates a normalization of corporate bonus compensation that benefited 2025 by about $0.08. He added that net interest expense is expected to increase due to a bond issuance that occurred partway through the first quarter of 2025, and the full-year tax rate is expected to be about 26%, with an estimated first-quarter rate of around 30% and approximately 25% for the remainder of the year.\n\nMcMullian said the competitive environment remained “rational but challenging” in the fourth quarter, with no major change in promotional intensity. He noted average price per unit in the bread category rose 1.1%, helped by higher private-label prices, while low-price branded offerings continued to take unit share from both private label and mid-price branded products.\n\nFlowers said it uses promotions selectively to encourage trial and repurchase, focusing on differentiated better-for-you products with relatively low base sales, and that it pulled back on promotions in the fourth quarter due to typically low year-end returns.\n\nManagement also pointed to consumer pressures from inflation, high debt levels, a slowing job market, and economic uncertainty. The company said value-seeking behavior has increased bread sales through club stores, and that consumers are shifting spending to the store perimeter. McMullian added that the move away from foods perceived as less healthy has continued, and said the company expects that trend to persist amid increased GLP-1 adoption and other influences.\n\nIn response, Flowers said it is prioritizing better-for-you and value-oriented products, including innovation around attributes such as protein, sourdough, and keto-friendly options, alongside value offerings such as small loaves. Management also reiterated plans to optimize the supply chain and align the bakery network with demand as part of its broader review.\n\nFlowers Foods, Inc is one of the largest producers of packaged bakery foods in the United States, offering a variety of fresh bread, buns, rolls, snack cakes and tortillas. Headquartered in Thomasville, Georgia, the company operates an extensive network of bakeries and distribution centers that serve retail grocery chains, convenience stores, mass merchandisers and foodservice customers nationwide. Flowers Foods markets its products under well-known brands such as Nature's Own, Wonder, Dave's Killer Bread, Mrs.\n\nThe article \"Flowers Foods Q4 Earnings Call Highlights\" was originally published by MarketBeat."
    },
    {
        "title": "Taiwan Semiconductor Manufacturing Company",
        "url": "https://www.ig.com/au/news-and-trade-ideas/stock-of-the-day--taiwan-semiconductor-manufacturing-company-260212",
        "source": "IG",
        "date": "2026-02-12T04:05:00+00:00",
        "content": "CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. Please ensure you fully understand the risks involved. \n CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. Please ensure you fully understand the risks involved.\n\nRecord monthly revenue, rising profitability and a significant uplift in 2026 capital expenditure highlight TSMC’s deepening dominance in advanced chip manufacturing as AI adoption continues to surge worldwide.\n\nThis video was created on 12 February 2026 for IG audiences by ausbiz.\n\nTaiwan Semiconductor Manufacturing Company (TSMC) recently reported its financial results, achieving a record high share price driven by robust demand for its advanced artificial intelligence (AI) chips. The company recorded its highest ever monthly revenue for January, totalling US$12.7 billion, and a net income of US$33.7 billion for the fourth quarter (Q4) that exceeded expectations. TSMC also achieved record gross and net profit margins of 62.3% and 48.3%, respectively.\n\nThe company holds a 71% market share in the global chip market and over 90% for the most advanced chips used in AI applications. TSMC plans to allocate up to US$56 billion in capital expenditure (capex) this year, marking a 40% increase from the previous year.\n\nDespite its impressive performance, TSMC faces potential geopolitical risks associated with its location in Taiwan. Analysts acknowledge Taiwan Semiconductor's critical role, supplying advanced chips essential for companies like  Apple and Tesla. Concerns remain about potential conflicts over Taiwan, but TSMC's establishment of manufacturing facilities in Europe and the United States (US) indicates efforts to mitigate these risks.\n\nWhile the stock has performed strongly, TSMC TSMC trades at a price‑earnings‑to‑growth (PEG) ratio below 1.0, suggesting earnings growth continues to outpace valuation. The company is viewed as a more stable long‑term semiconductor exposure than individual chip designers, given its diversified customer base.\n\nThis information has been prepared by IG, a trading name of IG Australia Pty Ltd. In addition to the disclaimer below, the material on this page does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. No representation or warranty is given as to the accuracy or completeness of this information. Consequently any person acting on it does so entirely at their own risk. Any research provided does not have regard to the specific investment objectives, financial situation and needs of any specific person who may receive it. It has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such is considered to be a marketing communication. Although we are not specifically constrained from dealing ahead of our recommendations we do not seek to take advantage of them before they are provided to our clients."
    },
    {
        "title": "Himax Technologies Q4 Earnings Call Highlights",
        "url": "https://finance.yahoo.com/news/himax-technologies-q4-earnings-call-164220995.html",
        "source": "Yahoo Finance",
        "date": "2026-02-12T17:41:00+00:00",
        "content": "Himax reported Q4 revenue of $203.1 million (up 2.0% sequentially) and profit per diluted ADS of $0.036 at the high end of guidance, with gross margin improving to 30.4% and operating profit turning positive versus the prior quarter.\n\nFor full-year 2025, revenue fell 8.2% to $832.2 million and gross margin plunged to 13.6% from 30.5% a year earlier, while non-driver products grew 7% to represent 20% of sales, reflecting a mix shift toward timing controllers, T-CON and WiseEye AI sensing products.\n\nManagement expects a seasonal Q1 2026 revenue decline of 2–6% with Q1 as the trough before a rebound driven by automotive ramps and non-driver growth, but warns that rising input and foundry costs and higher inventories could pressure margins beginning in Q2.\n\nInterested in Himax Technologies, Inc.? Here are five stocks we like better.\n\n5 Semiconductor stocks under $10\n\nHimax Technologies (NASDAQ:HIMX) reported fourth-quarter fiscal 2025 results that landed at the high end of its profit outlook, while management characterized market conditions as pressured by macro uncertainty and rising component costs. On the call, executives also outlined expectations for a first-quarter 2026 seasonal dip, followed by a rebound later in the year driven by automotive programs and growth in non-driver IC businesses such as timing controllers and the company’s WiseEye ultra-low-power AI sensing products.\n\nFor the fourth quarter, Himax posted revenue of $203.1 million, up 2.0% sequentially. Gross margin was 30.4%, in line with guidance and slightly above the prior quarter’s 30.2%. The company reported profit per diluted ADS of $0.036, at the high end of its guided range of $0.02 to $0.04.\n\n→ Once Upon A Farm: Buy the $1B Growth Story?\n\n5 Computer Vision Stocks with a Clear Path to Growth\n\nOperating expenses were $54.9 million, down 9.6% from the prior quarter but up 11.6% year-over-year. Management attributed the sequential decline primarily to lower annual employee bonus expense (which is typically higher in the third quarter), along with the depreciation of the New Taiwan dollar against the U.S. dollar, partially offset by higher payroll expenses. Operating profit was $6.8 million (operating margin 3.4%), compared with an operating margin of -0.3% in the prior quarter and 9.7% a year earlier.\n\nAfter-tax profit for the quarter was $6.8 million, which the company cited as $0.086 per diluted ADS, compared to $1.1 million (or $0.006 per diluted ADS) in the prior quarter and $24.6 million (or $0.14 per diluted ADS) in the year-ago period.\n\n→ No Rally? Coca-Cola’s Results Still Look Like a Sweet Deal\n\n3 Undervalued Small-Cap Stocks for Your Labor Day Watchlist\n\nLarge display driver revenue was $21.7 million, an increase over four quarters and above the company’s expectation for a single-digit sequential increase. Management said the outperformance was driven by rush orders for TV and notebook legacy products from panel makers, along with customer inventory stocking of TV and monitor ICs and a new notebook TDDI project entering mass production. Large panel drivers made up 10.7% of quarterly revenue.\n\nSmall- and medium-sized display driver revenue totaled $139.1 million, down 1.3% sequentially. Automotive driver sales (traditional DDIC and TDDI) rose about 10% quarter-over-quarter, which management tied to broader adoption of its TDDI technology among major customers globally. The company said its automotive revenue for full-year 2025 grew at a single-digit rate year-over-year despite softness in global auto markets. In contrast, smartphone and tablet IC revenue declined sequentially as customers pulled purchases forward into prior quarters.\n\n→ AI Power Crunch: Why Bloom Energy Is the Hidden Winner\n\nNon-driver revenue was $42.3 million, up 7.9% sequentially, which management attributed to increased ASP consumption to a leading projector customer and strong timing controller (T-CON) consumption for automotive applications. Himax said T-CON represented over 10% of total sales, with notable contribution from automotive, and highlighted that its automotive OLED on-cell touch IC entered mass production with a leading brand during the quarter.\n\nManagement described 2025 as challenging amid tariff and geopolitical uncertainty, with panel customers maintaining lean inventories and a make-to-order approach. Full-year revenue was $832.2 million, down 8.2% from 2024.\n\nLarge panel display driver IC: $90.7 million, down 28.0% year-over-year (10.9% of sales vs. 13.9% in 2024)\n\nSmall- and medium-sized drivers: $575.1 million, down 8.0% (69.1% of sales)\n\nNon-driver products: $166.4 million, up 7.0% (20.0% of sales vs. 17.1% a year ago)\n\nThe company reported full-year gross margin of 13.6% and compared it to 30.5% in 2024. Operating expenses were $210.2 million, up 1.1% year-over-year, driven by higher payroll and payout expenses and New Taiwan dollar appreciation, partially offset by lower employee bonus compensation. Operating income was $44.1 million (5.3% of sales), down from $68.2 million (7.5% of sales) in 2024. Net profit was $43.9 million, or $0.25 per diluted ADS, compared with $79.8 million, or $0.46 per diluted ADS, in 2024.\n\nHimax ended 2025 with $286.2 million in cash, cash equivalents, and other financial assets, up from $224.6 million a year earlier and slightly above $278.2 million in the prior quarter. Fourth-quarter operating cash inflow was $16.8 million, up from $6.7 million in the previous quarter.\n\nThe company had $28.5 million in long-term unsecured loans, including $6.0 million classified as current portion at year-end. Inventories rose to $152.7 million from $107.4 million in the prior quarter, while accounts receivable were $200.9 million (DSO 88 days).\n\nCapital expenditures were $4.0 million in the fourth quarter and $20.1 million for the full year, with management noting that the annual increase versus 2024 was primarily tied to construction in progress for a new pre-school near the company’s China campus, expected to be completed by the end of Q2 2026.\n\nFor the first quarter of 2026, Himax guided for revenue to decline 2% to 6% sequentially, with gross margin expected to be flat to slightly down depending on product mix. Profit attributable to shareholders was guided to $0.02 to $0.04 per fully diluted ADS.\n\nIn Q&A, management said the expected margin change is primarily due to product mix, including proportionally lower automotive shipments. Executives also discussed rising input costs such as gold and signs of foundry capacity tightening, saying the company is in discussions with foundry vendors on delivery support and “manageable” price increases, while also discussing potential price increases with customers. Management indicated these cost dynamics were “pretty recent” and were not a major factor in Q1 guidance, but could become more relevant starting in Q2.\n\nOperationally, management said it expects Q1 to be the trough of the year, with a rebound in Q2 and improving momentum into the second half, supported by inventory levels and new automotive projects entering mass production later in the year. It also expects continued growth in non-driver IC businesses, especially T-CON and WiseEye, to provide incremental support.\n\nOn segment expectations for Q1, the company said:\n\nLarge display driver IC sales are expected to increase by single digits sequentially on continued replenishment of TV IC products by Chinese panel customers.\n\nSmall- and medium-sized drivers are expected to decline by single digits, with automotive driver IC sales set to decrease by double digits due to seasonal softness around Lunar New Year, the pullback after two quarters of replenishment, and tapering subsidies in major markets.\n\nSmartphone TDDI and OLED product sales are expected to increase sequentially as new OLED solutions begin mass production with a panel maker serving leading smartphone brands.\n\nTablet IC sales are expected to grow sequentially due to shipments tied to a customer’s new premium OLED tablet.\n\nNon-driver revenue is expected to decrease by a single digit, including a single-digit decline in T-CON due in part to the absence of prior-quarter projector ASIC T-CON shipments and a moderation in automotive T-CON shipments after several quarters of growth.\n\nManagement also addressed development timelines for co-packaged optics (CPO), reiterating that 2026 is focused on customer validation of Gen 1 and Gen 2 products with sample shipments, limiting revenue contribution in 2026. For 2027, the company said it could potentially see meaningful contribution tied to a Gen 2 product targeting bandwidth greater than 6.4T, though the timing of mass production ramp depends on customer decisions and broader ecosystem readiness.\n\nOn OLED, management said total OLED contribution in 2026 (smartphone, IT, and automotive combined) is expected to be less than 10% of total sales, with a “real ramp” anticipated in 2027. It also said smartphone OLED gross margin is lower than the corporate average, while automotive and IT OLED are focus areas with better margins and higher IC content per panel.\n\nHimax Technologies, Inc (NASDAQ: HIMX) is a fabless semiconductor company specializing in display imaging technologies. The company designs and develops a comprehensive portfolio of display driver integrated circuits (DDICs), timing controllers, and other high-speed interface chips that enable high-resolution panels for a wide array of electronic devices. Himax's solutions are tailored to support both LCD and OLED displays, ensuring compatibility with television sets, desktop monitors, laptops, tablets, smartphones and wearable devices.\n\nIn addition to core display driver products, Himax offers wafer-level optics and liquid crystal on silicon (LCOS) microdisplay solutions for applications in augmented reality (AR) and virtual reality (VR) headsets.\n\nThe article \"Himax Technologies Q4 Earnings Call Highlights\" was originally published by MarketBeat."
    },
    {
        "title": "Cognex (CGNX) Q4 2025 Earnings Call Transcript",
        "url": "https://finance.yahoo.com/news/cognex-cgnx-q4-2025-earnings-164130365.html",
        "source": "Yahoo Finance",
        "date": "2026-02-12T17:13:00+00:00",
        "content": "Thursday, Feb. 12, 2026 at 8:30 a.m. ET\n\nPresident and Chief Executive Officer — Matt Moschner\n\nChief Financial Officer — Dennis Fehr\n\nMatt Moschner: 2025 marked a return to profitable growth for Cognex Corporation. With constant currency revenue growth of 8% year over year, and adjusted EPS growth of 38%. We built momentum throughout the year advancing our strategic objectives while staying focused on long-term value creation. Logistics continued to deliver steady growth, along with strong year-end spending across many of our factory automation end markets. Let us start with an update on our strategy. Turning to page four of our earnings presentation. We made great progress in 2025 against each of our three primary strategic objectives. First, we remain committed to leading in AI for industrial machine vision.\n\nWith nearly a decade of experience in this area, we are building cutting-edge tools that unlock new applications and dramatically simplify the user experience. With our talent and proven track record of delivering breakthrough technology, we are uniquely positioned to win in the AI era. During 2025, we introduced several transformative capabilities that strengthen our AI technology leadership. In January, we introduced the DataMan 290, helping us win share in the competitive ID factory automation market with new AI-enabled auto-setup and advanced code filtering. In March, we launched our In-Sight 8,900, which brings the power of embedded AI to OEM customers.\n\nIn June, we announced OneVision, bringing deep learning and edge learning together on a single cloud platform and creating new models deployable to embedded systems at the edge. And in October, we introduced SLX, our new solutions experience product line that brings our latest AI vision tools to logistics customers. These product launches strengthen our position within $3.2 billion of our $7.0 billion served market, using cutting-edge AI capabilities to deliver greater value for customers and, in the process, gain market share. Second, we remain focused on delivering the best customer experience in our industry. Our commitment spans the full customer life cycle, from initial engagement through post-sales support.\n\nExamples of investments in this area include new AI-powered chat assistance on our website, which can answer questions faster, centralizing customer support materials to enable self-service, standardizing the user interface design across more of our vision products, and offering enhanced 24/7 technical support. Third, we aim to double our customer base within five years. We expect to achieve this by continuing to advance our Salesforce transformation alongside investments in improved lead generation tools, such as a new cognex.com website, I will discuss in more detail momentarily. This multipronged approach is already yielding strong results as we acquired approximately 9,000 new customer accounts in 2025, three times the rate of new accounts added in 2024.\n\nThis momentum provides a strong foundation for achieving our five-year target. A key element of our go-to-market and customer service transformation is the launch of our new cognex.com website, which went live in late January. More than a refresh, it fully reimagines how we deliver on our promise of advanced machine vision made easy. This newly designed site is packed with our latest product information, links to technical support, new setup videos, hundreds of knowledge articles which engage customers more deeply at all stages of their journey with Cognex Corporation. It also has more advanced, automated tools that allow us to convert customer engagement on the site to high-quality leads for our sales engineers.\n\nNow let us turn to Page five. In the fourth quarter, we completed a comprehensive review of our portfolio and have started the process of exiting product lines that generate approximately $22 million of no-growth or low-margin revenue. This includes the divestment of a Japan-focused trading business that was acquired with Moritex, and discontinuing our mobile SDK, Edge Intelligence, and other noncore product lines. We are also taking further actions to drive improvements in our operating model, and in partnership with external consultants, have identified an additional $35 million to $40 million in annualized cost reductions by year-end 2026. As part of this process, we completed a holistic review of our entire cost structure.\n\nWe remain focused on increasing productivity in key areas such as sales and marketing using new digital tools, software development using AI-assisted code generation, and automating back-office processes while leveraging global value locations for scale and cost advantage. These changes help to simplify our organizational structure and empower Cognoids to do their best work with less overhead. These steps will allow us to sharpen our focus on the core business to support growth, while further expanding margins. Dennis will provide more detail on what this means for our financial framework. Turning to page six, our ongoing Salesforce transformation is a great example of how we are upgrading the operating model of Cognex Corporation.\n\nThe previous emerging customer initiative emphasized adding headcount and deploying easy-to-use products through a stand-alone sales organization. In contrast, our current Salesforce transformation prioritizes making our existing sellers more productive with better CRM tools, a streamlined product portfolio, and a much simpler organizational structure. This transformation began in January, when we integrated our sales activities into one organization with three distinct selling styles. We have launched new marketing tools to enhance top-of-funnel lead generation and new management practices which improve lead-to-opportunity conversion rates. Our comprehensive product ecosystem makes learning Cognex Corporation products easier, and shortens the sales cycle overall.\n\nAnd finally, we are collaborating more intentionally with a global network of systems integrators, machine builders, and service partners to find and fulfill new business more effectively. One year in, we are seeing both customer growth and sales productivity accelerate, which is very encouraging. More broadly, the announced portfolio optimization and operating model transformation are key drivers of further margin expansion. Taken together, these efforts enable growth and create durable operating leverage across the P&L, which Dennis will now discuss.\n\nDennis Fehr: Let me start with walking through the adjusted EBITDA margin progression in 2025 before I discuss where we go from here. Turning to page seven of the earnings presentation. The margin progression from 2024 to 2025. We ended 2025 with an adjusted EBITDA margin of 20.7%, excluding the onetime benefit from the commercial partnership. We achieved our first milestone, reaching greater than 20%, a full year ahead of plan, driven by focused execution and strong cost discipline. As we shared at Investor Day last June, our largest lever for driving bottom-line profitability is OpEx efficiency, which is where I want to begin. Over the past year, we have been laser-focused on driving organizational efficiencies throughout Cognex Corporation.\n\nWe achieved $33 million of gross cost reduction, which was partially offset by $11 million of incentive comp dollars, $4 million of FX headwinds, and $10 million of wage adjustments, resulting in a net reduction of $8 million. Regarding COGS productivity and pricing, we saw 2024 pricing headwinds, especially in China, are fully reflected in the 2025 P&L and are partially offset by favorable volume change. Organic mix was favorable for the year. However, we do not anticipate the full extent of this favorability to recur in 2026. Taken together, we are pleased with the progress made this year on adjusted EBITDA margin expansion.\n\nAnd as Matt mentioned, we will execute additional initiatives in 2026 as we work toward our next milestone. Moving to page eight. Building on the actions already completed, we are setting our next milestone at a 25% adjusted EBITDA margin, targeted on a run-rate basis by the end of 2026. The path to 25% is anchored in three key levers. First, OpEx efficiency. We expect to realize an additional $35 million to $40 million of identified net cost reductions, excluding FX, in 2026. Second, organic mix. The announced portfolio optimization will improve mix and partially offset the nonrecurring favorability seen in 2025. And third, COGS productivity and pricing.\n\nWith 2024 pricing headwinds fully reflected in the P&L, and ending 2025 with pricing stability, we are well positioned to turn pricing into a tailwind. Turning to Page nine. Considering our strong momentum of margin expansion, we are updating the financial framework we introduced at our Investor Day. We are raising our through-cycle adjusted EBITDA margin range to 25% to 31% from the prior 20% to 30%. Our through-cycle revenue CAGR remains 13% to 14% and we continue to expect greater than 100% free cash flow conversion. This updated financial framework reflects our\n\nDennis Fehr: And durability of the margin expansion we are driving. As we further progress on our margin expansion journey, we will continue to evaluate our margin ambitions and will update this framework accordingly. Let us turn to the operational update with our financial results. I will begin with a review of our fourth quarter results followed by an update on our performance for the full year. Starting with the financial highlights of the fourth quarter, Page 11 details our performance on three key financial metrics. One, adjusted EBITDA margin was 22.7%, representing an increase of 420 basis points year over year, the sixth consecutive quarter of year-over-year expansion.\n\nDennis Fehr: adjusted EPS increased 35% year over year, the sixth consecutive quarter of year-over-year double-digit EPS growth. And three, our trailing twelve-month free cash flow conversion rate reached 138%, meeting our target of greater than 100% for the fifth consecutive quarter. Our disciplined focus on cost management and profitable growth ensured that this quarter’s strong revenue performance translated into meaningful EPS growth and robust free cash flow. Turning to the income statement on page 12. Revenue increased 10% year over year and 9% on a constant currency basis. Looking at the geographic revenue trends on a year-over-year constant currency basis, Americas revenue expanded 11%, led by strong end-of-year demand in packaging and continued growth in logistics.\n\nEurope grew 13%, driven by strength in packaging. Greater China revenue increased 7%, driven by growth in consumer electronics and semiconductor. Other Asia revenue was flat in the quarter, as growth from the consumer electronics supply chain shift was offset by semiconductor against a very strong comparable. Staying on Page 12. Adjusted operating expenses increased 5% year over year and 2% on a constant currency basis, reflecting ongoing cost discipline offset by incentive compensation headwinds in the quarter. Looking forward, as we continue to drive cost efficiencies across the organization and incentive compensation already reset in 2025, we are confident to achieve the OpEx reductions discussed earlier and continue strong margin expansion in 2026.\n\nDriven by revenue growth and favorable mix, adjusted EBITDA margin reached 22.7%, well above the upper end of our guidance range. GAAP diluted earnings per share were $0.19, up 18% from a year ago. Adjusted diluted EPS was $0.27, representing 35% year-over-year growth. This strong EPS performance was driven by robust revenue growth, disciplined cost management, and a lower diluted share count compared to last year. In the fourth quarter, we recognized a $5 million gain on the sale of a property on our Natick campus that previously served as our training center. We are consolidating ongoing sales training into existing space at that campus, which allows us to further rationalize our real estate footprint.\n\nIn addition, we recorded a $30 million E&O charge following a reserve update aligned with our strategy to focus on select products. Both items are excluded from our non-GAAP results. Next, I will cover our full year 2025 results, both as reported and excluding the onetime benefit from the commercial partnership. Starting with the as-reported results on Page 13. 2025 revenue of $994 million increased 9% year over year and 8% on a constant currency basis. Adjusted EBITDA margin of 21.5% expanded 440 basis points, and adjusted EPS increased 38% year over year to $1.02. Turning to page 14. I will now cover the underlying business performance, excluding the onetime benefit of the commercial partnership.\n\nRevenue of $982 million increased 7% year over year as reported and on a constant currency basis, marking the first year with substantial organic growth since 2021. Adjusted EBITDA margin of 20.7% expanded 360 basis points driven by revenue growth and disciplined cost management, marking the first year of margin expansion since 2021. Adjusted EPS increased 31% year over year to $0.97, reflecting the strong operating leverage on the business. We generated $237 million of free cash flow in 2025, the highest since 2021 and up 77% year over year. Trailing twelve months free cash flow conversion was 138%, comfortably above our greater than 100% target.\n\nWe continued to drive working capital efficiencies in 2025, with our cash conversion cycle improving 57 days year over year and 116 days from the 2023 peak. Turning to capital allocation. We returned $206 million to shareholders in 2025, including $151 million of share repurchase. As of December 31, we had approximately $150 million remaining on our current share repurchase authorization. Yesterday, our board approved an increase of $500 million to the existing authorization. We intend to continue to be opportunistic with buybacks. Longer term, we remain committed to capital returns as a core pillar of the disciplined capital allocation framework we outlined last June.\n\nWe ended the year with $642 million in net cash and investments, providing flexibility to pursue accretive growth opportunities while continuing to return excess capital to shareholders. Now Matt will discuss our vertical market performance for the year. Matt,\n\nMatt Moschner: Thanks, Dennis. Let us review current trends across our key end markets as shown on Page 15. Please note that my discussion on 2025 end market performance excludes the onetime benefit from the commercial partnership. Although the macroeconomic backdrop remains uneven and geopolitical uncertainty persists, in 2025, we saw momentum in consumer electronics, logistics, and packaging. Automotive remained soft. Starting with logistics. 2025 was another very strong year, with double-digit revenue growth led by large e-commerce customers. We are driving strong adoption of our standardized machine vision tunnel and layering new vision applications on top of code reading, increasing the ROI for customers.\n\nLooking ahead to 2026, after two years of outsized growth we expect more moderate growth in the mid- to high-single-digit range. Longer term, we believe logistics can be our fastest growing vertical with growth in the mid-teens through cycle. Next, let us talk about packaging. Packaging delivered solid high single-digit revenue growth in 2025. As a large underpenetrated and less cyclical market it remains a priority. Our Salesforce transformation and AI-enabled product ecosystem position us to capture incremental opportunities and deepen penetration. For 2026, we expect mid- to high-single-digit growth as we bring more machine vision into packaging. Turning to consumer electronics. Revenue grew double digits in 2025 as the market emerged from a prolonged down cycle.\n\nWe see continued upside from ongoing supply chain shifts, new device form factors, and a consumer refresh cycle. For 2026, we expect high single- to double-digit growth driven by a continuation of these trends. Next is automotive. The automotive market remained challenging in 2025, with revenue down high single digits, in line with our expectations. Looking at the sequential development, we believe the market has reached a bottom and expect 2026 to be flat to low single-digit growth. Longer term, we see attractive opportunities for additional penetration as customers prioritize improving vehicle quality and reducing operating costs. Finally, in semiconductor, 2025 revenue grew mid-single digits ahead of our expectations.\n\nFor 2026, we expect back-half weighted growth with full-year expansion in the mid-single- to double-digit range, supported by the AI-driven investment cycle and reinforcing our confidence in this market. Our deep relationships with leading semiconductor equipment manufacturers position us well for continued growth. Let me pass the call back to Dennis to discuss our outlook.\n\nDennis Fehr: Dennis? Thanks, Matt. Moving to page 16. I will now review our financial guidance for the first quarter. In Q1, we expect revenue to be between $235 million and $255 million, representing growth of approximately 13% at the midpoint against a weak comp. Adjusted EBITDA margin is expected to be between 19%–22%, with the midpoint representing an increase of 370 basis points year over year. As discussed previously, please note that Q1 2025 OpEx benefited from FX and stock-based comp tailwinds that will not repeat this year. Adjusted earnings per share are expected to be between $0.22 and $0.26, with the midpoint of this range representing 50% year-over-year growth.\n\nIn summary, 2025 marks a year of substantial turnaround, with our top line growing organically and our margins expanding, both for the first time since 2021. We exited 2025 with strong momentum across most of our end markets, and that strength has continued into 2026. As a short-cycle business, we have limited visibility and we therefore remain focused on our priorities, including continued disciplined cost management, a streamlined portfolio, and transforming our operating model. These actions position us to drive profitable growth, maximize free cash flow, and allocate capital with rigor to create long-term shareholder value.\n\nBy the numbers, we are targeting a 25% adjusted EBITDA margin run rate exiting 2026 and at least 20% adjusted EPS growth, underscoring our ambition to significantly expand bottom-line profitability. Now Matt and I are ready for your questions. Operator, please go ahead.\n\nOperator: Thank you. The floor is now open for questions. If you would like to ask a question, please press star 1 on your telephone keypad. A confirmation tone will indicate that your line is in the question queue. You may press star 2 if you would like to remove your question from the queue. For participants using speaker equipment, it may be necessary to pick up the handset before pressing the star keys. We do ask that you please limit yourself to one question and one follow-up. Again, that is star 1 to register a question at this time. First question is going to be from Joseph Craig Giordano of TD Cowen. Please go ahead.\n\nDennis Fehr: Good morning. This is Michael on for Joe. Hi, Michael. Good morning.\n\nMatt Moschner: Thank you. Thank you for taking my question. Just a two-parter here. So just\n\nUnknown Analyst: wanted to dive a bit deeper on the $22 million revenue divestments. Could you just frame out the timing of when this should be expected? And you know, how is that, you know, if that is included in the guide, as well. And then just have a quick follow-up to that.\n\nDennis Fehr: Yep. No. Happy to do that. So maybe first, focusing, like, key takeaway on here. Right? It is really all about focusing on noncore or getting out noncore product lines, which do not have growth or low growth, and which have low margins. So in that regard, it is really focusing on improving the revenue mix and helping in that regard to offset some of the onetime favorability we have seen in 2025. The majority of that revenue which we are exiting is related to that Japan-focused trading business which we acquired along with Moritex. We are currently expecting to close that transaction by the end of, or within, the second quarter.\n\nSo that means you would start to see that in the second half of this year. Keep in mind that exiting that revenue will change a bit the mix of the end market. Right? So the majority of that revenue would come out of the packaging vertical, and a smaller portion would come out of the logistics vertical. So in that regard, keep in mind when you model to reduce these two verticals, whereas the growth expectations Matt stated, or the initial view on these growth expectations in these vertical markets, basically would remain unchanged on that lower base.\n\nUnknown Analyst: Great. That is helpful. And just a quick follow-up to that. Can you just give us a better understanding how the company determines what is considered core versus noncore. For instance, like, things like Edge Intelligence were a highlight of the Investor Day a couple years ago. So just would love to better understand the framing behind these priorities. Thank you.\n\nMatt Moschner: Yeah. Thanks, Michael. Yeah. This is Matt. This is a process that we started almost a year ago as we really thought about where do we have advantage. Right? We start with where do we have core IP, core skill, you know, a deeper understanding of a certain application area is really the foundation of what we would define as core. And then, you know, we look at other financial metrics that Dennis mentioned, really, what is the size of that market, what is the growth potential, what is the relative profit pool, profitability, and our ability to capture those profits.\n\nYou put those things together, and you put them really in the context of each other, as part of a portfolio of\n\nMatt Moschner: and, you know, I think what you quickly see are those that, you know, a, we have maybe a stronger right to win, and then, b, perhaps a weaker financial trajectory. So that is how we did it. Right? We have a pretty clear framework as to how we do that. And I think you are seeing the results of that work from last year in these results.\n\nOperator: Thank you. The next question is coming from Joe Ritchie of Goldman Sachs. Please go ahead.\n\nDennis Fehr: Good morning. Hey. Good morning. So\n\nMatt Moschner: yes, so my first question is on the cost reduction program for 2026. Dennis, maybe as you kind of think through the bridge for EBITDA margin expansion for the year, what are kind of the offsets we should be thinking about for 2026 to this cost reduction plan? And then also, how do you see that progressing as the year goes along?\n\nDennis Fehr: Yeah. No. Absolutely, Joe. So, right, I mean, we mentioned at the Investor Day last year that the largest lever is OpEx efficiency. And I think we really followed through on that in 2025 as we outlined in the walk for 2025. And then that enabled us at the end to hit the greater than 20% adjusted EBITDA milestone a full year ahead of\n\nDennis Fehr: Now looking at 2026, clearly, it is, again, the largest lever which we have. And then coming to your question, basically, what would be offsetting effects? It is on the mix side. Right? So I mentioned in the prepared remarks that we saw favorable, call it, onetime effects in mix in 2025. You are partially reducing that headwind with the portfolio optimization which we do, but it is not fully offsetting that. So really the headwind which we see is on the mix side. And then we would see perhaps, as we mentioned as well, some favorability from pricing, but I would say that it is probably really a smaller piece of the equation. Really think big picture about 2026.\n\nIt is more OpEx efficiency partially offset by mix.\n\nMatt Moschner: Got it. That is helpful, Dennis. And then, Matt, just a question for you. Look. It seems like you are getting a lot of traction on your customer growth initiative. And it sounds like lead generation is certainly improving. Can you just maybe double click on what has changed over the last six to twelve months? And then as we move forward, you know, seems like you are seeing a lot of that opportunity on the packaging side of the business. Would you expect that to maybe broaden across your other end markets as well? Yeah, Joe. Happy to. Yeah. No. For sure, we are seeing great momentum in our ability to acquire new customers.\n\nI would maybe take a step back. In these earnings, we really wanted to showcase the work we have been doing on our Salesforce transformation. And I really cannot overstate how significant of a transformation that is to our go-to-market. There is really four pillars, as we highlighted on the slides, which is it is a brand-new organization. Right? What we had was more of a fragmented structure where we have combined and standardized how we structure our teams around the world. That has been huge in terms of driving productivity, segmentation of activities, and cross-selling. The second is process. Right?\n\nWe have made huge investments over the last many years in business systems to really kind of digitize Cognex Corporation. We are seeing those pay off as we are able to arm our sales team with better data, better leads, better prospecting tools, better lead conversion metrics. So process is key, and we are, again, standardizing those with things like dashboards and things you would expect. Product. Right? We have been working hard on our product portfolio and we use this word ecosystem. And I want to encourage us all to think of that as not lip service. Right? That is really a deliberate effort to drive consistency in the user experience of our products.\n\nThat helps us train our sales team. That helps us sell the full portfolio with fewer people and less complexity. That is paying off. The fourth is partners. Right? We have really doubled down on how we work with and collaborate with the world’s leading systems integrators, OEMs, and service partners. And you put those four things together, org, process, product, and partners, on one hand, dramatically different from where we were, let us say, even two years ago with emerging customers, but you have to get really all of those four right, and I think we are. We have a great leadership team in our sales organization right now.\n\nKarl Gerst came out of products and is now leading global sales as of a year ago, and he is really moving fast with an ambitious agenda and has a great team behind him. And I think you are seeing those results, you know, one year later. And, you know, quite frankly, we saw those even a bit earlier last fall, and the results are an acceleration of our customer acquisition. But it is also our ability to be much more flexible, to your question on packaging, how we direct our sales activities as we see opportunities across the end markets. Right?\n\nIf we continue to see weakness in one and we see strength in others, we have tremendous flexibility now, maybe more so than we did in the past, to redirect our sales activities towards those high-growth areas and then actually the data to be able to show that it is working. So it is a longer answer to your question. I really cannot overstate the impact of our Salesforce transformation and the leadership that we have in place at the top of that organization. That is great. Thank you very much.\n\nOperator: Thank you. The next question is coming from Jamie Cook of Truist Securities. Please go ahead. Hi, good morning. I guess two questions. One, just on the organic top-line assumptions for 2026. Dennis, if you could provide any color, it looks like we should expect sort of mid- to high-single-digit growth organically. But I guess, the bigger question within that is with some of the success that you are seeing on the Salesforce transformation, you talked about adding 9,000 customers in 2025 versus ’20 versus 3,000. I do not remember what, when that was. But just are we starting to factor in more market outgrowth, and should we do that 2026 given some of the successes?\n\nAnd then I guess my second question just back on the portfolio optimization and the announcements you have made this quarter, I mean, where are you in this process? Is this, like, the first inning of the ballgame and there is more to come? Or we feel like we have, you know, fully identified sort of the noncore low-growth product lines? Thank you.\n\nDennis Fehr: Yes. Thanks, Jamie. Let me start with your first question. So maybe first, let me clarify. Right? We are not providing a full-year guidance. I think what we try, in the sense, in the spirit of providing transparency to the investor community, we try to provide a view from today’s angle based on data which we have available. Right? So we talked on the last earnings call about, like, hey, what are PMI data suggesting? And it certainly continues looking both at data which we are seeing in our business as well as macro factors.\n\nSo in that regard, I would say we are certainly encouraged by what we have been seeing towards the end of the year 2025, where we saw that strong year-end demand. And some of that turned into revenue in the first quarter in 2026 and helps with basically that growth in the first quarter against the weak comp. So and at the same time, we also saw some PMI uptick happening just in January. So these are certainly encouraging data points. But at the same time, clearly, I want to say, these are not yet a trend. Right?\n\nSo in that regard, we keep mindful about what we see and that we certainly would want to see certain more data points to either update our view to perhaps the high single digits, and in that regard, I would say kind of that mid-single- to high-single-digit range is kind of what we would say from today’s perspective. But, again, we are a short-cycle business. Things can change fast. So we want to provide kind of a continuous update on what we see, but it is by no means a full-year guide.\n\nMatt Moschner: Yeah. No. I would, Jamie, if you allow me to take the second one, which is where are we, particularly as it relates to the portfolio optimization. I would say these things do not happen overnight. We really have been working on this since almost a year ago, even well before the CEO transition, where we put teams in place to really look hard at the portfolio and I think we took a very thoughtful and rigorous approach to that. And you are seeing the fruits of that work. And so in that vein, I would say we are very much sort of at the end of that cycle of analysis.\n\nAnd I think you are seeing the announcements of those ideas. So yes, as it relates to the portfolio analysis. That said, I think as a products-oriented company, there is always work to do in making sure that your portfolio is fit for purpose and that it lets you run the company efficiently. There probably is more work we have to do just generally speaking on cleaning up things like SKUs that really do not need to exist and eliminating complexity in other areas. I consider that more just work to be done and less of sort of a strategic thing that we did.\n\nAnd so you might see the effects of that trickle out through the rest of the year. But as it relates to the portfolio optimization, I think what we are announcing today is towards the end of that process.\n\nOperator: The next question is coming from Andrew Edouard Buscaglia of BNP Paribas. Hi. Good morning, guys. This is Brooke on for Andrew. Was wondering if you could go a little bit deeper into the end markets. You mentioned momentum in logistics and consumer electronics. For CE, what is kind of driving the demand there? I know you mentioned a refresh cycle, maybe some form factor on new devices. And for logistics, momentum, is that currently more greenfield or brownfield? If you could just give a little bit more detail into what you have been seeing in the conversations you have been having.\n\nMatt Moschner: Yeah. Sure. Hey, Brooke. Thanks for joining us. Yeah. I will go deeper on CE and logistics. For sure. Consumer electronics, as we really started to highlight at the tail end of last year, I think we are seeing encouraging growth trends and really more broad based and that is certainly exciting. And I think consumer electronics as an industry plays very much to our strengths in technology. These are very demanding applications that require precision and the highest levels of quality given that many of these devices are quite expensive and have high price points in the market.\n\nAnd so we see a lot of those customers, both end users, the product owners, as well as the systems integrators, really favor Cognex Corporation. But there is, you know, there is many underlying trends that are supporting that growth. Certainly, the shifts in the supply chain outside of the traditional manufacturing locations of China to Greater Asia, ASEAN, India, even other parts of the world. And given the global company that we are, I think we remain a strong partner to enable those geographic shifts as they happen. New vision capabilities, we brought to market some pretty transformational AI tools last year, specifically designed for consumer electronics. I think we are seeing those play out nicely. Consumer demand. Right?\n\nConsumer demand is very strong for these sorts of devices currently. A lot of that is driven by some of the new AI features that are being brought to consumer devices that are very exciting and driving maybe a refresh cycle that we have not seen for many years. And then last but certainly not least, we are seeing new form factors. Again, particularly as consumers want to interact with the latest AI software tools, we are seeing technology providers really experiment with different form factors, whether it be foldable phones, glasses, pendants. And so, you know, these are devices that get made in the millions, the hundreds of millions, with extreme precision and high quality.\n\nAnd that is just such a good place for Cognex Corporation vision to play. So that is consumer. I think on logistics, again, very exciting market for us. We are capping our eighth quarter of double-digit growth, which is, I think, a testament to our commercial efforts and our sales team that sells into this market, but obviously, our technology. As you would expect, we are starting to get into territory of tougher comps. And in all of our markets, we kind of expect growth to moderate after such a long stretch of outsized growth, and we are seeing that. But I will tell you, I remain optimistic about logistics. We have great relationships.\n\nWe have a great team in place. We have great technology. And there are just huge white spaces that I think we are starting to tap into, particularly with product like the SLX as we start to dive deeper into the vision for logistics, which is really enabled by AI. And so you put those things together and I think this year, we are suggesting it might be a bit of a lower-growth year on logistics. I think it is still early to see how that plays out. But long term, I think we feel very, very strongly and excited about the logistics market overall. Hopefully, that answers your question, Brooke.\n\nAndrew Edouard Buscaglia: Yeah. Thank you. That was super helpful. And then just to follow-up, just an update going into 2026 on your capital allocation priorities. Your free cash flow has been very strong. Is there any update on M&A or acquisition targets?\n\nDennis Fehr: I, yeah. See, in general, the capital allocation priorities remain unchanged versus what we presented at Investor Day. Certainly, we are very pleased with the strong cash flow generation which we had, especially in 2025, 77% up. What is really driven on the one side by driving bottom-line profitability, at the same time also by optimizing the working capital. Now looking forward, I would say probably right where we are, where we want to be on working capital. Right? So cash conversion cycle somewhere in that 150 to 155 days, really where we feel like it is a really good point for us as Cognex Corporation.\n\nSo in that regard, probably we will see a bit less of contribution to the free cash flow from working capital\n\nAndrew Edouard Buscaglia: capital\n\nDennis Fehr: optimization. And then at the same time, we think we can definitely still achieve the greater than 100% free cash flow conversion rate within 2026. So in that regard, still looking forward to a strong year of cash conversion, but more rooted in margin expansion than in working capital reduction. And, yeah, clearly, similar capital allocation priorities than previously communicated.\n\nAndrew Edouard Buscaglia: Okay. Thanks for the update.\n\nOperator: Thank you. The next question is coming from Ken Newman of KeyBanc Capital Markets.\n\nMatt Moschner: On the solid execution this quarter.\n\nKen Newman: Hey, thanks, Scott. First,\n\nMatt Moschner: hey, thanks. Maybe first question for you guys. Dennis, it does not seem like you guys are seeing any impact from higher memory costs, but I just wanted to clarify if there is any cost increases that are embedded within the guide, and maybe just if you could remind us\n\nUnknown Analyst: the percent of COGS memory intensity.\n\nMatt Moschner: Yeah. Thanks, Ken. We do not disclose specifics around memory pricing, but I would say we do not expect any material impact from increased pricing tied to those supply chain issues. I would say we are pretty good at managing this. We really put teams in place many years ago when we saw a tightening of the supply chains on the tail end of COVID. We had some supply chain issues ourselves that have really forced us to double down and take many steps into our supply chain. And I think our ability to manage disruptions like this is really very strong, I would say world-class.\n\nWe have great relationships with our suppliers and we keep very close to what they are seeing in the market. And so I would not say that we are seeing increased memory prices affecting our business. We are seeing them. And I would say I am not going to really give what percentage of memory is our bill of material, but I would say it is not an overly significant portion. And I would not say that we have experienced really any material procurement issues today. So we will keep an eye on it.\n\nBut at this point, I think we feel comfortable that we have the tools to manage it and that it is already reflected adequately in our forward guidance.\n\nUnknown Analyst: Got it. Thanks, Matt. That is very helpful.\n\nMatt Moschner: And then for my follow-up here, just wanted to clarify. Is there any way to help us think about the cadence of how we should expect to realize that $35 to $40 million of cost benefits? Is that just an equal-weighted type of benefit through the year, or does some of that hit a little heavier in the first half?\n\nDennis Fehr: Yeah. No. Fully understand the question. So clearly, we are focusing on executing a good majority of that in 2026. So that means we would start to see some of these effects show up more towards Q3 of this year, and then perhaps a smaller portion towards the end of this year. In that regard, yeah, start to look for effects in the third quarter. And in general, I think as mentioned before, that really would set us then up for this adjusted EBITDA run rate of 25%. And maybe let me elaborate a little bit more on that one. So first, it is very clearly a run rate as we exit 2026. It is not a full-year number. Right?\n\nSo in that regard, it is probably pretty much what we have been saying before about how we think about margin expansion in 2026. I think, really, the message we want to give is that there is durability and that we have confidence in the margin expansion and that this will continue and can continue also into 2027. In that regard, take that comment mostly about, like, 2027 can have another increase or another year of margin expansion and that we are not done in 2026.\n\nOperator: Thank you. Our next question is coming from Tommy Moll of Stephens. Please go ahead.\n\nDennis Fehr: Good morning and thank you for taking my questions.\n\nTommy Moll: Hi, Tommy. Hey, Tommy.\n\nDennis Fehr: Automotive looks like it is going to move from red to green in 2026, which is nice to see. What context can you give us there, in particular by geography, maybe starting with North America? Just the latest and greatest on the demand side and the conversations you are having. Thank you.\n\nMatt Moschner: Yeah. Sure. As you mentioned, Tommy, as we have said before, you know, it is very much a geographic story. And that story tells differently in each area. So you ask about the U.S. and the Americas. What I would say is I would characterize it as an area where we are seeing relatively more activity and strength. Right? We are having good discussions with all the major OEMs. You would have seen them really try to cleanse their P&Ls of previous investments in EVs. And I think that is giving them flexibility to really think about the next iteration of powertrains. And those next generations are both perhaps a different powertrain, but also certainly a more connected car.\n\nAnd so, yeah, we are having those discussions with them, and there is quite a bit of activity that we are seeing start to come back in the U.S. Maybe if you do not mind, I will move on to Europe and Asia. In Europe, for sure, it is where we see the greatest level of weakness, and where the recovery seems to be slower. In Europe, just to build on some of my prior comments, we are shifting our sales activity to other verticals in Europe so that we can compensate for that weakness. But nonetheless, that is where it is. And in Asia, it is a bit mixed.\n\nI would say it is very much OEM dependent, whether you are talking about the Japanese OEMs, the Korean OEMs, the Chinese OEMs. And so we are staying close to all of them. And I would say both their investment levels, their powertrain choices, you know, are different. So we are trying to keep Asia as a bit more mixed. And hopefully, we can provide some more clarity as the year goes on. Hopefully, that is helpful, Tommy.\n\nTommy Moll: Yes. Thank you, Matt.\n\nDennis Fehr: Dennis, I wanted to ask about the raised through-cycle EBITDA margin expectation.\n\nDennis Fehr: percentage points, if I just look at the midpoint from your\n\nUnknown Analyst: Investor Day versus the update you provided us today. If\n\nDennis Fehr: we think about the bridging items there, is it as simple as\n\nTommy Moll: you gave us three bullets under transforming the operating model that\n\nDennis Fehr: net to the $35 to $40 million annualized. Is that the bridge? Or are there other operational changes that you have made to give confidence in that raised\n\nUnknown Analyst: through-cycle expectation?\n\nDennis Fehr: I mean, yeah, I think the bridge is really what we showed at Investor Day, so we are not really changing compared to what we said at Investor Day. Our strongest lever is the OpEx efficiency. And, right, we provided a target value for each of these buckets, and we are striving to achieve those. I think really what has had us change versus Investor Day is that we reached our first milestone. Right? And I think as a company, as a leadership team, we are quite encouraged that we achieved our first milestone a full year ahead of time, and that basically kind of drove us now to say, like, let us take a look at the next milestone.\n\nSo in that regard, nothing changed in the bridge in the way how we want to get there. It is really all about having hit the first milestone, and let us look at the second milestone. And the key levers to achieve the second milestone is really the cost optimization which we have announced combined with the portfolio optimization as well. Yeah. And, Tommy, I would just say,\n\nMatt Moschner: you know, anytime you think about being more efficient, reducing costs, it is easy to say, oh, you are just taking capacity out. And there were elements of that, right, where maybe we would have invested in capacity a little too far ahead of growth. But the other two areas that you have to look at are portfolio. We are doing that. You are seeing those as artifacts in today’s earnings. But the biggest and the hardest is changing the operating model. And I think if you just read the newspaper, there is just so many opportunities to be more efficient, be more productive.\n\nAnd that is really, I would say, where we go next and where you start to see more outsized benefits on efficiency over the longer term, right, where you can be more productive and automate more and do things more efficiently. And I think as an AI-first organization, I think we are embracing, I would say, a lot of the state of the art that is happening, not just in how you engineer products and do software development, but how do you interact with customers and how do you generate leads and how do you provide excellent tech support in more efficient ways.\n\nAnd so I think on that end, when it comes to operating model efficiency, we are probably earlier in our journey. And so you put those three things together and I think we have a lot of conviction, at least the 2026 numbers, that we are just, rest assured, that we are not settling. We are continuing to think about the longer term and how we would be a more productive, efficient organization.\n\nTommy Moll: Thank you both. I will turn it back. Thanks, Tom.\n\nOperator: Our next question is coming from Piyush Avasthy of Citi.\n\nMatt Moschner: Good morning, guys.\n\nDennis Fehr: Congrats on the great quarter.\n\nPiyush Avasthy: Thanks. Just following up on the last question, like,\n\nDennis Fehr: you know, the AI-assisted coding for software development, like, you know, I know, like, at your Investor Day, you kind of had talked about R&D being like a lower, you know, going to low teens as a percentage of sales from like close to mid-teens that you reported in ’25. But seems you are, like, this integration can really help you reduce the timeline to lower the R&D. Is that true or we should not get that too excited yet?\n\nMatt Moschner: If you just let me, let me give you a, bear with me, I am going to give you a longer-run answer. You know, Cognex Corporation, you know, we take pride in our customers expect from us market-leading technology and capability, and we will continue to deliver that. And, you know, our ability to move the market and invent is very much driven by our investment in our world-class engineering organization.\n\nAnd so, you know, I do not want anyone to misconstrue the comments that I am about to make as us retreating from that objective, because I think we really want to be the gold standard and push the market forward to be the best in the emerging technologies that we know can help industrial machine vision. But for sure, you know, there are just so many ways to be more efficient and more productive when it comes to technical design. And that is not just software. I would say it is also hardware, and we are pushing on both.\n\nBut we are years into using these tools, particularly as you mentioned on the software AI-assisted coding angle, and as we all see from the headlines and recent news announcements, those tools just keep getting better. We have an organization and a culture that embraces change and particularly as it relates to advanced AI, I would say. And so, yeah, we are, and we are doing it, I think, in the right way.\n\nMatt Moschner: we need to make sure that when we ship products, they have the utmost quality and security. And so there is a fine line you have to balance on all these things. But I think we are fully utilizing. I think it is still early days in terms of what the full potential is, and it is not just about software. I think it is really full stack. How we design and how we do more with the same or maybe slightly less heading into the future.\n\nDennis Fehr: Got it. Very helpful. And this is following up on Jamie’s question. Like, your 2026 view, again, you guys said, like, mid-single-digit to high-single-digit range. But if I look at your Q1 2026 top-line guidance, you are kind of suggesting 13% top-line growth. So are there any larger projects or one-timers in Q1 that is helping growth in the quarter? And do you expect the growth to decelerate as we move through the year, or is it just the limited visibility and you guys are being a little bit more prudent? Yeah. No. I understand the question, Piyush. I think two things. On the one side, Q1 is still driven by some of the year-end spending we saw in 2025.\n\nThat means just like revenue comes into the first quarter instead of being recognized in the fourth quarter. And then I really want to say that keep in mind that Q1 2025 was a weak quarter where we saw at that time a lot of logistics demand being pulled forward into Q4 2024. In that regard, that is a bit like this mix that this time we see kind of a reverse of shifting from quarter to quarter. Right? So last year, it was moved from Q1 into Q4, and this time, we see moves from Q4 into Q1. And that makes this 13% probably look a little bit larger than what it is.\n\nSo in that regard, not expect things like, hey, there is a deceleration of things, but clearly, there is kind of this underlying timing effect, which kind of\n\nDennis Fehr: may make it look like that. But in general, we will have our typical seasonality with Q2 and Q3 driven by consumer electronics, so stronger quarters there. Then certainly, we cannot say how we think about Q4 this year, whether we would see a similar effect on year-end spending like this Q1 2025. That is just much too early to talk about that. So in that regard, it comes back to what I said before. We certainly are encouraged by that spending, by seeing the PMI coming up. But let us see more data. Let us see more data points. Let us see more trends.\n\nAnd at the same time, we will control what we can control, and that is our cost basis and our portfolio. And going hard after these topics, and that gives us the confidence in our margin expansion. Appreciate all the color, guys. Good luck.\n\nPiyush Avasthy: Thanks, guys. Thanks.\n\nOperator: Thank you. The next question is coming from Guy Drummond Hardwick of Barclays. Please go ahead.\n\nMatt Moschner: Hi, good morning and congratulations on the\n\nUnknown Analyst: on the great results.\n\nMatt Moschner: Looking at your outlook, your initial outlook slide for 2026, looks like on a weighted average basis,\n\nGuy Drummond Hardwick: your end market growth is sort of\n\nJairam Nathan: mid- to high-single digits. First off, is that fair? And I apologize because I joined the call late, but the $22 million of divestments, is any of that reflected in the Q1 guidance? And how should we be treating that as excluding, as net of organic growth for this year? Or like a business divestment?\n\nDennis Fehr: Yeah. So a few thoughts here, Guy. So first, yeah, probably like that mid-single to high-single digit is a fair statement on an initial view. I said earlier in the call, again, we are a short-cycle business, all driven by what we see today. That view could change. PMIs could change. Data could change. Business trajectory could change. So it is not a guide. It is just a view of what we see from today’s perspective. And then towards the question of the revenue exit. So there is some divestment included in there in regards to the Japan-focused trading business, which we think will, can close in the second quarter of this year.\n\nAnd then think about, like, how to apply some of these growth rates. A very simplistic statement is take the 2025 revenue numbers, subtract the $22 million of exiting business, and apply the growth factors on top of it. That is maybe the very simple statement. You may do a little bit of timing adjustments there, but that is kind of how we thought about it when we put out that slide.\n\nGuy Drummond Hardwick: Thank you.\n\nOperator: Thank you. Excuse me. The next question is coming from Jairam Nathan of DA Davidson. Please go ahead.\n\nJairam Nathan: Hi, thanks for squeezing me in here. So\n\nNathan McCurren: Matt, Cognex Corporation has, you know, has all this, I think, done a good job in entering markets ahead of everyone else, like logistics. And it looks like, so I am just trying to understand what opportunities could you have with physical AI. There seems to be a lot of focus on sensing, and vision is a key part of that. Things like AMRs, humanoid robots. So I am just wondering if there is, do you see any opportunities in terms of physical AI?\n\nMatt Moschner: Sure. Yeah. We are probably the oldest physical AI company in the world. We have been, yeah, we have been giving robots eyes, the ability to perceive the world around them, for about 44 years. And that gives us a lot of strength. We know those applications really well, but your question is really more about adjacencies in new markets. Yes, as an organization, we have a very good way of looking at those things, evaluating them, and understanding if we have a strong right to win in them. We like the five verticals, the market verticals we participate in, and we see tremendous growth to continue to expand in those verticals.\n\nI think we are not the share leader in every geography, market vertical, or product segment. We aim to be. And so that is our top priority, is winning the core. But as it relates to new markets, you know, we are looking at, you know, what is the future of automation in these massive data centers that are going to be built out over the next several years. You know, there is a resurgence in investment in defense, in particular, and aerospace, particularly in parts of the world like Europe, as those industrial bases come back to life. And these are highly engineered parts that require the highest levels of quality and precision.\n\nAnd so, you know, we are certainly looking at potentially aerospace and defense as a market that could come back to life in a way it has not been in many years. And then certainly robotics, like you mentioned it. And we have been serving the robotics market for decades, I would say. Maybe not in the way that, you know, we are seeing today with humanoids, but much more as it relates to high-speed in-line manufacturing. We have done that in consumer electronics. We have done it in logistics. We have done it in automotive. And you can expect us to continue to invest in how we can be a better provider of vision for the world’s robots.\n\nAnd so, an area where we are thinking about investing in, I would say less so with the angle of humanoids. In full disclosure, we do not see that as such a strong place for us and such a little too far from home in terms of in-line, but many, many other areas for industrial robotics that could use vision, visual perception, and where we see ourselves as really having a great win.\n\nNathan McCurren: Thanks. And as a follow-up, and then it is just on the trading business with Moritex. Typically, businesses are low gross margin businesses. Should we, could we see a bump from gross margins in the second half with that divestment. Yeah. You are right. That\n\nDennis Fehr: typically trading businesses are less attractive on the gross margin side, and we saw that in general that Moritex had lower gross margins. So in that regard, that certainly will help a bit on the gross margin side into the second half.\n\nNathan McCurren: Okay. Great. Thank you.\n\nOperator: Thank you. I would like to turn the floor back over to Mr. Moschner for closing comments.\n\nMatt Moschner: Excellent. Well, thank you for joining us this morning and for your continued support of Cognex Corporation. We look forward to updating you on our progress in the first quarter.\n\nOperator: Ladies and gentlemen, this concludes today’s event. You may disconnect your lines or log off the webcast at this time, and enjoy the rest of your day.\n\nBefore you buy stock in Cognex, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Cognex wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $429,385!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,165,045!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 913% — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 12, 2026.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has positions in and recommends Cognex. The Motley Fool has a disclosure policy.\n\nCognex (CGNX) Q4 2025 Earnings Call Transcript was originally published by The Motley Fool"
    }
]