[
    {
        "title": "Nebius and Parsons have been highlighted as Zacks Bull and Bear of the Day",
        "url": "https://www.sharewise.com/us/news_articles/Nebius_and_Parsons_have_been_highlighted_as_Zacks_Bull_and_Bear_of_the_Day_Zacks_20260220_1025",
        "source": "sharewise",
        "date": "2026-02-20T11:16:00+00:00",
        "content": "Chicago, IL – February 20, 2026 – Zacks Equity Research shares Nebius Group (NBIS) as  the Bull of the Day and Parsons PSN  as the Bear of the Day. In addition, Zacks Equity Research provides analysis on —Verisk Analytics, Inc. VRSK, Seanergy Maritime Holdings Corp SHIP and Vulcan Materials Company VMC.\n\nHere is a synopsis of all three stocks:\n\nNebius Group is a Zacks Rank #2 (Buy) that has a F for Value and a C for Growth. This company is an AI centric cloud infrastructure concern. The company has grown from 7 data centers to 16 in a little over a year and a half and has a few interesting private company investments as well. Let’s learn more about why this stock is the Bull of the Day.\n\nNebius Group NV is a technology company that provides infrastructure and services to AI builders worldwide. It offers Nebius AI, an AI-centric cloud platform provides full-stack infrastructure, including large-scale GPU clusters, cloud services, and developer tools. The company also operates through specialized brands: Toloka AI, which partners in data for generative AI development; TripleTen, an edtech platform focused on re-skilling individuals for tech careers; and Avride, which develops autonomous driving technology. Nebius Group was founded by Elena Kolmanovskaya, Ilya Segalovich, Mikhail Fadeev, and Arkady Volozh in 1989 and is headquartered in Amsterdam, the Netherlands.\n\nWhen I look at a stock, the first thing I do is look to see if the company is beating the number. This tells me right away where the market’s expectations have been for the company and how management has communicated to the market. A stock that consistently beats has management communicating expectations to Wall Street that can be achieved. That is what you want to see.\n\nNebius Group has reported two times when there was a Zacks Consensus Estimate. Two quarters ago the company posted a loss of 39 cents when a loss of 52 cents was expected. That 13 cent beat translates into a positive earnings surprise of 25%.\n\nThe company recently reported earnings of a loss of 69 cents when the Zacks Consensus Estimate was calling for a loss of 44 cents and that 25 cent miss translates to a negative earnings surprise of -56%.\n\nThe key ideas on the most recent earnings print is that the company is now at an annual revenue run rate of $1.25B and also gave some interesting CapEx guidance.\n\nThe company expects to spend between $16B - $20B this year, but at least 60% of that will be funded from operations. The consensus revenues estimate is at $8.7B, so we should expect that at least one of its private company investments might be spun out.\n\nOne of their investments is in AVRIDE, an autonomous vehicle service. I was in an AVRIDE uber when in Dallas the other month and having owned a Tesla for the last 6 years I can say there is a significant difference between the two. The AVRIDE system was more appropriately aggressive when it needed to be as compared to the Tesla autopilot. You can view a snip of my ride here ( https://www.instagram.com/p/DTrIHCKkczp/).\n\nEarnings estimate revisions is what the Zacks Rank is all about.\n\nEstimates for 2026 are moving higher for Nebius Group.\n\nThe current fiscal year 2026 has increased from a loss of $3.06 to a loss of $2.12 over the last 60 days.\n\nFiscal 2027 has increased from a loss of $1.28 to a loss of $0.84 over the last 60 days.\n\nThe valuation for Nebius Group is interesting given the growth prospects. 2026 is expected to see sales of $3.25B which would be good for 508% topline growth. That is not a typo, 508% revenue growth this year. Analysts have projected revenue of $8.7 for 2026 and that would be good for 167% growth.\n\nThe price to book comes in at 5.5x and despite being a little more than value investors would be willing to pay, it shows how there can be growth and value at the same time… but don’t expect that to be the case for a long time. Price to sales is at 48x right now, but given the massive topline growth that metric will shrink considerably this year.\n\nGiven the large CapEx guidance I felt it was important to highlight the private company investments that NBIS has.\n\nClickHouse is an open source database platform focused on AI and has a valuation of around $15B. NBIS holds a 28% stake in the company.\n\nAVRIDE is the autonomous driving technology company of which NBIS holds 83% of. A recent funding round placed the valuation just shy of $3B.\n\nToloka is a data labeling and AI development services platform and is controlled by NBIS. Estimates for the valuation range between $500M - $850M and recently raised $72M from the likes of Bezos Expeditions and the CTO of Shopify Mikhail Parakhin.\n\nTripleTen is an edtech platform for re-skilling in technology careers and is controlled by NBIS. Estimates for the valuation of the company range wildly, with a low of around $50M to a high of $800M. The company grew revenue by 88% in 2025 with revenue of around $41M.\n\nParsons  is a Zacks Rank #5 (Strong Sell) after recently missing the Zacks Consensus Estimate. The stock has a Zacks Style Score for Value of C and a B for Growth. This article will look at why this stock is a Zacks Rank #5 (Strong Sell) as it is the Bear of the Day.\n\nParsons Corporation is a provider of technology-driven solutions. It is focused on the defense, intelligence and critical infrastructure markets. The company offers technical design and engineering services and software which consists of cybersecurity, intelligence, defense, military training, connected communities, physical infrastructure and mobility solutions. Parsons Corporation is based in Centreville, United States.\n\nWhen I look at a stock, the first thing I do is look to see if the company is beating the number. This tells me right away where the market’s expectations have been for the company and how management has communicated to the market. A stock that consistently beats has management communicating expectations to Wall Street that can be achieved. That is what you want to see.\n\nIn the case of Parsons I see the company has beaten the Zacks Consensus Estimate in three of the last four quarters. This alone does not make the stock a Zacks Rank #1 (Strong Buy) and it doesn’t make it a Zacks Rank #5 (Strong Sell) either.\n\nThe Zacks Rank does care about the earnings history, but it is much more heavily influenced by the movement of earnings estimates.\n\nThe most recent earnings report from PSN saw the company post $0.75 in EPS when the Zacks Consensus Estimate was calling for $0.80. That 5 cent miss translates to a 6.25% negative earnings surprise.\n\nThe Zacks Rank tells us which stocks are seeing earnings estimates move higher or in this case lower. For Parsons I see annual estimates for next year moving lower of late.\n\nThe current fiscal year consensus number has slid from $3.51 to $3.33 over the last 60 days.\n\nThe next fiscal year has also dropped from $3.95 to $3.70 over the last 60 days.\n\nNegative movement in earnings estimates like that is why this stock is a Zacks Rank #5 (Strong Sell).\n\nIt should be noted that a lot of stocks in the Zacks universe are seeing negative earnings estimate revisions. That means that the stocks that are seeing small but negative earnings estimate revisions are falling to a Zacks Rank #5 (Strong Sell).\n\nWall Street has remained volatile for most of 2026, with major indexes giving up their previous gains. Tech stocks, which have driven the market rally over the past few years, have lately been taking a beating. Also, high inflation and uncertainty over the Federal Reserve’s rate cut outlook have been making markets volatile.\n\nGiven the uncertainty, cautious investors looking for steady income and ways to protect their capital may consider holding or investing in dividend-paying stocks.\n\nSuch stocks provide steady earnings through regular dividend payouts and can help mitigate the effects of market volatility. Three such stocks are: Verisk Analytics, Inc., Seanergy Maritime Holdings Corp and Vulcan Materials Company.\n\nTech stocks have lately been suffering, which has been weighing on the broader market. Tech stocks have been largely responsible for the broader market rally over the past few years, thanks to the enthusiasm surrounding artificial intelligence (AI), especially generative AI.\n\nHowever, concerns started growing earlier this year over the profitability of the AI stocks, given the massive investments being made by the tech companies. This led to an initial tech selloff, eroding much of this year’s gain made by the three major indexes.\n\nThese fears were somewhat alleviated, but fresh AI disruptions have been rattling tech stocks. Investors are now concerned that advances in AI could disrupt some business models, leading not only to a massive tech selloff but also to financial, transportation and logistics stocks.\n\nAlso, inflation, despite easing over the past few months, is still far from the Federal Reserve’s 2% target. The Federal Reserve kept interest rates unchanged in its current range of 3.5% to 3.75% after cutting interest rates by 75 basis points last year.\n\nInvestors now remain uncertain about the Fed’s monetary policy outlook. Also, growing tensions between the United States and Iran have flared up fresh fears of a conflict between the two nations.\n\nVerisk Analytics, Inc. is one of the leading data analytics providers serving customers in the insurance, energy, financial services and specialized markets. Using advanced technologies to collect and analyze data, VRSK draws on unique data assets and deep domain expertise to provide innovations that are integrated into customer workflows. Verisk Analytics has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nOn Feb. 13, Verisk Analytics announced that its shareholders would receive a dividend of $0.50 a share on March 31. VRSK has a dividend yield of 1.02%. Over the past five years, Verisk Analytics has increased its dividend six times, and its payout ratio presently sits at 26% of earnings. Check Verisk Analytics’ dividend history here.\n\nSeanergy Maritime Holdings is a prominent pure-play Capesize ship-owner, which provides marine dry bulk transportation services through a modern fleet of Capesize vessels. SHIP has a Zacks Rank #1.\n\nOn Feb. 13, Seanergy Maritime declared that its shareholders would receive a dividend of $0.20 a share on April 10. SHIP has a dividend yield of 4.11%. Over the past five years, Seanergy Maritime Holdingshas increased its dividend seven times, and its payout ratio presently sits at 28% of earnings. Check Seanergy Maritime Holdings’dividend history here.\n\nVulcan Materials operates primarily in the United States as the nation's largest supplier of construction aggregates (primarily crushed stone, sand and gravel) and a major producer of aggregates-intensive downstream products like asphalt mix and ready-mixed concrete. VMC has a Zacks Rank #3.\n\nOn Feb. 13, Vulcan Materials Company announced that its shareholders would receive a dividend of $0.52 a share on March 23. VMC has a dividend yield of 0.65%. Over the past five years, Vulcan Materials Company has increased its dividend six times, and its payout ratio presently sits at 23% of earnings. Check Vulcan Materials Company’s dividend history here.\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\n\nToday you can access their live picks without cost or obligation.\n\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release.\n\nThe incredible demand for data is fueling the market's next digital gold rush. As data centers continue to be built and constantly upgraded, the companies that provide the hardware for these behemoths will become the NVIDIAs of tomorrow.\n\nOne under-the-radar chipmaker is uniquely positioned to take advantage of the next growth stage of this market. It specializes in semiconductor products that titans like NVIDIA don't build. It's just beginning to enter the spotlight, which is exactly where you want to be.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThis article originally published on Zacks Investment Research (zacks.com).\n\nThis page uses Cookies. For proper functioning of the page Cookies are needed. You agree to using Cookies by clicking \"OK\". \nMore infos can be found in our Privacy declaration.\n\nIf you disagree this service is only available in very limited ways."
    },
    {
        "title": "LMND Q4 Deep Dive: Accelerating Growth, Autonomous Car Insurance, and AI Investment Shape 2026 Outlook",
        "url": "https://ca.finance.yahoo.com/news/lmnd-q4-deep-dive-accelerating-053345928.html",
        "source": "Yahoo Finance Canada",
        "date": "2026-02-20T20:28:00+00:00",
        "content": "Digital insurance provider Lemonade (NYSE:LMND) reported Q4 CY2025 results beating Wall Street’s revenue expectations , with sales up 53.3% year on year to $228.1 million. Its GAAP loss of $0.29 per share was 26.5% above analysts’ consensus estimates.\n\nIs now the time to buy LMND? Find out in our full research report (it’s free).\n\nRevenue: $228.1 million vs analyst estimates of $217.6 million (53.3% year-on-year growth, 4.8% beat)\n\nEPS (GAAP): -$0.29 vs analyst estimates of -$0.39 (26.5% beat)\n\nAdjusted EBITDA: -$4.6 million (-2% margin, 80.7% year-on-year growth)\n\nMarket Capitalization: $4.61 billion\n\nLemonade's fourth quarter was marked by significant top-line acceleration and operational progress, though the market responded negatively to the results. Management credited rapid growth in in-force premium, improved marketing efficiency, and the scaling of pet, car, and European businesses as the primary drivers of performance. CEO Daniel Schreiber highlighted that gross profit increased sharply and free cash flow turned positive, noting, “This was our strongest quarter ever,” yet also acknowledged the need to maintain disciplined expense growth. Management’s cautious remarks around the pace of investment and the competitive landscape may have influenced the market’s reaction.\n\nLooking ahead, Lemonade’s forward guidance is anchored in continued investment in AI-driven automation, expansion of autonomous car insurance, and enhanced cross-selling capabilities. Management believes these efforts will drive both growth and profitability, with Schreiber stating the company is “highly focused on growth and accelerating growth because it is a gift that keeps on giving.” CFO Timothy Bixby emphasized that the company expects to achieve full-quarter EBITDA profitability by the end of this year and for the full year of 2027, while balancing investment in product and technology enhancements.\n\nManagement attributed the quarter’s outperformance to diversified growth across segments, ongoing efficiency gains in marketing, and the rollout of new technology initiatives, while also pointing to incremental R&D investment as a factor impacting margins.\n\nAutonomous car insurance launch: The rollout of Lemonade’s autonomous car insurance product, initially targeting Tesla vehicles, was cited as a major milestone. President Shai Wininger explained the product’s pricing model, which differentiates between human- and AI-driven miles, aiming to reflect risk more accurately. Early results suggest that autonomously-driven miles are priced at roughly half the rate of human-driven miles, with further reductions expected as technology matures.\n\nMarketing efficiency and growth spend: Management emphasized a disciplined approach to marketing investments, maintaining a lifetime value to customer acquisition cost (LTV-to-CAC) ratio above three times. Bixby noted that the company increased growth spend in the quarter as underwriting results improved, allowing for greater top-line outperformance while keeping efficiency intact.\n\nSegment diversification: Pet, car, and European markets were highlighted as the fastest-growing business areas, each combining high growth with improving underwriting performance. Management stated that this diversification reduces reliance on any single product or geography for future growth.\n\nAI-driven operations: Lemonade is making large-scale investments in AI to automate pricing, underwriting, and go-to-market operations. Schreiber described these initiatives as key to sustaining an industry-leading gross profit growth profile, asserting that the company’s “AI-first mindset” provides a structural advantage over traditional insurers.\n\nRegulatory and geographic expansion: The car insurance product is now available in states representing roughly half of the U.S. market, with plans to expand further in 2026. The company claims its regulatory and compliance processes now allow for faster state launches, compressing timelines from months to days.\n\nLemonade expects ongoing technology investment, new product expansion, and improving marketing efficiency to drive revenue and margin growth in the coming quarters.\n\nAI and automation investments: Management is prioritizing R&D for autonomous insurance, cross-selling platforms, and pricing automation, believing these will “collapse time, increase precision, and ultimately lower expenses.” These initiatives are intended to improve unit economics and maintain high gross profit growth rates.\n\nExpansion of autonomous car insurance: Lemonade plans to continue rolling out its autonomous car product to more U.S. states, with the goal of reaching the majority of the population by 2027. Management sees this as a multi-year opportunity, with the potential for dynamic pricing to become a new industry norm as autonomous driving adoption grows.\n\nCross-selling and segment mix shift: The company is investing in technology to better cross-sell products, particularly car and home insurance. With over 5% of customers holding multiple policies and nearly 20% of in-force premium coming from multi-policy holders, Lemonade expects this to be an efficient driver of growth without proportional increases in marketing spend.\n\nIn the coming quarters, the StockStory team will monitor (1) the pace of Lemonade’s autonomous car insurance expansion into new states, (2) progress in AI-driven cross-sell and pricing initiatives, and (3) continued momentum in diversifying growth across pet, car, and European segments. Execution on these fronts, as well as maintaining marketing efficiency while scaling, will be crucial signposts for Lemonade’s ability to sustain its growth trajectory.\n\nLemonade currently trades at $61.87, down from $65.73 just before the earnings. At this price, is it a buy or sell? See for yourself in our full research report (it’s free for active Edge members).\n\nYour portfolio can’t afford to be based on yesterday’s story. The risk in a handful of heavily crowded stocks is rising daily.\n\nThe names generating the next wave of massive growth are right here in our Top 6 Stocks for this week. This is a curated list of our High Quality stocks that have generated a market-beating return of 244% over the last five years (as of June 30, 2025).\n\nStocks that have made our list include now familiar names such as Nvidia (+1,326% between June 2020 and June 2025) as well as under-the-radar businesses like the once-micro-cap company Tecnoglass (+1,754% five-year return). Find your next big winner with StockStory today."
    },
    {
        "title": "ICU Medical Announces Fourth Quarter 2025 Results and Provides Fiscal Year 2026 Guidance",
        "url": "https://uk.finance.yahoo.com/news/icu-medical-announces-fourth-quarter-210500991.html",
        "source": "Yahoo Finance UK",
        "date": "2026-02-19T23:38:00+00:00",
        "content": "Your privacy is important to us\n\nYahoo is part of the Yahoo family of brandsThe sites and apps that we own and operate, including Yahoo and Engadget, and our digital advertising service, Yahoo Advertising.Yahoo family of brands.\n\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\n\nIf you would like to customise your choices, click 'Manage privacy settings'.\n\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy and Cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our Privacy Policy and Cookie Policy."
    }
]