[
    {
        "title": "Why Allegion (ALLE) Stock Is Trading Lower Today",
        "url": "https://finance.yahoo.com/news/why-allegion-alle-stock-trading-190058568.html",
        "source": "Yahoo Finance",
        "date": "2026-02-17T19:27:00+00:00",
        "content": "Shares of security hardware provider Allegion (NYSE:ALLE) fell 7.7% in the afternoon session after the company reported fourth-quarter earnings that missed Wall Street estimates and issued a weaker-than-expected forecast for the full year 2026.\n\nFor the quarter, Allegion's revenue of $1.03 billion was in line with expectations. However, its adjusted earnings of $1.94 per share fell short of the consensus forecast. The company's financial guidance for the upcoming year also disappointed investors. Allegion projected its full-year 2026 adjusted earnings per share to be in the range of $8.70 to $8.90. The midpoint of this range was below the prevailing analyst estimate, signaling a more cautious outlook than the market had anticipated.\n\nThe stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks. Is now the time to buy Allegion? Access our full analysis report here, it’s free.\n\nAllegion’s shares are not very volatile and have only had 4 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful, although it might not be something that would fundamentally change its perception of the business.\n\nThe biggest move we wrote about over the last year was 7 months ago when the stock gained 4.5% on the news that the security products manufacturer posted strong second-quarter results that beat analyst expectations and raised its full-year financial guidance.\n\nThe company announced second-quarter revenue of $1.02 billion, marking a 5.8% increase year-over-year and surpassing the $1 billion milestone for the first time in its history. Allegion's adjusted earnings per share (EPS) of $2.04 also exceeded Wall Street's consensus estimate of $1.99. Bolstering investor confidence, the company lifted its full-year 2025 financial outlook. It increased its adjusted EPS guidance to a new range of $8.00 to $8.15, which was notably above the prior analyst consensus of $7.85. Furthermore, the company raised its expected revenue growth for the year to between 6.5% and 7.5%.\n\nAllegion is up 2.6% since the beginning of the year, and at $165.04 per share, it is trading close to its 52-week high of $179.77 from February 2026. Investors who bought $1,000 worth of Allegion’s shares 5 years ago would now be looking at an investment worth $1,510.\n\nThe 1999 book Gorilla Game predicted Microsoft and Apple would dominate tech before it happened. Its thesis? Identify the platform winners early. Today, enterprise software companies embedding generative AI are becoming the new gorillas.  Click here for access to our special report that reveals one profitable leader already riding this wave, it’s free."
    },
    {
        "title": "LGI Homes Q4 Earnings Call Highlights",
        "url": "https://finance.yahoo.com/news/lgi-homes-q4-earnings-call-184636204.html",
        "source": "Yahoo Finance",
        "date": "2026-02-17T19:14:00+00:00",
        "content": "LGI delivered 1,362 homes in Q4 (1,301 recognized in revenue), reported its highest closings-per-community pace, and saw backlog surge 133% to 1,394 homes with net orders up 39%, although cancellations rose to 43.3% as many buyers face financing hurdles.\n\nMargins were pressured by incentives and price reductions to clear aged inventory — fourth-quarter gross margin excluding inventory charges fell to 19.2% (adjusted gross margin 22.3%), and the company recorded a $6.7 million inventory impairment.\n\nLGI ended the year with $1.7 billion of debt, $335 million total liquidity and ~60,842 controlled lots, plans to monetize older lots to reduce leverage toward a 35%–45% target, and guided 2026 to 4,600–5,400 closings with gross margin of 18%–20% (adjusted 21%–23%).\n\nInterested in LGI Homes, Inc.? Here are five stocks we like better.\n\nCongress Beat the Market Again—Here Are the 3 Stocks They Bought\n\nLGI Homes (NASDAQ:LGIH) executives emphasized disciplined execution and a continued focus on affordability as the homebuilder reported fourth-quarter and full-year 2025 results, while also outlining an outlook that assumes market conditions in 2026 will look “very similar” to 2025.\n\nCEO Eric Lipar said the company delivered 1,362 homes in the fourth quarter. Of those, 1,301 homes contributed to reported revenue of $474 million, while 61 homes were currently or previously leased homes with profits reflected in other income. Lipar also noted the company closed its 80,000th home in December.\n\n→ These 3 Stocks Just Graduated to the MSCI World Index\n\nInvestors Are Buying The Dip In LGI Homes Stock\n\nLGI ended 2025 with 144 active communities and averaged 3.1 closings per community per month in the fourth quarter, which management called its highest pace of the year. On a closings-per-community basis during the quarter, the company’s top markets were Charlotte (6.0), Northern California (5.8), Las Vegas (4.6), and Atlanta (4.2).\n\nManagement said gross margin performance was resilient relative to expectations but came in below prior guidance ranges due to the impact of incentives and price reductions tied to older inventory. Lipar attributed fourth-quarter margin pressure to the company “leaning into incentives” and clearing aged inventory using interest-rate buydowns, forward commitments, discounts, and pricing adjustments to remain competitive and support affordability.\n\n→ Meta's Platfroms' New Bull: Why Billionaire Bill Ackman Is Buying\n\nCFO Charles Merdian reported fourth-quarter gross margin excluding inventory-related charges of 19.2%, down from 22.9% in the prior-year quarter. He cited financing incentives, discounts on older inventory, a higher percentage of wholesale closings, and higher borrowing costs as key drivers, partially offset by what he described as a structural margin benefit from self-developed lots. Adjusted gross margin was 22.3%, excluding $14.4 million of capitalized interest and $609,000 related to purchase accounting.\n\nThe company recorded an inventory impairment charge of $6.7 million tied to four underperforming communities impacted by slower-than-modeled pace, financing incentives, and price discounts on aged inventory. Merdian said the company regularly reviews inventory and, “at this time,” analysis did not indicate future impairments “meaningfully different” from the fourth-quarter amount.\n\n→ Devon Energy Bets on Scale With Coterra Acquisition\n\nLipar said the homebuying process has been extended as many buyers need more time to save for down payments, strengthen credit, or sell existing homes. As a result, the company’s cancellation rate rose to 43.3%, and management expects the dynamic to persist “for the foreseeable future.” In Q&A, Lipar said the main reason for cancellations has not changed and is “strictly the ability to get financing,” adding that LGI is spending more time with customers who may need additional weeks to address debt, down payments, or credit scores.\n\nDespite higher cancellations, Lipar said net orders increased 39% year-over-year in the quarter. Backlog rose 133% to 1,394 homes, with backlog value exceeding $501 million, up 112% from the prior year. Management said those totals included an agreement with a wholesale buyer to acquire 480 homes delivering throughout 2026; excluding that agreement, backlog was still up 53% from the end of 2024.\n\nManagement added that January leads and retail net orders were up slightly compared to a softer year-ago period, but said it expects first-quarter results to be similar to last year as it monitors backlog “pull-through” and cancellation trends.\n\nFor full-year 2025, LGI delivered 4,788 homes, including 103 currently or previously leased homes. A total of 4,685 homes contributed to reported revenue of $1.7 billion. The company’s average selling price for the year was $364,000, roughly in line with the prior year. Full-year gross margin excluding inventory-related charges was 21.1%, and adjusted gross margin was 24%.\n\nLGI’s wholesale business represented a larger portion of annual closings. Merdian said the company closed 737 homes through wholesale in 2025, representing 15.7% of total closings and generating more than $230 million of revenue, compared to 9.2% and $164 million in 2024. In Q&A, management reiterated that wholesale revenue is recorded in home sales revenue, while gains from currently or previously leased homes are reflected in other income.\n\nFull-year selling, general and administrative expenses were $273.8 million, or 16.1% of revenue, a 150-basis-point increase from 2024 driven by fewer closings and a higher average community count. In the fourth quarter, SG&A was $65.6 million (13.8% of revenue), with G&A down year-over-year due primarily to compensation-related adjustments. When asked about the durability of the reduction, management said the fourth quarter was “more bonus driven,” while still expecting annual run rate to be similar year over year.\n\nOther income was $5.5 million in the fourth quarter and $18.7 million for the year. Merdian said full-year other income was driven by the sale of nearly 550 lots, 103 leased homes, commercial property, and income from joint ventures.\n\nLGI reported full-year net income of $72.6 million, or $3.13 per basic share and $3.12 per diluted share. Excluding impairment-related charges, net income was $77.6 million, or $3.35 per basic share and $3.34 per diluted share. Fourth-quarter net income was $17.3 million, or $0.75 per share, and $22.4 million, or $0.97 per share, excluding impairment-related charges. Merdian said the effective tax rate in the quarter was 27.9%, above the company’s outlook due to higher state income tax rates and the impact of impairments.\n\nOn land strategy, Merdian described the on-balance sheet land portfolio as a “key strategic advantage,” citing operational flexibility and profitability support. He said the average finished lot cost across controlled lots was approximately $70,000, and lot cost represented about 21% of average selling price last year. At year-end, LGI owned and controlled 60,842 lots, down 14.2% year over year, reflecting what management called discipline in capital allocation.\n\nExecutive Vice President Joshua Fattor said LGI ended the year with $1.7 billion of debt outstanding, including $528 million drawn on its revolver, and reduced its net debt-to-capital ratio by 160 basis points in the fourth quarter to 43.2%. Total liquidity was $335 million, including more than $61 million of cash and $274 million of revolver availability. Fattor said the company expects to work through older inventory, selectively monetize certain lot positions, and use proceeds to reduce debt as it progresses toward the midpoint of its 35% to 45% target leverage range.\n\nLooking to 2026, Lipar said guidance reflects current demand trends, elevated starting backlog, and what the company believes is attainable if market conditions remain generally consistent with recent experience. Key elements of the outlook include:\n\nActive selling communities at year-end: 150 to 160\n\nAverage sales price: $355,000 to $365,000\n\nAdjusted gross margin: 21% to 23%\n\nLipar said the company expects to continue using incentives—including closing costs, interest rate buydowns, and discounts on older inventory—to support affordability. In response to analyst questions, he said upside to margin guidance would likely require lower incentives or lower costs (including land development, impact fees, and construction costs), and noted the mix of wholesale closings can also influence margins.\n\nOn wholesale expectations, Lipar said the company anticipates wholesale closings representing 10% to 15% of 2026 closings and that the company feels “really good” about 10% given orders already in backlog. He added that new wholesale orders were “somewhat on pause” while the company sought more clarity on policy discussions related to institutional buyers.\n\nManagement also said community openings are expected to be more weighted toward the back half of the year, while reiterating confidence in its year-end community count target.\n\nLGI Homes, Inc (NASDAQ: LGIH) is a residential homebuilder primarily focused on serving first-time and first-time move-up homebuyers in the United States. The company specializes in the acquisition, development and sale of affordable single-family homes and townhomes. LGI Homes operates through an integrated model that encompasses land sourcing, lot development, home construction, and post-closing customer support including warranty services.\n\nIn addition to its core homebuilding activities, LGI Homes offers ancillary services to streamline the homebuying process for its customers.\n\nThe article \"LGI Homes Q4 Earnings Call Highlights\" was originally published by MarketBeat."
    },
    {
        "title": "Silver (XAG) Forecast: Speculators Exit as Silver Dropping Sparks New Value Hunt",
        "url": "https://www.fxempire.com/forecasts/article/silver-xag-forecast-speculators-exit-as-silver-dropping-sparks-new-value-hunt-1580046",
        "source": "FX Empire",
        "date": "2026-02-17T15:35:00+00:00",
        "content": "Spot silver is trading lower on Tuesday, dragged down by weak gold prices and a stronger US dollar. Silver is also trading on the weak side of the 50-day moving average, which opens the door to further downside pressure. With the break of the 50-day MA, the 200-day moving average at $51.65 is now on the radar.\n\nUnlike gold, which has the support of major central banks if the reports are still true, silver was supported throughout 2025 by reports of a supply deficit and strong industrial demand. Both factors contributed to a steady climb, understandably. That was until the overleveraged speculators took control and crashed the party. The exchange raised futures margins and suddenly some began to question the whole storage deficit and industrial demand argument.\n\nNow traders are dealing with an uncertain Fed and a risk-off situation across all speculative markets, which points toward lower prices and a return to more traditional fundamentals. Instead of looking to come in every day to take out offers, investors are now hunting value.\n\nLong-term investors have seen what silver can do after a 46-year wait, so they are the patient ones. The short-term guys have to think now with little momentum to the upside, so they have lost interest. But they will probably be back once the market finds value and stabilizes.\n\nIt is just a different game right now than it was during that explosive December and January time period. The rules have changed but good traders adapt, so be patient.\n\nCNBC covered it so I thought I would mention it. According to CNBC, Deutsche Bank analysts said in a note published Tuesday that silver was trading $7 below its real adjusted price in 1790, after prices fell in the morning.\n\nFirst of all, it is not a forecast. It is just a statement with historical context. It does not tell us where silver should trade tomorrow or next week. It is telling us that silver is at a discount to long-term purchasing power history. It could be attractive to dip buyers or to computer traders searching for historical value anomalies.\n\nEssentially it supports my idea of value hunting. It is restating what I wrote earlier about traders searching for value. It is just another piece of the puzzle.\n\nFor longer-term buyers, the story is a little different. It blows up the idea of silver being a hedge against inflation. However, it does not mean it is worthless. We are still going to see industrial and monetary policy-driven price spikes. It is probably better for timing potentially volatility-driven spikes, but not really worth holding for the long run because it is not a compounding asset. Translation: it is a good asset if you can catch the cyclical moves.\n\nMore Information in our Economic Calendar.\n\nJames Hyerczyk is a U.S. based seasoned technical analyst and educator with over 40 years of experience in market analysis and trading, specializing in chart patterns and price movement. He is the author of two books on technical analysis and has a background in both futures and stock markets.\n\nNASDAQ Index, SP500, Dow Jones Forecasts – NASDAQ Rebounds As Apple Gains 3.9%\n\nGold (XAU/USD) Price Forecast: Bounce Potential From Key Support Levels\n\nNatural Gas News: Natural Gas Futures Slide, Chart Points to Sub-$3\n\nUS Dollar Forecast: Dollar Gains as Traders Cut Rate-Cut Bets Ahead of Fed Minutes\n\nCrude Oil Price Forecast: Testing Support Before Possible Bounce"
    },
    {
        "title": "US10 YR, EUR/USD, GBP/USD and AUD/USD Forecast - Risk Appetite Struggling on Tuesday",
        "url": "https://www.fxempire.com/forecasts/article/us10-yr-eur-usd-gbp-usd-and-aud-usd-forecast-risk-appetite-struggling-on-tuesday-1580055",
        "source": "FX Empire",
        "date": "2026-02-17T15:24:00+00:00",
        "content": "The market continues to see a lot of questions asked about the risk appetite around the world. At this point, it looks like we are seeing some concerns.\n\nThe first chart I have in front of you is the 10-year yield in the United States. This chart suggests to me, at the moment at least, that we are going to threaten the 4% level. This is an amalgamation of a couple of different things. It is a bit of concern when it comes to the fact that inflation is cooling, so people are starting to bet that the Fed will cut rates. That is bad for the dollar, at least in theory.\n\nBut it can also be read as a little bit of fear. I think that fear is probably the main thing here because while the yields are dropping, we are also seeing the stock market, at least in pre-market trading, look a little soft in America. I will switch over here to the currency markets, keeping in mind that the 4% level could cause a bit of a bounce.\n\nThe Euro is sliding against the US dollar. I think this is our first clue that some of those yields dropping might be a run to safety. It is not necessarily so much about the Fed cutting because just because the Fed cuts rates does not mean markets have to go higher. They can and quite often do go lower because people become concerned. What does the Fed see? When I look at the Euro, I still pay close attention to the 50-day EMA. If we close below there on a daily chart, I think we could drop to the 200-day EMA pretty quickly. A bounce and a rally from here are still very much a real possibility with 1.18 offering support.\n\nThe British pound has fallen pretty significantly, and this has something to do with employment numbers in the UK or jobless claims being higher than anticipated. The 50-day EMA is being challenged. The 1.35 level could be challenged. If we break down below there, then I think we go looking for the 200-day EMA, which is about 150 pips below there. Breaking that changes the entire trend, and it changes the entire outlook. Britain does have quite a few economic numbers coming out this week, so this could get reversed very quickly. Keep an eye on 1.35.\n\nIn the Australian dollar, I am watching this thing roll over a little bit and that does suggest maybe what we are seeing again is risk-off behavior. It is not necessarily dollar strength just because the dollar is suddenly loved. I think people are a little worried about a few things. It is worth noting that dollar shorts are at a 14-year high. That is generally when you see the market start to turn in the other direction, when everybody is in the same trade.\n\nThis pair will be different, though, because the RBA is likely to raise rates again. That is divergent from most other central banks, including the two previous ones mentioned. At 0.6950, I start to look for a bounce and try to take advantage of that, and it is really not a pair I plan on shorting, regardless. If we start to see the US dollar take off, then I will short the Euro, or I will short the pound. The Aussie would be the outlier. Watch this; if this breaks down, that is going to be horrific for the other two.\n\nYou can use all of these charts in congruence today to get an idea as to how the stock market may behave. If we start to see the US dollar sell off a bit, then you start to look for more risk-on behavior in places like the Nasdaq or even the gold market. It all ties together.\n\nChris is a proprietary trader with more than 20 years of experience across various markets, including currencies, indices and commodities. As a senior analyst at FXEmpire since the website’s early days, he offers readers advanced market perspectives to navigate today’s financial landscape with confidence.\n\nNASDAQ Index, SP500, Dow Jones Forecasts – NASDAQ Rebounds As Apple Gains 3.9%\n\nGold (XAU/USD) Price Forecast: Bounce Potential From Key Support Levels\n\nNatural Gas News: Natural Gas Futures Slide, Chart Points to Sub-$3\n\nUS Dollar Forecast: Dollar Gains as Traders Cut Rate-Cut Bets Ahead of Fed Minutes\n\nCrude Oil Price Forecast: Testing Support Before Possible Bounce"
    },
    {
        "title": "Telix Submits European Marketing Authorization Application for TLX101-Px for Brain Cancer Imaging",
        "url": "https://finance.yahoo.com/news/telix-submits-european-marketing-authorization-215500374.html",
        "source": "Yahoo Finance",
        "date": "2026-02-17T22:15:00+00:00",
        "content": "MELBOURNE, Australia and INDIANAPOLIS, Feb. 18, 2026 (GLOBE NEWSWIRE) -- Telix Pharmaceuticals Limited (ASX: TLX, NASDAQ: TLX, “Telix”) today announces that it has submitted a marketing authorization application (MAA) in Europe for TLX101-Px (O-(2-[18F]fluoroethyl)-L-tyrosine, 18F-FET), its glioma (brain cancer) imaging candidate.\n\nTelix has been preparing the European and U.S. regulatory packages for TLX101-Px concurrently, bringing forward the European submission to meet an agreed filing date while aligning with aspects of the U.S. Food and Drug Administration (FDA) package to support the additional application. The submission covers major European markets1. Telix is seeking to expand patient access to advanced brain imaging through a broad clinical label, reflective of current clinical practice guidelines2. Submission of the U.S. New Drug Application (NDA) will follow.\n\nIn Europe, positron emission tomography (PET) imaging of glioma with 18F-FET (FET-PET) is currently performed under physician-supervised use through hospital-based production at a limited number of sites. However, there is currently no generally available commercial product in Europe that ensures consistent quality and access for glioma imaging, an acute and immediate need3. Telix aims to expand patient access to advanced imaging that can distinguish progressive or recurrent glioma from treatment-related changes in both adults and children, with potential for additional future indications. TLX101-Px is also being developed as a patient selection and response assessment tool for Telix’s glioblastoma therapy candidate TLX101-Tx (iodofalan 131I), which has been granted orphan drug designation in Europe and the U.S. and is the subject of the Phase 3 IPAX-BrIGHT trial in patients with recurrent glioblastoma, launching in multiple European countries4.\n\nPhilipp Lohmann, Group Leader Digital Translational Neuroimaging at Forschungszentrum Jülich research center in Germany, commented, “FET-PET imaging is already used in clinical practice in Europe for the evaluation of gliomas, and plays a critical role in treatment decision making. This applies particularly in the post-therapy setting, where conventional MRI5 alone can be limited in its ability to distinguish tumor progression from treatment-related changes. Having widespread access to TLX101-Px has potential to provide clinicians with greater biological insight, supporting more confident and timely management of patients with brain tumors.”\n\nKevin Richardson, Chief Executive Officer, Telix Precision Medicine, added, “We see a compelling opportunity in Europe to broaden access to authorized targeted radiopharmaceuticals for brain cancer imaging and therapy, and as such this submission is an important milestone for Telix. The strategic value of this submission is particularly relevant to establishing widespread glioma imaging as part of our corresponding therapeutic development program. We have been able to utilize aspects of our FDA package to expedite the European filing, which has been submitted in accordance with a pre-defined date agreed with the regulator, with the U.S. resubmission to follow.”\n\nIn Europe, approximately 67,500 brain and central nervous system tumors are diagnosed every year6, with gliomas accounting for approximately 30% of these, and up to 80% of all malignant brain tumors7. There is a critical unmet need to improve the diagnosis and management of gliomas, which are the most common primary brain tumors of the central nervous system, particularly in the post-treatment setting5. Conventional MRI imaging techniques have several limitations, including a lack of biological specificity, dependency on blood-brain barrier disruption, and an inherent inability to differentiate between tumor progression or treatment-related causes. This can yield inconclusive results and delay time-sensitive treatment decisions8. With low survival rates and the need to make rapid decisions, precision imaging is paramount5. Subject to regulatory approval, TLX101-Px has the potential to address this need, enabling patients in Europe to receive greater clarity in their diagnosis and treatment decision making.\n\nTLX101-Px (O-(2-[18F]fluoroethyl)-L-tyrosine) is Telix’s PET imaging candidate for the characterization of glioma. TLX101-Px targets membrane transport proteins known as L-type amino acid transporters 1 and 2 (LAT1 and LAT2). This enables TLX101-Px to be potentially utilized as a complementary diagnostic agent to TLX101-Tx (iodofalan 131I), Telix’s LAT1-targeting investigational glioblastoma (GBM) therapy, currently under investigation in Telix’s IPAX-29 and IPAX-BrIGHT6 studies. TLX101-Px and TLX101-Tx have not received a marketing authorization in any jurisdiction. In relevant European markets, the proposed brand name for TLX101-Px is “Pixlumi®”. Brand name and commercial launch are subject to final regulatory approval.\n\nAbout Telix Pharmaceuticals Limited\n\nTelix is a biopharmaceutical company focused on the development and commercialization of therapeutic and diagnostic radiopharmaceuticals and associated medical technologies. Telix is headquartered in Melbourne, Australia, with international operations in the United States, United Kingdom, Brazil, Canada, Europe (Belgium and Switzerland), and Japan. Telix is developing a portfolio of clinical and commercial stage products that aims to address significant unmet medical needs in oncology and rare diseases. Telix is listed on the Australian Securities Exchange (ASX: TLX) and the Nasdaq Global Select Market (NASDAQ: TLX).\n\nVisit www.telixpharma.com for further information about Telix, including details of the latest share price, ASX and U.S. Securities and Exchange Commission (SEC) filings, investor and analyst presentations, news releases, event details and other publications that may be of interest. You can also follow Telix on LinkedIn, X and Facebook.\n\nTelix Investor Relations (Global)\n\nMs. Kyahn WilliamsonTelix Pharmaceuticals LimitedSVP Investor Relations and Corporate CommunicationsEmail: kyahn.williamson@telixpharma.com\n\nThis announcement has been authorized for release by the Telix Pharmaceuticals Limited Disclosure Committee on behalf of the Board.\n\nCautionary Statement Regarding Forward-Looking Statements.\n\nYou should read this announcement together with our risk factors, as disclosed in our most recently filed reports with the Australian Securities Exchange (ASX), U.S. Securities and Exchange Commission (SEC), including our Annual Report on Form 20-F filed with the SEC, or on our website.\n\nThe information contained in this announcement is not intended to be an offer for subscription, invitation or recommendation with respect to securities of Telix Pharmaceuticals Limited (Telix) in any jurisdiction, including the United States. The information and opinions contained in this announcement are subject to change without notification. To the maximum extent permitted by law, Telix disclaims any obligation or undertaking to update or revise any information or opinions contained in this announcement, including any forward-looking statements (as referred to below), whether as a result of new information, future developments, a change in expectations or assumptions, or otherwise. No representation or warranty, express or implied, is made in relation to the accuracy or completeness of the information contained or opinions expressed in the course of this announcement.\n\nThis announcement may contain forward-looking statements, including within the meaning of the U.S. Private Securities Litigation Reform Act of 1995, that relate to anticipated future events, financial performance, plans, strategies or business developments. Forward-looking statements can generally be identified by the use of words such as “may”, “expect”, “intend”, “plan”, “estimate”, “anticipate”, “believe”, “outlook”, “forecast” and “guidance”, or the negative of these words or other similar terms or expressions. Forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause our actual results, levels of activity, performance or achievements to differ materially from any future results, levels of activity, performance or achievements expressed or implied by these forward-looking statements. Forward-looking statements are based on Telix’s good-faith assumptions as to the financial, market, regulatory and other risks and considerations that exist and affect Telix’s business and operations in the future and there can be no assurance that any of the assumptions will prove to be correct. In the context of Telix’s business, forward-looking statements may include, but are not limited to, statements about: the initiation, timing, progress, completion and results of Telix’s preclinical and clinical trials, and Telix’s research and development programs; Telix’s ability to advance product candidates into, enroll and successfully complete, clinical studies, including multi-national clinical trials; the timing or likelihood of regulatory filings and approvals for Telix’s product candidates, including the planned NDA resubmission for TLX101-Px and the planned BLA resubmission for TLX250-Px, manufacturing activities and product marketing activities; Telix’s sales, marketing and distribution and manufacturing capabilities and strategies; the commercialization of Telix’s product candidates, if or when they have been approved; Telix’s ability to obtain an adequate supply of raw materials at reasonable costs for its products and product candidates; estimates of Telix’s expenses, future revenues and capital requirements; Telix’s financial performance; developments relating to Telix’s competitors and industry; the anticipated impact of U.S. and foreign tariffs and other macroeconomic conditions on Telix’s business; and the pricing and reimbursement of Telix’s product candidates, if and after they have been approved. Telix’s actual results, performance or achievements may be materially different from those which may be expressed or implied by such statements, and the differences may be adverse. Accordingly, you should not place undue reliance on these forward-looking statements.\n\nTrademarks and Trade Names. All trademarks and trade names referenced in this press release are the property of Telix Pharmaceuticals Limited (Telix) or, where applicable, the property of their respective owners. For convenience, trademarks and trade names may appear without the ® or ™ symbols. Such omissions are not intended to indicate any waiver of rights by Telix or the respective owners. Trademark registration status may vary from country to country. Telix does not intend the use or display of any third-party trademarks or trade names to imply any affiliation with, endorsement by, or sponsorship from those third parties.\n\n©2026 Telix Pharmaceuticals Limited. All rights reserved.\n\n1 The French National Agency for Medicines and Health Products Safety (ANSM), in its capacity as Reference Member State, is responsible for coordinating and leading the scientific evaluation of the dossier, in collaboration with the concerned Member States, nominated by Telix and representing the major European markets for Telix’s brain cancer imaging product.2 Galldiks et al. Lancet Oncol. 2025 (Joint guidelines from the European Association of Nuclear Medicine (EANM), European Association of Neuro-Oncology (EANO), Society of Nuclear Medicine and Molecular Imaging (SNMMI), Response Assessment in Neuro-Oncology (RANO), The European Society for Pediatric Oncology and The Response Assessment in Pediatric Neuro-Oncology for the characterization of recurrence in glioma patients); National Comprehensive Cancer Network® (\"NCCN\") Clinical Practice Guidelines in Oncology (\"NCCN Guidelines®\") for Central Nervous System Cancers V1.2025.3 Albert et al. Lancet Oncol. 2024.4 ClinicalTrials.gov ID: NCT07100730.5 Magnetic Resonance Imaging.6 Frosina et al. Sci Rep. 2024.7 Goodenberger et al. Cancer Genetics. 2012.8 Smith et al. J Nucl Med. 2023.9 ClinicalTrials.gov ID: NCT05450744."
    }
]