[
    {
        "title": "Indian shares open marginally higher, extending gains on earnings optimism",
        "url": "https://uk.finance.yahoo.com/news/indian-shares-set-open-flat-023353369.html",
        "source": "Yahoo Finance UK",
        "date": "2026-02-19T03:50:00+00:00",
        "content": "Feb 19 (Reuters) - India's stock benchmarks inched higher at the ‌open on Thursday on ‌optimism over improving earnings outlook.\n\nThe Nifty 50 ​rose 0.21% to 25,873.35 and the BSE Sensex added 0.28% to 83,969.82, as of 9:15 ‌a.m. IST.\n\nFifteen of ⁠the 16 major sectors opened higher. The broader ⁠small-caps and mid-caps rose 0.3% and 0.2%, respectively.\n\nBoth the Nifty ​and Sensex ​have gained ​about 1.4% in ‌the last three sessions, with sentiment aided by an in-line December-quarter earnings season despite a one-time hit of labour code-related ‌charges.\n\nIT stocks, which suffered ​a rout due ​to ​AI-led disruption fears, rose ‌1% at the open, ​with analysts ​terming the rise as a tactical bounce after the ​sharp selloff.\n\n(Reporting ‌by Bharath Rajeswaran in Bengaluru; ​Editing by Janane Venkatraman ​and Sonia Cheema)"
    },
    {
        "title": "USD/CAD Forecast: Loonie Faces Two-Way Trade as Rate Differential Limits Near-Term Gains",
        "url": "https://www.fxempire.com/forecasts/article/usd-cad-forecast-loonie-faces-two-way-trade-as-rate-differential-limits-near-term-gains-1580693",
        "source": "FX Empire",
        "date": "2026-02-19T18:39:00+00:00",
        "content": "The Canadian dollar will face two opposing pressures ahead of the end of February. Recently, the labor department in Canada released a mixed labor survey for January that at face value seemed quite positive having an unemployment rate of 6.5% which was a 16 month low.\n\nHowever, after further examination, it becomes more complicated as there were a total of 25,000 jobs lost in January while there were also 28,000 manufacturing jobs lost. There were also 23,000 jobs lost in Ontario which is Canada’s primary manufacturing province due to the effect US tariffs have had on their manufacturing base and exports\n\nFurthermore, the drop from 6.8% to 6.5% in the unemployment rate was primarily due to a drop in participation in the labor force from 65.4% down to 65%. Again, this is not the environment that would encourage the Bank of Canada to change their current monetary policy.\n\nJaime Martinez Medina, Global Market Strategist at PU Prime commented:\n\nThe Canadian dollar enters the final stretch of February facing opposing forces that are likely to keep USD/CAD in a two-way trading environment rather than a clear directional trend.\n\nCanada’s latest labor report initially appeared encouraging, with unemployment falling to 6.5%, a 16-month low. However, the details were less constructive. The economy lost 25,000 jobs in January, including 28,000 manufacturing positions, with significant weakness concentrated in Ontario. The drop in unemployment was largely driven by lower labor force participation, rather than genuine job creation. This backdrop does little to justify a shift in the Bank of Canada’s current stance and reinforces expectations that the easing cycle has likely reached its end for now.\n\nThe dominant driver remains the interest rate differential. The Federal Reserve maintains a policy rate 125 basis points above Canada’s, providing sustained support for the U.S. dollar. As long as U.S. yields remain elevated relative to Canadian yields, capital flows are likely to favor USD-denominated assets. Markets do not expect meaningful Fed easing before mid-year, limiting near-term upside for the Canadian dollar.\n\nAt the same time, tariff uncertainty continues to weigh on Canada’s outlook. Trade tensions and the potential for additional U.S. measures have increased growth risks, with estimates suggesting a measurable drag on Canadian GDP through 2026. These policy risks create an additional premium embedded in USD/CAD.\n\nOil prices, while stable, are acting more as a floor than a catalyst. With crude trading in a narrow range and long-term forecasts subdued, energy alone is unlikely to drive CAD appreciation.\n\nInstitutional forecasts generally point to gradual CAD strengthening through 2026, but not an abrupt reversal. In the near term, the two-year yield spread remains the key signal. Unless U.S. data softens materially or Canadian yields rise, USD/CAD is likely to remain supported within its current range.\n\nAs it stands, the U.S. Federal Reserve maintains an interest rate of between 3.5% and 3.75%, whereas Canada’s Bank of Canada has an interest rate of 2.25%, meaning that there is a 125-basis-point difference between the two. This differential is why the CAD has not seen more strength relative to the U.S. thus far.\n\nIn addition, the BoC has lowered interest rates nine times from a peak of 5% to their current level; it is believed by many economists that the cutting cycle is over. At its January meeting, the Fed continued to hold its interest rate steady, and market expectations do not anticipate any U.S. interest rate cuts until at least June. The continued strength of the U.S. dollar due to a higher interest rate environment also creates challenges for the Canadian dollar remaining at lower trading levels as long as the rate differential remains in favor of the U.S.\n\nInstitutional desks at RBC, Scotiabank, TD Bank, and Goldman Sachs are all projecting gradual gains for the Canadian dollar through the end of 2026, indicating that these institutions are projecting year-end prices to be in the range of CAD$1.30 to CAD$1.33. These banks are not projecting a sudden change in trend, but a gradual return to longer-term averages is anticipated to develop.\n\nUS Dollar/Canadian Dollar weekly candlestick chart. Source: TradingView.\n\nUS data continues to be the driving force behind USD/CAD, as evidenced by the trend seen in the January payroll report. Non-farm payrolls rose 130,000 in January versus 55,000 expected, and the unemployment rate fell to 4.3% (down from 4.4% in December). Additionally, year-over-year wage growth was reported at 3.7%. This set of numbers gave the Fed no reason to move up their timeline for an action, which is why USD responded positively to the news.\n\nThe January CPI report, however, showed a different side of the USD story. Headline inflation was at 2.4%, down from 2.7% last month and below the 2.5% consensus forecast. Core CPI was at 2.5%, marking the first time the Core CPI has dropped below this level since April 2021. While this data could eventually lead to weak demand and weaken USD, one data point is not sufficient to change market expectations. The Fed has been clear that they require continued progress before taking action. As such, the markets added slightly to June cut expectations, but sentiment remains subdued.\n\nThere is still uncertainty surrounding tariffs, as well as continual confusion over this policy decision by the recently passed US Congress. On a partisan basis, the US House of Representatives voted 219 to 211 last week to attempt to repeal President Trump’s imposition of his 25% tariffs on Canadian imports, which is a rare act of bipartisan criticism of the President’s trade policies. Six Republicans voted with the Democrats to overturn the tariffs; however, the resolution must now go before the US Senate, where similar legislation has already been passed. Despite this fact, the likely outcome is that the President will veto this latest congressional attempt to remove the tariffs and therefore no change will result on tariffs until at least 2027 at the earliest.\n\nAnalysts are putting together their forecasts for the economic impact of these tariffs over our planning horizon to 2027, and most are estimating that these tariffs will reduce Canadian GDP by 1.2% between now and 2026. We are also starting to see the impact of the tariffs on manufacturing data, which will be continuing over the next several months as the international community re-evaluates their economic relationship with Canada.\n\nFurthermore, President Trump has stated that he will impose an additional 100% tariff on all Canadian imports if Canada proceeds with a trade agreement with China. This increases the uncertainty of doing business with and/or trading with Canada. Finally, most Canadian banks are indicating that the Comprehensive Trade Agreement is a wildcard in determining the value of the Canadian dollar against the US dollar, because trade news releases can move the value of the USD/CAD without taking into account the underlying fundamentals.\n\nAs of February, WTI Crude has settled between $62 and $64. The steady prices have negated against any major sell offs in the CAD; however, momentum should be generated by other sources rather than energy alone. The descriptive term for oil according to an institution in the market, currently, would be “a floor” not necessarily “a catalyst”. If, in the next couple of months or years an example where oil has broken above any resistance is witnessed, the market will determine if CAD relative value increases. Nevertheless, at this time, according to EIA, 2026 estimates for average Brent are $58 per barrel therefore suggesting no immediate increase in value of the Canadian Dollar based on commodity related increases.\n\nThe most important sign for where the USD/CAD will go, is the difference between the two-year yields on bonds in the US and Canada. The bond yield spread provides an indication of what each central bank’s monetary policies are expected to be. In the past, these have proven to be very good forecasters of future currency movement. Right now, US yields are much higher than Canada’s therefore funds are being drawn toward US assets. A significant reduction in the yield spread will occur when either softer US economic data pushes expectations for a Fed rate cut forward OR when an increase in expected future interest rates from the Bank of Canada increases Canadian yields. This would be a catalyst for a continued downward move in USD/CAD.\n\nBased on an analysis of the current institutional landscape, I would characterize the probability distribution of an eventual gradual decline in the USD/CAD exchange rate from between 1.32 to 1.35 through 2026 at 50% – 60%, with the balance of the overall institutional probability (~25% – 30%) for a range bound series of oscillations over that same time span.\n\nUS Dollar/Canadian Dollar daily candlestick chart. Source: TradingView.\n\nIt would take (10%-15% probability) a significant pickup in inflationary pressures in the United States to drive the forecast of the potential for bull extension in the USD to be driven above 1.42 or possibly higher. To extend inflationary pressures sufficiently would require significantly escalated trade tensions both internally in the United States and across global trade groups.\n\nCurrently, however, the forecast is fairly straight forward in that USD/CAD has shown consistency in positively correlated increases to the USD against the CAD on rising upside surprises in the United States with declines commensurate to increased Fed easing expectations into the future.\n\nThe bond markets as they reflect the realities of inflationary pressures will ultimately drive the trajectory of the USD/CAD exchange rate; until that time, it is logical to respect the current range of the USD/CAD exchange rate and follow the headline market – both of which would provide valuable trading signals.\n\nJames Hyerczyk is a U.S. based seasoned technical analyst and educator with over 40 years of experience in market analysis and trading, specializing in chart patterns and price movement. He is the author of two books on technical analysis and has a background in both futures and stock markets.\n\nNASDAQ Index, SP500, Dow Jones Forecasts – Stocks Retreat As Geopolitical Risks Rise\n\nGold (XAU/USD) Price Forecast: Bearish Bias Persists Below Key Average\n\nNatural Gas Price Forecast: Key Support Holds Near $2.87\n\nUS Dollar Forecast: DXY Breaks Higher on Middle East Tensions, Fed Outlook\n\nCrude Oil Price Forecast: Bullish Breakout Signals Trend Continuation"
    },
    {
        "title": "Visteon (VC) Q4 2025 Earnings Call Transcript",
        "url": "https://finance.yahoo.com/news/visteon-vc-q4-2025-earnings-160012858.html",
        "source": "Yahoo Finance",
        "date": "2026-02-19T16:57:00+00:00",
        "content": "Thursday, Feb. 19, 2026 at 9 a.m. ET\n\nPresident and Chief Executive Officer — Sachin S. Lawande\n\nExecutive Vice President and Chief Financial Officer — Jerome J. Rouquet\n\nSachin S. Lawande: Thank you, Chris, and good morning, everyone. Overall, we delivered a strong performance in 2025, several industry challenges. Net sales for the year were $3,768 million, coming in largely as we expected at the beginning of the year. From a product perspective, displays will stand out with sales growing approximately 20% year over year, reflecting strong customer demand for larger and advanced displays as well as our execution capabilities. Growth over market was muted in 2025 because of two well understood factors we have discussed throughout the year. First, battery management systems continued to be a headwind as EV demand in the US was softer than originally anticipated.\n\nAnd second, in China, our results were impacted by ongoing shift in market dynamics, including the continued loss of share by global OEMs. These two factors negatively impacted GOM by about seven percentage points. From a profitability standpoint, 2025 was a record year, Adjusted EBITDA reached $492,000,000 or 13.1% of sales, representing the highest level in the company's history. We also generated very strong adjusted free cash flow reflecting disciplined execution and continued focus on cost and capital efficiency. New business activity was another highlight of the year. We delivered a record $7,400,000,000 of new business wins, surpassing our prior peak. Finally, a strong balance sheet and cash generation continue to provide significant flexibility.\n\nDuring the year, we deployed more than $120,000,000 towards M&A and shareholder returns while maintaining a strong net cash position. Turning to page three.\n\nSachin S. Lawande: Before I go deeper into our 2025 results, I want to take a step back and briefly update you on the strategic work underway to build Visteon Corporation’s next phase of growth. While the majority of the benefits will come later, some of these initiatives are expected to show results in 2026. We are diversifying our customer base by expanding our presence with specification automakers, have historically been underrepresented at Visteon. In 2025, we secured another $500,000,000 of new business with Toyota.\n\nBuilding on the momentum from prior year, and launched new products with Toyota, Mahindra, Tata, and Maruti Suzuki We expect revenue from these OEMs to begin growing in 2026 and to ramp steadily over the next several years making them an important driver of our future growth. At the same time, software defined vehicles are now extending into other parts of the broader mobility ecosystem particularly commercial vehicles and two wheelers. While we have served these adjacent markets in the past, the changes driven by this trends are making them significantly more attractive growth opportunities while also helping us diversify our exposure. In 2025, nearly 15% of our new business wins came from two wheeler and commercial vehicle manufacturers.\n\nCompared to about 4% of our sales today. A particularly important milestone was winning the largest digital program in the two wheeler industry, approximately $400,000,000 in lifetime revenue with Honda. Launches for this program are scheduled to begin in 2027. Our manufacturing footprint and cost structure have long been a competitive advantage for Visteon, To further strengthen this advantage, we have increased vertical integration in manufacturing, to simplify the supply chain and capture incremental value. In 2025, we accelerated the insourcing of the molding of metal brackets used for large displays using an advanced lightweight textile molding process. We are the only tier one supplier that has this capability in house in the industry.\n\nWe have also increased our optical bonding capacity in various plants, Finally, we began manufacturing automotive cameras to complement our in house surround vision software enabling a complete end to end solution. More broadly, investing in the business remains a top capital allocation priority. In 2025, we deployed approximately $180,000,000 across CapEx and M&A to support new program launches technology development, and vertical integration initiatives. Advancing our technology portfolio and aligning it closely with market trends is a key element of our strategic priorities. Today, I would like to highlight two emerging product trends in particular, advanced displays based on OLED technology, and AI in the cockpit.\n\nIn 2025, nearly 50% of our new business wins were for displays, surpassing 2024 record levels and positioning this product for sustainable revenue growth. Importantly, we secured significant OLED display wins with luxury OEMs, in establishing Visteon's leadership in this segment of the auto market. While TFT displays will represent the bulk of the automotive market for displays, OLED displays will have greater share in the luxury vehicles. AI technology is advancing at an extraordinary pace Newer AI models deliver significantly higher intelligence, with far fewer parameters, enabling AI to move from the cloud to device based architectures, an essential shift for automotive applications. We are addressing this opportunity through two complementary offerings.\n\nFirst is our high performance compute hardware which provides the processing headroom and architectural required to run AI workloads in the vehicle. Early in 2025, we secured a win with Cherry in China and more recently, follow on business with Geely as they expand this architecture into the Lincoln co brand building on our Zika win in 2024. These are the most advanced cockpit systems in the industry, and are scheduled to launch in the 2026 reflecting both the pace of innovation our ability to execute alongside our customers. Second is Cognito AI, our in house AI based smart assistant for the cockpit.\n\nOver the past year, we expanded Cognito AI to support multimodal AI, combining large language models with vision models, allowing the system to interpret visual information such as road signs and symbols, alongside voice interaction, to deliver more contextual and intelligent driver experiences. Following CES, we have seen growing customer interest and deeper technical collaboration Together, our high performance compute systems and Cognito AI positions Visteon at the forefront of bringing AI into the automotive cockpit. Turning to page four. This slide provides more color on a original sales performance for the year. In the Americas, our sales were impacted by lower customer vehicle production, and by the steep drop in production of EVs at GM and Celanus.\n\nDMS sales took a further step down in Q4 after the expiration of the EV tax credit and resulted in a full year headwind of about 8% to our 2025 Americas sales. Offsetting these headwinds were a strong growth in digital clusters, displays, and infotainment programs at Ford, VW, Toyota, and Nissan on vehicles such as the Bronco, Tarok, Camry, and the Murano. With a strong performance in cockpit electronics, we were able to deliver a 5% growth of our market in this region despite the significant reduction in BMS sales. Europe was a standout market for us despite lower customer vehicle production, and the cybersecurity related disruption at JLR, one of our larger customers in the region.\n\nOur strong performance was driven by the ramp up of newly launched products, mostly large displays in digital clusters, with Audi, Ford, and Renault delivering an outstanding 11 growth over market in this region. We also benefited from our recently acquired engineering services businesses, which is an important strategic capability we are building starting in Europe. In rest of Asia, our sales were essentially flat as our growth in India and Southeast Asia were offset by declines with some customers in Japan. Our market outperformance in the region was driven by two wheeler programs with Honda, Royal Enfield, and TVS. We also benefited from a recently launched digital cluster program with Mitsubishi that is going on multiple car lines.\n\nFinally, as expected, sales in China declined year over year resulting in a significant headwind to our overall growth over market performance. The underperformance in China was largely driven by continued market share loss among global OEMs, and to a lesser extent, by vehicle mix and our product transition at Geely. Encouragingly, we delivered sequential sales growth in the fourth quarter supported by new product launches, including a new cockpit domain controller with Geely. Overall, we delivered 2% growth over market globally despite EV headwinds in the US and the ongoing challenges in China. This performance reflects the strength and diversification our product and customer portfolio, which has enhanced our ability to navigate market volatility.\n\nThe strategic initiatives outlined earlier are expected to further strengthen the resilience of the business. Turning to page five. Our 2025 operational performance reflected strong execution and global reach, with new products launched on 86 vehicle models across 19 vehicle manufacturers. These launches were well distributed geographically underscoring balanced growth across all major regions. From a product perspective, approximately one third of the launches were for large displays and SmartCore programs, aligned with the industry's accelerating shift towards software defined vehicles. The launch mix also showed increasing momentum in hybrid vehicles, which performed particularly well in 2025 as well as in commercial vehicles and two wheelers.\n\nSeveral key fourth quarter launches are highlighted on this page, In China, we launched a new digital cluster on the refreshed Toyota Corolla and Corolla Cross models. The Corolla has been a long standing success for Toyota in the Chinese market, and the updated versions offered with both ICE and hybrid powertrains introduce enhanced smart features designed to reinforce Toyota's position this highly competitive segment. We also launched a center information display on the Mazda CX-5 SUV a key element of Mazda's return to growth plan for 2026. This launch supports both ICE and hybrid variants of the wake in the China market.\n\nIn addition, we introduced a SmartCore system with Zeeker, further strengthening our position with Chinese OEMs adopting more advanced corporate architectures. In India, we introduced a fully integrated SmartCore based corporate system on Mahindra’s XUV 7XO featuring three twelve inch displays. The centralized compute system offers state of the art SDV capabilities including surround view, telematics, streaming media, OTA, ADAS visualization, besides advanced infotainment capabilities. Other fourth quarter launches included instrument clusters with Ford in North America, and Tata in India.\n\nIn summary, we delivered strong operational performance in 2025, launching a high number of new products, aligned with key industry growth drivers, including the shift to software defined vehicles, increasing adoption of large displays, and rising demand for hybrid vehicles that sets us up for continued growth. Turning to page six. We delivered a record $7,400,000,000 of new business wins in 2025, 20% higher than 2024. This performance is particularly impressive given the slower OEM port activity during the year, especially in Europe and the US, as automakers adjusted to shifting market dynamics around electrification, and increased competition from Chinese OEMs. Displays and SmartCore performed exceptionally well, reflecting the continued acceleration of the software defined vehicle trend across the industry.\n\nTogether, they accounted for approximately three quarters of our total wins. We also continued to build momentum in high performance compute system for the cockpit securing a second customer, Cherry, in China. We also secured significant wins in large format digital clusters to support the growth of ADAS and the increasing need to present safety critical information directly in the driver's line of sight. Turning now to the fourth quarter, we secured approximately $1,700,000,000 of new business wins and finishing the year on a strong note. A key highlight was a center information display program for a large full size ICE pickup in North America. Serving both commercial and retail customers.\n\nThis is a flagship high volume platform and underscores how OEMs continue to prioritize the cockpit as a critical area of differentiation even in pickups and trucks. We also won an integrated and infotainment system on a high volume global SUV and truck platform for a Japanese OEM, where we displaced an incumbent supplier. This win highlights our ability to deliver integrated cockpit system sets scale and compete effectively on both technology and cost, In China, we secured a driver display program for an entry level sedan with Toyota, and expanded our high performance compute system on the Lincoln co vehicle at Geely. Overall, the breadth of our cockpit product portfolio continues to create meaningful growth opportunities for the company.\n\nThe product and regional diversity of our new business wins positions us well to navigate industry challenges and drive continued growth. Turning to page seven. Let me close with a look at how we are thinking about 2026 and how it sets the path for our next stage of growth. For 2026, we expect sales to be in the range of 3.6 to five to $3,825,000,000. Starting on the left hand side of the slide, there are two specific headwinds we anticipate to impact 2026 both of which we expect will be largely behind us as we move into 2027. First, US EV production is expected to be lower following the reset in demand.\n\nAs a result, we are assuming that BMS volume in the Americas will decline by nearly 50% year over year. Second, Ford discontinued several vehicle models in 2025 where we had content, and there are no successful programs for those vehicles. In addition, we expect net pricing, foreign exchange, and other commercial items represent roughly a 2% headwind which is broadly in line with normal pricing dynamics. Jerome will walk through these items in more detail. Offsetting these pressures, the right hand side of the slide highlights the building blocks of our next stage of growth, which begin to take shape in 2026. In China, we expect sales to grow modestly, lower customer vehicle production.\n\nWe have two high performance compute SmartCore programs launching with domestic Chinese OEMs along with cockpit domain controller and display programs with German OEMs launching in the second half of the year. While we have been conservative in our estimates, there is potential upside if the upper segment of the vehicle market performs well as indicated by January market trends. Our strategic initiatives also begin to contribute in 2026. We have multiple program launches during the year, including several with Toyota, continued growth in India, and further expansion in two wheeler and commercial vehicles. These launches reflect the strategic work we discussed earlier, and help set the foundation for sustainable growth.\n\nThe final bar on the slide represents the net impact of program activity across the remainder of our customer portfolio. This includes new program launches and production ramps across a broader customer base such as the panoramic display and cluster with Audi, digital clusters on multiple Renault vehicles, and new displays with Nissan and Mercedes that more than offset normal program roll offs. It should be noted that it excludes the specific headwinds and the strategic growth drivers we have already discussed. Separately, the supply of memory chips is tight throughout the industry, and we are working closely with suppliers to mitigate the gaps and develop alternative drop in replacements.\n\nWhile the situation is still evolving, we expect that we will be able to cover customer demand applying similar playbook as with prior semiconductor shortages. Overall, 2026 represents an important year. While sales are impacted by temporary headwinds, the second half of the year begins to reflect the progress we have made in executing our growth strategy. That positions us for a return to top line growth as we move into 2027 and 2028. With that, I will turn the call over to Jerome. Thank you, Sachin. Before getting into the details of the quarter and our outlook,\n\nJerome J. Rouquet: I want to briefly step back and look at our financial performance over the past few years as it provides important context for how we have managed the business through a dynamic environment. Over this period, we have grown sales by more than 800,000,000, or 28%, despite our customer production declining by 13%. We have more than doubled adjusted EBITDA, and extended margins by over 500 basis points. Importantly, this margin progression has been steady and consistent, reflecting disciplined execution across pricing, cost structure, and operational performance. We have also generated strong cash flows.\n\nAdjusted free cash flow totaled 1,000,000,000 over this period, with an average conversion rate of approximately 42% driven by EBITDA growth and the sustained focus on working capital discipline and capital efficiency. While not shown on this slide, our return on invested capital remains in the high teens, well above our cost of capital and above our peer group, reflecting the quality of returns we are generating from our investment investments in the business. Taken together, these results demonstrate our ability to expand margins and generate cash even as volumes, mix, and regional dynamics have shifted. Turning to page 10.\n\nSales for the fourth quarter were $948,000,000 coming in above our expectations, primarily driven by customer recoveries related to program shortfalls. In the quarter, sales benefited by 30,000,000 related to a customer claim on an EV program in the US. Of which a portion was used to settle supplier obligations. From a product perspective, displays continue to be the main growth driver year over year, while battery management systems were down following the expiration of the EV tax credit in the US. We also experienced several discrete headwinds in the quarter, including the Novelis fire impacting Ford and the cyber attack at GLR, both of which were known headwinds going into the quarter.\n\nThere was no impact on the volumes, related to the potential Nexperia supply risk we referenced on the last call. Adjusted EBITDA for the quarter was 110,000,000 representing a margin of 11.6% and came in slightly above the midpoint of our guidance. One time items in the quarter represented a modest headwind as elevated warranty expense and some costs associated with resourcing away from the Nexperia more than offset the EBITDA benefit from the customer claim I mentioned previously. When excluding these onetime items, adjusted EBITDA margins approximately 12.5% on a normalized basis, reflecting continued commercial discipline and underlying cost performance.\n\nAdjusted free cash flow was strong, coming in at 77,000,000 supported by robust EBITDA levels and continued discipline in working capital management and capital efficiency. During the quarter, we returned capital to shareholders through $50,000,000 of share repurchases and 7,000,000 through our quarterly dividend, which we initiated in the third quarter. Our net cash position was 472,000,000 at the end of the quarter. Turning to Page 11. For the full year, sales were $3,768,000,000 down $98,000,000 or 3% year over year. Customer production was down 1% for the year, while currency was neutral. Pricing was a headwind of 4%. This includes our normal annual price reductions of 2% which are consistent with historical levels as well as lower customer recoveries.\n\nThe reduction in recoveries reflects the unwind of prior year semiconductor inflation.\n\nSachin S. Lawande: Revenue, offsetting headwinds from lower BMS volumes, In 2025, we delivered another record year for both our lower sales in China, and normal program roll offs. through disciplined cost execution. adjusted EBITDA dollars and margins. Pricing and lower customer recoveries were offset We delivered end to end product cost improvements including supplier cost reductions and vertical integration initiatives and drove productivity gains across engineering and SG&A. Throughout the year, we actively managed our cost structure in line with market conditions, enabling us to improve margins while continuing to invest in strategic growth initiatives. For the full year, the net impact from favorable one timers including elevated one time commercial recoveries was just under 30,000,000.\n\nExcluding these items, normalized adjusted EBITDA margins are in the mid 12% range for the full year. Before moving on to cash flow, I want to highlight our voluntary decision to change the methodology used to calculate our valuation allowance on US deferred tax assets. While there are two methodologies available that are acceptable under US GAAP, the methodology we will be using going forward enhances transparency and reduces complexity while also aligning with industry norms. We have reflected this accounting change in our US GAAP tax expense for the past three years in the 10-K. This change impacts the presentation of US GAAP taxes but does not affect cash taxes or underlying economics of the business.\n\nAdditional details are included in the 10-Ks. Turning to Page 12. In 2025, we generated $292,000,000 of adjusted free cash flow reflecting continued strength in the underlying earnings profile of the business. Trade working capital was a source of cash for the year, driven by lower sales and inventory reductions. Cash taxes increased year over year due to increased profitability, the timing of tax payments and some level of discrete items. Interest was a net positive as income generated on our cash balances more than offset interest payments on debt. Other changes primarily reflect ongoing pension contributions and timing of cash flows. Capital expenditures were $133,000,000 for the year, or 3.5% of sales, illustrating the capital discipline of the company.\n\nThis included continued investments in vertical integration as well as the purchase of land in India in the fourth quarter to support growth in this market. Taken together, our conversion ratio from EBITDA to adjusted free cash flow was nearly 60%. In total, we deployed approximately 275,000,000 of capital. This included both organic and inorganic investments, the return of approximately $72,000,000 of cash to shareholders through share repurchases and the initiation of a quarterly dividend. During the fourth quarter, we completed 100,000,000 pension derisking by transferring pension related assets and liabilities to an insurance company. This transaction had a noncash impact to net income of negative 7,000,000.\n\nAlso in the fourth quarter, S&P upgraded Visteon to BA1, reflecting expanded margins strong free cash flow generation, a conservative financial policy, and sustainable demand for advanced cockpit technologies. Turning to page 13. Turning to our 2026 outlook. Starting with sales, we expect revenue in the range of $3,625,000,000 to 3,825,000,000.000 As Sachin discussed, we begin to see the benefits of our strategic growth initiatives in 2026 with more meaningful acceleration into 2027 and beyond laying the foundation for sustainable annual top line growth beginning in 2027. At the same time, 2026 includes several discrete headwinds, including lower BMS sales and the discontinuations of certain programs at Ford, with both items largely behind us as we go into 2027.\n\nOur outlook is primarily based on the January S&P forecast. Customer weighted production is expected to be down in the low single digits. Against this backdrop, we expect Visteon growth of a market to be in the low single digits, This is below our long term expectations due to the discrete headwinds in 2026 that positions us for stronger growth going forward as those headwinds roll off and our strategic initiatives accelerate. Before moving to EBITDA, let me provide some additional perspective on the commercial dynamics embedded in our outlook. Recognizing that this remains a dynamic area.\n\nThere are several items that reduce sales year over year including normal annual pricing to customers, lower customer recoveries related to semiconductor and supply chain disruptions from prior years, as well as the non recurrence of certain commercial recoveries recognized in 2025. Partially offsetting these declines, we expect recoveries related to more recent semiconductor dynamics, including memory related costs. We also anticipate a modest tailwind from currency. On a net basis, we expect these various items to represent approximately a 2% headwind to sales year over year. Adjusted EBITDA is expected to be between 455 to 495,000,000. At the midpoint of guidance, margins are 12.8%.\n\nAs we have highlighted previously, our 2025 results included a net benefit of just under 30,000,000 above our normal run rate. Of that amount, we expect about only 10,000,000 to repeat in 2026, resulting in a 20,000,000 year over year headwind. Excluding this factor, we expect adjusted EBITDA dollars to be roughly flat year over year despite lower sales reflecting the underlying strength of the business and our continued operational focus. Compared to normalized margins of 12.5% in 2025, our guidance incorporates a 30 basis point improvement. Included in our guidance are ongoing benefits from cost discipline, emerging savings from vertical integration, and product costing initiatives.\n\nThese are offset by increased investments in the business to support product development, including in AI and vertical integration. This outlook also incorporates an increase in memory cost with a year over year cost increase, representing approximately 2% of sales. We are in active discussions with our customers to pass along these costs and we have incorporated in our guidance a modest amount of potential timing mismatch between cost incurred and customer recoveries. These discussions are ongoing, and given their sensitive nature, we will not be providing additional details at this time. Turning to cash flow, we expect adjusted free cash flow of approximately $170,000,000 to $210,000,000 representing a conversion rate of approximately 40% at the midpoint.\n\nWe currently anticipate working capital will be a slight use of cash as we increase inventory levels. Capital expenditures are expected to be approximately $150,000,000 or about 4% of sales, which includes the build out of a second manufacturing facility in India, as well as support of upcoming program launches, and continued investments in vertical integration. Overall, our 26 guidance reflects a business executing with discipline, maintaining margin expansion on a normalized basis, generating strong cash flow, and continuing to invest in the growth initiatives that support the next phase of our top line growth. As usual, we are not providing formal quarterly guidance, but I did want to share some directional insight before moving on.\n\nWe expect first quarter sales to be the lowest of the year reflecting the industry production profile for 2026. Continued depressed BMS volumes and launches that are weighted towards the back half of the year. From a profitability standpoint, Q1 EBITDA will be negatively impacted by lower volumes as well as higher memory cost. Recognizing that not all customer recoveries agreements will be finalized by the end of the first quarter. Turning to page 14. In 2026, we expect to have more than half $1,000,000,000 of cash available to deploy. This amount represents a combination of cash on hand and cash that we expect to generate during the year.\n\nWe will continue to be guided by the same disciplined capital allocation framework, prioritizing investment in the business while returning excess capital to shareholders. Starting with investments in the business, this remains our top priority. As discussed earlier, we expect to allocate approximately 150,000,000 to capital expenditures in 2026 positioning the business for future growth and supporting vertical integration initiatives. In addition to CapEx, we continue to see meaningful opportunities for M&A Our focus remains on expanding capabilities through engineering services, while also selectively evaluating opportunities to enhance our technology portfolio. While the ultimate level of investment will depend on how the transactions progress during the year, M&A deployment could be up to two times our annual CapEx investment levels.\n\nAs always, we will remain disciplined and prioritize strategic fit and financial returns. Even after funding these growth investments, we expect to maintain significant capacity to return capital to shareholders. First, we are increasing our quarterly dividend to $0.375 per share, representing an increase of 36%. This reflects our confidence in the durability of our cash flow and equates to approximately 40,000,000 on an annual basis. In addition, we intend to remain active in share repurchases. At a minimum, we will offset dilution with the intent to be more opportunistic depending on market conditions and the pace of M&A activity.\n\nAt the end of 2025, we had 75,000,000 remaining under our existing authorization, and we expect to revisit this level as the year progresses. To round out the cash flow picture, we have a modest amortization requirement on our debt facility, representing 18,000,000 of cash outflow in 2026. Taken together, our capital allocation plan for 2026 reflects a balanced and flexible approach continuing to invest in growth, returning capital to shareholders, and maintaining balance sheet strength as the business continues to transition and scale. Turning to page 15. Before we conclude, want to highlight our upcoming investor day, which will be held on June 25 in New York City.\n\nWe look forward to sharing more detail on our long term outlook including how the strategic initiatives we have discussed today translate into growth and value creation over the coming years. We hope many of you will be able to join us. Thank you for your time today, I would like now to open the call for your questions.\n\nOperator: At this time, if you would like to ask an audio question, please press star then the number one on your telephone keypad. Again, that is star and the number one. Your first question is from the line of Luke L. Junk with Baird. Good morning. Thanks for taking my questions. Maybe\n\nSachin S. Lawande: just to start with, Sachin, hoping we could just\n\nJerome J. Rouquet: dig into the DRAM exposure a little bit more relative to the product portfolio, maybe just to scale that 2% impact to guidance both across portfolio and then kind of what that represents from a cost standpoint? And then maybe qualitatively, if you could also just speak to supply the supplier side of this and your ability to get in front of this, and I am just curious from a timing standpoint, you know, were you working on this relative relatively earlier versus when this became more known in financial markets?\n\nSachin S. Lawande: Sure. Sure. So in terms of\n\nSachin S. Lawande: the use of memory, look, as you can imagine, we use memory chips in virtually all of our products. And we use different types of memories. You know, they have DRAM for sure, but different types of DRAMs, but also flash memory. Now the memory supply and that landscape looks different than the logic chips that we have had issues with in the past. As you probably know, almost 90 plus percent of the market is made up of essentially three suppliers, including Samsung, Kynix, and Micron. And we work with all of them, and we have a long standing relationship with these suppliers and a very strategic one.\n\nWe started to work with them towards the end of last year As you might know, the memory industry typically plans for a about a 10% growth in demand each year. But towards the second half, I would say more in the third quarter of last year, the demand signals from the rest of the industry, not automotive, but consumer electronics, data centers, etcetera, indicated that the demand in 2026 was going to be closer to about 50% and not the traditional 10% or so, thereabouts that industry was accustomed to. So the main fallout of all of that is that the supply is gonna be tight everybody in all industries. Right? And automotive will also have the same situation.\n\nSo what we are doing in response to that and we started on this journey last year itself and I believe earlier than many the industry, we started to work with our suppliers to secure the capacity for the full year. So that is something that, we have already made a lot of progress with. And we should be I would say, in a better position than most to be able to get those capacity reservations secured. Now even with that, where we see gaps, we are developing alternate pin to pin compatible drop in replacements. Similar to what we did with the logic chip shortages.\n\nAnd also evaluating new suppliers There are some new suppliers not many, but some that are emerging mostly in China. And we started engaging with them late last year and have already secured some supply from these emerging suppliers. So net, if I look at our full year demand for this year, should largely be able to cover customer demand There may be some timing impacts that we have to manage. Even that, I think as we work with our suppliers, we should be able to largely mitigate.\n\nNow on the cost side, as Jerome mentioned, we have a increase in cost in this memory chips on account of our, you know, historical relationship with the suppliers and the early engagement that we have, I believe we will be in a in a good position to have a good cost despite the increase, which we will expect to recover from our customers similar to, you know, the last semiconductor prices. So now to answer your other question about specifically how much is it, we would rather not provide any breakdown of our materials mainly for competitive reasons. The increase that as Jerome mentioned represents about two of our sales probably as much as we can share for now.\n\nLuke L. Junk: Got it. I really appreciate color there, Sachin. For my follow-up, just want to dig in to the kind of the weighting of revenue this year. So very much appreciate the comment about first quarter sales and the impacts there. Just want to think about weighting the first half versus the second half this year as well, given the impacts from Ford and BMS are seem pretty immediate stepping into the year versus your launch cadence picking up into the back half?\n\nAnd then maybe if we could just walk at a high level into 2027 as well as some of these transient have not seemed like they should drop out and that launch cadence maybe should more fully read through. Thank you.\n\nJerome J. Rouquet: Hey. Good morning, Luke. I will I will start, and then I will hand over to Sachin for '27. So, for '26, we have a as we had anticipated, we have a second half, which is going to be slightly better. Than the first half of the year, and that is really, due to the, launches that we have, that are, more back loaded. Towards the end of the year. And we have got that in China, We have got that with our key strategic initiatives. Including Toyota, that will really ramp up in Q3 and in some cases for Toyota in Q4. So overall, we have got about a 3% improvement in the second half versus the first half.\n\nWhen IHS was, I think, close to 2%. So we are doing slightly better than the market in the in the second half versus the first half. Related to Q1, we do think that Q1 will be, the lowest, quarter of the year.\n\nJerome J. Rouquet: the back of two things. The first one is the fact that IHS as well is guiding towards a decline year over year of about three to 4%. So we will have this reflected, in our sales. And we do see as well at this point pretty low level of BMS sales as we are going into, into the first quarter. So, that will obviously impact our Q1 sales, which will be, as I said, the lowest of the year.\n\nSachin S. Lawande: Thanks. Thanks, Jerome. Before I get into the 2027 topic, I would like to just briefly touch upon our performance in 2025 and our two for '26. Because I think the dynamics there have a significant bearing on how we think about 2027. and the other was BMS. Combined, So if you think about 2025, we have we had two major headwinds. One was China, represented about seven percentage points of headwinds And we were able to offset that through new product launches, mainly in North America and Europe, twenty five. those And if you were to do exclude headwinds and the one timers, that represents about seven percentage points of growth over market.\n\nNow when you look at 2026, especially in the walk that we have provided for our sales, we have BMS again as a headwind. Perhaps we might be a little more conservative than the for sure, S&P four's outlook. But nonetheless, we have BMS, and we have the discontinued vehicles at four. That we mentioned earlier. But China is no longer headwind. Now offsetting these are all two new product launches mainly in Europe and in Asia, particularly in China, However, most of the high value launches are in the 2026 to about five percentage points.\n\nNow as we go into 2027, although we will not provide specific financial targets on this call here today, By the way, we will do that in much fulsome treatment in our investor day in June. What I can say is that we expect a top line sales growth since the headwinds both China and BMS, would largely be behind us. Well as this discontinued vehicles topic.\n\nAnd the growth that we will have from the new product launches, especially high performance compute systems in China, as well as displays and other products and the products we are making in the adjacent markets and our strategic initiatives should bring us back to our mid to high single digit growth over market in 2027 and drive top line growth. So I hope that gives a much sort of broader context on current performance as well as what we expect in 2027.\n\nLuke L. Junk: Yep. Thank you very much. I will leave it there.\n\nOperator: Thank you. Your next question is from the line of Shreyas Patil with Wolfe Capital.\n\nShreyas Patil: Thanks a lot for taking my question. Maybe just a quick clarification on your\n\nShreyas Patil: commentary around memory. So just is your memory exposure equivalent to 2% of revenues? Or are you expecting an increase in memory costs? That is equal to 2%? Of sales. Yeah. What\n\nSachin S. Lawande: what we have mentioned, the 2% is specifically regarding the increase. In the cost that we anticipate this year.\n\nShreyas Patil: Okay. Thank you. And then maybe, you know, looking at the bridge the revenue bridge that you provided earlier, you are pointing to your traditional customers driving about two points of top line\n\nShreyas Patil: line growth. That is about $75,000,000 Just curious what you are seeing in terms of launch activity broadly this year amongst those OEMs from some of the other suppliers that have reported, it does seem like '26 is a somewhat lighter year. For launch activity, particularly in North America and Europe. Is that similar to what you are seeing? And would that be a contributing positive if you are thinking about 2027?\n\nSachin S. Lawande: Yeah. So, Shreyas, I think we are seeing a little bit of a different perspective than some of our other peers perhaps. We have a significant amount of launch activity in Europe related to displays As you might remember, we have fun a high level of displaced business A lot of it has come from Europe, in the past couple of years. And that is turning into revenue especially in the 20 launches in China. And so what has happened in China is after sort of a reset with many of our international OEMs, not just the domestic OEMs. They have been launching new vehicles to compete in that you know, highly competitive market.\n\nAnd this seems to be the year, again, second half, this seems to be the year that they are introducing new vehicles And I think the timing also might actually work out very well if you have seen even the early numbers from January in China, the market seems to be tilting in favor of more higher priced vehicles with all of the changes with respect to policies and pricing, etcetera, that have happened in that market. And we think, you know, that might actually help our mobile customers, but also our domestic customers like Geely. They have some high performance compute launches that we discussed earlier. With domestic OEMs, and they go into the more premium flagship vehicle models.\n\nSo I we do see a very healthy launch activity this year.\n\nSachin S. Lawande: me, that is really signals again this STV trend now. Complemented by this AI trend. Starting to really drive some momentum.\n\nShreyas Patil: Okay. Great. And maybe just one last one on the M&A pipeline you mentioned, I think it is about $300,000,000 or so. Maybe you could just unpack the how the what is kind of in that in that pipeline are the size of the companies that you are looking at And maybe the you know, how should we think about the timeline for when you could you could execute on those deals? Thank you.\n\nJerome J. Rouquet: Yeah. Let me start, and I will hand over to Sachin as well. So we have not really given a number. The chart may indicate that it could be as much as twice the amount of CapEx we have for '26. But we will see how it goes. We are quite ambitious in 2026 given the pipeline that we have And the criterias that we have got in mind for M&A remain the same as the ones that we have talked about in the past.\n\nThe first one is that we want to have M&A that are bolt on by design, and that by that, we mean we want to look at fairly small acquisitions so that we can tuck them in our existing business pretty quickly. The second criteria is that we want to have technology slash capability accretive. To what we are doing today, augmenting essentially the platform that we have from a software standpoint. And that includes as well engineering services.\n\nAnd as you know, we have already done two acquisitions and we are, considering as well further And then the third criteria that we have always considered as well is the fact that we want to have as much as possible these businesses being margin accretive from day one. So that we do not get a return that is going to be, in five or even ten years. So kind of the three criterias that we have selected, in the past and that we are still continuing to apply as we look at, this pipeline of acquisition. 2026. And maybe just to add to what Jerome has said, you know, without\n\nSachin S. Lawande: necessarily getting into any specifics about sizes of the companies, etcetera, that we are looking at. One thing to keep in mind, Shreyas, is if you look at our journey, of integrating more and more of the ECUs, we have gone from integrating the cluster and the IBI into CDC, not the HPC integrates even more ECUs including body control, gateways, plus additional rear seat entertainment, passenger side, entertainment as well. And now with the regulations in ADAS, in particular, in Europe, is also expected to follow-up in China. We see that ADAS is gonna be more of a table stakes almost features and something that we can look forward to in integration in a one of our future products.\n\nSo we continue to look for opportunities where we can bring in those technology elements in house that can allow us to take cost out and integrate more of the content in our systems. So that should give you some sense of the kind of the companies we are looking at, none of which are a big transactions. As Jerome mentioned, we prefer to focus on technology capabilities so that we can then integrate it in a better manner. With in our systems.\n\nOperator: Your next question is from the line Lupitae Macaulay with TD Cowen.\n\nLupitae Macaulay: Great. Thanks. Good morning, everyone.\n\nLupitae Macaulay: A first question, just going back to Slide seven and the revenue bridge. On the 2% headwinds from discontinued vehicles, I am curious whether you have content in some of the competing vehicles to the vehicles that are being discontinued and whether it is an assumption for some pickup of revenue there? Or are you kind of more assuming that, that headwind does not get recovered or recouped by other competing vehicles might have content on. Yeah. I think yes. The answer is yes. We do we have\n\nSachin S. Lawande: content in that sort of a very broad cross section of vehicles at that OEM. But at least as yet, we are not necessarily seeing the benefit Now that does not mean it may not happen. It could. Still early in the year. And we do not have full visibility into the OEM's plans. Given the fairly significant you know, volume of vehicles that those represented, we do expect that they would try to fill that hole with some other vehicles, which in if that were to happen, then we would, I guess, benefit from it.\n\nSachin S. Lawande: we have we are not seeing that as yet, we have not included that in our outlook. If it does happen, then it might provide some tailwind.\n\nJerome J. Rouquet: And I would add, Sachin, that we have used broadly IHS, in fact, for\n\nJerome J. Rouquet: this discontinued vehicle, but as well just for overall Ford volume going into '26.\n\nLupitae Macaulay: That is very, very helpful. And just as a second question,\n\nLupitae Macaulay: strong bookings in 2025, that is great to see. Sachin, I was hoping\n\nLupitae Macaulay: you had a target to share for bookings in 2026. And then if you kind of look at the last few years average booking, it does seem to support maybe a mid to high single digit revenue growth algorithm for the company in the medium term. I think I heard you say, Sachin, to an earlier question that you may even\n\nJerome J. Rouquet: get to that level as early as next year. Just hoping you kind of talk a little bit about\n\nLupitae Macaulay: the implications of bookings for the company's growth in the medium term.\n\nSachin S. Lawande: Yeah. Very good question. And if you think about, you know, the 2025 performance in particular, the things I would like to highlight. One are displays, which we did really well across the board, if you look at our displacements, they have were spread over Europe, North America, and also Asia. And those programs typically have a shorter lead time in terms of development and launch. Than the cochlear electronics programs. Those fundamentally with more software it takes longer to launch those systems. So that is one factor. The other thing is that about 15% of our wins were on you know, two wheelers and commercial vehicles. And two wheelers in particular also have fairly short time to market.\n\nSo that is really the reason where why we feel that the infection of, you know, these wins turning into revenue and contributing to our growth of our market. Will be fairly earlier than traditional, you know, and or historical sort of averages in terms of time. And in terms of just outlook, for this year, in particular, for new business wins, the pipeline of new opportunities is pretty robust. I am I am very happy to see that given this environment where a lot of the customers that we have, especially outside of China, still in some sort of form or the other in terms of trying to get their portfolio adjusted. We still see a very robust pipeline.\n\nAgain, thereby displaced, but also more for the domain controllers. And a emerge opportunity, which is very exciting. Is this AI dedicated ECUs for AI to bring AI into cockpits without necessarily re architecting the whole vehicle. This is starting in China. And we are very excited and optimistic about it. And has the potential to come across, you know, into other regions fairly quickly.\n\nLupitae Macaulay: That is very helpful. Thank you.\n\nOperator: Your next question is from the line of Tom Narayan with RBC Capital Markets.\n\nTanaseo: Hi. This is Tanaseo on for Tom. Thanks taking the question. So on the last call, I think you guys mentioned a roughly 20% volume reduction for BMS in 2026. And it looks like that number has since jumped up to 50% So it sounds like you guys are still anticipating BMS to show some recovery in 2027. But is there anything you can give us on your longer term planning around BMS? And where you think it could get up to maybe as a percentage of revenue?\n\nSachin S. Lawande: Absolutely. So let me give you this the way we think about BMS. So especially in the US, first of all, I would start by saying that it is very difficult to forecast what EVs will do this year in particular first full year without all the incentives, But we can look at Q4 for as one data point, not necessarily sufficient, but at least that is what we have in front of us. So even with the pull ahead that occurred, due to the expiry of the incentive, we saw a\n\nSachin S. Lawande: Penetration of about just over 5% of EVs in the US in Q4. Now as we think about 2026, we do believe it will start very soft in the sense that Q1 is probably going to be the low point of EV sales in the US for continuing from the effects of the pull ahead in last year. And then Q2 onwards slowly recover. Now the question is to what level? Now what we have assumed in our outlook is very conservative number. We have assumed a roughly 3% penetration of EVs with our customers. I mentioned Q4 was over 5%. For the full year, it was over seven So it feels like our 3% is fairly conservative.\n\nS&P has a 30% lower 2026 than 2025. And if you look at you know, our numbers, it is closer to 50% drop year over year. So there could be some upside if we are found to be too conservative here, but given everything, we felt it would be prudent to be a little bit more on the conservative side.\n\nNow if you about 2027 and going forward, the improvements that we see in the cost of EVs and continuing focus on those wire customers, in particular GM, we believe that the market should recover modestly from the lows of 2026 We will we will we will wait for a little longer to exactly what that could look like, but we believe it could be a very modest improvement and a steady growth from there.\n\nTanaseo: Okay. Gotcha. Thank you. I guess on a on a slightly higher level, it looks like you guys have pretty strong growth over market in Europe in 2025. I was wondering if you could give us a sense of whether you see any opportunities to capture additional business wins, especially from the Chinese domestic export into Europe?\n\nSachin S. Lawande: Yes. And we do see a lot of positives from the Chinese OEMs activity in Europe not just with them directly, but also with European OEMs who are responding to the competitive threat by essentially uplifting the capabilities in the cockpits. Now we also have been able to win business in Europe, the Chinese OEMs, and we expect to able to do more of that as we go forward. So to us, you know, Europe represents a interesting data point where the growth of the Chinese OEMs sales actually helps the business in terms of driving more content in the cockpit.\n\nSo we expect to see the dynamic not just limited to Europe, but in other regions there you see higher activity of the China OEMs.\n\nShreyas Patil: And to your point, we do anticipate Europe to also\n\nSachin S. Lawande: contribute more in terms of new business opportunities this year as well.\n\nTanaseo: Okay. Great. Thank you.\n\nOperator: Your next question is from Joe Spak with UBS. Thanks.\n\nJoe Spak: I guess I wanted to go back to better understand some of the\n\nJoe Spak: memory commentary. And I know you are going to be you are you are talking about being limited here in what you are going to say. But in the overall bridge, you are talking about recoveries, pricing, FX being a 2% year over year headwind. Now you have the old recoveries, right, that is that is you know, probably lower year over year as you sort of indicated from the original semiconductor challenges, Price is sort of minus two. FX looks like it is probably a positive. So I guess to get to that overall minus two, and I and if I take in the context your you know, the increase is about 2% of sales.\n\nIt looks like you are assuming very little in terms of actual recoveries on memory. Is that is that about right? And maybe just a comment on you know, sourcing here because it sounds like you are doing a lot of work I know a lot of the automakers are doing work as well, and there is some directed by. So you know, who is really responsible for what? Yeah. Let me take the first question.\n\nJerome J. Rouquet: Joe, good morning. So the buckets that you described are the right ones. We have got in this 2% annual pricing We have got, what I would call the legacy or the reduction in recoveries related to the prior chip shortage that are coming down. And then we have got on a positive side, recoveries for the new memory tensions that are going on as well as some modest, effects.\n\nMaybe just to be very clear on the memory, we are we have baked in our assumptions that we will be recovering the majority of these costs And, when I said the majority is that we are fully intending to recover everything, but there will be some level of timing that we have accounted for between the cost incurred and the customer recoveries. And we will, as I mentioned, we will see that Q1 and that is probably going to be as well a shearing effect all the way to till the end of the year on that topic. But these are the four full buckets, and we are absolutely intending to recover the memory cost increases through our customer\n\nSachin S. Lawande: And to your other question, Joe, you know, the OEMs activities are more related to understanding the situation and engaging with the suppliers. I do not believe that they have direct sourcing, at least not with us. So in our case, we do virtually all of the sourcing of memories directly ourselves.\n\nJoe Spak: But I guess on if the guidance also sort of assumes that you know, you are re recovering it all just with some timing mismatches. Then it mean, it is also you know, rough numbers. Is that fair to sort of say that is like a 20 to 30 basis point hit to your margins this year?\n\nJerome J. Rouquet: We have not given any specific. It is embedded in this 2%, so I would take that 2% as kind of the essential piece of the work As I said, in fact, if you decompose maybe these buckets, if you think about it, annual pricing as well as say, legacy semiconductor recoveries will be fully offset by the efficiencies that we are generating in the business. Will be offsetting the memory cost increases to the majority will have some level of leakage, but nothing major. And then you have in that bucket as well, as I said, the effects. Which is a pretty small number.\n\nOverall, when we look at our business, and that is pretty valid in fact for the last two years, and it will be still valid as well for twenty six. The dilution of, recoveries has an impact of about 0.5 percentage points on the on recoveries. So on EBITDA. Sorry. So that is kind of the dilution that you see, over the years. Coming from that buck. Good. Okay. Maybe just one quick one just to follow-up on the\n\nJoe Spak: the capital deployment and the M&A. And I know those are gradiated bars, you said the M&A could be you know, twice the CapEx or $300,000,000 or if I look at M&A to buyback, that is like a two to one ratio And if you add up, you know, CapEx, the dividend, the debt, like, it looks like there is about you know, 300,000,000 total left there. So I guess I am just I am just wondering, like, if\n\nJoe Spak: and I know there is ranges here, but if the M&A outlay goes up to that 300,000,000, does that mean there is little left for buyback?\n\nJerome J. Rouquet: Yeah. These the slide shows, in fact, that buyback would be in the $100 plus million. Right. Our priority is going to be really focusing on, obviously, investing in the in the business with the CapEx. As well as focusing on these acquisitions. Obviously, the excess is going to go to dividend and as well share buybacks, but we do want to remain opportunistic in terms of the buyback. So that is really the key point as well. And we will, we will update you as we go, throughout the year.\n\nJerome J. Rouquet: Thank you. This concludes our earnings call for the fourth quarter.\n\nLupitae Macaulay: And full year of 2025.\n\nJerome J. Rouquet: Thank you for participating in today's call and your ongoing interest in Visteon.\n\nOperator: This concludes Visteon Corporation’s fourth quarter 2025 result earnings call. You may now disconnect.\n\nBefore you buy stock in Visteon, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Visteon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $420,595!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,152,356!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 901% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 19, 2026.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.\n\nVisteon (VC) Q4 2025 Earnings Call Transcript was originally published by The Motley Fool"
    },
    {
        "title": "Needham upgrades Analog Devices, says shares have 'additional room to run'",
        "url": "https://finance.yahoo.com/news/needham-upgrades-analog-devices-says-135038511.html",
        "source": "Yahoo Finance",
        "date": "2026-02-19T15:45:00+00:00",
        "content": "Investing.com -- Analog Devices was upgraded by Needham & Company in a note on Thursday, with the firm highlighting improving operating trends, strong quarterly results and rising demand across key end markets that should continue to lift earnings and the share price.\n\nNeedham analyst N. Quinn Bolton raised the stock to Buy from Hold, arguing that the firm “can no longer justify remaining on the sidelines” following better-than-expected fiscal first-quarter results and guidance that was “meaningfully above expectations.”\n\nHe noted that while shares have surged 44.7% since ADI’s fourth-quarter 2025 earnings, compared with 2.6% for the S&P 500, several catalysts support further upside. Needham set a $400 price target on the stock, based on a 30-times multiple of its 2027 earnings estimate.\n\nBolton wrote that “customers appear to have moved through the digestion phase,” with orders now more closely aligned with consumption trends.\n\nHe added that ADI’s core industrial business, excluding automated test equipment and aerospace and defense, remains “20% below prior peak levels,” leaving room for recovery as bookings strengthen.\n\nNeedham also cited the absence of any restocking to date, saying “a restocking cycle is still in front of the company,” while improved pricing and expanding exposure to data center and AI applications, roughly 20% of sales, continue to support growth.\n\nIndustrial revenue rose about 5% quarter over quarter, with ATE and aerospace and defense delivering record results, Needham said. The firm expects industrial revenue to rise more than 20% in the second quarter, led by ATE.\n\nAutomotive trends remain softer in the first half, but Needham said the segment should return to year-over-year growth in the second half of fiscal 2026.\n\nNeedham upgrades Analog Devices, says shares have ‘additional room to run’\n\nJPMorgan outlines ten strategic themes that could shape the outlook for 2026\n\nThis sector is 'poised for a big, beautiful year': Truist"
    },
    {
        "title": "ONE Gas OGS Q4 2025 Earnings Call Transcript",
        "url": "https://finance.yahoo.com/news/one-gas-ogs-q4-2025-171203670.html",
        "source": "Yahoo Finance",
        "date": "2026-02-19T19:02:00+00:00",
        "content": "Thursday, Feb. 19, 2026 at 11 a.m. ET\n\nChairman & Chief Executive Officer — Sid McAnnally\n\nExecutive Vice President & Chief Financial Officer — Chris Sighinolfi\n\nPresident & Chief Operating Officer — Curtis L. Dinan\n\nVice President, Investor Relations — Erin Dailey\n\nNeed a quote from a Motley Fool analyst? Email pr@fool.com\n\nSid McAnnally: I begin our call today by recognizing our coworkers across the company, for their dedication to serving our 2,300,000 customers during Winter Storm Fern. This storm was the first multi-day subfreezing event we have experienced since Winter Storm Uri in 2021. On the peak day of the storm, we delivered over 3,000,000,000 cubic feet of gas to our customers with no supply disruptions. This performance is a testament to the work completed after Uri, including the Austin system reinforcement which boosted our available winter peak capacity by approximately 25%. Our post-Uri investments also included a focus on gas supply.\n\nWe increased our storage capacity to over 60 Bcf, implemented strategic reinforcements across our system, and diversified our gas supply, all enhancing reliability and reducing the impact of price fluctuation on our customers. As a result, across our service territory, over 80% of the gas supply needed during the storm was shielded from temporary price increases. Our full-year 2025 financial results were also strong. In August, based on a solid first half performance and the expected impact of Texas House Bill 4384, we raised the midpoint of our EPS guidance to $4.37. We finished the year fully in line with that midsummer expectation. This marks our twelfth consecutive year of meeting or surpassing the midpoint of our initial EPS guidance.\n\nFinally, to ensure that the financial impact of the Texas legislation is appropriately reflected in our disclosures, we have introduced a non-GAAP adjustment to our net income and earnings per share. This update adds clarity to our disclosures and helps better illustrate the earnings that our regulator allows. I will ask Chris to discuss the details. Chris?\n\nChris Sighinolfi: Thanks, Sid, and good morning, everyone. With solid fourth-quarter performance, we delivered full-year financial results squarely in line with our revised guidance. 2025 net income totaled $264,000,000 or $4.37 per diluted share, compared with $223,000,000 and $3.91 in 2024.\n\nChris Sighinolfi: Capital expenditures totaled $760,000,000 for the year. As Sid noted, we have introduced non-GAAP adjustments to our financial reports and our earnings guidance. These adjustments offer a comprehensive view of our performance within the Texas regulatory model and better reflect the returns allowed by our regulator. I want to spend a moment detailing specifically what these adjustments represent and why we are introducing them now. In 2011, the Texas Railroad Commission adopted Rule 8.209 of the Texas Administrative Code. This rule allows natural gas utilities to defer depreciation expense and ad valorem taxes and accrue a carrying cost on qualifying safety-related capital expenditures between the time of project in-service and its inclusion in rates.\n\nTexas House Bill 4384, signed into law last June, extends the approved deferrals and accruals of Rule 8.209 to all capital expenditures in the state. The carrying cost allowed to be accrued under both provisions is defined as the unrecovered gross plant multiplied by the utility's pretax weighted average cost of capital as established in its most recent rate proceeding. As we know, weighted average cost of capital includes a return on debt and a return on equity. It is specifically the accrual and allowed recovery of this equity return and the timing of its impact that caused a delta between our regulatory books in Texas and our reported GAAP financials.\n\nThis difference in treatment between our regulatory accounting and GAAP accounting has existed since the adoption of Rule 8.209 in 2011, but it represented a modest annual impact when only Rule 8.209 applied. For example, in 2024, this difference was approximately $2,000,000, or roughly $0.03 per diluted share. With the expansion of qualifying capital under House Bill 4384 last year, this delta widened to nearly $7,000,000, or roughly $0.11 per diluted share. With a full year of impact in 2026, we anticipate it will constitute an approximate $12,000,000 variance, roughly $0.18 per diluted share, or 4% of our projected consolidated full-year EPS.\n\nIn sum, this difference in treatment is a fundamental aspect of our regulatory framework and an embedded feature of our financial profile. Texas House Bill 4384 has amplified the impact of these adjustments and with them meaningfully increased the persistent delta between regulatory accounting and GAAP accounting. For these reasons, we will report non-GAAP adjusted net income and EPS figures as key indicators of business performance going forward. Adjusted net income for the fourth quarter was $90,000,000 or $1.48 per diluted share compared with $78,000,000 and $1.35 in the same period in 2024. For the full year, adjusted net income was $271,000,000 or $4.48 per diluted share, compared with $225,000,000 and $3.94 in 2024.\n\nOur expected financial performance as expressed in our 2026 financial guidance has not changed, but we intend to also provide guidance based on our adjusted numbers going forward. So for 2026, we expect adjusted net income in the range of $306,000,000 to $314,000,000 and adjusted earnings per share in the range of $4.83 to $4.95. Consistent with our previously communicated five-year financial outlook, we expect long-term adjusted net income growth of 7% to 9%, and adjusted EPS growth of 5% to 7%. These growth rates now use adjusted 2025 actual results as the baseline for the 2026 through 2030 planning period, implying a 2030 adjusted EPS midpoint of roughly $6.\n\nTurning to other financial results, O&M expense for the full year was up approximately 5% over 2024, slightly above our 4% CAGR guidance. As I noted on our third-quarter call, we had the opportunity and capacity to execute some projects earlier than we had initially planned, resulting in the slightly elevated expense rate for 2025. Executing certain projects ahead of schedule is another example of how we continually look for ways to deliver improvements more efficiently while maintaining financial discipline. Our long-term outlook continues to project a 3% to 4% O&M CAGR as indicated in our guidance.\n\nExcluding amounts related to KGSS-1, interest expense in the quarter was $2,900,000 lower year-over-year, primarily reflecting lower rates on commercial paper borrowings and the implementation of Texas House Bill 4384. We benefited from Federal Reserve rate cuts in 2024 and 2025, which we anticipated, though they occurred more quickly than we had assumed in our plan. As a reminder, we have assumed no further rate cuts in 2026. As with everything we do, we are focused on efficient execution of our financing strategy, so any future rate cuts flow through to our bottom line. Our balance sheet remains strong. In December, S&P affirmed its A- credit rating and stable outlook.\n\nAnd earlier this month, Moody's affirmed its A3 rating and stable outlook. 2025 cash flow metrics were several hundred basis points above our respective downgrade thresholds with both agencies, and our financial plan supports similar performance going forward. With that, Curtis, I will turn it to you.\n\nCurtis L. Dinan: Thank you, Chris, and good morning, everyone. I will begin with an update on regulatory and legislative activity. Earlier this month, we received a final order in the Texas rate case. The Railroad Commission approved a $14,400,000 revenue increase, a 9.8% return on equity, a 59.9% equity ratio. The Commission also approved consolidation of our three remaining Texas divisions into a single statewide division. We plan to make one GRIP filing for Texas Gas Service and our PBR filing in Oklahoma later this quarter. Our Kansas GSRS filing is planned for April. We have no full rate cases planned until the Oklahoma filing in 2027 as required by our tariff.\n\nCurtis L. Dinan: Turning to legislative activity.\n\nCurtis L. Dinan: We are supporting proposed legislation in Kansas that would allow for more efficient recovery of the capital we invest in the Kansas Gas Service system. We view this as a constructive step towards better aligning capital recovery with investment timing as we help to advance ongoing economic development in Kansas. Moving on to operations and commercial activity. Our strong finish to the year reflects the consistent, disciplined execution of our capital plan, which is designed to support growth while staying closely aligned with our affordability, safety, and reliability commitments. We completed $760,000,000 worth of capital investment projects during 2025, with $170,000,000 dedicated to serving our growing customer base.\n\nAn example of the investments we are making is the new pipeline announced in December where ONE Gas, Inc. will invest roughly $120,000,000 to deliver over 100,000,000,000 cubic feet of natural gas annually to Western Farmers Electric Cooperative in southeastern Oklahoma. This project will support a new natural gas-fueled generation plant and create capacity for future economic growth across the region. We have also broken ground on a project to serve an advanced manufacturing plant outside of El Paso, which is on track to be in service by the third quarter of this year. This is another project that supports reliability and system growth without increasing costs for residential customers. Both projects were included in our guidance.\n\nBeyond these projects, we continue to add about 23,000 new residential customers each year. Growth in our customer base allows us to spread costs more efficiently, helping keep service affordable. In addition to our customer-focused growth strategy, our overall approach to running the business ensures customer affordability remains a key priority. Sid alluded to some of the steps we take to mitigate gas cost. Examples include sourcing gas at the Waha hub, which often offers favorable pricing, increasing our storage by 20%, and using physical and financial hedges to mitigate temporary price fluctuations like we saw last month. We are also focused on long-term value and efficiency as we make staffing and operational decisions.\n\nOur insourcing program is a good example. While onboarding and training new employees temporarily increases cost, the long-term benefits are clear. Our teams operate more efficiently, deliver stronger performance, and create a pipeline of future talent. We completed 1,300,000 line locates last year, and now perform about 40% of that work in-house. Insourcing this work has delivered significant operational improvements as our ratio of total excavation damages per 1,000 locates, a common industry metric, decreased by over 14% year-over-year, even though we experienced an 8% increase in ticket volumes. Bringing this work in-house reflects our broader focus on improving execution, reducing long-term cost, and strengthening our operational capabilities.\n\nOur efforts to run the business efficiently have paid off, as we have kept our cumulative residential bill CAGR below inflation at just under 2% while continuing to deliver top-tier safety performance. I will now turn it back to Sid for closing remarks.\n\nSid McAnnally: Thank you, Curtis. Yesterday, we announced that Curtis will take on an expanded role as President and Chief Operating Officer. As our system continues to grow and the number and scale of new projects increases, this change will allow us to leverage the experience that Curtis brings from both his time in operations as COO and his financial experience as CFO in the early years of our company. We are fortunate to have someone that combines deep experience across the business with strong leadership skills to take on this expanded role at an exciting time for our company. Operator, we are now ready for questions.\n\nOperator: If you are using a speakerphone, please make sure your mute function is turned off to allow your signal to reach our equipment. We will pause for a moment to allow everyone an opportunity to signal for questions. First question comes from Gabriel Moreen with Mizuho. Your line is open. Please go ahead.\n\nGabriel Moreen: Hey, good morning, everyone, and congrats to Curtis. I am sure he is forward to saving all that time on conference calls talking through only one Texas regulatory jurisdiction at this point. Thank you, Gabe. Yeah. I want to start off on the, you know, of the non-GAAP adjustments here. I am curious why, first of all, maybe you could not did not feel like you could speak to this in December. But then sort of as a larger picture, here, given that this, I think, is a bit of a material step change as far as kind of your starting point here for EPS growth.\n\nDoes that also play into kind of equity issuance or needed equity issuance, how you think about your cap structure, your dividend payout ratio? Does it matter less because, you know, this is sort of as you mentioned, regulatory versus financial accounting.\n\nChris Sighinolfi: Hi, Gabe. It is Chris. On the timing, a couple things to note. You know, this was obviously legislation passed in June. And we studied it throughout the period. As you may recall, the Railroad Commission had a 270-day window to draft and pass procedural rules associated with this legislation. We have been party to that process throughout the fall and the early part of the winter. And so, you know, we participated in comments. We looked at early drafts. The final rules are on the RRC agenda for approval at next Tuesday's meeting.\n\nSo, you know, if there was a final step to solidify our understanding of the state's intent in this legislation, we feel very confident that we know, with the final rule sitting for approval, where the state's intent is. And so that was kind of the final step of it. It was the increase in the magnitude of the delta between regulatory books and GAAP books, and then it was the conclusion of that process that led us to take action on this at this point and not at an earlier juncture.\n\nAs it pertains to your question as to, you know, the capital markets side of the plan, it really does not have an effect in a meaningful way on that. The House Bill accounting treatment is, in the early part of it, more impactful to earnings than it is to cash flow. And so I would not expect that it would change that in a material way. It may over time, but not initially.\n\nGabriel Moreen: Got it. Thanks, Chris. And then maybe if I can just pivot a little bit to some of the, I think, growth opportunities with the Western Farmers announcement and the like. Can you just talk about sort of the competitive landscape and I think some of the backlog within the projects that I think you are in negotiation on. How you are competing with, I think, some other providers, like midstream providers that also may be looking to lay their lines to additional power gen facilities, how that shapes up within kind of, I think, the regulatory construct that probably pitching to potential customers?\n\nCurtis L. Dinan: Yeah. Gabe, it is a really good point. What we try to do early in the process, we have lots of these opportunities coming towards us. And one of the early filters we apply to it is do we have a competitive advantage to serve that facility. There are some situations where we are very competitively advantaged because of assets we already have nearby to the opportunity, and there are other situations where we are not as competitive. We do not have assets in those areas, so we quickly try to move on from those. You are right, though, where those two things are maybe equal between a midstream provider and us. The tiebreaker often is our regulatory structure.\n\nAnd being able to be very transparent about what is included in our rates, how charges to that customer would be funded, if there are any customer payments required for the construction, it is very transparent by being able to look at our tariffs. So I think in many ways, just that transparency gives us a competitive advantage. That is just one of the pieces of it in addition to what I was describing as the geographic advantages we have sometimes.\n\nGabriel Moreen: Got it. Thanks, Curtis.\n\nOperator: We will now turn to Paul Andrew Zimbardo with Jefferies. Your line is open. Please go ahead.\n\nChris Sighinolfi: Hi. Good morning, team, and congratulations, Curtis, as well.\n\nChris Sighinolfi: Hi. No. Thank you. The first question, is there any way that you could frame the potential benefit from that proposed Kansas legislation you mentioned, whether earned ROE or net income? That would be helpful.\n\nCurtis L. Dinan: So, Paul, it is still in the early stages. I think just this morning, the proposed bill cleared the House of Representatives. The main parameters in the bill as it is written that is going to the Senate is an increase in the types of capital that can be included. Essentially, all of the capital that we invest directly in Kansas would now be part of that GSRS filing, so an expanded universe, so to speak. And then the cap would increase. Today, it is $0.80 per month of impact to a customer. That $0.80 would increase to $1.35. I would emphasize, it has cleared the House. It still has to go through the Senate process.\n\nSo I would characterize this still as in early innings.\n\nChris Sighinolfi: Okay. And how much of—you said it would make substantial all the capital qualify. How much would qualify currently?\n\nCurtis L. Dinan: Currently, what qualifies is safety-related expenditures, so system integrity type of work as well as cybersecurity. So this would add in any growth capital we are doing, facilities that we are putting in place, those types of things that are directly in the state of Kansas. Any corporate allocations such as an ERP system that is spread, like applies to all of the company, that would have to go through a full rate case to be able to be included. So it substantially includes all of the capital we are spending up there, other than those corporate items. And you have seen our filings each year at $0.80. It has been about an $8,000,000 GSRS filing.\n\nSo it would increase from that $0.80 to $1.35.\n\nChris Sighinolfi: Then a bigger picture one, just as you add in the Texas legislation benefit to the adjusted profile. Any direction you are providing on kind of where within that growth rate range? I think latest vintage was around the midpoint long term. Any refreshed thoughts on that as you shift—Hey, Paul. It is Chris. No. Not specifically. When we offered guidance last year, we had noted the high end of the range. This year, we noted the midpoint. We are just six weeks in. I would stick to that for now. Okay.\n\nOperator: Thank you very much. We will now turn to David Keith Arcaro with Morgan Stanley. Your line is open. Please go ahead. Hey, thanks. Good morning. Good morning, David.\n\nErin Dailey: Congratulations, Curtis, as well. Best wishes\n\nChris Sighinolfi: to you in the new, expanded role here. I was wondering, let me see. Oh, just to check, does the guidance in the adjusted EPS level, does that assume the latest Texas rate case outcome essentially that you just got? In terms of what, you know, cost of capital is being embedded in there? Yeah. It does. Our original guidance back in the fall embedded a best estimate for what we thought that would prove to be, and it is pretty close to that. So it is in on the GAAP side and obviously carries forward from there to the non-GAAP. Got it. Okay. Thanks.\n\nAnd I did not quite catch it, Chris, but is the adjustment—is there a cash component to that, like, in terms of the higher earnings from the regulatory perspective, are you getting that as a cash recovery, like a boost to cash in some way? Or is that all pure, you know, just on paper in terms of the accounting? The accrual and deferral is not—once, obviously, that gets rolled into the GRIP filing, it will be a larger cash flow item than it would have been without the legislation. So there is a cash component, but the cash component shows up as it would in normal rates and not in the deferral accrual.\n\nChris Sighinolfi: Yep. That is clear. Thanks for that. And then just last quick one. I was curious. How are Treasuries and the current kind of Treasury curve lining up against your guidance expectations at this point?\n\nDavid Keith Arcaro: We have seen\n\nChris Sighinolfi: pretty strong market performance from issuers that have gone so far. I would say, David, if we were to move with something today, it is probably slightly favorable to what we embedded in our refinancing for the year. But, you know, that term loan that we put in place last year does not mature until September. And so, you know, I am always nervous to take today’s conditions that may or may not exist by the time we access the capital markets. But specific to your question, it is favorable to it today. Okay. Great. Thanks so much.\n\nOperator: That concludes the question and answer session. I would now like to hand it back to the ONE Gas, Inc. team for closing remarks. Thank you again for your interest in ONE Gas, Inc.\n\nErin Dailey: We look forward to seeing many of you at upcoming conferences in Chicago and New York. Our quiet period for the first quarter starts when we close our books in early April and extends until we release earnings in May. We will provide details on the conference call at a later date. Have a wonderful day.\n\nOperator: This concludes the ONE Gas, Inc. fourth quarter and year-end 2025 earnings conference call and webcast. You may now disconnect.\n\nBefore you buy stock in One Gas, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and One Gas wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $420,595!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,152,356!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 901% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\n\n*Stock Advisor returns as of February 19, 2026.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.\n\nONE Gas OGS Q4 2025 Earnings Call Transcript was originally published by The Motley Fool"
    }
]